{"total": 5120627, "offset": 1800, "next": 1900, "data": [{"paperId": "955fe2ee26d888ae22749b0853981b8b581b133d", "url": "https://www.semanticscholar.org/paper/955fe2ee26d888ae22749b0853981b8b581b133d", "title": "Holographic Embeddings of Knowledge Graphs", "abstract": "\n \n Learning embeddings of entities and relations is an efficient and versatile method to perform machine learning on relational data such as knowledge graphs. In this work, we propose holographic embeddings (HolE) to learn compositional vector space representations of entire knowledge graphs. The proposed method is related to holographic models of associative memory in that it employs circular correlation to create compositional representations. By using correlation as the compositional operator, HolE can capture rich interactions but simultaneously remains efficient to compute, easy to train, and scalable to very large datasets. Experimentally, we show that holographic embeddings are able to outperform state-of-the-art methods for link prediction on knowledge graphs and relational learning benchmark datasets.\n \n", "year": 2015, "referenceCount": 35, "citationCount": 832, "influentialCitationCount": 147, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1729762", "name": "Maximilian Nickel"}, {"authorId": "1690976", "name": "L. Rosasco"}, {"authorId": "1685292", "name": "T. Poggio"}]}, {"paperId": "6d0bd45930fcbdc64f826ae210980dfb6e0b8636", "url": "https://www.semanticscholar.org/paper/6d0bd45930fcbdc64f826ae210980dfb6e0b8636", "title": "Making Machine Learning Models Clinically Useful.", "abstract": "Recent advances in supervised machine learning have improved diagnostic accuracy and prediction of treatment outcomes, in some cases surpassing the performance of clinicians.1 In supervised machine learning, a mathematical function is constructed via automated analysis of training data, which consists of input features (such as retinal images) and output labels (such as the grade of macular edema). With large training data sets and minimal human guidance, a computer learns to generalize from the information contained in the training data. The result is a mathematical function, a model, that can be used to map a new record to the corresponding diagnosis, such as an image to grade macular edema. Although machine learning–based models for classification or for predicting a future health state are being developed for diverse clinical applications, evidence is lacking that deployment of these models has improved care and patient outcomes.2 One barrier to demonstrating such improvement is the basis used to assess the performance of a model. Current approaches gauge performance by quantifying how closely the diagnosis or prediction made by the model matches known diagnoses or health outcomes. Quantifications include sensitivity, specificity, and positive predictive value, as well as measures such as the", "year": 2019, "referenceCount": 7, "citationCount": 128, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "143665076", "name": "N. Shah"}, {"authorId": "46802048", "name": "A. Milstein"}, {"authorId": "151491825", "name": "Steven C Bagley PhD"}]}, {"paperId": "d988c0ff9b6f023fa01c8f96f7218a30ca085de6", "url": "https://www.semanticscholar.org/paper/d988c0ff9b6f023fa01c8f96f7218a30ca085de6", "title": "Socially guided machine learning", "abstract": "Social interaction will be key to enabling robots and machines in general to learn new tasks from ordinary people (not experts in robotics or machine learning). Everyday people who need to teach their machines new things will find it natural for to rely on their interpersonal interaction skills. This thesis provides several contributions towards the understanding of this Socially Guided Machine Learning scenario. \nWhile the topic of human input to machine learning algorithms has been explored to some extent, prior works have not gone far enough to understand what people will try to communicate when teaching a machine and how algorithms and learning systems can be modified to better accommodate a human partner. Interface techniques have been based on intuition and assumptions rather than grounded in human behavior, and often techniques are not demonstrated or evaluated with everyday people. \nUsing a computer game, Sophie's Kitchen, an experiment with human subjects provides several insights about how people approach the task of teaching a machine. In particular, people want to direct and guide an agent's exploration process, they quickly use the behavior of the agent to infer a mental model of the learning process, and they utilize positive and negative feedback in asymmetric ways. Using a robotic platform, Leonardo, and 200 people in follow-up studies of modified versions of the Sophie's Kitchen game, four research themes are developed. \nThe use of human guidance in a machine learning exploration can be successfully incorporated to improve learning performance. Novel learning approaches demonstrate aspects of goal-oriented learning. The transparency of the machine learner can have significant effects on the nature of the instruction received from the human teacher, which in turn positively impacts the learning process. Utilizing asymmetric interpretations of positive and negative feedback from a human partner, can result in a more efficient and robust learning experience. (Copies available exclusively from MIT Libraries, Rm. 14-0551, Cambridge, MA 02139-4307. Ph. 617-253-5668; Fax 617-253-1690.)", "year": 2006, "referenceCount": 107, "citationCount": 74, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "1682788", "name": "A. Thomaz"}]}, {"paperId": "0f8ef4fc563af85744cf6214925a0fbf51edc2a7", "url": "https://www.semanticscholar.org/paper/0f8ef4fc563af85744cf6214925a0fbf51edc2a7", "title": "Predicting hepatitis B virus–positive metastatic hepatocellular carcinomas using gene expression profiling and supervised machine learning", "abstract": null, "year": 2003, "referenceCount": 52, "citationCount": 807, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "145681410", "name": "Q. Ye"}, {"authorId": "143822422", "name": "L. Qin"}, {"authorId": "3216845", "name": "M. Forgues"}, {"authorId": "2118241977", "name": "P. He"}, {"authorId": "2152672855", "name": "J. Kim"}, {"authorId": "121167337", "name": "A. Peng"}, {"authorId": "144734711", "name": "R. Simon"}, {"authorId": "2152883966", "name": "Yan Li"}, {"authorId": "1885953", "name": "A. Robles"}, {"authorId": "2140051186", "name": "Yidong Chen"}, {"authorId": "11958223", "name": "Zeng-chen Ma"}, {"authorId": "10234856", "name": "Zhi-quan Wu"}, {"authorId": "39223684", "name": "S. Ye"}, {"authorId": "3379467", "name": "Yin-kun Liu"}, {"authorId": "145378441", "name": "Zhao-You Tang"}, {"authorId": "31858898", "name": "X. Wang"}]}, {"paperId": "a456265138c088a894301c0433dae938705a9bec", "url": "https://www.semanticscholar.org/paper/a456265138c088a894301c0433dae938705a9bec", "title": "Deep Sets", "abstract": "We study the problem of designing models for machine learning tasks defined on sets. In contrast to the traditional approach of operating on fixed dimensional vectors, we consider objective functions defined on sets and are invariant to permutations. Such problems are widespread, ranging from the estimation of population statistics, to anomaly detection in piezometer data of embankment dams, to cosmology. Our main theorem characterizes the permutation invariant objective functions and provides a family of functions to which any permutation invariant objective function must belong. This family of functions has a special structure which enables us to design a deep network architecture that can operate on sets and which can be deployed on a variety of scenarios including both unsupervised and supervised learning tasks. We demonstrate the applicability of our method on population statistic estimation, point cloud classification, set expansion, and outlier detection.", "year": 2017, "referenceCount": 63, "citationCount": 1322, "influentialCitationCount": 167, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1771307", "name": "M. Zaheer"}, {"authorId": "2150275", "name": "Satwik Kottur"}, {"authorId": "2111187", "name": "Siamak Ravanbakhsh"}, {"authorId": "1719347", "name": "B. Póczos"}, {"authorId": "145124475", "name": "R. Salakhutdinov"}, {"authorId": "46234526", "name": "Alex Smola"}]}, {"paperId": "bf864fa6c4ce7fba5e9be1ed61d514ce67bb9346", "url": "https://www.semanticscholar.org/paper/bf864fa6c4ce7fba5e9be1ed61d514ce67bb9346", "title": "Machine learning for precise quantum measurement.", "abstract": "Adaptive feedback schemes are promising for quantum-enhanced measurements yet are complicated to design. Machine learning can autonomously generate algorithms in a classical setting. Here we adapt machine learning for quantum information and use our framework to generate autonomous adaptive feedback schemes for quantum measurement. In particular, our approach replaces guesswork in quantum measurement by a logical, fully automatic, programable routine. We show that our method yields schemes that outperform the best known adaptive scheme for interferometric phase estimation.", "year": 2009, "referenceCount": 25, "citationCount": 139, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine", "Computer Science"], "authors": [{"authorId": "1878626", "name": "A. Hentschel"}, {"authorId": "34655154", "name": "B. Sanders"}]}, {"paperId": "30e0ffeb519a4df2d4a2067e899c5fb5c5e85e70", "url": "https://www.semanticscholar.org/paper/30e0ffeb519a4df2d4a2067e899c5fb5c5e85e70", "title": "Exploiting Unintended Feature Leakage in Collaborative Learning", "abstract": "Collaborative machine learning and related techniques such as federated learning allow multiple participants, each with his own training dataset, to build a joint model by training locally and periodically exchanging model updates. We demonstrate that these updates leak unintended information about participants' training data and develop passive and active inference attacks to exploit this leakage. First, we show that an adversarial participant can infer the presence of exact data points -- for example, specific locations -- in others' training data (i.e., membership inference). Then, we show how this adversary can infer properties that hold only for a subset of the training data and are independent of the properties that the joint model aims to capture. For example, he can infer when a specific person first appears in the photos used to train a binary gender classifier. We evaluate our attacks on a variety of tasks, datasets, and learning configurations, analyze their limitations, and discuss possible defenses.", "year": 2018, "referenceCount": 70, "citationCount": 724, "influentialCitationCount": 74, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145557680", "name": "Luca Melis"}, {"authorId": "3469125", "name": "Congzheng Song"}, {"authorId": "1728207", "name": "Emiliano De Cristofaro"}, {"authorId": "1723945", "name": "Vitaly Shmatikov"}]}, {"paperId": "180a03aa6f09e2b06417b86e8f1828861633bd37", "url": "https://www.semanticscholar.org/paper/180a03aa6f09e2b06417b86e8f1828861633bd37", "title": "Privacy-preserving Machine Learning as a Service", "abstract": "Abstract Machine learning algorithms based on deep Neural Networks (NN) have achieved remarkable results and are being extensively used in different domains. On the other hand, with increasing growth of cloud services, several Machine Learning as a Service (MLaaS) are offered where training and deploying machine learning models are performed on cloud providers’ infrastructure. However, machine learning algorithms require access to the raw data which is often privacy sensitive and can create potential security and privacy risks. To address this issue, we present CryptoDL, a framework that develops new techniques to provide solutions for applying deep neural network algorithms to encrypted data. In this paper, we provide the theoretical foundation for implementing deep neural network algorithms in encrypted domain and develop techniques to adopt neural networks within practical limitations of current homomorphic encryption schemes. We show that it is feasible and practical to train neural networks using encrypted data and to make encrypted predictions, and also return the predictions in an encrypted form. We demonstrate applicability of the proposed CryptoDL using a large number of datasets and evaluate its performance. The empirical results show that it provides accurate privacy-preserving training and classification.", "year": 2018, "referenceCount": 44, "citationCount": 136, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2599072", "name": "Ehsan Hesamifard"}, {"authorId": "1718305", "name": "H. Takabi"}, {"authorId": "2053305594", "name": "Mehdi Ghasemi"}, {"authorId": "1701402", "name": "Rebecca N. Wright"}]}, {"paperId": "d1d8980d04d411c314910d1926f3bbaac46c2197", "url": "https://www.semanticscholar.org/paper/d1d8980d04d411c314910d1926f3bbaac46c2197", "title": "DeepMIMO: A Generic Deep Learning Dataset for Millimeter Wave and Massive MIMO Applications", "abstract": "Machine learning tools are finding interesting applications in millimeter wave (mmWave) and massive MIMO systems. This is mainly thanks to their powerful capabilities in learning unknown models and tackling hard optimization problems. To advance the machine learning research in mmWave/massive MIMO, however, there is a need for a common dataset. This dataset can be used to evaluate the developed algorithms, reproduce the results, set benchmarks, and compare the different solutions. In this work, we introduce the DeepMIMO dataset, which is a generic dataset for mmWave/massive MIMO channels. The DeepMIMO dataset generation framework has two important features. First, the DeepMIMO channels are constructed based on accurate ray-tracing data obtained from Remcom Wireless InSite. The DeepMIMO channels, therefore, capture the dependence on the environment geometry/materials and transmitter/receiver locations, which is essential for several machine learning applications. Second, the DeepMIMO dataset is generic/parameterized as the researcher can adjust a set of system and channel parameters to tailor the generated DeepMIMO dataset for the target machine learning application. The DeepMIMO dataset can then be completely defined by the (i) the adopted ray-tracing scenario and (ii) the set of parameters, which enables the accurate definition and reproduction of the dataset. In this paper, an example DeepMIMO dataset is described based on an outdoor ray-tracing scenario of 18 base stations and more than one million users. The paper also shows how this dataset can be used in an example deep learning application of mmWave beam prediction.", "year": 2019, "referenceCount": 21, "citationCount": 182, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "authors": [{"authorId": "145719185", "name": "A. Alkhateeb"}]}, {"paperId": "412b230127c05dbeab72b9d9c8f6bc9c55d566f7", "url": "https://www.semanticscholar.org/paper/412b230127c05dbeab72b9d9c8f6bc9c55d566f7", "title": "The Mortality and Medical Costs of Air Pollution: Evidence from Changes in Wind Direction", "abstract": "We estimate the causal effects of acute fine particulate matter exposure on mortality, health care use, and medical costs among the US elderly using Medicare data. We instrument for air pollution using changes in local wind direction and develop a new approach that uses machine learning to estimate the life-years lost due to pollution exposure. Finally, we characterize treatment effect heterogeneity using both life expectancy and generic machine learning inference. Both approaches find that mortality effects are concentrated in about 25 percent of the elderly population.", "year": 2016, "referenceCount": 111, "citationCount": 277, "influentialCitationCount": 51, "isOpenAccess": true, "fieldsOfStudy": ["Geography", "Medicine"], "authors": [{"authorId": "4292991", "name": "T. Deryugina"}, {"authorId": "66372515", "name": "Garth Heutel"}, {"authorId": "2099940622", "name": "Nolan H. Miller"}, {"authorId": "40051475", "name": "D. Molitor"}, {"authorId": "39573999", "name": "J. Reif"}]}, {"paperId": "3e317d0a505535bc2ae045b587ac2a9492ddc86f", "url": "https://www.semanticscholar.org/paper/3e317d0a505535bc2ae045b587ac2a9492ddc86f", "title": "On the Use of Stochastic Hessian Information in Optimization Methods for Machine Learning", "abstract": "This paper describes how to incorporate sampled curvature information in a Newton-CG method and in a limited memory quasi-Newton method for statistical learning. The motivation for this work stems from supervised machine learning applications involving a very large number of training points. We follow a batch approach, also known in the stochastic optimization literature as a sample average approximation approach. Curvature information is incorporated in two subsampled Hessian algorithms, one based on a matrix-free inexact Newton iteration and one on a preconditioned limited memory BFGS iteration. A crucial feature of our technique is that Hessian-vector multiplications are carried out with a significantly smaller sample size than is used for the function and gradient. The efficiency of the proposed methods is illustrated using a machine learning application involving speech recognition.", "year": 2011, "referenceCount": 26, "citationCount": 247, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "144448267", "name": "R. Byrd"}, {"authorId": "2302020", "name": "Gillian M. Chin"}, {"authorId": "2471268", "name": "Will Neveitt"}, {"authorId": "2784955", "name": "J. Nocedal"}]}, {"paperId": "d725045ed29d69b7a503896841ef637383376043", "url": "https://www.semanticscholar.org/paper/d725045ed29d69b7a503896841ef637383376043", "title": "Learning Machines: Foundations of Trainable Pattern-Classifying Systems", "abstract": null, "year": 1965, "referenceCount": 0, "citationCount": 452, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144497046", "name": "N. Nilsson"}]}, {"paperId": "21faf54f062bb3061885e407539ce43e7ce19156", "url": "https://www.semanticscholar.org/paper/21faf54f062bb3061885e407539ce43e7ce19156", "title": "Anticipating Cryptocurrency Prices Using Machine Learning", "abstract": "Machine learning and AI-assisted trading have attracted growing interest for the past few years. Here, we use this approach to test the hypothesis that the inefficiency of the cryptocurrency market can be exploited to generate abnormal profits. We analyse daily data for 1,681 cryptocurrencies for the period between Nov. 2015 and Apr. 2018. We show that simple trading strategies assisted by state-of-the-art machine learning algorithms outperform standard benchmarks. Our results show that nontrivial, but ultimately simple, algorithmic mechanisms can help anticipate the short-term evolution of the cryptocurrency market.", "year": 2018, "referenceCount": 98, "citationCount": 133, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics", "Economics"], "authors": [{"authorId": "2818774", "name": "Laura Alessandretti"}, {"authorId": "70058324", "name": "Abeer ElBahrawy"}, {"authorId": "2905635", "name": "L. Aiello"}, {"authorId": "2836702", "name": "A. Baronchelli"}]}, {"paperId": "7a6121c4ac99b0d21aa20424df4390a38537c063", "url": "https://www.semanticscholar.org/paper/7a6121c4ac99b0d21aa20424df4390a38537c063", "title": "Machine learning with operational costs", "abstract": "This work proposes a way to align statistical modeling with decision making. We provide a method that propagates the uncertainty in predictive modeling to the uncertainty in operational cost, where operational cost is the amount spent by the practitioner in solving the problem. The method allows us to explore the range of operational costs associated with the set of reasonable statistical models, so as to provide a useful way for practitioners to understand uncertainty. To do this, the operational cost is cast as a regularization term in a learning algorithm's objective function, allowing either an optimistic or pessimistic view of possible costs, depending on the regularization parameter. From another perspective, if we have prior knowledge about the operational cost, for instance that it should be low, this knowledge can help to restrict the hypothesis space, and can help with generalization. We provide a theoretical generalization bound for this scenario. We also show that learning with operational costs is related to robust optimization.", "year": 2011, "referenceCount": 51, "citationCount": 49, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1782469", "name": "Theja Tulabandhula"}, {"authorId": "48395540", "name": "C. Rudin"}]}, {"paperId": "8a5d0579590465494c9aba58a857af43b190b6a6", "url": "https://www.semanticscholar.org/paper/8a5d0579590465494c9aba58a857af43b190b6a6", "title": "Deep Learning in Mobile and Wireless Networking: A Survey", "abstract": "The rapid uptake of mobile devices and the rising popularity of mobile applications and services pose unprecedented demands on mobile and wireless networking infrastructure. Upcoming 5G systems are evolving to support exploding mobile traffic volumes, real-time extraction of fine-grained analytics, and agile management of network resources, so as to maximize user experience. Fulfilling these tasks is challenging, as mobile environments are increasingly complex, heterogeneous, and evolving. One potential solution is to resort to advanced machine learning techniques, in order to help manage the rise in data volumes and algorithm-driven applications. The recent success of deep learning underpins new and powerful tools that tackle problems in this space. In this paper, we bridge the gap between deep learning and mobile and wireless networking research, by presenting a comprehensive survey of the crossovers between the two areas. We first briefly introduce essential background and state-of-the-art in deep learning techniques with potential applications to networking. We then discuss several techniques and platforms that facilitate the efficient deployment of deep learning onto mobile systems. Subsequently, we provide an encyclopedic review of mobile and wireless networking research based on deep learning, which we categorize by different domains. Drawing from our experience, we discuss how to tailor deep learning to mobile environments. We complete this survey by pinpointing current challenges and open future directions for research.", "year": 2018, "referenceCount": 588, "citationCount": 880, "influentialCitationCount": 52, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3194878", "name": "Chaoyun Zhang"}, {"authorId": "144555592", "name": "P. Patras"}, {"authorId": "1763096", "name": "H. Haddadi"}]}, {"paperId": "93aa063d330ed7509f55b1297138cf20300fb969", "url": "https://www.semanticscholar.org/paper/93aa063d330ed7509f55b1297138cf20300fb969", "title": "Kernels for Vector-Valued Functions: a Review", "abstract": "Kernel methods are among the most popular techniques in machine learning. From a regularization perspective they play a central role in regularization theory as they provide a natural choice for the hypotheses space and the regularization functional through the notion of reproducing kernel Hilbert spaces. From a probabilistic perspective they are the key in the context of Gaussian processes, where the kernel function is known as the covariance function. Traditionally, kernel methods have been used in supervised learning problems with scalar outputs and indeed there has been a considerable amount of work devoted to designing and learning kernels. More recently there has been an increasing interest in methods that deal with multiple outputs, motivated partially by frameworks like multitask learning. In this monograph, we review different methods to design or learn valid kernel functions for multiple outputs, paying particular attention to the connection between probabilistic and functional methods.", "year": 2011, "referenceCount": 115, "citationCount": 619, "influentialCitationCount": 71, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144491954", "name": "Mauricio A Álvarez"}, {"authorId": "1690976", "name": "L. Rosasco"}, {"authorId": "145306271", "name": "Neil D. Lawrence"}]}, {"paperId": "2521c3d76bc439c961b7003080f4a7a661949547", "url": "https://www.semanticscholar.org/paper/2521c3d76bc439c961b7003080f4a7a661949547", "title": "Causal Protein-Signaling Networks Derived from Multiparameter Single-Cell Data", "abstract": "Machine learning was applied for the automated derivation of causal influences in cellular signaling networks. This derivation relied on the simultaneous measurement of multiple phosphorylated protein and phospholipid components in thousands of individual primary human immune system cells. Perturbing these cells with molecular interventions drove the ordering of connections between pathway components, wherein Bayesian network computational methods automatically elucidated most of the traditionally reported signaling relationships and predicted novel interpathway network causalities, which we verified experimentally. Reconstruction of network models from physiologically relevant primary single cells might be applied to understanding native-state tissue signaling biology, complex drug actions, and dysfunctional signaling in diseased cells.", "year": 2005, "referenceCount": 42, "citationCount": 1584, "influentialCitationCount": 182, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "46599630", "name": "K. Sachs"}, {"authorId": "3289622", "name": "O. Perez"}, {"authorId": "1397424343", "name": "D. Pe’er"}, {"authorId": "1761370", "name": "D. Lauffenburger"}, {"authorId": "1857137", "name": "G. Nolan"}]}, {"paperId": "44f4b1b90f8d5515f2486e07e4cb4b9589c27518", "url": "https://www.semanticscholar.org/paper/44f4b1b90f8d5515f2486e07e4cb4b9589c27518", "title": "Deep Learning and Its Applications to Machine Health Monitoring: A Survey", "abstract": "Since 2006, deep learning (DL) has become a rapidly growing research direction, redefining state-of-the-art performances in a wide range of areas such as object recognition, image segmentation, speech recognition and machine translation. In modern manufacturing systems, data-driven machine health monitoring is gaining in popularity due to the widespread deployment of low-cost sensors and their connection to the Internet. Meanwhile, deep learning provides useful tools for processing and analyzing these big machinery data. The main purpose of this paper is to review and summarize the emerging research work of deep learning on machine health monitoring. After the brief introduction of deep learning techniques, the applications of deep learning in machine health monitoring systems are reviewed mainly from the following aspects: Auto-encoder (AE) and its variants, Restricted Boltzmann Machines and its variants including Deep Belief Network (DBN) and Deep Boltzmann Machines (DBM), Convolutional Neural Networks (CNN) and Recurrent Neural Networks (RNN). Finally, some new trends of DL-based machine health monitoring methods are discussed.", "year": 2016, "referenceCount": 112, "citationCount": 142, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "49832912", "name": "Rui Zhao"}, {"authorId": "35374692", "name": "Ruqiang Yan"}, {"authorId": "48354147", "name": "Zhenghua Chen"}, {"authorId": "144067957", "name": "K. Mao"}, {"authorId": "48319740", "name": "Peng Wang"}, {"authorId": "1700762", "name": "R. Gao"}]}, {"paperId": "a486e2839291111bb44fa1f07731ada123539f75", "url": "https://www.semanticscholar.org/paper/a486e2839291111bb44fa1f07731ada123539f75", "title": "Google’s Multilingual Neural Machine Translation System: Enabling Zero-Shot Translation", "abstract": "We propose a simple solution to use a single Neural Machine Translation (NMT) model to translate between multiple languages. Our solution requires no changes to the model architecture from a standard NMT system but instead introduces an artificial token at the beginning of the input sentence to specify the required target language. Using a shared wordpiece vocabulary, our approach enables Multilingual NMT systems using a single model. On the WMT’14 benchmarks, a single multilingual model achieves comparable performance for English→French and surpasses state-of-theart results for English→German. Similarly, a single multilingual model surpasses state-of-the-art results for French→English and German→English on WMT’14 and WMT’15 benchmarks, respectively. On production corpora, multilingual models of up to twelve language pairs allow for better translation of many individual pairs. Our models can also learn to perform implicit bridging between language pairs never seen explicitly during training, showing that transfer learning and zero-shot translation is possible for neural translation. Finally, we show analyses that hints at a universal interlingua representation in our models and also show some interesting examples when mixing languages.", "year": 2016, "referenceCount": 35, "citationCount": 1571, "influentialCitationCount": 193, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145657834", "name": "Melvin Johnson"}, {"authorId": "144927151", "name": "M. Schuster"}, {"authorId": "2827616", "name": "Quoc V. Le"}, {"authorId": "2048712", "name": "M. Krikun"}, {"authorId": "48607963", "name": "Yonghui Wu"}, {"authorId": "2545358", "name": "Z. Chen"}, {"authorId": "144203200", "name": "Nikhil Thorat"}, {"authorId": "1765169", "name": "F. Viégas"}, {"authorId": "145233583", "name": "M. Wattenberg"}, {"authorId": "32131713", "name": "G. Corrado"}, {"authorId": "48342565", "name": "Macduff Hughes"}, {"authorId": "49959210", "name": "J. Dean"}]}, {"paperId": "eaaeba863049573132b4e2088034b10d85e9b625", "url": "https://www.semanticscholar.org/paper/eaaeba863049573132b4e2088034b10d85e9b625", "title": "Emergency department triage prediction of clinical outcomes using machine learning models", "abstract": null, "year": 2019, "referenceCount": 56, "citationCount": 163, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "4967535", "name": "Y. Raita"}, {"authorId": "3350947", "name": "T. Goto"}, {"authorId": "15813955", "name": "M. Faridi"}, {"authorId": "2115443669", "name": "David F. M. Brown"}, {"authorId": "145195567", "name": "C. Camargo"}, {"authorId": "2136894", "name": "K. Hasegawa"}]}, {"paperId": "d56fb220b4995272d830fe115a2eedd54448d1c3", "url": "https://www.semanticscholar.org/paper/d56fb220b4995272d830fe115a2eedd54448d1c3", "title": "A Performance and Cost Assessment of Machine Learning Interatomic Potentials.", "abstract": "Machine learning of the quantitative relationship between local environment descriptors and the potential energy surface of a system of atoms has emerged as a new frontier in the development of interatomic potentials (IAPs). Here, we present a comprehensive evaluation of ML-IAPs based on four local environment descriptors --- atom-centered symmetry functions (ACSF), smooth overlap of atomic positions (SOAP), the Spectral Neighbor Analysis Potential (SNAP) bispectrum components, and moment tensors --- using a diverse data set generated using high-throughput density functional theory (DFT) calculations. The data set comprising bcc (Li, Mo) and fcc (Cu, Ni) metals and diamond group IV semiconductors (Si, Ge) is chosen to span a range of crystal structures and bonding. All descriptors studied show excellent performance in predicting energies and forces far surpassing that of classical IAPs, as well as predicting properties such as elastic constants and phonon dispersion curves. We observe a general trade-off between accuracy and the degrees of freedom of each model, and consequently computational cost. We will discuss these trade-offs in the context of model selection for molecular dynamics and other applications.", "year": 2019, "referenceCount": 130, "citationCount": 262, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine", "Mathematics", "Chemistry"], "authors": [{"authorId": "11844524", "name": "Yunxing Zuo"}, {"authorId": "143915066", "name": "Chi Chen"}, {"authorId": "2108568792", "name": "Xiang-Guo Li"}, {"authorId": "98796862", "name": "Z. Deng"}, {"authorId": "2109366932", "name": "Yiming Chen"}, {"authorId": "144136091", "name": "J. Behler"}, {"authorId": "2559761", "name": "Gábor Csányi"}, {"authorId": "2810901", "name": "A. Shapeev"}, {"authorId": "144056220", "name": "A. Thompson"}, {"authorId": "47817335", "name": "M. Wood"}, {"authorId": "2381325", "name": "S. Ong"}]}, {"paperId": "ecfdfcd1ef21449a01701122745a7be5ba135e7f", "url": "https://www.semanticscholar.org/paper/ecfdfcd1ef21449a01701122745a7be5ba135e7f", "title": "Data Mining for Imbalanced Datasets: An Overview", "abstract": null, "year": 2005, "referenceCount": 66, "citationCount": 1260, "influentialCitationCount": 52, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144539424", "name": "N. Chawla"}]}, {"paperId": "0ea2f1f5c470c4947b48bbd21245fb327282f3b4", "url": "https://www.semanticscholar.org/paper/0ea2f1f5c470c4947b48bbd21245fb327282f3b4", "title": "Stock market's price movement prediction with LSTM neural networks", "abstract": "Predictions on stock market prices are a great challenge due to the fact that it is an immensely complex, chaotic and dynamic environment. There are many studies from various areas aiming to take on that challenge and Machine Learning approaches have been the focus of many of them. There are many examples of Machine Learning algorithms been able to reach satisfactory results when doing that type of prediction. This article studies the usage of LSTM networks on that scenario, to predict future trends of stock prices based on the price history, alongside with technical analysis indicators. For that goal, a prediction model was built, and a series of experiments were executed and theirs results analyzed against a number of metrics to assess if this type of algorithm presents and improvements when compared to other Machine Learning methods and investment strategies. The results that were obtained are promising, getting up to an average of 55.9% of accuracy when predicting if the price of a particular stock is going to go up or not in the near future.", "year": 2017, "referenceCount": 21, "citationCount": 398, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2112887403", "name": "David M. Q. Nelson"}, {"authorId": "38964525", "name": "Adriano M. Pereira"}, {"authorId": "153714464", "name": "Renato A. de Oliveira"}]}, {"paperId": "f18329d62d51ac7045c1f7a657ddf03f10c0157b", "url": "https://www.semanticscholar.org/paper/f18329d62d51ac7045c1f7a657ddf03f10c0157b", "title": "A survey of methods for distributed machine learning", "abstract": null, "year": 2013, "referenceCount": 50, "citationCount": 138, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1402266988", "name": "Diego Peteiro-Barral"}, {"authorId": "1401832226", "name": "Bertha Guijarro-Berdiñas"}]}, {"paperId": "c2f4c6d7e06da14c4b3ce3a9b97394a64708dc52", "url": "https://www.semanticscholar.org/paper/c2f4c6d7e06da14c4b3ce3a9b97394a64708dc52", "title": "Database Dependency Discovery: A Machine Learning Approach", "abstract": "Database dependencies, such as functional and multivalued dependencies, express the presence of structure in database relations, that can be utilised in the database design process. The discovery of database dependencies can be viewed as an induction problem, in which general rules (dependencies) are obtained from specific facts (the relation). This viewpoint has the advantage of abstracting away as much as possible from the particulars of the dependencies. The algorithms in this paper are designed such that they can easily be generalised to other kinds of dependencies.Like in current approaches to computational induction such as inductive logic programming, we distinguish between top-down algorithms and bottom-up algorithms. In a top-down approach, hypotheses are generated in a systematic way and then tested against the given relation. In a bottom-up approach, the relation is inspected in order to see what dependencies it may satisfy or violate. We give a simple (but inefficient) top-down algorithm, a bi-directional algorithm, and a bottom-up algorithm. In the case of functional dependencies, these algorithms have been implemented in the FDEP system and evaluated experimentally. The bottom-up algorithm is the most efficient of the three, and also outperforms other algorithms from the literature.", "year": 1999, "referenceCount": 34, "citationCount": 185, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47840704", "name": "Peter A. Flach"}, {"authorId": "2263707", "name": "Iztok Savnik"}]}, {"paperId": "821e3d348ea9761d5dcf6470235b7a73931d84cd", "url": "https://www.semanticscholar.org/paper/821e3d348ea9761d5dcf6470235b7a73931d84cd", "title": "Chinese Word Segmentation as Character Tagging", "abstract": "In this paper we report results of a supervised machine-learning approach to Chinese word segmentation. A maximum entropy tagger is trained on manually annotated data to automatically assign to Chinese characters, or hanzi, tags that indicate the position of a hanzi within a word. The tagged output is then converted into segmented text for evaluation. Preliminary results show that this approach is competitive against other supervised machine-learning segmenters reported in previous studies, achieving precision and recall rates of 95.01% and 94.94% respectively, trained on a 237K-word training set.", "year": 2003, "referenceCount": 31, "citationCount": 276, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3432785", "name": "Nianwen Xu"}]}, {"paperId": "d17a3e9f34125ba6454e365ffe403ce8a91f2632", "url": "https://www.semanticscholar.org/paper/d17a3e9f34125ba6454e365ffe403ce8a91f2632", "title": "SGD and Hogwild! Convergence Without the Bounded Gradients Assumption", "abstract": "Stochastic gradient descent (SGD) is the optimization algorithm of choice in many machine learning applications such as regularized empirical risk minimization and training deep neural networks. The classical convergence analysis of SGD is carried out under the assumption that the norm of the stochastic gradient is uniformly bounded. While this might hold for some loss functions, it is always violated for cases where the objective function is strongly convex. In (Bottou et al.,2016), a new analysis of convergence of SGD is performed under the assumption that stochastic gradients are bounded with respect to the true gradient norm. Here we show that for stochastic problems arising in machine learning such bound always holds; and we also propose an alternative convergence analysis of SGD with diminishing learning rate regime, which results in more relaxed conditions than those in (Bottou et al.,2016). We then move on the asynchronous parallel setting, and prove convergence of Hogwild! algorithm in the same regime, obtaining the first convergence results for this method in the case of diminished learning rate.", "year": 2018, "referenceCount": 24, "citationCount": 144, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "144274166", "name": "Lam M. Nguyen"}, {"authorId": "143671628", "name": "Phuong Ha Nguyen"}, {"authorId": "144534186", "name": "Marten van Dijk"}, {"authorId": "2662221", "name": "Peter Richtárik"}, {"authorId": "2005127", "name": "K. Scheinberg"}, {"authorId": "144696183", "name": "Martin Takác"}]}, {"paperId": "613cca60171b063ff78f9346dd1b199a438375a6", "url": "https://www.semanticscholar.org/paper/613cca60171b063ff78f9346dd1b199a438375a6", "title": "Physics-informed machine learning approach for reconstructing Reynolds stress modeling discrepancies based on DNS data", "abstract": "We show that the discrepancies in Reynolds-averaged Navier-Stokes (RANS) modeled Reynolds stresses can be explained by mean flow features. A physics-informed machine learning framework is proposed to improve the predictive capabilities of RANS models by leveraging existing direct numerical simulations databases.", "year": 2016, "referenceCount": 57, "citationCount": 385, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "2110206668", "name": "Jian-Xun Wang"}, {"authorId": "47876141", "name": "Jinlong Wu"}, {"authorId": "41193045", "name": "Heng Xiao"}]}, {"paperId": "6a61b4967c161347525abc3ab5dba590c0cd99ca", "url": "https://www.semanticscholar.org/paper/6a61b4967c161347525abc3ab5dba590c0cd99ca", "title": "Analysis of function of rectified linear unit used in deep learning", "abstract": "Deep Learning is attracting much attention in object recognition and speech processing. A benefit of using the deep learning is that it provides automatic pre-training. Several proposed methods that include auto-encoder are being successfully used in various applications. Moreover, deep learning uses a multilayer network that consists of many layers, a huge number of units, and huge amount of data. Thus, executing deep learning requires heavy computation, so deep learning is usually utilized with parallel computation with many cores or many machines. Deep learning employs the gradient algorithm, however this traps the learning into the saddle point or local minima. To avoid this difficulty, a rectified linear unit (ReLU) is proposed to speed up the learning convergence. However, the reasons the convergence is speeded up are not well understood. In this paper, we analyze the ReLU by a using simpler network called the soft-committee machine and clarify the reason for the speedup. We also train the network in an on-line manner. The soft-committee machine provides a good test bed to analyze deep learning. The results provide some reasons for the speedup of the convergence of the deep learning.", "year": 2015, "referenceCount": 18, "citationCount": 209, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3217681", "name": "K. Hara"}, {"authorId": "34282232", "name": "D. Saitoh"}, {"authorId": "144548336", "name": "Hayaru Shouno"}]}, {"paperId": "aea2d6337264545a3da2ed5958845d6b622d176f", "url": "https://www.semanticscholar.org/paper/aea2d6337264545a3da2ed5958845d6b622d176f", "title": "Prognosis of Bearing Acoustic Emission Signals Using Supervised Machine Learning", "abstract": "Acoustic emission (AE) technique can be successfully utilized for condition monitoring of various machining and industrial processes. To keep machines function at optimal levels, fault prognosis model to predict the remaining useful life (RUL) of machine components is required. This model is used to analyze the output signals of a machine whilst in operation and accordingly helps to set an early alarm tool that reduces the untimely replacement of components and the wasteful machine downtime. Recent improvements indicate the drive on the way towards incorporation of prognosis and diagnosis machine learning techniques in future machine health management systems. With this in mind, this work employs three supervised machine learning techniques; support vector machine regression, multilayer artificial neural network model and gaussian process regression, to correlate AE features with corresponding natural wear of slow speed bearings throughout series of laboratory experiments. Analysis of signal parameters such as signal intensity estimator and root mean square was undertaken to discriminate individual types of early damage. It was concluded that neural networks model with back propagation learning algorithm has an advantage over the other models in estimating the RUL for slow speed bearings if the proper network structure is chosen and sufficient data is provided.", "year": 2018, "referenceCount": 27, "citationCount": 128, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "30988326", "name": "M. Elforjani"}, {"authorId": "31380622", "name": "Suliman Shanbr"}]}, {"paperId": "8f54b85fcd5074482a74f32a96e808b5be3a9da7", "url": "https://www.semanticscholar.org/paper/8f54b85fcd5074482a74f32a96e808b5be3a9da7", "title": "Towards energy-aware scheduling in data centers using machine learning", "abstract": "As energy-related costs have become a major economical factor for IT infrastructures and data-centers, companies and the research community are being challenged to find better and more efficient power-aware resource management strategies. There is a growing interest in \"Green\" IT and there is still a big gap in this area to be covered.\n In order to obtain an energy-efficient data center, we propose a framework that provides an intelligent consolidation methodology using different techniques such as turning on/off machines, power-aware consolidation algorithms, and machine learning techniques to deal with uncertain information while maximizing performance. For the machine learning approach, we use models learned from previous system behaviors in order to predict power consumption levels, CPU loads, and SLA timings, and improve scheduling decisions. Our framework is vertical, because it considers from watt consumption to workload features, and cross-disciplinary, as it uses a wide variety of techniques.\n We evaluate these techniques with a framework that covers the whole control cycle of a real scenario, using a simulation with representative heterogeneous workloads, and we measure the quality of the results according to a set of metrics focused toward our goals, besides traditional policies. The results obtained indicate that our approach is close to the optimal placement and behaves better when the level of uncertainty increases.", "year": 2010, "referenceCount": 34, "citationCount": 256, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2658652", "name": "Josep Lluís Berral"}, {"authorId": "2495308", "name": "Íñigo Goiri"}, {"authorId": "2526886", "name": "Ramon Nou"}, {"authorId": "144322760", "name": "F. Julià"}, {"authorId": "143814317", "name": "Jordi Guitart"}, {"authorId": "1745702", "name": "Ricard Gavaldà"}, {"authorId": "144345280", "name": "J. Torres"}]}, {"paperId": "5f54adfd6d6959e0c9ae8953ac00ea675087085f", "url": "https://www.semanticscholar.org/paper/5f54adfd6d6959e0c9ae8953ac00ea675087085f", "title": "Named Entity Extraction using AdaBoost", "abstract": "This paper presents a Named Entity Extraction (NEE) system for the CoNLL 2002 competition. The two main sub-tasks of the problem, recognition (NER) and classification (NEC), are performed sequentially and independently with separate modules. Both modules are machine learning based systems, which make use of binary AdaBoost classifiers.", "year": 2002, "referenceCount": 5, "citationCount": 198, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1701734", "name": "X. Carreras"}, {"authorId": "3049328", "name": "Lluís Màrquez i Villodre"}, {"authorId": "1778523", "name": "Lluís Padró"}]}, {"paperId": "9c9ba700f9871a41cfc007658c9ff24f84dc4dcb", "url": "https://www.semanticscholar.org/paper/9c9ba700f9871a41cfc007658c9ff24f84dc4dcb", "title": "Deep Learning with Topological Signatures", "abstract": "Inferring topological and geometrical information from data can offer an alternative perspective on machine learning problems. Methods from topological data analysis, e.g., persistent homology, enable us to obtain such information, typically in the form of summary representations of topological features. However, such topological signatures often come with an unusual structure (e.g., multisets of intervals) that is highly impractical for most machine learning techniques. While many strategies have been proposed to map these topological signatures into machine learning compatible representations, they suffer from being agnostic to the target learning task. In contrast, we propose a technique that enables us to input topological signatures to deep neural networks and learn a task-optimal representation during training. Our approach is realized as a novel input layer with favorable theoretical properties. Classification experiments on 2D object shapes and social network graphs demonstrate the versatility of the approach and, in case of the latter, we even outperform the state-of-the-art by a large margin.", "year": 2017, "referenceCount": 32, "citationCount": 170, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2059648771", "name": "Christoph Hofer"}, {"authorId": "2132917", "name": "R. Kwitt"}, {"authorId": "1695046", "name": "M. Niethammer"}, {"authorId": "30134366", "name": "A. Uhl"}]}, {"paperId": "8529c088924433f2c80c77bc2346129ab75db081", "url": "https://www.semanticscholar.org/paper/8529c088924433f2c80c77bc2346129ab75db081", "title": "Selective Transfer Machine for Personalized Facial Expression Analysis", "abstract": "Automatic facial action unit (AU) and expression detection from videos is a long-standing problem. The problem is challenging in part because classifiers must generalize to previously unknown subjects that differ markedly in behavior and facial morphology (e.g., heavy versus delicate brows, smooth versus deeply etched wrinkles) from those on which the classifiers are trained. While some progress has been achieved through improvements in choices of features and classifiers, the challenge occasioned by individual differences among people remains. Person-specific classifiers would be a possible solution but for a paucity of training data. Sufficient training data for person-specific classifiers typically is unavailable. This paper addresses the problem of how to <italic>personalize</italic> a generic classifier without additional labels from the test subject. We propose a transductive learning method, which we refer to as a Selective Transfer Machine (STM), to personalize a generic classifier by attenuating person-specific mismatches. STM achieves this effect by simultaneously learning a classifier and re-weighting the training samples that are most relevant to the test subject. We compared STM to both generic classifiers and cross-domain learning methods on four benchmarks: CK+ <xref ref-type=\"bibr\" rid=\"ref44\">[44]</xref> , GEMEP-FERA <xref ref-type=\"bibr\" rid=\"ref67\">[67]</xref> , RU-FACS <xref ref-type=\"bibr\" rid=\"ref4\">[4]</xref> and GFT <xref ref-type=\"bibr\" rid=\"ref57\">[57]</xref> . STM outperformed generic classifiers in all.", "year": 2017, "referenceCount": 94, "citationCount": 155, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "39336289", "name": "Wen-Sheng Chu"}, {"authorId": "143867160", "name": "F. D. L. Torre"}, {"authorId": "1737918", "name": "J. Cohn"}]}, {"paperId": "a43d7b8e5e1bcb7c3fbf82164cfc9d12737176e8", "url": "https://www.semanticscholar.org/paper/a43d7b8e5e1bcb7c3fbf82164cfc9d12737176e8", "title": "Task Clustering and Gating for Bayesian Multitask Learning", "abstract": "Modeling a collection of similar regression or classification tasks can be improved by making the tasks 'learn from each other'. In machine learning, this subject is approached through 'multitask learning', where parallel tasks are modeled as multiple outputs of the same network. In multilevel analysis this is generally implemented through the mixed-effects linear model where a distinction is made between 'fixed effects', which are the same for all tasks, and 'random effects', which may vary between tasks. In the present article we will adopt a Bayesian approach in which some of the model parameters are shared (the same for all tasks) and others more loosely connected through a joint prior distribution that can be learned from the data. We seek in this way to combine the best parts of both the statistical multilevel approach and the neural network machinery. The standard assumption expressed in both approaches is that each task can learn equally well from any other task. In this article we extend the model by allowing more differentiation in the similarities between tasks. One such extension is to make the prior mean depend on higher-level task characteristics. More unsupervised clustering of tasks is obtained if we go from a single Gaussian prior to a mixture of Gaussians. This can be further generalized to a mixture of experts architecture with the gates depending on task characteristics. All three extensions are demonstrated through application both on an artificial data set and on two real-world problems, one a school problem and the other involving single-copy newspaper sales.", "year": 2003, "referenceCount": 27, "citationCount": 612, "influentialCitationCount": 44, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143626983", "name": "B. Bakker"}, {"authorId": "1790356", "name": "T. Heskes"}]}, {"paperId": "c529f5b08675f787cdcc094ee495239592339f82", "url": "https://www.semanticscholar.org/paper/c529f5b08675f787cdcc094ee495239592339f82", "title": "Learning to Simulate Complex Physics with Graph Networks", "abstract": "Here we present a machine learning framework and model implementation that can learn to simulate a wide variety of challenging physical domains, involving fluids, rigid solids, and deformable materials interacting with one another. Our framework---which we term \"Graph Network-based Simulators\" (GNS)---represents the state of a physical system with particles, expressed as nodes in a graph, and computes dynamics via learned message-passing. Our results show that our model can generalize from single-timestep predictions with thousands of particles during training, to different initial conditions, thousands of timesteps, and at least an order of magnitude more particles at test time. Our model was robust to hyperparameter choices across various evaluation metrics: the main determinants of long-term performance were the number of message-passing steps, and mitigating the accumulation of error by corrupting the training data with noise. Our GNS framework advances the state-of-the-art in learned physical simulation, and holds promise for solving a wide range of complex forward and inverse problems.", "year": 2020, "referenceCount": 42, "citationCount": 422, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "1398105826", "name": "Alvaro Sanchez-Gonzalez"}, {"authorId": "2069002234", "name": "Jonathan Godwin"}, {"authorId": "2054956", "name": "T. Pfaff"}, {"authorId": "83539859", "name": "Rex Ying"}, {"authorId": "1702139", "name": "J. Leskovec"}, {"authorId": "2019153", "name": "P. Battaglia"}]}, {"paperId": "9abd1ff6214eacd65a8ba7f790e9e87c86088cb9", "url": "https://www.semanticscholar.org/paper/9abd1ff6214eacd65a8ba7f790e9e87c86088cb9", "title": "The importance of interpretability and visualization in machine learning for applications in medicine and health care", "abstract": null, "year": 2020, "referenceCount": 98, "citationCount": 181, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1723612", "name": "A. Vellido"}]}, {"paperId": "4601c715a8042543e88a0bd63095ae6d6a6a6faa", "url": "https://www.semanticscholar.org/paper/4601c715a8042543e88a0bd63095ae6d6a6a6faa", "title": "Fundamentals of Deep Learning: Designing Next-Generation Machine Intelligence Algorithms", "abstract": "With the reinvigoration of neural networks in the 2000s, deep learning has become an extremely active area of research, one thats paving the way for modern machine learning. In this practical book, author Nikhil Buduma provides examples and clear explanations to guide you through major concepts of this complicated field. Companies such as Google, Microsoft, and Facebook are actively growing in-house deep-learning teams. For the rest of us, however, deep learning is still a pretty complex and difficult subject to grasp. If youre familiar with Python, and have a background in calculus, along with a basic understanding of machine learning, this book will get you started. Examine the foundations of machine learning and neural networks Learn how to train feed-forward neural networks Use Tensor Flow to implement your first neural network Manage problems that arise as you begin to make networks deeper Build neural networks that analyze complex images Perform effective dimensionality reduction using autoencoders Dive deep into sequence analysis to examine language Understand the fundamentals of reinforcement learning", "year": 2017, "referenceCount": 0, "citationCount": 168, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "90635111", "name": "Nikhil Buduma"}, {"authorId": "36278644", "name": "N. Locascio"}]}, {"paperId": "f22d50504a79cfb8f01b3dacb9a4d8f613f049b1", "url": "https://www.semanticscholar.org/paper/f22d50504a79cfb8f01b3dacb9a4d8f613f049b1", "title": "Statistical Learning from a Regression Perspective", "abstract": "Statistical Learning as a Regression Problem.- Regression Splines and Regression Smoothers.- Classification and Regression Trees (CART).- Bagging.- Random Forests.- Boosting.- Support Vector Machines.- Broader Implications and a Bit of Craft Lore.", "year": 2008, "referenceCount": 2, "citationCount": 301, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "1974692", "name": "J. Maindonald"}]}, {"paperId": "9239696d0dc5b029e0946e4b84a1515cb31d2e6b", "url": "https://www.semanticscholar.org/paper/9239696d0dc5b029e0946e4b84a1515cb31d2e6b", "title": "Learning from Distributions via Support Measure Machines", "abstract": "This paper presents a kernel-based discriminative learning framework on probability measures. Rather than relying on large collections of vectorial training examples, our framework learns using a collection of probability distributions that have been constructed to meaningfully represent training data. By representing these probability distributions as mean embeddings in the reproducing kernel Hilbert space (RKHS), we are able to apply many standard kernel-based learning techniques in straightforward fashion. To accomplish this, we construct a generalization of the support vector machine (SVM) called a support measure machine (SMM). Our analyses of SMMs provides several insights into their relationship to traditional SVMs. Based on such insights, we propose a flexible SVM (Flex-SVM) that places different kernel functions on each training example. Experimental results on both synthetic and real-world data demonstrate the effectiveness of our proposed framework.", "year": 2012, "referenceCount": 21, "citationCount": 176, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2276351", "name": "Krikamol Muandet"}, {"authorId": "1693668", "name": "K. Fukumizu"}, {"authorId": "3125402", "name": "Francesco Dinuzzo"}, {"authorId": "1707625", "name": "B. Schölkopf"}]}, {"paperId": "78a3f425af2d1227591481df83273c01e83e4e98", "url": "https://www.semanticscholar.org/paper/78a3f425af2d1227591481df83273c01e83e4e98", "title": "Deep Learning Trends for Focal Brain Pathology Segmentation in MRI", "abstract": null, "year": 2016, "referenceCount": 91, "citationCount": 75, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2203743", "name": "Mohammad Havaei"}, {"authorId": "2886006", "name": "N. Guizard"}, {"authorId": "1777528", "name": "H. Larochelle"}, {"authorId": "1687510", "name": "Pierre-Marc Jodoin"}]}, {"paperId": "999a011a93942ec4760a9c7eb8005e7acd60239b", "url": "https://www.semanticscholar.org/paper/999a011a93942ec4760a9c7eb8005e7acd60239b", "title": "Evaluating Machine Learning Models", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 44, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2060163247", "name": "Alice Zheng"}, {"authorId": "87365215", "name": "N. Shelby"}, {"authorId": "2083310973", "name": "Ellie Volckhausen"}]}, {"paperId": "a6bf288da1c2cdfc31004e44daaa1344aa50ebfb", "url": "https://www.semanticscholar.org/paper/a6bf288da1c2cdfc31004e44daaa1344aa50ebfb", "title": "Kernel techniques: From machine learning to meshless methods", "abstract": "Kernels are valuable tools in various fields of numerical analysis, including approximation, interpolation, meshless methods for solving partial differential equations, neural networks, and machine learning. This contribution explains why and how kernels are applied in these disciplines. It uncovers the links between them, in so far as they are related to kernel techniques. It addresses non-expert readers and focuses on practical guidelines for using kernels in applications.", "year": 2006, "referenceCount": 315, "citationCount": 254, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3261621", "name": "R. Schaback"}, {"authorId": "3235534", "name": "H. Wendland"}]}, {"paperId": "3dd8bf5cca76b1690a2642b73b509fb3a27e4f36", "url": "https://www.semanticscholar.org/paper/3dd8bf5cca76b1690a2642b73b509fb3a27e4f36", "title": "MetaReg: Towards Domain Generalization using Meta-Regularization", "abstract": "Training models that generalize to new domains at test time is a problem of fundamental importance in machine learning. In this work, we encode this notion of domain generalization using a novel regularization function. We pose the problem of finding such a regularization function in a Learning to Learn (or) meta-learning framework. The objective of domain generalization is explicitly modeled by learning a regularizer that makes the model trained on one domain to perform well on another domain. Experimental validations on computer vision and natural language datasets indicate that our method can learn regularizers that achieve good cross-domain generalization.", "year": 2018, "referenceCount": 34, "citationCount": 361, "influentialCitationCount": 48, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3458479", "name": "Y. Balaji"}, {"authorId": "2716670", "name": "S. Sankaranarayanan"}, {"authorId": "9215658", "name": "R. Chellappa"}]}, {"paperId": "1a248138f807d67240eeb5030cfdc9fc305dc6d4", "url": "https://www.semanticscholar.org/paper/1a248138f807d67240eeb5030cfdc9fc305dc6d4", "title": "Supervised machine learning techniques in cognitive radio networks during cooperative spectrum handovers", "abstract": null, "year": 2017, "referenceCount": 39, "citationCount": 298, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2932559", "name": "H. Anandakumar"}, {"authorId": "46903437", "name": "K. Umamaheswari"}]}, {"paperId": "60373a16e4088cf6f91ddd03f617474d42cf8927", "url": "https://www.semanticscholar.org/paper/60373a16e4088cf6f91ddd03f617474d42cf8927", "title": "Machine learning: Discriminative and generative", "abstract": null, "year": 2006, "referenceCount": 2, "citationCount": 130, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2316129", "name": "M. Meilă"}]}, {"paperId": "53eef24a59b12107e6188e121c85f85fa8a78100", "url": "https://www.semanticscholar.org/paper/53eef24a59b12107e6188e121c85f85fa8a78100", "title": "Explainable machine-learning predictions for the prevention of hypoxaemia during surgery", "abstract": null, "year": 2018, "referenceCount": 38, "citationCount": 659, "influentialCitationCount": 36, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "23451726", "name": "Scott M. Lundberg"}, {"authorId": "2447936", "name": "B. Nair"}, {"authorId": "145552173", "name": "M. Vavilala"}, {"authorId": "2062639", "name": "M. Horibe"}, {"authorId": "5615276", "name": "M. Eisses"}, {"authorId": "2052327253", "name": "Trevor L. Adams"}, {"authorId": "35577567", "name": "D. Liston"}, {"authorId": "2135149452", "name": "Daniel King-Wai Low"}, {"authorId": "87906368", "name": "Shu-Fang Newman"}, {"authorId": "2135608343", "name": "Jerry H. Kim"}, {"authorId": "2180463", "name": "Su-In Lee"}]}, {"paperId": "6a26268d2ba9d34e5b59ae6e5c11a83cdca1a85e", "url": "https://www.semanticscholar.org/paper/6a26268d2ba9d34e5b59ae6e5c11a83cdca1a85e", "title": "Matching Words and Pictures", "abstract": "We present a new approach for modeling multi-modal data sets, focusing on the specific case of segmented images with associated text. Learning the joint distribution of image regions and words has many applications. We consider in detail predicting words associated with whole images (auto-annotation) and corresponding to particular image regions (region naming). Auto-annotation might help organize and access large collections of images. Region naming is a model of object recognition as a process of translating image regions to words, much as one might translate from one language to another. Learning the relationships between image regions and semantic correlates (words) is an interesting example of multi-modal data mining, particularly because it is typically hard to apply data mining techniques to collections of images. We develop a number of models for the joint distribution of image regions and words, including several which explicitly learn the correspondence between regions and words. We study multi-modal and correspondence extensions to Hofmann's hierarchical clustering/aspect model, a translation model adapted from statistical machine translation (Brown et al.), and a multi-modal extension to mixture of latent Dirichlet allocation (MoM-LDA). All models are assessed using a large collection of annotated images of real scenes. We study in depth the difficult problem of measuring performance. For the annotation task, we look at prediction performance on held out data. We present three alternative measures, oriented toward different types of task. Measuring the performance of correspondence methods is harder, because one must determine whether a word has been placed on the right region of an image. We can use annotation performance as a proxy measure, but accurate measurement requires hand labeled data, and thus must occur on a smaller scale. We show results using both an annotation proxy, and manually labeled data.", "year": 2003, "referenceCount": 68, "citationCount": 1789, "influentialCitationCount": 104, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145602732", "name": "Kobus Barnard"}, {"authorId": "2446509", "name": "P. D. Sahin"}, {"authorId": "144016256", "name": "D. Forsyth"}, {"authorId": "1737568", "name": "N. D. Freitas"}, {"authorId": "1796335", "name": "D. Blei"}, {"authorId": "1694621", "name": "Michael I. Jordan"}]}, {"paperId": "ca0ea624b068042ca34264ddaa5e42620ceee875", "url": "https://www.semanticscholar.org/paper/ca0ea624b068042ca34264ddaa5e42620ceee875", "title": "Keepaway Soccer: From Machine Learning Testbed to Benchmark", "abstract": null, "year": 2005, "referenceCount": 25, "citationCount": 155, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144848112", "name": "P. Stone"}, {"authorId": "145805766", "name": "Gregory Kuhlmann"}, {"authorId": "39286677", "name": "Matthew E. Taylor"}, {"authorId": "2108818054", "name": "Yaxin Liu"}]}, {"paperId": "e9ecc83042f6d439a32815a19c1bc11cc82b6a8b", "url": "https://www.semanticscholar.org/paper/e9ecc83042f6d439a32815a19c1bc11cc82b6a8b", "title": "Introduction to MAchine Learning & Knowledge Extraction (MAKE)", "abstract": "The grand goal of Machine Learning is to develop software which can learn from previous experience—similar to how we humans do. Ultimately, to reach a level of usable intelligence, we need (1) to learn from prior data, (2) to extract knowledge, (3) to generalize—i.e., guessing where probability function mass/density concentrates, (4) to fight the curse of dimensionality, and (5) to disentangle underlying explanatory factors of the data—i.e., to make sense of the data in the context of an application domain. To address these challenges and to ensure successful machine learning applications in various domains an integrated machine learning approach is important. This requires a concerted international effort without boundaries, supporting collaborative, cross-domain, interdisciplinary and transdisciplinary work of experts from seven sections, ranging from data pre-processing to data visualization, i.e., to map results found in arbitrarily high dimensional spaces into the lower dimensions to make it accessible, usable and useful to the end user. An integrated machine learning approach needs also to consider issues of privacy, data protection, safety, security, user acceptance and social implications. This paper is the inaugural introduction to the new journal of MAchine Learning & Knowledge Extraction (MAKE). The goal is to provide an incomplete, personally biased, but consistent introduction into the concepts of MAKE and a brief overview of some selected topics to stimulate future research in the international research community.", "year": 2017, "referenceCount": 123, "citationCount": 50, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1749801", "name": "Andreas Holzinger"}]}, {"paperId": "a73eef4e0ec8e49be1c0e6abb04cc1967a681c50", "url": "https://www.semanticscholar.org/paper/a73eef4e0ec8e49be1c0e6abb04cc1967a681c50", "title": "The need for uncertainty quantification in machine-assisted medical decision making", "abstract": null, "year": 2019, "referenceCount": 18, "citationCount": 172, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2856308", "name": "Edmon Begoli"}, {"authorId": "144296799", "name": "Tanmoy Bhattacharya"}, {"authorId": "3095535", "name": "D. Kusnezov"}]}, {"paperId": "1edfaf279f01d6ea3469b20c57cff6fa69dec219", "url": "https://www.semanticscholar.org/paper/1edfaf279f01d6ea3469b20c57cff6fa69dec219", "title": "Application of machine learning techniques for supply chain demand forecasting", "abstract": null, "year": 2008, "referenceCount": 40, "citationCount": 380, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "32422549", "name": "R. Carbonneau"}, {"authorId": "1750984", "name": "K. Laframboise"}, {"authorId": "143634220", "name": "R. Vahidov"}]}, {"paperId": "21832c7ae5193450e5344f2d349e7c6c89741840", "url": "https://www.semanticscholar.org/paper/21832c7ae5193450e5344f2d349e7c6c89741840", "title": "Using Machine Learning", "abstract": null, "year": 2022, "referenceCount": 41, "citationCount": 77, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50657891", "name": "Molly K. Maskrey"}, {"authorId": "49336963", "name": "Wallace Wang"}]}, {"paperId": "706253fafc50bb126c1d78058952ef92270bf72d", "url": "https://www.semanticscholar.org/paper/706253fafc50bb126c1d78058952ef92270bf72d", "title": "Teaching machines and programmed learning", "abstract": null, "year": 1960, "referenceCount": 0, "citationCount": 151, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Psychology"], "authors": [{"authorId": "50066563", "name": "A. A. Lumsdaine"}, {"authorId": "31813000", "name": "R. Glaser"}]}, {"paperId": "a28c4a55514bf6a8ddd536e2aeaa4fc6a31018c8", "url": "https://www.semanticscholar.org/paper/a28c4a55514bf6a8ddd536e2aeaa4fc6a31018c8", "title": "Recent Advances in Hierarchical Reinforcement Learning", "abstract": null, "year": 2003, "referenceCount": 0, "citationCount": 601, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1730590", "name": "A. Barto"}, {"authorId": "1850503", "name": "S. Mahadevan"}]}, {"paperId": "37acbbbcfe9d8eb89e5b01da28dac6d44c3903ee", "url": "https://www.semanticscholar.org/paper/37acbbbcfe9d8eb89e5b01da28dac6d44c3903ee", "title": "Data Programming: Creating Large Training Sets, Quickly", "abstract": "Large labeled training sets are the critical building blocks of supervised learning methods and are key enablers of deep learning techniques. For some applications, creating labeled training sets is the most time-consuming and expensive part of applying machine learning. We therefore propose a paradigm for the programmatic creation of training sets called data programming in which users express weak supervision strategies or domain heuristics as labeling functions, which are programs that label subsets of the data, but that are noisy and may conflict. We show that by explicitly representing this training set labeling process as a generative model, we can \"denoise\" the generated training set, and establish theoretically that we can recover the parameters of these generative models in a handful of settings. We then show how to modify a discriminative loss function to make it noise-aware, and demonstrate our method over a range of discriminative models including logistic regression and LSTMs. Experimentally, on the 2014 TAC-KBP Slot Filling challenge, we show that data programming would have led to a new winning score, and also show that applying data programming to an LSTM model leads to a TAC-KBP score almost 6 F1 points over a state-of-the-art LSTM baseline (and into second place in the competition). Additionally, in initial user studies we observed that data programming may be an easier way for non-experts to create machine learning models when training data is limited or unavailable.", "year": 2016, "referenceCount": 34, "citationCount": 507, "influentialCitationCount": 81, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "143711421", "name": "Alexander J. Ratner"}, {"authorId": "1801197", "name": "Christopher De Sa"}, {"authorId": "144766615", "name": "Sen Wu"}, {"authorId": "2196579", "name": "Daniel Selsam"}, {"authorId": "2114485554", "name": "C. Ré"}]}, {"paperId": "05eb25b9b945ec6cd37af3fc80dd36b6be4711e0", "url": "https://www.semanticscholar.org/paper/05eb25b9b945ec6cd37af3fc80dd36b6be4711e0", "title": "Fast Rates for Support Vector Machines", "abstract": null, "year": 2005, "referenceCount": 14, "citationCount": 103, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1782193", "name": "Ingo Steinwart"}, {"authorId": "143790221", "name": "C. Scovel"}]}, {"paperId": "e406c7d0bf67ea13dc9553fd4514ceaa3a61f6df", "url": "https://www.semanticscholar.org/paper/e406c7d0bf67ea13dc9553fd4514ceaa3a61f6df", "title": "Learning to Identify Review Spam", "abstract": "In the past few years, sentiment analysis and opinion mining becomes a popular and important task. These studies all assume that their opinion resources are real and trustful. However, they may encounter the faked opinion or opinion spam problem. In this paper, we study this issue in the context of our product review mining system. On product review site, people may write faked reviews, called review spam, to promote their products, or defame their competitors' products. It is important to identify and filter out the review spam. Previous work only focuses on some heuristic rules, such as helpfulness voting, or rating deviation, which limits the performance of this task. \n \nIn this paper, we exploit machine learning methods to identify review spam. Toward the end, we manually build a spam collection from our crawled reviews. We first analyze the effect of various features in spam identification. We also observe that the review spammer consistently writes spam. This provides us another view to identify review spam: we can identify if the author of the review is spammer. Based on this observation, we provide a twoview semi-supervised method, co-training, to exploit the large amount of unlabeled data. The experiment results show that our proposed method is effective. Our designed machine learning methods achieve significant improvements in comparison to the heuristic baselines.", "year": 2011, "referenceCount": 24, "citationCount": 369, "influentialCitationCount": 36, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1794976", "name": "Fangtao Li"}, {"authorId": "1730108", "name": "Minlie Huang"}, {"authorId": "2143684688", "name": "Yi Yang"}, {"authorId": "145213540", "name": "Xiaoyan Zhu"}]}, {"paperId": "e90f281bcc5ca3499bfb5e56983ba82c97e81490", "url": "https://www.semanticscholar.org/paper/e90f281bcc5ca3499bfb5e56983ba82c97e81490", "title": "Bayesian compressive sensing and projection optimization", "abstract": "This paper introduces a new problem for which machine-learning tools may make an impact. The problem considered is termed \"compressive sensing\", in which a real signal of dimension N is measured accurately based on K << N real measurements. This is achieved under the assumption that the underlying signal has a sparse representation in some basis (e.g., wavelets). In this paper we demonstrate how techniques developed in machine learning, specifically sparse Bayesian regression and active learning, may be leveraged to this new problem. We also point out future research directions in compressive sensing of interest to the machine-learning community.", "year": 2007, "referenceCount": 26, "citationCount": 51, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144576567", "name": "Shihao Ji"}, {"authorId": "145006560", "name": "L. Carin"}]}, {"paperId": "8e8ec502208f29ee9f78ded19226578e027ecd16", "url": "https://www.semanticscholar.org/paper/8e8ec502208f29ee9f78ded19226578e027ecd16", "title": "Universal Intelligence: A Definition of Machine Intelligence", "abstract": null, "year": 2007, "referenceCount": 168, "citationCount": 513, "influentialCitationCount": 51, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34313265", "name": "S. Legg"}, {"authorId": "144154444", "name": "Marcus Hutter"}]}, {"paperId": "a2d1aaedb70777d1fa047af6db30e84c55b81023", "url": "https://www.semanticscholar.org/paper/a2d1aaedb70777d1fa047af6db30e84c55b81023", "title": "Bayesian Optimization of Combinatorial Structures", "abstract": "The optimization of expensive-to-evaluate black-box functions over combinatorial structures is an ubiquitous task in machine learning, engineering and the natural sciences. The combinatorial explosion of the search space and costly evaluations pose challenges for current techniques in discrete optimization and machine learning, and critically require new algorithmic ideas. This article proposes, to the best of our knowledge, the first algorithm to overcome these challenges, based on an adaptive, scalable model that identifies useful combinatorial structure even when data is scarce. Our acquisition function pioneers the use of semidefinite programming to achieve efficiency and scalability. Experimental evaluations demonstrate that this algorithm consistently outperforms other methods from combinatorial and Bayesian optimization.", "year": 2018, "referenceCount": 50, "citationCount": 90, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "145539374", "name": "R. Baptista"}, {"authorId": "31925701", "name": "Matthias Poloczek"}]}, {"paperId": "d42f875d9580de703a29c9b6c05cd535a41976dc", "url": "https://www.semanticscholar.org/paper/d42f875d9580de703a29c9b6c05cd535a41976dc", "title": "Statistical Reinforcement Learning - Modern Machine Learning Approaches", "abstract": "Reinforcement learning (RL) is a framework for decision making in unknown environments based on a large amount of data. Several practical RL applications for business intelligence, plant control, and game players have been successfully explored in recent years. Providing an accessible introduction to the field, this book covers model-based and model-free approaches, policy iteration, and policy search methods. It presents illustrative examples and state-of-the-art results, including dimensionality reduction in RL and risk-sensitive RLm. The book provides a bridge between RL and data mining and machine learning research.", "year": 2015, "referenceCount": 0, "citationCount": 37, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "67154907", "name": "Masashi Sugiyama"}]}, {"paperId": "d9a2cfd0e7991de8bd19749d78be26c44ccae94c", "url": "https://www.semanticscholar.org/paper/d9a2cfd0e7991de8bd19749d78be26c44ccae94c", "title": "Extreme Learning Machine with Randomly Assigned RBF Kernels", "abstract": "A new learning algorithm called extreme learning machine (ELM) has recently been proposed for single-hidden layer feedforward neural networks (SLFNs) with additive neurons to easily achieve good generalization performance at extremely fast learning speed. ELM randomly chooses the input weights and analytically determines the output weights of SLFNs. It is proved in theory that ELM can be extended to single-hidden layer feedforward neural networks (SLFNs) with radial basis function (RBF) kernels RBF networks, which allows the centers and impact widths of RBF kernels to be randomly generated and the output weights to be simply analytically calculated instead of iteratively tuned. The kernel function of ELM can be any nonlinear bounded integrable function which is almost continuous anywhere. Interestingly, the experimental results show that the ELM algorithm for RBF networks can complete learning at extremely fast speed and produce generalization performance very close to that of SVM in some benchmarking function approximation and classification problems. Index terms Radial basis function network, feedforward neural networks, real time learning, extreme learning machine, ELM, arbitrary kernels. The preliminary idea of the ELM algorithm for RBF networks has been shown in the Proceedings of the Eighth International Conference on Control, Automation, Robotics and Vision (ICARCV 2004), Dec 6-9, Kunming, China. Guang-Bin Huang and Chee-Kheong Siew Extreme Learning Machine with Randomly Assigned RBF Kernels", "year": 2005, "referenceCount": 13, "citationCount": 185, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "145678691", "name": "G. Huang"}, {"authorId": "1683268", "name": "C. Siew"}]}, {"paperId": "2a96afaf3261a87f0daa51699b4b3cf169e092c4", "url": "https://www.semanticscholar.org/paper/2a96afaf3261a87f0daa51699b4b3cf169e092c4", "title": "Rotation Equivariant CNNs for Digital Pathology", "abstract": null, "year": 2018, "referenceCount": 17, "citationCount": 267, "influentialCitationCount": 38, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "46221215", "name": "Bastiaan S. Veeling"}, {"authorId": "14327727", "name": "J. Linmans"}, {"authorId": "46258792", "name": "Jim Winkens"}, {"authorId": "2056266", "name": "Taco Cohen"}, {"authorId": "1678311", "name": "M. Welling"}]}, {"paperId": "805b8935d0a5937f67a6058c9cac6c18a55029cd", "url": "https://www.semanticscholar.org/paper/805b8935d0a5937f67a6058c9cac6c18a55029cd", "title": "Learning on the border: active learning in imbalanced data classification", "abstract": "This paper is concerned with the class imbalance problem which has been known to hinder the learning performance of classification algorithms. The problem occurs when there are significantly less number of observations of the target concept. Various real-world classification tasks, such as medical diagnosis, text categorization and fraud detection suffer from this phenomenon. The standard machine learning algorithms yield better prediction performance with balanced datasets. In this paper, we demonstrate that active learning is capable of solving the class imbalance problem by providing the learner more balanced classes. We also propose an efficient way of selecting informative instances from a smaller pool of samples for active learning which does not necessitate a search through the entire dataset. The proposed method yields an efficient querying system and allows active learning to be applied to very large datasets. Our experimental results show that with an early stopping criteria, active learning achieves a fast solution with competitive prediction performance in imbalanced data classification.", "year": 2007, "referenceCount": 96, "citationCount": 380, "influentialCitationCount": 33, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1769472", "name": "S. Ertekin"}, {"authorId": "40537842", "name": "Jian Huang"}, {"authorId": "52184096", "name": "L. Bottou"}, {"authorId": "145157784", "name": "C. Lee Giles"}]}, {"paperId": "af702d6e8137ef5143e09b22b8bc7209e73fb0a3", "url": "https://www.semanticscholar.org/paper/af702d6e8137ef5143e09b22b8bc7209e73fb0a3", "title": "A Brief Survey of Machine Learning Methods in Protein Sub-Golgi Localization", "abstract": "The location of proteins in a cell can provide important clues to their functions in various biological processes. Thus, the application of machine learning method in the prediction of protein subcellular localization has become a hotspot in bioinformatics. As one of key organelles, the Golgi apparatus is in charge of protein storage, package, and distribution.The identification of protein location in Golgi apparatus will provide in-depth insights into their functions. Thus, the machine learning-based method of predicting protein location in Golgi apparatus has been extensively explored. The development of protein sub-Golgi apparatus localization prediction should be reviewed for providing a whole background for the fields.The benchmark dataset, feature extraction, machine learning method and published results were summarized.We briefly introduced the recent progresses in protein sub-Golgi apparatus localization prediction using machine learning methods and discussed their advantages and disadvantages.We pointed out the perspective of machine learning methods in protein sub-Golgi localization prediction.", "year": 2019, "referenceCount": 100, "citationCount": 95, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "19323213", "name": "Wuritu Yang"}, {"authorId": "145384708", "name": "Xiao-Juan Zhu"}, {"authorId": "47513577", "name": "Jian Huang"}, {"authorId": "145634032", "name": "H. Ding"}, {"authorId": "2051534436", "name": "Hao Lin"}]}, {"paperId": "8221ed66d16b608653393757eaf443187ffe60a0", "url": "https://www.semanticscholar.org/paper/8221ed66d16b608653393757eaf443187ffe60a0", "title": "A Machine Learning Approach to Building Domain-Specific Search Engines", "abstract": "Domain-specific search engines are becoming increasingly popular because they offer increased accuracy and extra features not possible with general, Web-wide search engines. Unfortunately, they are also difficult and time-consuming to maintain. This paper proposes the use of machine learning techniques to greatly automate the creation and maintenance of domain-specific search engines. We describe new research in reinforcement learning, text classification and information extraction that enables efficient spidering, populates topic hierarchies, and identifies informative text segments. Using these techniques, we have built a demonstration system: a search engine for computer science research papers available at www.cora.justrcsettrch.com.", "year": 1999, "referenceCount": 19, "citationCount": 211, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143753639", "name": "A. McCallum"}, {"authorId": "145172877", "name": "K. Nigam"}, {"authorId": "35211659", "name": "Jason D. M. Rennie"}, {"authorId": "2544946", "name": "K. Seymore"}]}, {"paperId": "8d28437ad8702719229f84a4c43fa7fefd2a54b0", "url": "https://www.semanticscholar.org/paper/8d28437ad8702719229f84a4c43fa7fefd2a54b0", "title": "Machine learning: paradigms and methods", "abstract": null, "year": 1990, "referenceCount": 0, "citationCount": 127, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143712374", "name": "J. Carbonell"}]}, {"paperId": "1a2fb75103ea9dc9ff31711ba5aa357088c026bc", "url": "https://www.semanticscholar.org/paper/1a2fb75103ea9dc9ff31711ba5aa357088c026bc", "title": "Automated Vulnerability Detection in Source Code Using Deep Representation Learning", "abstract": "Increasing numbers of software vulnerabilities are discovered every year whether they are reported publicly or discovered internally in proprietary code. These vulnerabilities can pose serious risk of exploit and result in system compromise, information leaks, or denial of service. We leveraged the wealth of C and C++ open-source code available to develop a largescale function-level vulnerability detection system using machine learning. To supplement existing labeled vulnerability datasets, we compiled a vast dataset of millions of open-source functions and labeled it with carefully-selected findings from three different static analyzers that indicate potential exploits. Using these datasets, we developed a fast and scalable vulnerability detection tool based on deep feature representation learning that directly interprets lexed source code. We evaluated our tool on code from both real software packages and the NIST SATE IV benchmark dataset. Our results demonstrate that deep feature representation learning on source code is a promising approach for automated software vulnerability detection.", "year": 2018, "referenceCount": 18, "citationCount": 210, "influentialCitationCount": 34, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2070634196", "name": "Rebecca L. Russell"}, {"authorId": "47714368", "name": "Louis Y. Kim"}, {"authorId": "40902376", "name": "Lei H. Hamilton"}, {"authorId": "40900798", "name": "T. Lazovich"}, {"authorId": "4413381", "name": "Jacob A. Harer"}, {"authorId": "2066070614", "name": "Onur Ozdemir"}, {"authorId": "40900236", "name": "Paul M. Ellingwood"}, {"authorId": "1940574", "name": "M. McConley"}]}, {"paperId": "548ba88cfef75633cf1fad6c16e31b67f95226d6", "url": "https://www.semanticscholar.org/paper/548ba88cfef75633cf1fad6c16e31b67f95226d6", "title": "A hybrid machine learning approach to network anomaly detection", "abstract": null, "year": 2007, "referenceCount": 62, "citationCount": 378, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1745305", "name": "T. Shon"}, {"authorId": "1805429", "name": "Jongsub Moon"}]}, {"paperId": "99b43d6dd6923e94b304fe294f43be159630f628", "url": "https://www.semanticscholar.org/paper/99b43d6dd6923e94b304fe294f43be159630f628", "title": "On the ethics of algorithmic decision-making in healthcare", "abstract": "In recent years, a plethora of high-profile scientific publications has been reporting about machine learning algorithms outperforming clinicians in medical diagnosis or treatment recommendations. This has spiked interest in deploying relevant algorithms with the aim of enhancing decision-making in healthcare. In this paper, we argue that instead of straightforwardly enhancing the decision-making capabilities of clinicians and healthcare institutions, deploying machines learning algorithms entails trade-offs at the epistemic and the normative level. Whereas involving machine learning might improve the accuracy of medical diagnosis, it comes at the expense of opacity when trying to assess the reliability of given diagnosis. Drawing on literature in social epistemology and moral responsibility, we argue that the uncertainty in question potentially undermines the epistemic authority of clinicians. Furthermore, we elucidate potential pitfalls of involving machine learning in healthcare with respect to paternalism, moral responsibility and fairness. At last, we discuss how the deployment of machine learning algorithms might shift the evidentiary norms of medical diagnosis. In this regard, we hope to lay the grounds for further ethical reflection of the opportunities and pitfalls of machine learning for enhancing decision-making in healthcare.", "year": 2019, "referenceCount": 43, "citationCount": 132, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "1423968387", "name": "Thomas Grote"}, {"authorId": "1689077", "name": "Philipp Berens"}]}, {"paperId": "2995c605ef1a801b1d4fb958728baa6c1c8db433", "url": "https://www.semanticscholar.org/paper/2995c605ef1a801b1d4fb958728baa6c1c8db433", "title": "Performance analysis of support vector machines classifiers in breast cancer mammography recognition", "abstract": null, "year": 2014, "referenceCount": 62, "citationCount": 182, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "3836512", "name": "A. Azar"}, {"authorId": "1396460618", "name": "Shaimaa A. El-said"}]}, {"paperId": "cd1c2c19cc2921bd67d1b08a57c96014043e717e", "url": "https://www.semanticscholar.org/paper/cd1c2c19cc2921bd67d1b08a57c96014043e717e", "title": "Machine learning methods for metabolic pathway prediction", "abstract": null, "year": 2010, "referenceCount": 36, "citationCount": 153, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine", "Biology"], "authors": [{"authorId": "49072211", "name": "J. Dale"}, {"authorId": "114129852", "name": "Liviu Popescu"}, {"authorId": "1807113", "name": "P. Karp"}]}, {"paperId": "eaf5b3a28606da5014d5c3d106b2fc4306933808", "url": "https://www.semanticscholar.org/paper/eaf5b3a28606da5014d5c3d106b2fc4306933808", "title": "Graphite: Iterative Generative Modeling of Graphs", "abstract": "Graphs are a fundamental abstraction for modeling relational data. However, graphs are discrete and combinatorial in nature, and learning representations suitable for machine learning tasks poses statistical and computational challenges. In this work, we propose Graphite, an algorithmic framework for unsupervised learning of representations over nodes in large graphs using deep latent variable generative models. Our model parameterizes variational autoencoders (VAE) with graph neural networks, and uses a novel iterative graph refinement strategy inspired by low-rank approximations for decoding. On a wide variety of synthetic and benchmark datasets, Graphite outperforms competing approaches for the tasks of density estimation, link prediction, and node classification. Finally, we derive a theoretical connection between message passing in graph neural networks and mean-field variational inference.", "year": 2018, "referenceCount": 83, "citationCount": 198, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1954250", "name": "Aditya Grover"}, {"authorId": "40576688", "name": "Aaron Zweig"}, {"authorId": "2490652", "name": "S. Ermon"}]}, {"paperId": "9ed53d949959165188ab2e5fd76f686d692d43ea", "url": "https://www.semanticscholar.org/paper/9ed53d949959165188ab2e5fd76f686d692d43ea", "title": "Dynamic control flow in large-scale machine learning", "abstract": "Many recent machine learning models rely on fine-grained dynamic control flow for training and inference. In particular, models based on recurrent neural networks and on reinforcement learning depend on recurrence relations, data-dependent conditional execution, and other features that call for dynamic control flow. These applications benefit from the ability to make rapid control-flow decisions across a set of computing devices in a distributed system. For performance, scalability, and expressiveness, a machine learning system must support dynamic control flow in distributed and heterogeneous environments. This paper presents a programming model for distributed machine learning that supports dynamic control flow. We describe the design of the programming model, and its implementation in TensorFlow, a distributed machine learning system. Our approach extends the use of dataflow graphs to represent machine learning models, offering several distinctive features. First, the branches of conditionals and bodies of loops can be partitioned across many machines to run on a set of heterogeneous devices, including CPUs, GPUs, and custom ASICs. Second, programs written in our model support automatic differentiation and distributed gradient computations, which are necessary for training machine learning models that use control flow. Third, our choice of non-strict semantics enables multiple loop iterations to execute in parallel across machines, and to overlap compute and I/O operations. We have done our work in the context of TensorFlow, and it has been used extensively in research and production. We evaluate it using several real-world applications, and demonstrate its performance and scalability.", "year": 2018, "referenceCount": 42, "citationCount": 86, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47112093", "name": "Yuan Yu"}, {"authorId": "2057642721", "name": "Martín Abadi"}, {"authorId": "144758007", "name": "P. Barham"}, {"authorId": "2445241", "name": "E. Brevdo"}, {"authorId": "32623151", "name": "M. Burrows"}, {"authorId": "36347083", "name": "Andy Davis"}, {"authorId": "48448318", "name": "J. Dean"}, {"authorId": "1780892", "name": "S. Ghemawat"}, {"authorId": "3367786", "name": "Tim Harley"}, {"authorId": "2052793706", "name": "Peter Hawkins"}, {"authorId": "2090818", "name": "M. Isard"}, {"authorId": "1942300", "name": "M. Kudlur"}, {"authorId": "3089272", "name": "R. Monga"}, {"authorId": "20154699", "name": "D. Murray"}, {"authorId": "2152198093", "name": "Xiaoqiang Zheng"}]}, {"paperId": "9720a25a09946f69ddf110fc3782dd1079527088", "url": "https://www.semanticscholar.org/paper/9720a25a09946f69ddf110fc3782dd1079527088", "title": "Machine Learning in Medicine: A Primer for Physicians", "abstract": null, "year": 2010, "referenceCount": 1, "citationCount": 102, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "5239295", "name": "A. Waljee"}, {"authorId": "49200163", "name": "P. Higgins"}]}, {"paperId": "a144c763b06ffb5c0ac1aa2b4f7e4384cace50fb", "url": "https://www.semanticscholar.org/paper/a144c763b06ffb5c0ac1aa2b4f7e4384cace50fb", "title": "Machine Learning Techniques for Multimedia - Case Studies on Organization and Retrieval", "abstract": null, "year": 2008, "referenceCount": 0, "citationCount": 39, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "51021910", "name": "M. Cord"}, {"authorId": "143709732", "name": "P. Cunningham"}]}, {"paperId": "3a62d3759631153ff135184202792977fbdd265b", "url": "https://www.semanticscholar.org/paper/3a62d3759631153ff135184202792977fbdd265b", "title": "Learning And Soft Computing Support Vector Machines Neural Networks And Fuzzy Logic Models", "abstract": "Thank you for reading learning and soft computing support vector machines neural networks and fuzzy logic models. As you may know, people have search hundreds times for their chosen books like this learning and soft computing support vector machines neural networks and fuzzy logic models, but end up in malicious downloads. Rather than enjoying a good book with a cup of coffee in the afternoon, instead they juggled with some infectious bugs inside their computer.", "year": 2016, "referenceCount": 0, "citationCount": 186, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "52615285", "name": "D. Eichel"}]}, {"paperId": "6cd7a47bbba11a994cd8e68ee5eae2fcb0033054", "url": "https://www.semanticscholar.org/paper/6cd7a47bbba11a994cd8e68ee5eae2fcb0033054", "title": "Driving in the Matrix: Can virtual worlds replace human-generated annotations for real world tasks?", "abstract": "Deep learning has rapidly transformed the state of the art algorithms used to address a variety of problems in computer vision and robotics. These breakthroughs have relied upon massive amounts of human annotated training data. This time consuming process has begun impeding the progress of these deep learning efforts. This paper describes a method to incorporate photo-realistic computer images from a simulation engine to rapidly generate annotated data that can be used for the training of machine learning algorithms. We demonstrate that a state of the art architecture, which is trained only using these synthetic annotations, performs better than the identical architecture trained on human annotated real-world data, when tested on the KITTI data set for vehicle detection. By training machine learning algorithms on a rich virtual world, real objects in real scenes can be learned and classified using synthetic data. This approach offers the possibility of accelerating deep learning's application to sensor-based classification problems like those that appear in self-driving cars. The source code and data to train and validate the networks described in this paper are made available for researchers.", "year": 2016, "referenceCount": 24, "citationCount": 402, "influentialCitationCount": 59, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1389944402", "name": "M. Johnson-Roberson"}, {"authorId": "116731556", "name": "Charlie Barto"}, {"authorId": "2067925945", "name": "Rounak Mehta"}, {"authorId": "2057436877", "name": "S. N. Sridhar"}, {"authorId": "2748006", "name": "Karl Rosaen"}, {"authorId": "145386932", "name": "R. Vasudevan"}]}, {"paperId": "6910d193282b4f00a0a81fdfb0e7dd8ae50648cd", "url": "https://www.semanticscholar.org/paper/6910d193282b4f00a0a81fdfb0e7dd8ae50648cd", "title": "Milepost GCC: Machine Learning Enabled Self-tuning Compiler", "abstract": null, "year": 2011, "referenceCount": 92, "citationCount": 235, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2043821", "name": "G. Fursin"}, {"authorId": "3334002", "name": "Yuriy Kashnikov"}, {"authorId": "3248259", "name": "Abdul Wahid Memon"}, {"authorId": "3148192", "name": "Z. Chamski"}, {"authorId": "1731764", "name": "O. Temam"}, {"authorId": "3305063", "name": "Mircea Namolaru"}, {"authorId": "1388775854", "name": "E. Yom-Tov"}, {"authorId": "1795886", "name": "Bilha Mendelson"}, {"authorId": "38737579", "name": "A. Zaks"}, {"authorId": "2630186", "name": "E. Courtois"}, {"authorId": "1697641", "name": "F. Bodin"}, {"authorId": "38759952", "name": "Phil Barnard"}, {"authorId": "40580165", "name": "Elton Ashton"}, {"authorId": "30561807", "name": "Edwin V. Bonilla"}, {"authorId": "153031524", "name": "J. Thomson"}, {"authorId": "145715698", "name": "Christopher K. I. Williams"}, {"authorId": "1401533251", "name": "M. O’Boyle"}]}, {"paperId": "c2a561b725b03de41f02106d1c27305997cc9126", "url": "https://www.semanticscholar.org/paper/c2a561b725b03de41f02106d1c27305997cc9126", "title": "Artificial intelligence and machine learning to fight COVID-19", "abstract": "Ahmad Alimadadi,* Sachin Aryal,* Ishan Manandhar,* X Patricia B. Munroe, Bina Joe, and X Xi Cheng Center for Hypertension and Precision Medicine, Program in Physiological Genomics, Department of Physiology and Pharmacology, University of Toledo College of Medicine and Life Sciences, Toledo, Ohio; and Clinical Pharmacology, William Harvey Research Institute, National Institute of Health Research Barts Cardiovascular Biomedical Research Centre, Barts and The London School of Medicine and Dentistry, Queen Mary University of London, London, United Kingdom", "year": 2020, "referenceCount": 14, "citationCount": 357, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "88872117", "name": "A. Alimadadi"}, {"authorId": "88799661", "name": "Sachin Aryal"}, {"authorId": "1596635009", "name": "Ishan Manandhar"}, {"authorId": "2786361", "name": "P. Munroe"}, {"authorId": "32239942", "name": "B. Joe"}, {"authorId": "29986658", "name": "Xi Cheng"}]}, {"paperId": "a20f94ee49d9f29720cf9555457e1fea9050c0b2", "url": "https://www.semanticscholar.org/paper/a20f94ee49d9f29720cf9555457e1fea9050c0b2", "title": "Machine learning, medical diagnosis, and biomedical engineering research - commentary", "abstract": null, "year": 2014, "referenceCount": 32, "citationCount": 267, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "49910875", "name": "K. Foster"}, {"authorId": "3244609", "name": "R. Koprowski"}, {"authorId": "145274856", "name": "J. Skufca"}]}, {"paperId": "410d06ff1dc1aa602681ff947c781522df4ae02f", "url": "https://www.semanticscholar.org/paper/410d06ff1dc1aa602681ff947c781522df4ae02f", "title": "Data Integration and Machine Learning: A Natural Synergy", "abstract": "There is now more data to analyze than ever before. As data volume and variety have increased, so have the ties between machine learning and data integration become stronger. For machine learning to be effective, one must utilize data from the greatest possible variety of sources; and this is why data integration plays a key role. At the same time machine learning is driving automation in data integration, resulting in overall reduction of integration costs and improved accuracy. This tutorial focuses on three aspects of the synergistic relationship between data integration and machine learning: (1) we survey how state-of-the-art data integration solutions rely on machine learning-based approaches for accurate results and effective human-in-the-loop pipelines, (2) we review how end-to-end machine learning applications rely on data integration to identify accurate, clean, and relevant data for their analytics exercises, and (3) we discuss open research challenges and opportunities that span across data integration and machine learning.", "year": 2018, "referenceCount": 62, "citationCount": 71, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145867172", "name": "Xin Dong"}, {"authorId": "145071799", "name": "Theodoros Rekatsinas"}]}, {"paperId": "72d194dda60affd2728deca833a10028960d28a2", "url": "https://www.semanticscholar.org/paper/72d194dda60affd2728deca833a10028960d28a2", "title": "Data Management Challenges in Production Machine Learning", "abstract": "The tutorial discusses data-management issues that arise in the context of machine learning pipelines deployed in production. Informed by our own experience with such largescale pipelines, we focus on issues related to understanding, validating, cleaning, and enriching training data. The goal of the tutorial is to bring forth these issues, draw connections to prior work in the database literature, and outline the open research questions that are not addressed by prior art.", "year": 2017, "referenceCount": 35, "citationCount": 139, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1763100", "name": "Neoklis Polyzotis"}, {"authorId": "1473253195", "name": "Sudip Roy"}, {"authorId": "3288247", "name": "Steven Euijong Whang"}, {"authorId": "8195063", "name": "Martin A. Zinkevich"}]}, {"paperId": "c4e7410be72006f91462fb291668069efe8dcc33", "url": "https://www.semanticscholar.org/paper/c4e7410be72006f91462fb291668069efe8dcc33", "title": "The Logic Programming Paradigm: A 25-Year Perspective", "abstract": "This exciting new text reveals both the evolution of this programming paradigm since its inception and the impressively broad scope of current research in the field. The contributors to this book are all leading world experts in Logic Programming, and they deal with both theoretical and practical issues. They address such diverse topics as: computational molecular biology, machine learning, mobile computing, multi-agent systems, planning, numerical computing and dynamical systems, database systems, an alternative to the \"formulas as types\" approach, program semantics and analysis, and natural language processing. XXXXXXX Neuer Text Logic Programming was founded 25 years ago. This exciting book reveals both the evolution of this programming paradigm and its impressively broad scope of current research. The contributions by leading computer scientists deal with both theoretical and practical issues. They address diverse topics such as: computational molecular biology, machine learning, mobile computing, multi-agent systems, numerical computing and dynamical systems, database systems, program semantics, natural language processing, and promising future directions.", "year": 2011, "referenceCount": 37, "citationCount": 434, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Physics", "Computer Science"], "authors": [{"authorId": "1748061", "name": "K. Apt"}, {"authorId": "1707833", "name": "V. Marek"}, {"authorId": "38119663", "name": "M. Truszczynski"}, {"authorId": "2678443", "name": "D. Warren"}]}, {"paperId": "1b4c906704cd125adf5c9a974e16c56e49925bf3", "url": "https://www.semanticscholar.org/paper/1b4c906704cd125adf5c9a974e16c56e49925bf3", "title": "Variational Relevance Vector Machines", "abstract": "The Support Vector Machine (SVM) of Vapnik (1998) has become widely established as one of the leading approaches to pattern recognition and machine learning. It expresses predictions in terms of a linear combination of kernel functions centred on a subset of the training data, known as support vectors. \nDespite its widespread success, the SVM suffers from some important limitations, one of the most significant being that it makes point predictions rather than generating predictive distributions. Recently Tipping (1999) has formulated the Relevance Vector Machine (RVM), a probabilistic model whose functional form is equivalent to the SVM. It achieves comparable recognition accuracy to the SVM, yet provides a full predictive distribution, and also requires substantially fewer kernel functions. \nThe original treatment of the RVM relied on the use of type II maximum likelihood (the `evidence framework') to provide point estimates of the hyperparameters which govern model sparsity. In this paper we show how the RVM can be formulated and solved within a completely Bayesian paradigm through the use of variational inference, thereby giving a posterior distribution over both parameters and hyperparameters. We demonstrate the practicality and performance of the variational RVM using both synthetic and real world examples.", "year": 2000, "referenceCount": 16, "citationCount": 394, "influentialCitationCount": 53, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1792884", "name": "Charles M. Bishop"}, {"authorId": "2831141", "name": "Michael E. Tipping"}]}, {"paperId": "9ef319ead5ec24f9ed46dcdb8951804e8338a2eb", "url": "https://www.semanticscholar.org/paper/9ef319ead5ec24f9ed46dcdb8951804e8338a2eb", "title": "Machine learned job recommendation", "abstract": "We address the problem of recommending suitable jobs to people who are seeking a new job. We formulate this recommendation problem as a supervised machine learning problem. Our technique exploits all past job transitions as well as the data associated with employees and institutions to predict an employee's next job transition. We train a machine learning model using a large number of job transitions extracted from the publicly available employee profiles in the Web. Experiments show that job transitions can be accurately predicted, significantly improving over a baseline that always predicts the most frequent institution in the data.", "year": 2011, "referenceCount": 10, "citationCount": 129, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2418446", "name": "Ioannis K. Paparrizos"}, {"authorId": "1776940", "name": "B. B. Cambazoglu"}, {"authorId": "1682878", "name": "A. Gionis"}]}, {"paperId": "b33ca9ba9a9790cc308c8a1244316e270c9dbb33", "url": "https://www.semanticscholar.org/paper/b33ca9ba9a9790cc308c8a1244316e270c9dbb33", "title": "Wrapper Maintenance: A Machine Learning Approach", "abstract": "The proliferation of online information sources has led to an increased use of wrappers for extracting data from Web sources. While most of the previous research has focused on quick and efficient generation of wrappers, the development of tools for wrapper maintenance has received less attention. This is an important research problem because Web sources often change in ways that prevent the wrappers from extracting data correctly. We present an efficient algorithm that learns structural information about data from positive examples alone. We describe how this information can be used for two wrapper maintenance applications: wrapper verification and reinduction. The wrapper verification system detects when a wrapper is not extracting correct data, usually because the Web source has changed its format. The reinduction algorithm automatically recovers from changes in the Web source by identifying data on Web pages so that a new wrapper may be generated for this source. To validate our approach, we monitored 27 wrappers over a period of a year. The verification algorithm correctly discovered 35 of the 37 wrapper changes, and made 16 mistakes, resulting in precision of 0.73 and recall of 0.95. We validated the reinduction algorithm on ten Web sources. We were able to successfully reinduce the wrappers, obtaining precision and recall values of 0.90 and 0.80 on the data extraction task.", "year": 2011, "referenceCount": 39, "citationCount": 178, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1745117", "name": "Craig A. Knoblock"}, {"authorId": "1782658", "name": "Kristina Lerman"}, {"authorId": "26602711", "name": "Steven N. Minton"}]}, {"paperId": "ea65c6b51cafb1c07232bc3c4f57a253f94f92e6", "url": "https://www.semanticscholar.org/paper/ea65c6b51cafb1c07232bc3c4f57a253f94f92e6", "title": "Clinical applications of machine learning algorithms: beyond the black box", "abstract": "To maximise the clinical benefits of machine learning algorithms, we need to rethink our approach to explanation, argue David Watson and colleagues", "year": 2019, "referenceCount": 32, "citationCount": 194, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2065079791", "name": "David Watson"}, {"authorId": "14443391", "name": "J. Krutzinna"}, {"authorId": "2065454559", "name": "I. Bruce"}, {"authorId": "2099346931", "name": "Christopher Em Griffiths"}, {"authorId": "3893481", "name": "I. McInnes"}, {"authorId": "2054724023", "name": "Michael R. Barnes"}, {"authorId": "1982425", "name": "L. Floridi"}]}, {"paperId": "fb2def2d03608ae94f0a8289ec5d6ff72f74d6ae", "url": "https://www.semanticscholar.org/paper/fb2def2d03608ae94f0a8289ec5d6ff72f74d6ae", "title": "Simple decision rules for classifying human cancers from gene expression profiles", "abstract": "MOTIVATION\nVarious studies have shown that cancer tissue samples can be successfully detected and classified by their gene expression patterns using machine learning approaches. One of the challenges in applying these techniques for classifying gene expression data is to extract accurate, readily interpretable rules providing biological insight as to how classification is performed. Current methods generate classifiers that are accurate but difficult to interpret. This is the trade-off between credibility and comprehensibility of the classifiers. Here, we introduce a new classifier in order to address these problems. It is referred to as k-TSP (k-Top Scoring Pairs) and is based on the concept of 'relative expression reversals'. This method generates simple and accurate decision rules that only involve a small number of gene-to-gene expression comparisons, thereby facilitating follow-up studies.\n\n\nRESULTS\nIn this study, we have compared our approach to other machine learning techniques for class prediction in 19 binary and multi-class gene expression datasets involving human cancers. The k-TSP classifier performs as efficiently as Prediction Analysis of Microarray and support vector machine, and outperforms other learning methods (decision trees, k-nearest neighbour and naïve Bayes). Our approach is easy to interpret as the classifier involves only a small number of informative genes. For these reasons, we consider the k-TSP method to be a useful tool for cancer classification from microarray gene expression data.\n\n\nAVAILABILITY\nThe software and datasets are available at http://www.ccbm.jhu.edu\n\n\nCONTACT\nactan@jhu.edu.", "year": 2005, "referenceCount": 57, "citationCount": 391, "influentialCitationCount": 35, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144665015", "name": "A. Tan"}, {"authorId": "2567800", "name": "D. Naiman"}, {"authorId": "2112281249", "name": "Lei Xu"}, {"authorId": "1799516", "name": "R. Winslow"}, {"authorId": "1707642", "name": "D. Geman"}]}, {"paperId": "486574b08c57e70d1ac3345f306efe6979682bda", "url": "https://www.semanticscholar.org/paper/486574b08c57e70d1ac3345f306efe6979682bda", "title": "Machine Learning Topological Invariants with Neural Networks", "abstract": "In this Letter we supervisedly train neural networks to distinguish different topological phases in the context of topological band insulators. After training with Hamiltonians of one-dimensional insulators with chiral symmetry, the neural network can predict their topological winding numbers with nearly 100% accuracy, even for Hamiltonians with larger winding numbers that are not included in the training data. These results show a remarkable success that the neural network can capture the global and nonlinear topological features of quantum phases from local inputs. By opening up the neural network, we confirm that the network does learn the discrete version of the winding number formula. We also make a couple of remarks regarding the role of the symmetry and the opposite effect of regularization techniques when applying machine learning to physical systems.", "year": 2017, "referenceCount": 56, "citationCount": 145, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Physics"], "authors": [{"authorId": "144664224", "name": "Pengfei Zhang"}, {"authorId": "5060396", "name": "Huitao Shen"}, {"authorId": "47939671", "name": "H. Zhai"}]}, {"paperId": "7e152e587fbc73b5bd23048c71c1b36c569416c5", "url": "https://www.semanticscholar.org/paper/7e152e587fbc73b5bd23048c71c1b36c569416c5", "title": "EMBER: An Open Dataset for Training Static PE Malware Machine Learning Models", "abstract": "This paper describes EMBER: a labeled benchmark dataset for training machine learning models to statically detect malicious Windows portable executable files. The dataset includes features extracted from 1.1M binary files: 900K training samples (300K malicious, 300K benign, 300K unlabeled) and 200K test samples (100K malicious, 100K benign). To accompany the dataset, we also release open source code for extracting features from additional binaries so that additional sample features can be appended to the dataset. This dataset fills a void in the information security machine learning community: a benign/malicious dataset that is large, open and general enough to cover several interesting use cases. We enumerate several use cases that we considered when structuring the dataset. Additionally, we demonstrate one use case wherein we compare a baseline gradient boosted decision tree model trained using LightGBM with default settings to MalConv, a recently published end-to-end (featureless) deep learning model for malware detection. Results show that even without hyper-parameter optimization, the baseline EMBER model outperforms MalConv. The authors hope that the dataset, code and baseline model provided by EMBER will help invigorate machine learning research for malware detection, in much the same way that benchmark datasets have advanced computer vision research.", "year": 2018, "referenceCount": 31, "citationCount": 222, "influentialCitationCount": 61, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2639880", "name": "H. Anderson"}, {"authorId": "153379407", "name": "P. Roth"}]}, {"paperId": "310910704c82332cedc465afa3bdc15a5add0af0", "url": "https://www.semanticscholar.org/paper/310910704c82332cedc465afa3bdc15a5add0af0", "title": "Unified Theories of Cognition", "abstract": "Introduction The Nature of Theories What Are Unified Theories of Cognition? Is Psychology Ready for Unified Theories? The Task of the Book Foundations of Cognitive Science Behaving Systems Knowledge Systems Representation Machines and Computation Symbols Architectures Intelligence Search and Problem Spaces Preparation and Deliberation Summary Human Cognitive Architecture The Human Is a Symbol System System Levels The Time Scale of Human Action The Biological Band The Neural Circuit Level The Real-Time Constraint on Cognition The Cognitive Band The Level of Simple Operations The First Level of Composed Operations The Intendedly Rational Band Higher Bands: Social, Historical, and Evolutionary Summary Symbolic Processing for Intelligence The Central Architecture for Performance Chunking The Total Cognitive System RI-Soar: Knowledge-Intensive and Knowledge-Lean Operation Designer-Soar: Difficult Intellectual Tasks Soar as an Intelligent System Mapping Soar onto Human Cognition Soar and the Shape of Human Cognition Summary Immediate Behavior The Scientific Role of Immediate-Response Data Methodological Preliminaries Functional Analysis of Immediate Responses The Simplest Response Task (SRI) The Two-Choice Response Task (2CRT) Stimulus-Response Compatibility (SRC) Discussion of the Three Analyses Item Recognition Typing Summary Memory, Learning, and Skill The Memory and Learning Hypothesis of Soar The Soar Qualitative Theory of Learning The Distinction between Episodic and Semantic Memory Data Chunking Skill Acquisition Short-Term Memory (STM) Summary Intendedly Rational Behavior Ciyptarithmetic Syllogisms Sentence Verification Summary Along the Frontiers Language Development The Biological Band The Social Band The Role of Applications How to Move toward Unified Theories of Cognition References Name Index Subject Index", "year": 1990, "referenceCount": 0, "citationCount": 2575, "influentialCitationCount": 188, "isOpenAccess": false, "fieldsOfStudy": ["Psychology"], "authors": [{"authorId": "48603437", "name": "A. Newell"}]}, {"paperId": "2de06861c42928581aec8ddd932e68ad450a2c0a", "url": "https://www.semanticscholar.org/paper/2de06861c42928581aec8ddd932e68ad450a2c0a", "title": "Adversarial support vector machine learning", "abstract": "Many learning tasks such as spam filtering and credit card fraud detection face an active adversary that tries to avoid detection. For learning problems that deal with an active adversary, it is important to model the adversary's attack strategy and develop robust learning models to mitigate the attack. These are the two objectives of this paper. We consider two attack models: a free-range attack model that permits arbitrary data corruption and a restrained attack model that anticipates more realistic attacks that a reasonable adversary would devise under penalties. We then develop optimal SVM learning strategies against the two attack models. The learning algorithms minimize the hinge loss while assuming the adversary is modifying data to maximize the loss. Experiments are performed on both artificial and real data sets. We demonstrate that optimal solutions may be overly pessimistic when the actual attacks are much weaker than expected. More important, we demonstrate that it is possible to develop a much more resilient SVM learning model while making loose assumptions on the data corruption models. When derived under the restrained attack model, our optimal SVM learning strategy provides more robust overall performance under a wide range of attack parameters.", "year": 2012, "referenceCount": 25, "citationCount": 114, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2150920617", "name": "Yan Zhou"}, {"authorId": "1741044", "name": "Murat Kantarcioglu"}, {"authorId": "72558235", "name": "B. Thuraisingham"}, {"authorId": "35476307", "name": "B. Xi"}]}, {"paperId": "77cf2d8a174c5a9a6b41c44203695c1d7f83f391", "url": "https://www.semanticscholar.org/paper/77cf2d8a174c5a9a6b41c44203695c1d7f83f391", "title": "Machine learning for medical diagnosis: history, state of the art and perspective", "abstract": null, "year": 2001, "referenceCount": 100, "citationCount": 1246, "influentialCitationCount": 43, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "143986204", "name": "I. Kononenko"}]}, {"paperId": "91ed985917cf4c317b7d91e15c1ec55e746153bf", "url": "https://www.semanticscholar.org/paper/91ed985917cf4c317b7d91e15c1ec55e746153bf", "title": "What Clinicians Want: Contextualizing Explainable Machine Learning for Clinical End Use", "abstract": "Translating machine learning (ML) models effectively to clinical practice requires establishing clinicians' trust. Explainability, or the ability of an ML model to justify its outcomes and assist clinicians in rationalizing the model prediction, has been generally understood to be critical to establishing trust. However, the field suffers from the lack of concrete definitions for usable explanations in different settings. To identify specific aspects of explainability that may catalyze building trust in ML models, we surveyed clinicians from two distinct acute care specialties (Intenstive Care Unit and Emergency Department). We use their feedback to characterize when explainability helps to improve clinicians' trust in ML models. We further identify the classes of explanations that clinicians identified as most relevant and crucial for effective translation to clinical practice. Finally, we discern concrete metrics for rigorous evaluation of clinical explainability methods. By integrating perceptions of explainability between clinicians and ML researchers we hope to facilitate the endorsement and broader adoption and sustained use of ML systems in healthcare.", "year": 2019, "referenceCount": 81, "citationCount": 182, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "23152217", "name": "S. Tonekaboni"}, {"authorId": "34287745", "name": "Shalmali Joshi"}, {"authorId": "46223842", "name": "M. McCradden"}, {"authorId": "49800482", "name": "A. Goldenberg"}]}, {"paperId": "105fcd199906f44037a9ce6001674e3adc4f92fb", "url": "https://www.semanticscholar.org/paper/105fcd199906f44037a9ce6001674e3adc4f92fb", "title": "Rainfall forecasting by technological machine learning models", "abstract": null, "year": 2008, "referenceCount": 46, "citationCount": 189, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2106248", "name": "Wei‐Chiang Hong"}]}, {"paperId": "3ffe41c72ace4b5ccf8e76d713f48dc644bf5a51", "url": "https://www.semanticscholar.org/paper/3ffe41c72ace4b5ccf8e76d713f48dc644bf5a51", "title": "Predicting MOOC Dropout over Weeks Using Machine Learning Methods", "abstract": "With high dropout rates as observed in many current larger-scale online courses, mechanisms that are able to predict student dropout become increasingly important. While this problem is partially solved for students that are active in online forums, this is not yet the case for the more general student population. In this paper, we present an approach that works on click-stream data. Among other features, the machine learning algorithm takes the weekly history of student data into account and thus is able to notice changes in student behavior over time. In the later phases of a course (i.e., once such history data is available), this approach is able to predict dropout significantly better than baseline methods.", "year": 2014, "referenceCount": 12, "citationCount": 270, "influentialCitationCount": 27, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1412607411", "name": "Marius Kloft"}, {"authorId": "70124120", "name": "Felix Stiehler"}, {"authorId": "2369706", "name": "Zhilin Zheng"}, {"authorId": "1698561", "name": "Niels Pinkwart"}]}, {"paperId": "5ef2edfe51d3d768b1d89ad7e74e4ce8e55d1d49", "url": "https://www.semanticscholar.org/paper/5ef2edfe51d3d768b1d89ad7e74e4ce8e55d1d49", "title": "Delta TFIDF: An Improved Feature Space for Sentiment Analysis", "abstract": "\n \n Mining opinions and sentiment from social networking sites is a popular application for social media systems. Common approaches use a machine learning system with a bag of words feature set. We present Delta TFIDF, an intuitive general purpose technique to efficiently weight word scores before classification. Delta TFIDF is easy to compute, implement, and understand. We use Support Vector Machines to show that Delta TFIDF significantly improves accuracy for sentiment analysis problems using three well known data sets.\n \n", "year": 2009, "referenceCount": 11, "citationCount": 348, "influentialCitationCount": 34, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40378713", "name": "Justin Martineau"}, {"authorId": "144121212", "name": "Timothy W. Finin"}]}, {"paperId": "cb030975a3dbcdf52a01cbd1c140711332313e13", "url": "https://www.semanticscholar.org/paper/cb030975a3dbcdf52a01cbd1c140711332313e13", "title": "Intelligible Models for HealthCare: Predicting Pneumonia Risk and Hospital 30-day Readmission", "abstract": "In machine learning often a tradeoff must be made between accuracy and intelligibility. More accurate models such as boosted trees, random forests, and neural nets usually are not intelligible, but more intelligible models such as logistic regression, naive-Bayes, and single decision trees often have significantly worse accuracy. This tradeoff sometimes limits the accuracy of models that can be applied in mission-critical applications such as healthcare where being able to understand, validate, edit, and trust a learned model is important. We present two case studies where high-performance generalized additive models with pairwise interactions (GA2Ms) are applied to real healthcare problems yielding intelligible models with state-of-the-art accuracy. In the pneumonia risk prediction case study, the intelligible model uncovers surprising patterns in the data that previously had prevented complex learned models from being fielded in this domain, but because it is intelligible and modular allows these patterns to be recognized and removed. In the 30-day hospital readmission case study, we show that the same methods scale to large datasets containing hundreds of thousands of patients and thousands of attributes while remaining intelligible and providing accuracy comparable to the best (unintelligible) machine learning methods.", "year": 2015, "referenceCount": 7, "citationCount": 1087, "influentialCitationCount": 55, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145727186", "name": "R. Caruana"}, {"authorId": "91993942", "name": "Yin Lou"}, {"authorId": "143614516", "name": "J. Gehrke"}, {"authorId": "143831110", "name": "Paul Koch"}, {"authorId": "46525681", "name": "M. Sturm"}, {"authorId": "2763493", "name": "Noémie Elhadad"}]}]}