{"total": 5798117, "offset": 100, "next": 200, "data": [{"paperId": "a9cbbef8f4426329d0687025b34287c35bdd8b38", "url": "https://www.semanticscholar.org/paper/a9cbbef8f4426329d0687025b34287c35bdd8b38", "title": "Machine learning and the physical sciences", "abstract": "Machine learning (ML) encompasses a broad range of algorithms and modeling tools used for a vast array of data processing tasks, which has entered most scientific disciplines in recent years. This article reviews in a selective way the recent research on the interface between machine learning and the physical sciences. This includes conceptual developments in ML motivated by physical insights, applications of machine learning techniques to several domains in physics, and cross fertilization between the two fields. After giving a basic notion of machine learning methods and principles, examples are described of how statistical physics is used to understand methods in ML. This review then describes applications of ML methods in particle physics and cosmology, quantum many-body physics, quantum computing, and chemical and material physics. Research and development into novel computing architectures aimed at accelerating ML are also highlighted. Each of the sections describe recent successes as well as domain-specific methodology and challenges.", "year": 2019, "referenceCount": 429, "citationCount": 819, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "50666189", "name": "G. Carleo"}, {"authorId": "119628938", "name": "I. Cirac"}, {"authorId": "11638962", "name": "K. Cranmer"}, {"authorId": "1742040", "name": "L. Daudet"}, {"authorId": "3048564", "name": "M. Schuld"}, {"authorId": "1777660", "name": "Naftali Tishby"}, {"authorId": "1445956232", "name": "Leslie Vogt-Maranto"}, {"authorId": "2065813820", "name": "Lenka Zdeborov'a"}]}, {"paperId": "48ddd9101a90fe65e3061de69626741b843ff5e4", "url": "https://www.semanticscholar.org/paper/48ddd9101a90fe65e3061de69626741b843ff5e4", "title": "The use of the area under the ROC curve in the evaluation of machine learning algorithms", "abstract": null, "year": 1997, "referenceCount": 50, "citationCount": 5257, "influentialCitationCount": 615, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1720617", "name": "A. Bradley"}]}, {"paperId": "6bc43977fb11cceed0b9aa55b23c6dd29dd9a132", "url": "https://www.semanticscholar.org/paper/6bc43977fb11cceed0b9aa55b23c6dd29dd9a132", "title": "Correlation-based Feature Selection for Machine Learning", "abstract": "A central problem in machine learning is identifying a representative set of features from which to construct a classification model for a particular task. This thesis addresses the problem of feature selection for machine learning through a correlation based approach. The central hypothesis is that good feature sets contain features that are highly correlated with the class, yet uncorrelated with each other. A feature evaluation formula, based on ideas from test theory, provides an operational definition of this hypothesis. CFS (Correlation based Feature Selection) is an algorithm that couples this evaluation formula with an appropriate correlation measure and a heuristic search strategy. CFS was evaluated by experiments on artificial and natural datasets. Three machine learning algorithms were used: C4.5 (a decision tree learner), IB1 (an instance based learner), and naive Bayes. Experiments on artificial datasets showed that CFS quickly identifies and screens irrelevant, redundant, and noisy features, and identifies relevant features as long as their relevance does not strongly depend on other features. On natural domains, CFS typically eliminated well over half the features. In most cases, classification accuracy using the reduced feature set equaled or bettered accuracy using the complete feature set. Feature selection degraded machine learning performance in cases where some features were eliminated which were highly predictive of very small areas of the instance space. Further experiments compared CFS with a wrapper—a well known approach to feature selection that employs the target learning algorithm to evaluate feature sets. In many cases CFS gave comparable results to the wrapper, and in general, outperformed the wrapper on small datasets. CFS executes many times faster than the wrapper, which allows it to scale to larger datasets. Two methods of extending CFS to handle feature interaction are presented and experimentally evaluated. The first considers pairs of features and the second incorporates iii feature weights calculated by the RELIEF algorithm. Experiments on artificial domains showed that both methods were able to identify interacting features. On natural domains, the pairwise method gave more reliable results than using weights provided by RELIEF.", "year": 2003, "referenceCount": 111, "citationCount": 3636, "influentialCitationCount": 443, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "118860642", "name": "M. Hall"}]}, {"paperId": "21dfbc88b21b27fe8a245ab1df98edd45f655ae7", "url": "https://www.semanticscholar.org/paper/21dfbc88b21b27fe8a245ab1df98edd45f655ae7", "title": "Machine Learning in Medicine", "abstract": "Machine Learning in Medicine In this view of the future of medicine, patient–provider interactions are informed and supported by massive amounts of data from interactions with similar patients. The...", "year": 2019, "referenceCount": 0, "citationCount": 702, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "8638650", "name": "A. Rajkomar"}, {"authorId": "2056947059", "name": "Jeffrey Dean"}, {"authorId": "1740538", "name": "I. Kohane"}]}, {"paperId": "b5904cd5dbf73b8d5ff13517de490c292d877ee0", "url": "https://www.semanticscholar.org/paper/b5904cd5dbf73b8d5ff13517de490c292d877ee0", "title": "Applications of machine learning in drug discovery and development", "abstract": null, "year": 2019, "referenceCount": 119, "citationCount": 742, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3793520", "name": "J. Vamathevan"}, {"authorId": "47420092", "name": "D. Clark"}, {"authorId": "1927408", "name": "Paul Czodrowski"}, {"authorId": "144312222", "name": "I. Dunham"}, {"authorId": "2064181672", "name": "Edgardo Ferran"}, {"authorId": "2166424886", "name": "George Lee"}, {"authorId": "2185912448", "name": "Bin Li"}, {"authorId": "1705442", "name": "A. Madabhushi"}, {"authorId": "34243620", "name": "P. Shah"}, {"authorId": "144357385", "name": "M. Spitzer"}, {"authorId": "3926122", "name": "Shanrong Zhao"}]}, {"paperId": "9583ac53a19cdf0db81fef6eb0b63e66adbe2324", "url": "https://www.semanticscholar.org/paper/9583ac53a19cdf0db81fef6eb0b63e66adbe2324", "title": "Machine Learning with Adversaries: Byzantine Tolerant Gradient Descent", "abstract": "We study the resilience to Byzantine failures of distributed implementations of Stochastic Gradient Descent (SGD). So far, distributed machine learning frameworks have largely ignored the possibility of failures, especially arbitrary (i.e., Byzantine) ones. Causes of failures include software bugs, network asynchrony, biases in local datasets, as well as attackers trying to compromise the entire system. Assuming a set of n workers, up to f being Byzantine, we ask how resilient can SGD be, without limiting the dimension, nor the size of the parameter space. We first show that no gradient aggregation rule based on a linear combination of the vectors proposed by the workers (i.e, current approaches) tolerates a single Byzantine failure. We then formulate a resilience property of the aggregation rule capturing the basic requirements to guarantee convergence despite f Byzantine workers. We propose Krum, an aggregation rule that satisfies our resilience property, which we argue is the first provably Byzantine-resilient algorithm for distributed SGD. We also report on experimental evaluations of Krum.", "year": 2017, "referenceCount": 34, "citationCount": 649, "influentialCitationCount": 209, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3094352", "name": "P. Blanchard"}, {"authorId": "9623412", "name": "El Mahdi El Mhamdi"}, {"authorId": "1727558", "name": "R. Guerraoui"}, {"authorId": "1718150", "name": "J. Stainer"}]}, {"paperId": "3b900b13a8ae7814c1fb00960ef1da66c4580859", "url": "https://www.semanticscholar.org/paper/3b900b13a8ae7814c1fb00960ef1da66c4580859", "title": "Ensemble Methods in Machine Learning", "abstract": null, "year": 2000, "referenceCount": 38, "citationCount": 6405, "influentialCitationCount": 303, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144299726", "name": "Thomas G. Dietterich"}]}, {"paperId": "46c266b3d1274dacd7fce27ee8cb4d587f087a58", "url": "https://www.semanticscholar.org/paper/46c266b3d1274dacd7fce27ee8cb4d587f087a58", "title": "Machine Learning Interpretability: A Survey on Methods and Metrics", "abstract": "Machine learning systems are becoming increasingly ubiquitous. These systems’s adoption has been expanding, accelerating the shift towards a more algorithmic society, meaning that algorithmically informed decisions have greater potential for significant social impact. However, most of these accurate decision support systems remain complex black boxes, meaning their internal logic and inner workings are hidden to the user and even experts cannot fully understand the rationale behind their predictions. Moreover, new regulations and highly regulated domains have made the audit and verifiability of decisions mandatory, increasing the demand for the ability to question, understand, and trust machine learning systems, for which interpretability is indispensable. The research community has recognized this interpretability problem and focused on developing both interpretable models and explanation methods over the past few years. However, the emergence of these methods shows there is no consensus on how to assess the explanation quality. Which are the most suitable metrics to assess the quality of an explanation? The aim of this article is to provide a review of the current state of the research field on machine learning interpretability while focusing on the societal impact and on the developed methods and metrics. Furthermore, a complete literature review is presented in order to identify future directions of work on this field.", "year": 2019, "referenceCount": 147, "citationCount": 534, "influentialCitationCount": 24, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "33791144", "name": "D. V. Carvalho"}, {"authorId": "35153466", "name": "E. M. Pereira"}, {"authorId": "3698192", "name": "Jaime S. Cardoso"}]}, {"paperId": "57fdd4d1b69e7640c54eef4e8fbba2beb6449019", "url": "https://www.semanticscholar.org/paper/57fdd4d1b69e7640c54eef4e8fbba2beb6449019", "title": "Definitions, methods, and applications in interpretable machine learning", "abstract": "Significance The recent surge in interpretability research has led to confusion on numerous fronts. In particular, it is unclear what it means to be interpretable and how to select, evaluate, or even discuss methods for producing interpretations of machine-learning models. We aim to clarify these concerns by defining interpretable machine learning and constructing a unifying framework for existing methods which highlights the underappreciated role played by human audiences. Within this framework, methods are organized into 2 classes: model based and post hoc. To provide guidance in selecting and evaluating interpretation methods, we introduce 3 desiderata: predictive accuracy, descriptive accuracy, and relevancy. Using our framework, we review existing work, grounded in real-world studies which exemplify our desiderata, and suggest directions for future work. Machine-learning models have demonstrated great success in learning complex patterns that enable them to make predictions about unobserved data. In addition to using models for prediction, the ability to interpret what a model has learned is receiving an increasing amount of attention. However, this increased focus has led to considerable confusion about the notion of interpretability. In particular, it is unclear how the wide array of proposed interpretation methods are related and what common concepts can be used to evaluate them. We aim to address these concerns by defining interpretability in the context of machine learning and introducing the predictive, descriptive, relevant (PDR) framework for discussing interpretations. The PDR framework provides 3 overarching desiderata for evaluation: predictive accuracy, descriptive accuracy, and relevancy, with relevancy judged relative to a human audience. Moreover, to help manage the deluge of interpretation methods, we introduce a categorization of existing techniques into model-based and post hoc categories, with subgroups including sparsity, modularity, and simulatability. To demonstrate how practitioners can use the PDR framework to evaluate and understand interpretations, we provide numerous real-world examples. These examples highlight the often underappreciated role played by human audiences in discussions of interpretability. Finally, based on our framework, we discuss limitations of existing methods and directions for future work. We hope that this work will provide a common vocabulary that will make it easier for both practitioners and researchers to discuss and choose from the full range of interpretation methods.", "year": 2019, "referenceCount": 113, "citationCount": 562, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144585578", "name": "W. James Murdoch"}, {"authorId": "145229121", "name": "Chandan Singh"}, {"authorId": "19225295", "name": "Karl Kumbier"}, {"authorId": "1405625449", "name": "R. Abbasi-Asl"}, {"authorId": "2116415778", "name": "Bin Yu"}]}, {"paperId": "638e41912f314c74436205aa8d332dca963ab1dc", "url": "https://www.semanticscholar.org/paper/638e41912f314c74436205aa8d332dca963ab1dc", "title": "Parameterized quantum circuits as machine learning models", "abstract": "Hybrid quantum–classical systems make it possible to utilize existing quantum computers to their fullest extent. Within this framework, parameterized quantum circuits can be regarded as machine learning models with remarkable expressive power. This Review presents the components of these models and discusses their application to a variety of data-driven tasks, such as supervised learning and generative modeling. With an increasing number of experimental demonstrations carried out on actual quantum hardware and with software being actively developed, this rapidly growing field is poised to have a broad spectrum of real-world applications.", "year": 2019, "referenceCount": 182, "citationCount": 361, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Computer Science", "Mathematics"], "authors": [{"authorId": "3468759", "name": "M. Benedetti"}, {"authorId": "39853731", "name": "Erika Lloyd"}, {"authorId": "2071662750", "name": "Stefan H. Sack"}, {"authorId": "103837672", "name": "Mattia Fiorentini"}]}, {"paperId": "730fba26faa7f91dc6742a0c3521eb439670a825", "url": "https://www.semanticscholar.org/paper/730fba26faa7f91dc6742a0c3521eb439670a825", "title": "Machine-learning-guided directed evolution for protein engineering", "abstract": null, "year": 2018, "referenceCount": 135, "citationCount": 375, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "47271615", "name": "Kevin Kaichuang Yang"}, {"authorId": "51125091", "name": "Zachary Wu"}, {"authorId": "2795724", "name": "F. Arnold"}]}, {"paperId": "ec6200bdcc23b79a71555962cde50306c4029f1a", "url": "https://www.semanticscholar.org/paper/ec6200bdcc23b79a71555962cde50306c4029f1a", "title": "Hyperparameter Optimization for Machine Learning Models Based on Bayesian Optimization", "abstract": "Hyperparameters are important for machine learning algorithms since they directly control the behaviors of training algorithms and have a significant effect on the performance of machine learning models. Several techniques have been developed and successfully applied for certain application domains. However, this work demands professional knowledge and expert experience. And sometimes it has to resort to the brute-force search. Therefore, if an efficient hyperparameter optimization algorithm can be developed to optimize any given machine learning method, it will greatly improve the efficiency of machine learning. In this paper, we consider building the relationship between the performance of the machine learning models and their hyperparameters by Gaussian processes. In this way, the hyperparameter tuning problem can be abstracted as an optimization problem and Bayesian optimization is used to solve the problem. Bayesian optimization is based on the Bayesian theorem. It sets a prior over the optimization function and gathers the information from the previous sample to update the posterior of the optimization function. A utility function selects the next sample point to maximize the optimization function. Several experiments were conducted on standard test datasets. Experiment results show that the proposed method can find the best hyperparameters for the widely used machine learning models, such as the random forest algorithm and the neural networks, even multi-grained cascade forest under the consideration of time cost.", "year": 2019, "referenceCount": 31, "citationCount": 323, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153171583", "name": "Jia Wu"}, {"authorId": "2109243152", "name": "Xiuyun Chen"}, {"authorId": "1682058", "name": "H. Zhang"}, {"authorId": "2068236437", "name": "Li-Dong Xiong"}, {"authorId": "1878461", "name": "Hang Lei"}, {"authorId": "48136123", "name": "S. Deng"}]}, {"paperId": "d294d5246e0dd8ed8bd9ec9d24a01fd4ece4fb3c", "url": "https://www.semanticscholar.org/paper/d294d5246e0dd8ed8bd9ec9d24a01fd4ece4fb3c", "title": "A Detailed Investigation and Analysis of Using Machine Learning Techniques for Intrusion Detection", "abstract": "Intrusion detection is one of the important security problems in todays cyber world. A significant number of techniques have been developed which are based on machine learning approaches. However, they are not very successful in identifying all types of intrusions. In this paper, a detailed investigation and analysis of various machine learning techniques have been carried out for finding the cause of problems associated with various machine learning techniques in detecting intrusive activities. Attack classification and mapping of the attack features is provided corresponding to each attack. Issues which are related to detecting low-frequency attacks using network attack dataset are also discussed and viable methods are suggested for improvement. Machine learning techniques have been analyzed and compared in terms of their detection capability for detecting the various category of attacks. Limitations associated with each category of them are also discussed. Various data mining tools for machine learning have also been included in the paper. At the end, future directions are provided for attack detection using machine learning techniques.", "year": 2019, "referenceCount": 184, "citationCount": 288, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "4268597", "name": "P. Mishra"}, {"authorId": "1693037", "name": "V. Varadharajan"}, {"authorId": "1707996", "name": "U. Tupakula"}, {"authorId": "2371703", "name": "E. Pilli"}]}, {"paperId": "c8ac6060d34179871b81ecd19621c63360347f8e", "url": "https://www.semanticscholar.org/paper/c8ac6060d34179871b81ecd19621c63360347f8e", "title": "Comparing different supervised machine learning algorithms for disease prediction", "abstract": null, "year": 2019, "referenceCount": 88, "citationCount": 346, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1798025", "name": "S. Uddin"}, {"authorId": "2108514783", "name": "Arif Khan"}, {"authorId": "52224520", "name": "Md Ekramul Hossain"}, {"authorId": "145781245", "name": "M. Moni"}]}, {"paperId": "a42e380e1b8aafecb3b1e338a8a9a579c6a5a40f", "url": "https://www.semanticscholar.org/paper/a42e380e1b8aafecb3b1e338a8a9a579c6a5a40f", "title": "A Survey of Machine Learning Techniques Applied to Software Defined Networking (SDN): Research Issues and Challenges", "abstract": "In recent years, with the rapid development of current Internet and mobile communication technologies, the infrastructure, devices and resources in networking systems are becoming more complex and heterogeneous. In order to efficiently organize, manage, maintain and optimize networking systems, more intelligence needs to be deployed. However, due to the inherently distributed feature of traditional networks, machine learning techniques are hard to be applied and deployed to control and operate networks. Software defined networking (SDN) brings us new chances to provide intelligence inside the networks. The capabilities of SDN (e.g., logically centralized control, global view of the network, software-based traffic analysis, and dynamic updating of forwarding rules) make it easier to apply machine learning techniques. In this paper, we provide a comprehensive survey on the literature involving machine learning algorithms applied to SDN. First, the related works and background knowledge are introduced. Then, we present an overview of machine learning algorithms. In addition, we review how machine learning algorithms are applied in the realm of SDN, from the perspective of traffic classification, routing optimization, quality of service/quality of experience prediction, resource management and security. Finally, challenges and broader perspectives are discussed.", "year": 2019, "referenceCount": 255, "citationCount": 284, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153741316", "name": "Jun-feng Xie"}, {"authorId": "1696615", "name": "F. Yu"}, {"authorId": "102628601", "name": "Tao Huang"}, {"authorId": "144814372", "name": "Renchao Xie"}, {"authorId": "2119611603", "name": "Jiang Liu"}, {"authorId": "3334549", "name": "Chen-meng Wang"}, {"authorId": "2117417872", "name": "Yunjie Liu"}]}, {"paperId": "ac644a74a0ebc8cfbe1b0af8120004909828d283", "url": "https://www.semanticscholar.org/paper/ac644a74a0ebc8cfbe1b0af8120004909828d283", "title": "Adversarial attacks on medical machine learning", "abstract": "Emerging vulnerabilities demand new conversations With public and academic attention increasingly focused on the new role of machine learning in the health information economy, an unusual and no-longer-esoteric category of vulnerabilities in machine-learning systems could prove important. These vulnerabilities allow a small, carefully designed change in how inputs are presented to a system to completely alter its output, causing it to confidently arrive at manifestly wrong conclusions. These advanced techniques to subvert otherwise-reliable machine-learning systems—so-called adversarial attacks—have, to date, been of interest primarily to computer science researchers (1). However, the landscape of often-competing interests within health care, and billions of dollars at stake in systems' outputs, implies considerable problems. We outline motivations that various players in the health care system may have to use adversarial attacks and begin a discussion of what to do about them. Far from discouraging continued innovation with medical machine learning, we call for active engagement of medical, technical, legal, and ethical experts in pursuit of efficient, broadly available, and effective health care that machine learning will enable.", "year": 2019, "referenceCount": 9, "citationCount": 437, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "50478054", "name": "S. G. Finlayson"}, {"authorId": "2066570629", "name": "John Bowers"}, {"authorId": "35553861", "name": "Joichi Ito"}, {"authorId": "46714697", "name": "J. Zittrain"}, {"authorId": "143649421", "name": "Andrew Beam"}, {"authorId": "1740538", "name": "I. Kohane"}]}, {"paperId": "fbf9812f29156024ec693b4633a21303eead309d", "url": "https://www.semanticscholar.org/paper/fbf9812f29156024ec693b4633a21303eead309d", "title": "Machine learning algorithm validation with a limited sample size", "abstract": "Advances in neuroimaging, genomic, motion tracking, eye-tracking and many other technology-based data collection methods have led to a torrent of high dimensional datasets, which commonly have a small number of samples because of the intrinsic high cost of data collection involving human participants. High dimensional data with a small number of samples is of critical importance for identifying biomarkers and conducting feasibility and pilot work, however it can lead to biased machine learning (ML) performance estimates. Our review of studies which have applied ML to predict autistic from non-autistic individuals showed that small sample size is associated with higher reported classification accuracy. Thus, we have investigated whether this bias could be caused by the use of validation methods which do not sufficiently control overfitting. Our simulations show that K-fold Cross-Validation (CV) produces strongly biased performance estimates with small sample sizes, and the bias is still evident with sample size of 1000. Nested CV and train/test split approaches produce robust and unbiased performance estimates regardless of sample size. We also show that feature selection if performed on pooled training and testing data is contributing to bias considerably more than parameter tuning. In addition, the contribution to bias by data dimensionality, hyper-parameter space and number of CV folds was explored, and validation methods were compared with discriminable data. The results suggest how to design robust testing methodologies when working with small datasets and how to interpret the results of other studies based on what validation method was used.", "year": 2019, "referenceCount": 33, "citationCount": 382, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "8452323", "name": "A. Vabalas"}, {"authorId": "2283643", "name": "E. Gowen"}, {"authorId": "2910758", "name": "E. Poliakoff"}, {"authorId": "1807736", "name": "A. Casson"}]}, {"paperId": "a89fa53a26b66fcbac7dd2e3524715eeb284f513", "url": "https://www.semanticscholar.org/paper/a89fa53a26b66fcbac7dd2e3524715eeb284f513", "title": "Do no harm: a roadmap for responsible machine learning for health care", "abstract": null, "year": 2019, "referenceCount": 38, "citationCount": 323, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Psychology"], "authors": [{"authorId": "38556322", "name": "J. Wiens"}, {"authorId": "1932128", "name": "S. Saria"}, {"authorId": "47057856", "name": "M. Sendak"}, {"authorId": "2804918", "name": "M. Ghassemi"}, {"authorId": "39717165", "name": "V. Liu"}, {"authorId": "1388372395", "name": "Finale Doshi-Velez"}, {"authorId": "145064562", "name": "K. Jung"}, {"authorId": "145993598", "name": "K. Heller"}, {"authorId": "2107807", "name": "David C. Kale"}, {"authorId": "2073359011", "name": "Mohammed Saeed"}, {"authorId": "4136467", "name": "P. Ossorio"}, {"authorId": "1404837859", "name": "Sonoo Thadaney-Israni"}, {"authorId": "49800482", "name": "A. Goldenberg"}]}, {"paperId": "e67121cd31e95fba6c892724e619323ad7564b03", "url": "https://www.semanticscholar.org/paper/e67121cd31e95fba6c892724e619323ad7564b03", "title": "A Survey of Deep Learning and Its Applications: A New Paradigm to Machine Learning", "abstract": null, "year": 2020, "referenceCount": 81, "citationCount": 308, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "104394731", "name": "Shaveta Dargan"}, {"authorId": "2109645645", "name": "Munish Kumar"}, {"authorId": "103435006", "name": "M. Ayyagari"}, {"authorId": "145627436", "name": "G. Kumar"}]}, {"paperId": "5d093bd376ba63495ea442241bc8bc2f0ff30c2b", "url": "https://www.semanticscholar.org/paper/5d093bd376ba63495ea442241bc8bc2f0ff30c2b", "title": "Machine learning in medicine: a practical introduction", "abstract": null, "year": 2019, "referenceCount": 49, "citationCount": 355, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1435552642", "name": "Jenni A. M. Sidey-Gibbons"}, {"authorId": "1404920372", "name": "C. Sidey-Gibbons"}]}, {"paperId": "97f4a6f87f258053f2677504647696f1803c6794", "url": "https://www.semanticscholar.org/paper/97f4a6f87f258053f2677504647696f1803c6794", "title": "How to Read Articles That Use Machine Learning: Users' Guides to the Medical Literature.", "abstract": "In recent years, many new clinical diagnostic tools have been developed using complicated machine learning methods. Irrespective of how a diagnostic tool is derived, it must be evaluated using a 3-step process of deriving, validating, and establishing the clinical effectiveness of the tool. Machine learning-based tools should also be assessed for the type of machine learning model used and its appropriateness for the input data type and data set size. Machine learning models also generally have additional prespecified settings called hyperparameters, which must be tuned on a data set independent of the validation set. On the validation set, the outcome against which the model is evaluated is termed the reference standard. The rigor of the reference standard must be assessed, such as against a universally accepted gold standard or expert grading.", "year": 2019, "referenceCount": 36, "citationCount": 237, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2118113191", "name": "Yun Liu"}, {"authorId": "1406206167", "name": "Po-Hsuan Cameron Chen"}, {"authorId": "2058373914", "name": "Jonathan Krause"}, {"authorId": "49506408", "name": "L. Peng"}]}, {"paperId": "241d9b16e09f77368797c44493eafbadd675da5b", "url": "https://www.semanticscholar.org/paper/241d9b16e09f77368797c44493eafbadd675da5b", "title": "Fairness in Machine Learning", "abstract": null, "year": 2020, "referenceCount": 191, "citationCount": 277, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1682762", "name": "L. Oneto"}, {"authorId": "48880818", "name": "S. Chiappa"}]}, {"paperId": "b5461f9c5d65e87561e00848921ee797902dae14", "url": "https://www.semanticscholar.org/paper/b5461f9c5d65e87561e00848921ee797902dae14", "title": "Causality for Machine Learning", "abstract": "Graphical causal inference as pioneered by Judea Pearl arose from research on artiﬁcial intelligence (AI), and for a long time had little connection to the ﬁeld of machine learning. This article discusses where links have been and should be established, introducing key concepts along the way. It argues that the hard open problems of machine learning and AI are intrinsically related to causality, and explains how the ﬁeld is beginning to understand them.", "year": 2019, "referenceCount": 134, "citationCount": 236, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "4080509", "name": "B. Scholkopf"}]}, {"paperId": "236dfdeb4511754cf71ba220ac569b11973502cd", "url": "https://www.semanticscholar.org/paper/236dfdeb4511754cf71ba220ac569b11973502cd", "title": "Machine Learning and Deep Learning Methods for Intrusion Detection Systems: A Survey", "abstract": "Networks play important roles in modern life, and cyber security has become a vital research area. An intrusion detection system (IDS) which is an important cyber security technique, monitors the state of software and hardware running in the network. Despite decades of development, existing IDSs still face challenges in improving the detection accuracy, reducing the false alarm rate and detecting unknown attacks. To solve the above problems, many researchers have focused on developing IDSs that capitalize on machine learning methods. Machine learning methods can automatically discover the essential differences between normal data and abnormal data with high accuracy. In addition, machine learning methods have strong generalizability, so they are also able to detect unknown attacks. Deep learning is a branch of machine learning, whose performance is remarkable and has become a research hotspot. This survey proposes a taxonomy of IDS that takes data objects as the main dimension to classify and summarize machine learning-based and deep learning-based IDS literature. We believe that this type of taxonomy framework is fit for cyber security researchers. The survey first clarifies the concept and taxonomy of IDSs. Then, the machine learning algorithms frequently used in IDSs, metrics, and benchmark datasets are introduced. Next, combined with the representative literature, we take the proposed taxonomic system as a baseline and explain how to solve key IDS issues with machine learning and deep learning techniques. Finally, challenges and future developments are discussed by reviewing recent representative studies.", "year": 2019, "referenceCount": 97, "citationCount": 236, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "2145593249", "name": "Hongyu Liu"}, {"authorId": "2055226664", "name": "Bo Lang"}]}, {"paperId": "dab261b25ff8ccd2c9144a5cb3a46b39ac0ac4bd", "url": "https://www.semanticscholar.org/paper/dab261b25ff8ccd2c9144a5cb3a46b39ac0ac4bd", "title": "Troubling Trends in Machine Learning Scholarship", "abstract": "Flawed scholarship threatens to mislead the public and stymie future research by compromising ML’s intellectual foundations. Indeed, many of these problems have recurred cyclically throughout the history of AI and, more broadly, in scientific research. In 1976, Drew McDermott chastised the AI community for abandoning self-discipline, warning prophetically that \"if we can’t criticize ourselves, someone else will save us the trouble.\" The current strength of machine learning owes to a large body of rigorous research to date, both theoretical and empirical. By promoting clear scientific thinking and communication, our community can sustain the trust and investment it currently enjoys.", "year": 2018, "referenceCount": 89, "citationCount": 222, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "32219137", "name": "Zachary Chase Lipton"}, {"authorId": "5164568", "name": "J. Steinhardt"}]}, {"paperId": "8fd8fe76b3fc76adb47b1f1597e2e182a8280225", "url": "https://www.semanticscholar.org/paper/8fd8fe76b3fc76adb47b1f1597e2e182a8280225", "title": "Survey on SDN based network intrusion detection system using machine learning approaches", "abstract": null, "year": 2019, "referenceCount": 44, "citationCount": 242, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9729107", "name": "N. Sultana"}, {"authorId": "9219862", "name": "N. Chilamkurti"}, {"authorId": "145439284", "name": "Wei Peng"}, {"authorId": "51132514", "name": "Rabei Alhadad"}]}, {"paperId": "18aaf8664bbae17a7d20bcb422c36e5d52201aa5", "url": "https://www.semanticscholar.org/paper/18aaf8664bbae17a7d20bcb422c36e5d52201aa5", "title": "Machine learning-assisted directed protein evolution with combinatorial libraries", "abstract": "Significance Proteins often function poorly when used outside their natural contexts; directed evolution can be used to engineer them to be more efficient in new roles. We propose that the expense of experimentally testing a large number of protein variants can be decreased and the outcome can be improved by incorporating machine learning with directed evolution. Simulations on an empirical fitness landscape demonstrate that the expected performance improvement is greater with this approach. Machine learning-assisted directed evolution from a single parent produced enzyme variants that selectively synthesize the enantiomeric products of a new-to-nature chemical transformation. By exploring multiple mutations simultaneously, machine learning efficiently navigates large regions of sequence space to identify improved proteins and also produces diverse solutions to engineering problems. To reduce experimental effort associated with directed protein evolution and to explore the sequence space encoded by mutating multiple positions simultaneously, we incorporate machine learning into the directed evolution workflow. Combinatorial sequence space can be quite expensive to sample experimentally, but machine-learning models trained on tested variants provide a fast method for testing sequence space computationally. We validated this approach on a large published empirical fitness landscape for human GB1 binding protein, demonstrating that machine learning-guided directed evolution finds variants with higher fitness than those found by other directed evolution approaches. We then provide an example application in evolving an enzyme to produce each of the two possible product enantiomers (i.e., stereodivergence) of a new-to-nature carbene Si–H insertion reaction. The approach predicted libraries enriched in functional enzymes and fixed seven mutations in two rounds of evolution to identify variants for selective catalysis with 93% and 79% ee (enantiomeric excess). By greatly increasing throughput with in silico modeling, machine learning enhances the quality and diversity of sequence solutions for a protein engineering problem.", "year": 2019, "referenceCount": 53, "citationCount": 233, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine", "Chemistry"], "authors": [{"authorId": "51125091", "name": "Zachary Wu"}, {"authorId": "145934550", "name": "S. Kan"}, {"authorId": "144475958", "name": "Russell D. Lewis"}, {"authorId": "8641455", "name": "Bruce J. Wittmann"}, {"authorId": "2795724", "name": "F. Arnold"}]}, {"paperId": "8b27e2fafbe24cf9ce24f308a7e746489ff0dfb8", "url": "https://www.semanticscholar.org/paper/8b27e2fafbe24cf9ce24f308a7e746489ff0dfb8", "title": "Trainable Weka Segmentation: a machine learning tool for microscopy pixel classification", "abstract": "Summary: State‐of‐the‐art light and electron microscopes are capable of acquiring large image datasets, but quantitatively evaluating the data often involves manually annotating structures of interest. This process is time‐consuming and often a major bottleneck in the evaluation pipeline. To overcome this problem, we have introduced the Trainable Weka Segmentation (TWS), a machine learning tool that leverages a limited number of manual annotations in order to train a classifier and segment the remaining data automatically. In addition, TWS can provide unsupervised segmentation learning schemes (clustering) and can be customized to employ user‐designed image features or classifiers. Availability and Implementation: TWS is distributed as open‐source software as part of the Fiji image processing distribution of ImageJ at http://imagej.net/Trainable_Weka_Segmentation. Contact: ignacio.arganda@ehu.eus Supplementary information: Supplementary data are available at Bioinformatics online.", "year": 2017, "referenceCount": 8, "citationCount": 1051, "influentialCitationCount": 50, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1398461214", "name": "Ignacio Arganda-Carreras"}, {"authorId": "2129065", "name": "V. Kaynig"}, {"authorId": "1680265", "name": "C. Rueden"}, {"authorId": "2504157", "name": "K. Eliceiri"}, {"authorId": "3032174", "name": "Johannes E. Schindelin"}, {"authorId": "145844120", "name": "A. Cardona"}, {"authorId": "144924970", "name": "H. Seung"}]}, {"paperId": "3784b73a1f392160523400ec0309191c0a96d86f", "url": "https://www.semanticscholar.org/paper/3784b73a1f392160523400ec0309191c0a96d86f", "title": "MLlib: Machine Learning in Apache Spark", "abstract": "Apache Spark is a popular open-source platform for large-scale data processing that is well-suited for iterative machine learning tasks. In this paper we present MLlib, Spark's open-source distributed machine learning library. MLlib provides efficient functionality for a wide range of learning settings and includes several underlying statistical, optimization, and linear algebra primitives. Shipped with Spark, MLlib supports several languages and provides a high-level API that leverages Spark's rich ecosystem to simplify the development of end-to-end machine learning pipelines. MLlib has experienced a rapid growth due to its vibrant open-source community of over 140 contributors, and includes extensive documentation to support further growth and to let users quickly get up to speed.", "year": 2015, "referenceCount": 34, "citationCount": 1567, "influentialCitationCount": 171, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "39309572", "name": "Xiangrui Meng"}, {"authorId": "2086593199", "name": "Joseph K. Bradley"}, {"authorId": "2065287033", "name": "Burak Yavuz"}, {"authorId": "144752747", "name": "Evan R. Sparks"}, {"authorId": "2697906", "name": "S. Venkataraman"}, {"authorId": "2536434", "name": "Davies Liu"}, {"authorId": "2114973651", "name": "Jeremy Freeman"}, {"authorId": "2064759911", "name": "D. B. Tsai"}, {"authorId": "2089931559", "name": "Manish Amde"}, {"authorId": "2060860697", "name": "Sean Owen"}, {"authorId": "40413768", "name": "Doris Xin"}, {"authorId": "2066641", "name": "Reynold Xin"}, {"authorId": "143666627", "name": "M. Franklin"}, {"authorId": "5985064", "name": "R. Zadeh"}, {"authorId": "143834867", "name": "M. Zaharia"}, {"authorId": "145532827", "name": "Ameet S. Talwalkar"}]}, {"paperId": "daf468f001c3a5c6f9e667417becb94fa83efb2f", "url": "https://www.semanticscholar.org/paper/daf468f001c3a5c6f9e667417becb94fa83efb2f", "title": "Exploiting machine learning for end-to-end drug discovery and development", "abstract": null, "year": 2019, "referenceCount": 112, "citationCount": 231, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "1887610", "name": "S. Ekins"}, {"authorId": "39778181", "name": "A. C. Puhl"}, {"authorId": "67164018", "name": "Kimberley M. Zorn"}, {"authorId": "50556284", "name": "T. Lane"}, {"authorId": "8903363", "name": "Daniel P. Russo"}, {"authorId": "143722544", "name": "Jennifer J Klein"}, {"authorId": "2053197", "name": "A. Hickey"}, {"authorId": "143961624", "name": "A. Clark"}]}, {"paperId": "4f2b9cb774489c1a600c224c75edb8da07a24064", "url": "https://www.semanticscholar.org/paper/4f2b9cb774489c1a600c224c75edb8da07a24064", "title": "Machine-learning reprogrammable metasurface imager", "abstract": null, "year": 2019, "referenceCount": 48, "citationCount": 254, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "6013040", "name": "Lianlin Li"}, {"authorId": "38749395", "name": "Hengxin Ruan"}, {"authorId": null, "name": "Che Liu"}, {"authorId": "93648258", "name": "Ying Li"}, {"authorId": "17686104", "name": "Ya Shuang"}, {"authorId": "2186738926", "name": "A. Alú"}, {"authorId": "144274551", "name": "C. Qiu"}, {"authorId": "1911485", "name": "T. Cui"}]}, {"paperId": "b3ea2d9c8e5ea3b87ace121f0bece71565abc187", "url": "https://www.semanticscholar.org/paper/b3ea2d9c8e5ea3b87ace121f0bece71565abc187", "title": "Quantifying the Carbon Emissions of Machine Learning", "abstract": "From an environmental standpoint, there are a few crucial aspects of training a neural network that have a major impact on the quantity of carbon that it emits. These factors include: the location of the server used for training and the energy grid that it uses, the length of the training procedure, and even the make and model of hardware on which the training takes place. In order to approximate these emissions, we present our Machine Learning Emissions Calculator, a tool for our community to better understand the environmental impact of training ML models. We accompany this tool with an explanation of the factors cited above, as well as concrete actions that individual practitioners and organizations can take to mitigate their carbon emissions.", "year": 2019, "referenceCount": 24, "citationCount": 216, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8651990", "name": "Alexandre Lacoste"}, {"authorId": "2993731", "name": "A. Luccioni"}, {"authorId": "97574153", "name": "V. Schmidt"}, {"authorId": "2526021", "name": "Thomas Dandres"}]}, {"paperId": "62ccd99a65bfc7c735ae1f33b75b107665de95df", "url": "https://www.semanticscholar.org/paper/62ccd99a65bfc7c735ae1f33b75b107665de95df", "title": "Federated Machine Learning", "abstract": "Today’s artificial intelligence still faces two major challenges. One is that, in most industries, data exists in the form of isolated islands. The other is the strengthening of data privacy and security. We propose a possible solution to these challenges: secure federated learning. Beyond the federated-learning framework first proposed by Google in 2016, we introduce a comprehensive secure federated-learning framework, which includes horizontal federated learning, vertical federated learning, and federated transfer learning. We provide definitions, architectures, and applications for the federated-learning framework, and provide a comprehensive survey of existing works on this subject. In addition, we propose building data networks among organizations based on federated mechanisms as an effective solution to allowing knowledge to be shared without compromising user privacy.", "year": 2019, "referenceCount": 75, "citationCount": 773, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "152290618", "name": "Qiang Yang"}, {"authorId": "40457423", "name": "Yang Liu"}, {"authorId": "11573257", "name": "Tianjian Chen"}, {"authorId": "8230559", "name": "Yongxin Tong"}]}, {"paperId": "d0ab11de3077490c80a08abd0fb8827bac84c454", "url": "https://www.semanticscholar.org/paper/d0ab11de3077490c80a08abd0fb8827bac84c454", "title": "MoleculeNet: A Benchmark for Molecular Machine Learning", "abstract": "Molecular machine learning has been maturing rapidly over the last few years. Improved methods and the presence of larger datasets have enabled machine learning algorithms to make increasingly accurate predictions about molecular properties. However, algorithmic progress has been limited due to the lack of a standard benchmark to compare the efficacy of proposed methods; most new algorithms are benchmarked on different datasets making it challenging to gauge the quality of proposed methods. This work introduces MoleculeNet, a large scale benchmark for molecular machine learning. MoleculeNet curates multiple public datasets, establishes metrics for evaluation, and offers high quality open-source implementations of multiple previously proposed molecular featurization and learning algorithms (released as part of the DeepChem open source library). MoleculeNet benchmarks demonstrate that learnable representations are powerful tools for molecular machine learning and broadly offer the best performance. However, this result comes with caveats. Learnable representations still struggle to deal with complex tasks under data scarcity and highly imbalanced classification. For quantum mechanical and biophysical datasets, the use of physics-aware featurizations can be more important than choice of particular learning algorithm.", "year": 2017, "referenceCount": 36, "citationCount": 787, "influentialCitationCount": 154, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9957625", "name": "Zhenqin Wu"}, {"authorId": "2378027", "name": "Bharath Ramsundar"}, {"authorId": "5932099", "name": "Evan N. Feinberg"}, {"authorId": "145986494", "name": "Joseph Gomes"}, {"authorId": "9959840", "name": "Caleb Geniesse"}, {"authorId": "5929246", "name": "Aneesh S. Pappu"}, {"authorId": "40867019", "name": "K. Leswing"}, {"authorId": "1806271", "name": "V. Pande"}]}, {"paperId": "6e23398447a022fb9495c44fa80e9de593a574bc", "url": "https://www.semanticscholar.org/paper/6e23398447a022fb9495c44fa80e9de593a574bc", "title": "Machine Learning in Agriculture: A Review", "abstract": "Machine learning has emerged with big data technologies and high-performance computing to create new opportunities for data intensive science in the multi-disciplinary agri-technologies domain. In this paper, we present a comprehensive review of research dedicated to applications of machine learning in agricultural production systems. The works analyzed were categorized in (a) crop management, including applications on yield prediction, disease detection, weed detection crop quality, and species recognition; (b) livestock management, including applications on animal welfare and livestock production; (c) water management; and (d) soil management. The filtering and classification of the presented articles demonstrate how agriculture will benefit from machine learning technologies. By applying machine learning to sensor data, farm management systems are evolving into real time artificial intelligence enabled programs that provide rich recommendations and insights for farmer decision support and action.", "year": 2018, "referenceCount": 117, "citationCount": 878, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2752858", "name": "Konstantinos G. Liakos"}, {"authorId": "3375011", "name": "P. Busato"}, {"authorId": "3201660", "name": "D. Moshou"}, {"authorId": "145802955", "name": "S. Pearson"}, {"authorId": "2345652", "name": "D. Bochtis"}]}, {"paperId": "5c7e5248d9eb7f373f10277410bf8506160907ea", "url": "https://www.semanticscholar.org/paper/5c7e5248d9eb7f373f10277410bf8506160907ea", "title": "All-optical machine learning using diffractive deep neural networks", "abstract": "All-optical deep learning Deep learning uses multilayered artificial neural networks to learn digitally from large datasets. It then performs advanced identification and classification tasks. To date, these multilayered neural networks have been implemented on a computer. Lin et al. demonstrate all-optical machine learning that uses passive optical components that can be patterned and fabricated with 3D-printing. Their hardware approach comprises stacked layers of diffractive optical elements analogous to an artificial neural network that can be trained to execute complex functions at the speed of light. Science, this issue p. 1004 All-optical deep learning can be implemented with 3D-printed passive optical components. Deep learning has been transforming our ability to execute advanced inference tasks using computers. Here we introduce a physical mechanism to perform machine learning by demonstrating an all-optical diffractive deep neural network (D2NN) architecture that can implement various functions following the deep learning–based design of passive diffractive layers that work collectively. We created 3D-printed D2NNs that implement classification of images of handwritten digits and fashion products, as well as the function of an imaging lens at a terahertz spectrum. Our all-optical deep learning framework can perform, at the speed of light, various complex functions that computer-based neural networks can execute; will find applications in all-optical image analysis, feature detection, and object classification; and will also enable new camera designs and optical components that perform distinctive tasks using D2NNs.", "year": 2018, "referenceCount": 52, "citationCount": 741, "influentialCitationCount": 37, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Medicine"], "authors": [{"authorId": "143746845", "name": "Xing Lin"}, {"authorId": "48156295", "name": "Y. Rivenson"}, {"authorId": "3913651", "name": "N. T. Yardimci"}, {"authorId": "4901769", "name": "Muhammed Veli"}, {"authorId": "5602194", "name": "Yilin Luo"}, {"authorId": "2146359", "name": "M. Jarrahi"}, {"authorId": "2660014", "name": "A. Ozcan"}]}, {"paperId": "88a97c8ef539589c55a6fe869c243792e470d6a3", "url": "https://www.semanticscholar.org/paper/88a97c8ef539589c55a6fe869c243792e470d6a3", "title": "Applied Machine Learning at Facebook: A Datacenter Infrastructure Perspective", "abstract": "Machine learning sits at the core of many essential products and services at Facebook. This paper describes the hardware and software infrastructure that supports machine learning at global scale. Facebook's machine learning workloads are extremely diverse: services require many different types of models in practice. This diversity has implications at all layers in the system stack. In addition, a sizable fraction of all data stored at Facebook flows through machine learning pipelines, presenting significant challenges in delivering data to high-performance distributed training flows. Computational requirements are also intense, leveraging both GPU and CPU platforms for training and abundant CPU capacity for real-time inference. Addressing these and other emerging challenges continues to require diverse efforts that span machine learning algorithms, software, and hardware design.", "year": 2018, "referenceCount": 19, "citationCount": 409, "influentialCitationCount": 38, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1775500", "name": "Kim M. Hazelwood"}, {"authorId": "145583374", "name": "Sarah Bird"}, {"authorId": "1896817", "name": "D. Brooks"}, {"authorId": "2127604", "name": "Soumith Chintala"}, {"authorId": "40863835", "name": "Utku Diril"}, {"authorId": "40858378", "name": "Dmytro Dzhulgakov"}, {"authorId": "2133743548", "name": "Mohamed Fawzy"}, {"authorId": "33920592", "name": "Bill Jia"}, {"authorId": "39978391", "name": "Yangqing Jia"}, {"authorId": "10774798", "name": "Aditya Kalro"}, {"authorId": "2057766961", "name": "James Law"}, {"authorId": "2110234018", "name": "Kevin Lee"}, {"authorId": "2159321510", "name": "Jason Lu"}, {"authorId": "34837514", "name": "P. Noordhuis"}, {"authorId": "1711231", "name": "M. Smelyanskiy"}, {"authorId": "2068237821", "name": "Liang Xiong"}, {"authorId": "2108429236", "name": "Xiaodong Wang"}]}, {"paperId": "efd7b7aafeb83b8a8d6fd90a35d6fb6a62f5f695", "url": "https://www.semanticscholar.org/paper/efd7b7aafeb83b8a8d6fd90a35d6fb6a62f5f695", "title": "Manipulating Machine Learning: Poisoning Attacks and Countermeasures for Regression Learning", "abstract": "As machine learning becomes widely used for automated decisions, attackers have strong incentives to manipulate the results and models generated by machine learning algorithms. In this paper, we perform the first systematic study of poisoning attacks and their countermeasures for linear regression models. In poisoning attacks, attackers deliberately influence the training data to manipulate the results of a predictive model. We propose a theoretically-grounded optimization framework specifically designed for linear regression and demonstrate its effectiveness on a range of datasets and models. We also introduce a fast statistical attack that requires limited knowledge of the training process. Finally, we design a new principled defense method that is highly resilient against all poisoning attacks. We provide formal guarantees about its convergence and an upper bound on the effect of poisoning attacks when the defense is deployed. We evaluate extensively our attacks and defenses on three realistic datasets from health care, loan assessment, and real estate domains.", "year": 2018, "referenceCount": 56, "citationCount": 434, "influentialCitationCount": 35, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40844378", "name": "Matthew Jagielski"}, {"authorId": "3046437", "name": "Alina Oprea"}, {"authorId": "1684175", "name": "B. Biggio"}, {"authorId": "2118484076", "name": "Chang Liu"}, {"authorId": "1398550766", "name": "C. Nita-Rotaru"}, {"authorId": "2165247199", "name": "Bo Li"}]}, {"paperId": "960ba564e9e598d864dff38d2f3d0bad1b319ead", "url": "https://www.semanticscholar.org/paper/960ba564e9e598d864dff38d2f3d0bad1b319ead", "title": "A Survey of Machine Learning for Big Code and Naturalness", "abstract": "Research at the intersection of machine learning, programming languages, and software engineering has recently taken important steps in proposing learnable probabilistic models of source code that exploit the abundance of patterns of code. In this article, we survey this work. We contrast programming languages against natural languages and discuss how these similarities and differences drive the design of probabilistic models. We present a taxonomy based on the underlying design principles of each model and use it to navigate the literature. Then, we review how researchers have adapted these models to application areas and discuss cross-cutting and application-specific challenges and opportunities.", "year": 2017, "referenceCount": 215, "citationCount": 551, "influentialCitationCount": 32, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3216345", "name": "Miltiadis Allamanis"}, {"authorId": "1757975", "name": "Earl T. Barr"}, {"authorId": "1730296", "name": "Premkumar T. Devanbu"}, {"authorId": "37210858", "name": "Charles Sutton"}]}, {"paperId": "b9518627db25f05930e931f56497602363a75491", "url": "https://www.semanticscholar.org/paper/b9518627db25f05930e931f56497602363a75491", "title": "Interpretable machine learning: definitions, methods, and applications", "abstract": "M learning (ML) has recently received considerable attention for its ability to accurately predict a wide variety of complex phenomena. However, there is a growing realization that, in addition to predictions, ML models are capable of producing knowledge about domain relationships contained in data, often referred to as interpretations. These interpretations have found uses both in their own right, e.g. medicine (1), policy-making (2), and science (3, 4), as well as in auditing the predictions themselves in response to issues such as regulatory pressure (5) and fairness (6). In the absence of a well-formed definition of interpretability, a broad range of methods with a correspondingly broad range of outputs (e.g. visualizations, natural language, mathematical equations) have been labeled as interpretation. This has led to considerable confusion about the notion of interpretability. In particular, it is unclear what it means to interpret something, what common threads exist among disparate methods, and how to select an interpretation method for a particular problem/audience. In this paper, we attempt to address these concerns. To do so, we first define interpretability in the context of machine learning and place it within a generic data science life cycle. This allows us to distinguish between two main classes of interpretation methods: model-based∗ and post hoc. We then introduce the Predictive, Descriptive, Relevant (PDR) framework, consisting of three desiderata for evaluating and constructing interpretations: predictive accuracy, descriptive", "year": 2019, "referenceCount": 94, "citationCount": 317, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "144585578", "name": "W. James Murdoch"}, {"authorId": "145229121", "name": "Chandan Singh"}, {"authorId": "19225295", "name": "Karl Kumbier"}, {"authorId": "1405625449", "name": "R. Abbasi-Asl"}, {"authorId": "144923779", "name": "Bin Yu"}]}, {"paperId": "05d20fda297c9afb347214bd1693bd049674e0c6", "url": "https://www.semanticscholar.org/paper/05d20fda297c9afb347214bd1693bd049674e0c6", "title": "Machine Learning for the Geosciences: Challenges and Opportunities", "abstract": "Geosciences is a field of great societal relevance that requires solutions to several urgent problems facing our humanity and the planet. As geosciences enters the era of big data, machine learning (ML)—that has been widely successful in commercial domains—offers immense potential to contribute to problems in geosciences. However, geoscience applications introduce novel challenges for ML due to combinations of geoscience properties encountered in every problem, requiring novel research in machine learning. This article introduces researchers in the machine learning (ML) community to these challenges offered by geoscience problems and the opportunities that exist for advancing both machine learning and geosciences. We first highlight typical sources of geoscience data and describe their common properties. We then describe some of the common categories of geoscience problems where machine learning can play a role, discussing the challenges faced by existing ML methods and opportunities for novel ML research. We conclude by discussing some of the cross-cutting research themes in machine learning that are applicable across several geoscience problems, and the importance of a deep collaboration between machine learning and geosciences for synergistic advancements in both disciplines.", "year": 2017, "referenceCount": 128, "citationCount": 201, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2548167", "name": "A. Karpatne"}, {"authorId": "1405321572", "name": "I. Ebert‐Uphoff"}, {"authorId": "1753019", "name": "S. Ravela"}, {"authorId": "30160005", "name": "H. Babaie"}, {"authorId": "2107978833", "name": "Vipin Kumar"}]}, {"paperId": "e9239469aba4bccf3e36d1c27894721e8dbefc44", "url": "https://www.semanticscholar.org/paper/e9239469aba4bccf3e36d1c27894721e8dbefc44", "title": "Foundations of Machine Learning", "abstract": "This graduate-level textbook introduces fundamental concepts and methods in machine learning. It describes several important modern algorithms, provides the theoretical underpinnings of these algorithms, and illustrates key aspects for their application. The authors aim to present novel theoretical tools and concepts while giving concise proofs even for relatively advanced topics. Foundations of Machine Learning fills the need for a general textbook that also offers theoretical details and an emphasis on proofs. Certain topics that are often treated with insufficient attention are discussed in more detail here; for example, entire chapters are devoted to regression, multi-class classification, and ranking. The first three chapters lay the theoretical foundation for what follows, but each remaining chapter is mostly self-contained. The appendix offers a concise probability review, a short introduction to convex optimization, tools for concentration bounds, and several basic properties of matrices and norms used in the book. The book is intended for graduate students and researchers in machine learning, statistics, and related areas; it can be used either as a textbook or as a reference text for a research seminar.", "year": 2012, "referenceCount": 231, "citationCount": 2512, "influentialCitationCount": 306, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "81080659", "name": "M. Mohri"}, {"authorId": "2435268", "name": "Afshin Rostamizadeh"}, {"authorId": "145532827", "name": "Ameet S. Talwalkar"}]}, {"paperId": "eed9fa4483cab37eacd59db0fac4b1441431ee85", "url": "https://www.semanticscholar.org/paper/eed9fa4483cab37eacd59db0fac4b1441431ee85", "title": "Tensor Decomposition for Signal Processing and Machine Learning", "abstract": "Tensors or <italic>multiway arrays</italic> are functions of three or more indices <inline-formula> <tex-math notation=\"LaTeX\">$(i,j,k,\\ldots)$</tex-math></inline-formula>—similar to matrices (two-way arrays), which are functions of two indices <inline-formula><tex-math notation=\"LaTeX\">$(r,c)$</tex-math></inline-formula> for (row, column). Tensors have a rich history, stretching over almost a century, and touching upon numerous disciplines; but they have only recently become ubiquitous in signal and data analytics at the confluence of signal processing, statistics, data mining, and machine learning. This overview article aims to provide a good starting point for researchers and practitioners interested in learning about and working with tensors. As such, it focuses on fundamentals and motivation (using various application examples), aiming to strike an appropriate balance of breadth <italic>and depth</italic> that will enable someone having taken first graduate courses in matrix algebra and probability to get started doing research and/or developing tensor algorithms and software. Some background in applied optimization is useful but not strictly required. The material covered includes tensor rank and rank decomposition; basic tensor factorization models and their relationships and properties (including fairly good coverage of identifiability); broad coverage of algorithms ranging from alternating optimization to stochastic gradient; statistical performance analysis; and applications ranging from source separation to collaborative filtering, mixture and topic modeling, classification, and multilinear subspace learning.", "year": 2016, "referenceCount": 165, "citationCount": 969, "influentialCitationCount": 67, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "73776482", "name": "N. Sidiropoulos"}, {"authorId": "2217213", "name": "L. Lathauwer"}, {"authorId": "144406546", "name": "Xiao Fu"}, {"authorId": "2349460", "name": "Kejun Huang"}, {"authorId": "3000659", "name": "E. Papalexakis"}, {"authorId": "1702392", "name": "C. Faloutsos"}]}, {"paperId": "9d75cc322a4e06d0a3a868cb91b04219a289c12c", "url": "https://www.semanticscholar.org/paper/9d75cc322a4e06d0a3a868cb91b04219a289c12c", "title": "Machine Learning: An Applied Econometric Approach", "abstract": "Machines are increasingly doing \"intelligent\" things. Face recognition algorithms use a large dataset of photos labeled as having a face or not to estimate a function that predicts the presence y of a face from pixels x. This similarity to econometrics raises questions: How do these new empirical tools fit with what we know? As empirical economists, how can we use them? We present a way of thinking about machine learning that gives it its own place in the econometric toolbox. Machine learning not only provides new tools, it solves a different problem. Specifically, machine learning revolves around the problem of prediction, while many economic applications revolve around parameter estimation. So applying machine learning to economics requires finding relevant tasks. Machine learning algorithms are now technically easy to use: you can download convenient packages in R or Python. This also raises the risk that the algorithms are applied naively or their output is misinterpreted. We hope to make them conceptually easier to use by providing a crisper understanding of how these algorithms work, where they excel, and where they can stumble—and thus where they can be most usefully applied.", "year": 2017, "referenceCount": 252, "citationCount": 982, "influentialCitationCount": 66, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2062143", "name": "S. Mullainathan"}, {"authorId": "47281276", "name": "Jann Spiess"}]}, {"paperId": "6a6ad9eb495739f4c80e7c09598720c3d5c5dff7", "url": "https://www.semanticscholar.org/paper/6a6ad9eb495739f4c80e7c09598720c3d5c5dff7", "title": "Federated Learning: Collaborative Machine Learning without\nCentralized Training Data", "abstract": "Federated learning (also known as collaborative learning) is a machine learning technique that trains\nan algorithm without transferring data samples across numerous decentralized edge devices or\nservers. This strategy differs from standard centralized machine learning techniques in which all local\ndatasets are uploaded to a single server, as well as more traditional decentralized alternatives, which\nfrequently presume that local data samples are uniformly distributed.\nFederated learning allows several actors to collaborate on the development of a single, robust\nmachine learning model without sharing data, allowing crucial issues such as data privacy, data\nsecurity, data access rights, and access to heterogeneous data to be addressed. Defence,\ntelecommunications, internet of things, and pharmaceutical industries are just a few of the sectors\nwhere it has applications.", "year": 2022, "referenceCount": 6, "citationCount": 334, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2181966147", "name": "Abhishek V A"}, {"authorId": "2181945880", "name": "Binny S"}, {"authorId": "2181972275", "name": "Johan T R"}, {"authorId": "2181974014", "name": "Nithin Raj"}, {"authorId": "2181972083", "name": "Vishal Thomas"}]}, {"paperId": "033f25ad905ef2ed32a8331cf38b83953ff15922", "url": "https://www.semanticscholar.org/paper/033f25ad905ef2ed32a8331cf38b83953ff15922", "title": "A Review of Relational Machine Learning for Knowledge Graphs", "abstract": "Relational machine learning studies methods for the statistical analysis of relational, or graph-structured, data. In this paper, we provide a review of how such statistical models can be “trained” on large knowledge graphs, and then used to predict new facts about the world (which is equivalent to predicting new edges in the graph). In particular, we discuss two fundamentally different kinds of statistical relational models, both of which can scale to massive data sets. The first is based on latent feature models such as tensor factorization and multiway neural networks. The second is based on mining observable patterns in the graph. We also show how to combine these latent and observable models to get improved modeling power at decreased computational cost. Finally, we discuss how such statistical models of graphs can be combined with text-based information extraction methods for automatically constructing knowledge graphs from the Web. To this end, we also discuss Google's knowledge vault project as an example of such combination.", "year": 2015, "referenceCount": 156, "citationCount": 1218, "influentialCitationCount": 121, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1729762", "name": "Maximilian Nickel"}, {"authorId": "1702318", "name": "K. Murphy"}, {"authorId": "1700754", "name": "Volker Tresp"}, {"authorId": "1718798", "name": "E. Gabrilovich"}]}, {"paperId": "9ef6e2b5bf3b7426d52b911e6914db228bbb7e15", "url": "https://www.semanticscholar.org/paper/9ef6e2b5bf3b7426d52b911e6914db228bbb7e15", "title": "Machine learning", "abstract": null, "year": 2021, "referenceCount": 20, "citationCount": 0, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "71760660", "name": "P. Bangert"}]}, {"paperId": "4f2baff3195b6fc43a38e3e869496dab9fe9dbc3", "url": "https://www.semanticscholar.org/paper/4f2baff3195b6fc43a38e3e869496dab9fe9dbc3", "title": "Delayed Impact of Fair Machine Learning", "abstract": "Static classification has been the predominant focus of the study of fairness in machine learning. While most models do not consider how decisions change populations over time, it is conventional wisdom that fairness criteria promote the long-term well-being of groups they aim to protect. This work studies the interaction of static fairness criteria with temporal indicators of well-being. We show a simple one-step feedback model in which common criteria do not generally promote improvement over time, and may in fact cause harm. Our results highlight the importance of temporal modeling in the evaluation of fairness criteria, suggesting a range of new challenges and trade-offs.", "year": 2018, "referenceCount": 34, "citationCount": 312, "influentialCitationCount": 26, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1748108610", "name": "Lydia T. Liu"}, {"authorId": "1491339790", "name": "Sarah Dean"}, {"authorId": "144322309", "name": "Esther Rolf"}, {"authorId": "3385674", "name": "Max Simchowitz"}, {"authorId": "1775622", "name": "Moritz Hardt"}]}, {"paperId": "78aa018ee7d52360e15d103390ea1cdb3a0beb41", "url": "https://www.semanticscholar.org/paper/78aa018ee7d52360e15d103390ea1cdb3a0beb41", "title": "Transferability in Machine Learning: from Phenomena to Black-Box Attacks using Adversarial Samples", "abstract": "Many machine learning models are vulnerable to adversarial examples: inputs that are specially crafted to cause a machine learning model to produce an incorrect output. Adversarial examples that affect one model often affect another model, even if the two models have different architectures or were trained on different training sets, so long as both models were trained to perform the same task. An attacker may therefore train their own substitute model, craft adversarial examples against the substitute, and transfer them to a victim model, with very little information about the victim. Recent work has further developed a technique that uses the victim model as an oracle to label a synthetic training set for the substitute, so the attacker need not even collect a training set to mount the attack. We extend these recent techniques using reservoir sampling to greatly enhance the efficiency of the training procedure for the substitute model. We introduce new transferability attacks between previously unexplored (substitute, victim) pairs of machine learning model classes, most notably SVMs and decision trees. We demonstrate our attacks on two commercial machine learning classification systems from Amazon (96.19% misclassification rate) and Google (88.94%) using only 800 queries of the victim model, thereby showing that existing machine learning approaches are in general vulnerable to systematic black-box attacks regardless of their structure.", "year": 2016, "referenceCount": 34, "citationCount": 1277, "influentialCitationCount": 103, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1967156", "name": "Nicolas Papernot"}, {"authorId": "144061974", "name": "P. Mcdaniel"}, {"authorId": "153440022", "name": "Ian J. Goodfellow"}]}, {"paperId": "7c63a6e6d3b31b14ae4236bfbd574ea37cab18a7", "url": "https://www.semanticscholar.org/paper/7c63a6e6d3b31b14ae4236bfbd574ea37cab18a7", "title": "Choosing Prediction Over Explanation in Psychology: Lessons From Machine Learning", "abstract": "Psychology has historically been concerned, first and foremost, with explaining the causal mechanisms that give rise to behavior. Randomized, tightly controlled experiments are enshrined as the gold standard of psychological research, and there are endless investigations of the various mediating and moderating variables that govern various behaviors. We argue that psychology’s near-total focus on explaining the causes of behavior has led much of the field to be populated by research programs that provide intricate theories of psychological mechanism but that have little (or unknown) ability to predict future behaviors with any appreciable accuracy. We propose that principles and techniques from the field of machine learning can help psychology become a more predictive science. We review some of the fundamental concepts and tools of machine learning and point out examples where these concepts have been used to conduct interesting and important psychological research that focuses on predictive research questions. We suggest that an increased focus on prediction, rather than explanation, can ultimately lead us to greater understanding of behavior.", "year": 2017, "referenceCount": 117, "citationCount": 887, "influentialCitationCount": 50, "isOpenAccess": true, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "2075675", "name": "T. Yarkoni"}, {"authorId": "48804181", "name": "Jacob Westfall"}]}, {"paperId": "2aadb938af2f77a6ad9321ff873c1c9b9a579fcb", "url": "https://www.semanticscholar.org/paper/2aadb938af2f77a6ad9321ff873c1c9b9a579fcb", "title": "A Survey of Data Mining and Machine Learning Methods for Cyber Security Intrusion Detection", "abstract": "Cyber security is that the body of technologies, processes and practices designed to safeguard networks, computers, programs and knowledge from attack, harm or unauthorized access. During a computing context, the term security implies cyber security. This survey paper describes a targeted literature survey of machine learning (ML) and data processing (DM) strategies for cyber analytics in support of intrusion detection. This paper focuses totally on cyber intrusion detection as it applies to wired networks. With a wired network, associate oppose must experience many layers of defense at firewalls and operative systems, or gain physical access to the network. The quality of ML/DM algorithms is addressed, discussion of challenges for victimization ML/DM for cyber security is conferred, and some recommendations on once to use a given methodology area unit provided.", "year": 2017, "referenceCount": 13, "citationCount": 851, "influentialCitationCount": 70, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "100818765", "name": "Lalu Banoth"}, {"authorId": "70392354", "name": "M. S. Teja"}, {"authorId": "2102149819", "name": "M. Saicharan"}, {"authorId": "143612469", "name": "N. Chandra"}]}, {"paperId": "0359bba5112d472206d82ddb29947f2d634bb0cc", "url": "https://www.semanticscholar.org/paper/0359bba5112d472206d82ddb29947f2d634bb0cc", "title": "Introduction to machine learning", "abstract": "The goal of machine learning is to program computers to use example data or past experience to solve a given problem. Many successful applications of machine learning exist already, including systems that analyze past sales data to predict customer behavior, optimize robot behavior so that a task can be completed using minimum resources, and extract knowledge from bioinformatics data. Introduction to Machine Learning is a comprehensive textbook on the subject, covering a broad array of topics not usually included in introductory machine learning texts. In order to present a unified treatment of machine learning problems and solutions, it discusses many methods from different fields, including statistics, pattern recognition, neural networks, artificial intelligence, signal processing, control, and data mining. All learning algorithms are explained so that the student can easily move from the equations in the book to a computer program. The text covers such topics as supervised learning, Bayesian decision theory, parametric methods, multivariate methods, multilayer perceptrons, local models, hidden Markov models, assessing and comparing classification algorithms, and reinforcement learning. New to the second edition are chapters on kernel machines, graphical models, and Bayesian estimation; expanded coverage of statistical tests in a chapter on design and analysis of machine learning experiments; case studies available on the Web (with downloadable results for instructors); and many additional exercises. All chapters have been revised and updated. Introduction to Machine Learning can be used by advanced undergraduates and graduate students who have completed courses in computer programming, probability, calculus, and linear algebra. It will also be of interest to engineers in the field who are concerned with the application of machine learning methods. Adaptive Computation and Machine Learning series", "year": 2004, "referenceCount": 19, "citationCount": 3330, "influentialCitationCount": 275, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1691898", "name": "Ethem Alpaydin"}]}, {"paperId": "c5c3fa019574988c479474c32f34debecd12e8d1", "url": "https://www.semanticscholar.org/paper/c5c3fa019574988c479474c32f34debecd12e8d1", "title": "Procedural Content Generation via Machine Learning (PCGML)", "abstract": "This survey explores procedural content generation via machine learning (PCGML), defined as the generation of game content using machine learning models trained on existing content. As the importance of PCG for game development increases, researchers explore new avenues for generating high-quality content with or without human involvement; this paper addresses the relatively new paradigm of using machine learning (in contrast with search-based, solver-based, and constructive methods). We focus on what is most often considered functional game content, such as platformer levels, game maps, interactive fiction stories, and cards in collectible card games, as opposed to cosmetic content, such as sprites and sound effects. In addition to using PCG for autonomous generation, cocreativity, mixed-initiative design, and compression, PCGML is suited for repair, critique, and content analysis because of its focus on modeling existing content. We discuss various data sources and representations that affect the generated content. Multiple PCGML methods are covered, including neural networks: long short-term memory networks, autoencoders, and deep convolutional networks; Markov models: $n$-grams and multi-dimensional Markov chains; clustering; and matrix factorization. Finally, we discuss open problems in PCGML, including learning from small data sets, lack of training data, multilayered learning, style-transfer, parameter tuning, and PCG as a game mechanic.", "year": 2017, "referenceCount": 112, "citationCount": 254, "influentialCitationCount": 35, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3375548", "name": "A. Summerville"}, {"authorId": "29929346", "name": "Sam Snodgrass"}, {"authorId": "144599741", "name": "Matthew J. Guzdial"}, {"authorId": "1757823", "name": "Christoffer Holmgård"}, {"authorId": "48630276", "name": "Amy K. Hoover"}, {"authorId": "2232368", "name": "Aaron Isaksen"}, {"authorId": "3431050", "name": "Andy Nealen"}, {"authorId": "1810053", "name": "J. Togelius"}]}, {"paperId": "8db8166249dfb94dd8d52f88d27917b5755ae049", "url": "https://www.semanticscholar.org/paper/8db8166249dfb94dd8d52f88d27917b5755ae049", "title": "A Quick Review of Machine Learning Algorithms", "abstract": "Machine learning is predominantly an area of Artificial Intelligence which has been a key component of digitalization solutions that has caught major attention in the digital arena. In this paper author intends to do a brief review of various machine learning algorithms which are most frequently used and therefore are the most popular ones. The author intends to highlight the merits and demerits of the machine learning algorithms from their application perspective to aid in an informed decision making towards selecting the appropriate learning algorithm to meet the specific requirement of the application.", "year": 2019, "referenceCount": 11, "citationCount": 144, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "28530119", "name": "Susmita Ray"}]}, {"paperId": "59d9318f07331ec15e54fe2a4218bc4a5c247a38", "url": "https://www.semanticscholar.org/paper/59d9318f07331ec15e54fe2a4218bc4a5c247a38", "title": "Foolbox: A Python toolbox to benchmark the robustness of machine learning models", "abstract": "Even todays most advanced machine learning models are easily fooled by almost imperceptible perturbations of their inputs. Foolbox is a new Python package to generate such adversarial perturbations and to quantify and compare the robustness of machine learning models. It is build around the idea that the most comparable robustness measure is the minimum perturbation needed to craft an adversarial example. To this end, Foolbox provides reference implementations of most published adversarial attack methods alongside some new ones, all of which perform internal hyperparameter tuning to find the minimum adversarial perturbation. Additionally, Foolbox interfaces with most popular deep learning frameworks such as PyTorch, Keras, TensorFlow, Theano and MXNet and allows different adversarial criteria such as targeted misclassification and top-k misclassification as well as different distance measures. The code is licensed under the MIT license and is openly available at https://github.com/bethgelab/foolbox. The most up-to-date documentation can be found at http://foolbox.readthedocs.io. In 2013, Szegedy et al. demonstrated that minimal perturbations, often almost imperceptible to humans, can have devastating effects on machine predictions. These so-called adversarial perturbations thus demonstrate a striking difference between human and machine perception. As a result, adversarial perturbations have been subject to many Equal contribution Centre for Integrative Neuroscience, University of Tübingen, Germany Bernstein Center for Computational Neuroscience, Tübingen, Germany International Max Planck Research School for Intelligent Systems, Tübingen, Germany Max Planck Institute for Biological Cybernetics, Tübingen, Germany Institute for Theoretical Physics, University of Tübingen, Germany. Correspondence to: Jonas Rauber <jonas.rauber@bethgelab.org>. Reliable Machine Learning in the Wild Workshop, 34 th International Conference on Machine Learning, Sydney, Australia, 2017. studies concerning the generation of such perturbations and strategies to protect machine learning models such as deep neural networks against them. A practical definition of the robustness R of a model, first used by Szegedy et al. (2013), is the average size of the minimum adversarial perturbation ρ(x) across many samples x, R = 〈ρ(x)〉 x where (1) ρ(x) = min δ d(x,x+ δ) s.t. x+ δ is adversarial (2) and d(·) is some distance measure. Unfortunately, finding the global minimum adversarial perturbation is close to impossible in any practical setting, and we thus employ heuristic attacks to find a suitable approximation. Such heuristics, however, can fail, in which case we could easily be mislead to believe that a model is robust (Brendel & Bethge, 2017). Our best strategy is thus to employ as many attacks as possible, and to use the minimal perturbation found across all attacks as an approximation to the true global minimum. At the moment, however, such a strategy is severely obstructed by two problems: first, the code for most known attack methods is either not available at all, or only available for one particular deep learning framework. Second, implementations of the same attack often differ in many details and are thus not directly comparable. Foolbox improves upon the existing Python package cleverhans by Papernot et al. (2016b) in three important aspects: 1. It interfaces with most popular machine learning frameworks such as PyTorch, Keras, TensorFlow, Theano, Lasagne and MXNet and provides a straight forward way to add support for other frameworks, 2. it provides reference implementations for more than 15 adversarial attacks with a simple and consistent API, and 3. it supports many different criteria for adversarial examples, including custom ones. This technical report is structured as follows: In section 1 we provide an overview over Foolbox and demonstrate Foolbox: A Python toolbox to benchmark the robustness of machine learning models how to benchmark a model and report the result. In section 2 we describe the adversarial attack methods that are implemented in Foolbox and explain the internal hyperparameter tuning.", "year": 2017, "referenceCount": 11, "citationCount": 354, "influentialCitationCount": 49, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "19237612", "name": "Jonas Rauber"}, {"authorId": "40634590", "name": "Wieland Brendel"}, {"authorId": "1731199", "name": "M. Bethge"}]}, {"paperId": "be1496e9620089b377ef631692478f5034ee95b8", "url": "https://www.semanticscholar.org/paper/be1496e9620089b377ef631692478f5034ee95b8", "title": "Machine learning applications in epilepsy", "abstract": "Machine learning leverages statistical and computer science principles to develop algorithms capable of improving performance through interpretation of data rather than through explicit instructions. Alongside widespread use in image recognition, language processing, and data mining, machine learning techniques have received increasing attention in medical applications, ranging from automated imaging analysis to disease forecasting. This review examines the parallel progress made in epilepsy, highlighting applications in automated seizure detection from electroencephalography (EEG), video, and kinetic data, automated imaging analysis and pre‐surgical planning, prediction of medication response, and prediction of medical and surgical outcomes using a wide variety of data sources. A brief overview of commonly used machine learning approaches, as well as challenges in further application of machine learning techniques in epilepsy, is also presented. With increasing computational capabilities, availability of effective machine learning algorithms, and accumulation of larger datasets, clinicians and researchers will increasingly benefit from familiarity with these techniques and the significant progress already made in their application in epilepsy.", "year": 2019, "referenceCount": 114, "citationCount": 137, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "48487599", "name": "B. Abbasi"}, {"authorId": "2423726", "name": "D. Goldenholz"}]}, {"paperId": "175e37bca3762b3a52c6a0e153060b98a251d061", "url": "https://www.semanticscholar.org/paper/175e37bca3762b3a52c6a0e153060b98a251d061", "title": "Inverse molecular design using machine learning: Generative models for matter engineering", "abstract": "The discovery of new materials can bring enormous societal and technological progress. In this context, exploring completely the large space of potential materials is computationally intractable. Here, we review methods for achieving inverse design, which aims to discover tailored materials from the starting point of a particular desired functionality. Recent advances from the rapidly growing field of artificial intelligence, mostly from the subfield of machine learning, have resulted in a fertile exchange of ideas, where approaches to inverse molecular design are being proposed and employed at a rapid pace. Among these, deep generative models have been applied to numerous classes of materials: rational design of prospective drugs, synthetic routes to organic compounds, and optimization of photovoltaics and redox flow batteries, as well as a variety of other solid-state materials.", "year": 2018, "referenceCount": 93, "citationCount": 839, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "1380248978", "name": "Benjamín Sánchez-Lengeling"}, {"authorId": "1380248954", "name": "Alán Aspuru-Guzik"}]}, {"paperId": "3f22c9462f8e588ce4210a304133e2265f41d913", "url": "https://www.semanticscholar.org/paper/3f22c9462f8e588ce4210a304133e2265f41d913", "title": "Artificial Intelligence and Machine Learning in Pathology: The Present Landscape of Supervised Methods", "abstract": "Increased interest in the opportunities provided by artificial intelligence and machine learning has spawned a new field of health-care research. The new tools under development are targeting many aspects of medical practice, including changes to the practice of pathology and laboratory medicine. Optimal design in these powerful tools requires cross-disciplinary literacy, including basic knowledge and understanding of critical concepts that have traditionally been unfamiliar to pathologists and laboratorians. This review provides definitions and basic knowledge of machine learning categories (supervised, unsupervised, and reinforcement learning), introduces the underlying concept of the bias-variance trade-off as an important foundation in supervised machine learning, and discusses approaches to the supervised machine learning study design along with an overview and description of common supervised machine learning algorithms (linear regression, logistic regression, Naive Bayes, k-nearest neighbor, support vector machine, random forest, convolutional neural networks).", "year": 2019, "referenceCount": 76, "citationCount": 125, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "31682040", "name": "H. Rashidi"}, {"authorId": "144026292", "name": "N. Tran"}, {"authorId": "83007327", "name": "Elham Vali Betts"}, {"authorId": "5788528", "name": "L. Howell"}, {"authorId": "2072877937", "name": "Ralph Green"}]}, {"paperId": "1ecc2bd0bc6ffa0a2f466a058589c20593e3e57c", "url": "https://www.semanticscholar.org/paper/1ecc2bd0bc6ffa0a2f466a058589c20593e3e57c", "title": "The Marginal Value of Adaptive Gradient Methods in Machine Learning", "abstract": "Adaptive optimization methods, which perform local optimization with a metric constructed from the history of iterates, are becoming increasingly popular for training deep neural networks. Examples include AdaGrad, RMSProp, and Adam. We show that for simple overparameterized problems, adaptive methods often find drastically different solutions than gradient descent (GD) or stochastic gradient descent (SGD). We construct an illustrative binary classification problem where the data is linearly separable, GD and SGD achieve zero test error, and AdaGrad, Adam, and RMSProp attain test errors arbitrarily close to half. We additionally study the empirical generalization capability of adaptive methods on several state-of-the-art deep learning models. We observe that the solutions found by adaptive methods generalize worse (often significantly worse) than SGD, even when these solutions have better training performance. These results suggest that practitioners should reconsider the use of adaptive methods to train neural networks.", "year": 2017, "referenceCount": 26, "citationCount": 784, "influentialCitationCount": 80, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144102853", "name": "Ashia C. Wilson"}, {"authorId": "40458654", "name": "R. Roelofs"}, {"authorId": "144872294", "name": "Mitchell Stern"}, {"authorId": "1706280", "name": "Nathan Srebro"}, {"authorId": "9229182", "name": "B. Recht"}]}, {"paperId": "efca2a32ce9c7a808c2c3efcc2c3dac032dfc8ea", "url": "https://www.semanticscholar.org/paper/efca2a32ce9c7a808c2c3efcc2c3dac032dfc8ea", "title": "Big Data and Machine Learning in Health Care.", "abstract": "Nearly all aspects of modern life are in some way being changed by big data and machine learning. Netflix knows what movies people like to watch and Google knows what people want to know based on their search histories. Indeed, Google has recently begun to replace much of its existing non–machine learning technology with machine learning algorithms, and there is great optimism that these techniques can provide similar improvements across many sectors. It isnosurprisethenthatmedicineisawashwithclaims of revolution from the application of machine learning to big health care data. Recent examples have demonstrated that big data and machine learning can create algorithms that perform on par with human physicians.1 Though machine learning and big data may seem mysterious at first, they are in fact deeply related to traditional statistical models that are recognizable to most clinicians. It is our hope that elucidating these connections will demystify these techniques and provide a set of reasonable expectations for the role of machine learning and big data in health care. Machine learning was originally described as a program that learns to perform a task or make a decision automatically from data, rather than having the behavior explicitlyprogrammed.However,thisdefinitionisverybroad and could cover nearly any form of data-driven approach. For instance, consider the Framingham cardiovascular risk score,whichassignspointstovariousfactorsandproduces a number that predicts 10-year cardiovascular risk. Should this be considered an example of machine learning? The answer might obviously seem to be no. Closer inspection oftheFraminghamriskscorerevealsthattheanswermight not be as obvious as it first seems. The score was originally created2 by fitting a proportional hazards model to data frommorethan5300patients,andsothe“rule”wasinfact learnedentirelyfromdata.Designatingariskscoreasamachine learning algorithm might seem a strange notion, but this example reveals the uncertain nature of the original definition of machine learning. It is perhaps more useful to imagine an algorithm as existing along a continuum between fully human-guided vs fully machine-guided data analysis. To understand the degree to which a predictive or diagnostic algorithm can said to be an instance of machine learning requires understanding how much of its structure or parameters were predetermined by humans. The trade-off between human specificationofapredictivealgorithm’spropertiesvslearning those properties from data is what is known as the machine learning spectrum. Returning to the Framingham study, to create the original risk score statisticians and clinical experts worked together to make many important decisions, such as which variables to include in the model, therelationshipbetweenthedependentandindependent variables, and variable transformations and interactions. Since considerable human effort was used to define these properties, it would place low on the machine learning spectrum (#19 in the Figure and Supplement). Many evidence-based clinical practices are based on a statistical model of this sort, and so many clinical decisions in fact exist on the machine learning spectrum (middle left of Figure). On the extreme low end of the machine learning spectrum would be heuristics and rules of thumb that do not directly involve the use of any rules or models explicitly derived from data (bottom left of Figure). Suppose a new cardiovascular risk score is created that includes possible extensions to the original model. For example, it could be that risk factors should not be added but instead should be multiplied or divided, or perhaps a particularly important risk factor should square the entire score if it is present. Moreover, if it is not known in advance which variables will be important, but thousands of individual measurements have been collected, how should a good model be identified from among the infinite possibilities? This is precisely what a machine learning algorithm attempts to do. As humans impose fewer assumptions on the algorithm, it moves further up the machine learning spectrum. However, there is never a specific threshold wherein a model suddenly becomes “machine learning”; rather, all of these approaches exist along a continuum, determined by how many human assumptions are placed onto the algorithm. An example of an approach high on the machine learning spectrum has recently emerged in the form of so-called deep learning models. Deep learning models are stunningly complex networks of artificial neurons that were designed expressly to create accurate models directly from raw data. Researchers recently demonstrated a deep learning algorithm capable of detecting diabetic retinopathy (#4 in the Figure, top center) from retinal photographs at a sensitivity equal to or greater than that of ophthalmologists.1 This model learned the diagnosis procedure directly from the raw pixels of the images with no human intervention outside of a team of ophthalmologists who annotated each image with the correct diagnosis. Because they are able to learn the task with little human instruction or prior assumptions, these deep learning algorithms rank very high on the machine learning spectrum (Figure, light blue circles). Though they require less human guidance, deep learning algorithms for image recognition require enormous amounts of data to capture the full complexity, variety, and nuance inherent to real-world images. Consequently, these algorithms often require hundreds of thousands of examples to extract the salient image features that are correlated with the outcome of interest. Higher placement on the machine learning spectrum does not imply superiority, because different tasks require different levels of human involvement. While algorithms high on the spectrum are often very flexible and can learn many tasks, they are often uninterpretable VIEWPOINT", "year": 2018, "referenceCount": 3, "citationCount": 789, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "143649421", "name": "Andrew Beam"}, {"authorId": "1740538", "name": "I. Kohane"}]}, {"paperId": "adfc508b9b3d4fc3903aa383a290dc68fb8bbe5a", "url": "https://www.semanticscholar.org/paper/adfc508b9b3d4fc3903aa383a290dc68fb8bbe5a", "title": "Implementing Machine Learning in Health Care - Addressing Ethical Challenges.", "abstract": "Implementing Machine Learning in Health Care We need to consider the ethical challenges inherent in implementing machine learning in health care if its benefits are to be realized. Some of these ch...", "year": 2018, "referenceCount": 5, "citationCount": 538, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "16015502", "name": "D. Char"}, {"authorId": "143665076", "name": "N. Shah"}, {"authorId": "8439459", "name": "D. Magnus"}]}, {"paperId": "39361b3507c9f8b0a97780568b645f80a208d78a", "url": "https://www.semanticscholar.org/paper/39361b3507c9f8b0a97780568b645f80a208d78a", "title": "Machine Learning and Deep Learning Methods for Cybersecurity", "abstract": "With the development of the Internet, cyber-attacks are changing rapidly and the cyber security situation is not optimistic. This survey report describes key literature surveys on machine learning (ML) and deep learning (DL) methods for network analysis of intrusion detection and provides a brief tutorial description of each ML/DL method. Papers representing each method were indexed, read, and summarized based on their temporal or thermal correlations. Because data are so important in ML/DL methods, we describe some of the commonly used network datasets used in ML/DL, discuss the challenges of using ML/DL for cybersecurity and provide suggestions for research directions.", "year": 2018, "referenceCount": 84, "citationCount": 467, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2067672128", "name": "Yang Xin"}, {"authorId": "2069277364", "name": "Lingshuang Kong"}, {"authorId": "2118357790", "name": "Zhi Liu"}, {"authorId": "49069825", "name": "Yuling Chen"}, {"authorId": "121704135", "name": "Yanmiao Li"}, {"authorId": "96519515", "name": "Hongliang Zhu"}, {"authorId": "49594896", "name": "Mingcheng Gao"}, {"authorId": "2149274", "name": "Haixia Hou"}, {"authorId": "2108713951", "name": "Chunhua Wang"}]}, {"paperId": "ab0a6b82c359ce6d4c2425080ffee632cb46fced", "url": "https://www.semanticscholar.org/paper/ab0a6b82c359ce6d4c2425080ffee632cb46fced", "title": "MoleculeNet: a benchmark for molecular machine learning† †Electronic supplementary information (ESI) available. See DOI: 10.1039/c7sc02664a", "abstract": "A large scale benchmark for molecular machine learning consisting of multiple public datasets, metrics, featurizations and learning algorithms.", "year": 2017, "referenceCount": 121, "citationCount": 457, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics", "Medicine"], "authors": [{"authorId": "9957625", "name": "Zhenqin Wu"}, {"authorId": "2378027", "name": "Bharath Ramsundar"}, {"authorId": "5932099", "name": "Evan N. Feinberg"}, {"authorId": "145986494", "name": "Joseph Gomes"}, {"authorId": "9959840", "name": "Caleb Geniesse"}, {"authorId": "5929246", "name": "Aneesh S. Pappu"}, {"authorId": "40867019", "name": "K. Leswing"}, {"authorId": "1806271", "name": "V. Pande"}]}, {"paperId": "eef183687fab4d762a381f2e80e357e08e923f0a", "url": "https://www.semanticscholar.org/paper/eef183687fab4d762a381f2e80e357e08e923f0a", "title": "Model Evaluation, Model Selection, and Algorithm Selection in Machine Learning", "abstract": "The correct use of model evaluation, model selection, and algorithm selection techniques is vital in academic machine learning research as well as in many industrial settings. This article reviews different techniques that can be used for each of these three subtasks and discusses the main advantages and disadvantages of each technique with references to theoretical and empirical studies. Further, recommendations are given to encourage best yet feasible practices in research and applications of machine learning. Common methods such as the holdout method for model evaluation and selection are covered, which are not recommended when working with small datasets. Different flavors of the bootstrap technique are introduced for estimating the uncertainty of performance estimates, as an alternative to confidence intervals via normal approximation if bootstrapping is computationally feasible. Common cross-validation techniques such as leave-one-out cross-validation and k-fold cross-validation are reviewed, the bias-variance trade-off for choosing k is discussed, and practical tips for the optimal choice of k are given based on empirical evidence. Different statistical tests for algorithm comparisons are presented, and strategies for dealing with multiple comparisons such as omnibus tests and multiple-comparison corrections are discussed. Finally, alternative methods for algorithm selection, such as the combined F-test 5x2 cross-validation and nested cross-validation, are recommended for comparing machine learning algorithms when datasets are small.", "year": 2018, "referenceCount": 35, "citationCount": 392, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2562040", "name": "S. Raschka"}]}, {"paperId": "d5125164c7fec457d1442cce807a3436841715d0", "url": "https://www.semanticscholar.org/paper/d5125164c7fec457d1442cce807a3436841715d0", "title": "Machine Learning Approaches for Clinical Psychology and Psychiatry.", "abstract": "Machine learning approaches for clinical psychology and psychiatry explicitly focus on learning statistical functions from multidimensional data sets to make generalizable predictions about individuals. The goal of this review is to provide an accessible understanding of why this approach is important for future practice given its potential to augment decisions associated with the diagnosis, prognosis, and treatment of people suffering from mental illness using clinical and biological data. To this end, the limitations of current statistical paradigms in mental health research are critiqued, and an introduction is provided to critical machine learning methods used in clinical studies. A selective literature review is then presented aiming to reinforce the usefulness of machine learning methods and provide evidence of their potential. In the context of promising initial results, the current limitations of machine learning approaches are addressed, and considerations for future clinical translation are outlined.", "year": 2018, "referenceCount": 0, "citationCount": 362, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Psychology"], "authors": [{"authorId": "5672681", "name": "D. Dwyer"}, {"authorId": "2660554", "name": "P. Falkai"}, {"authorId": "3214043", "name": "N. Koutsouleris"}]}, {"paperId": "5939ac3b5a9d64d8371ee179751351d7698637df", "url": "https://www.semanticscholar.org/paper/5939ac3b5a9d64d8371ee179751351d7698637df", "title": "Using Machine Learning to Advance Personality Assessment and Theory", "abstract": "Machine learning has led to important advances in society. One of the most exciting applications of machine learning in psychological science has been the development of assessment tools that can powerfully predict human behavior and personality traits. Thus far, machine learning approaches to personality assessment have focused on the associations between social media and other digital records with established personality measures. The goal of this article is to expand the potential of machine learning approaches to personality assessment by embedding it in a more comprehensive construct validation framework. We review recent applications of machine learning to personality assessment, place machine learning research in the broader context of fundamental principles of construct validation, and provide recommendations for how to use machine learning to advance our understanding of personality.", "year": 2019, "referenceCount": 68, "citationCount": 117, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Psychology"], "authors": [{"authorId": "5199283", "name": "W. Bleidorn"}, {"authorId": "2066036", "name": "C. Hopwood"}]}, {"paperId": "5327bb691a1c63791a06de2d3f0478e47785add5", "url": "https://www.semanticscholar.org/paper/5327bb691a1c63791a06de2d3f0478e47785add5", "title": "Predicting Diabetes Mellitus With Machine Learning Techniques", "abstract": "Diabetes mellitus is a chronic disease characterized by hyperglycemia. It may cause many complications. According to the growing morbidity in recent years, in 2040, the world’s diabetic patients will reach 642 million, which means that one of the ten adults in the future is suffering from diabetes. There is no doubt that this alarming figure needs great attention. With the rapid development of machine learning, machine learning has been applied to many aspects of medical health. In this study, we used decision tree, random forest and neural network to predict diabetes mellitus. The dataset is the hospital physical examination data in Luzhou, China. It contains 14 attributes. In this study, five-fold cross validation was used to examine the models. In order to verity the universal applicability of the methods, we chose some methods that have the better performance to conduct independent test experiments. We randomly selected 68994 healthy people and diabetic patients’ data, respectively as training set. Due to the data unbalance, we randomly extracted 5 times data. And the result is the average of these five experiments. In this study, we used principal component analysis (PCA) and minimum redundancy maximum relevance (mRMR) to reduce the dimensionality. The results showed that prediction with random forest could reach the highest accuracy (ACC = 0.8084) when all the attributes were used.", "year": 2018, "referenceCount": 74, "citationCount": 356, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "144268946", "name": "Q. Zou"}, {"authorId": "26953868", "name": "Kaiyang Qu"}, {"authorId": "2112602289", "name": "Ya-ling Luo"}, {"authorId": "2053677281", "name": "Dehui Yin"}, {"authorId": "144250293", "name": "Y. Ju"}, {"authorId": "144256490", "name": "Hua Tang"}]}, {"paperId": "0f5476c9629f8093e8ba8c6a41868415c6a7f2f1", "url": "https://www.semanticscholar.org/paper/0f5476c9629f8093e8ba8c6a41868415c6a7f2f1", "title": "Stealing Hyperparameters in Machine Learning", "abstract": "Hyperparameters are critical in machine learning, as different hyperparameters often result in models with significantly different performance. Hyperparameters may be deemed confidential because of their commercial value and the confidentiality of the proprietary algorithms that the learner uses to learn them. In this work, we propose attacks on stealing the hyperparameters that are learned by a learner. We call our attacks hyperparameter stealing attacks. Our attacks are applicable to a variety of popular machine learning algorithms such as ridge regression, logistic regression, support vector machine, and neural network. We evaluate the effectiveness of our attacks both theoretically and empirically. For instance, we evaluate our attacks on Amazon Machine Learning. Our results demonstrate that our attacks can accurately steal hyperparameters. We also study countermeasures. Our results highlight the need for new defenses against our hyperparameter stealing attacks for certain machine learning algorithms.", "year": 2018, "referenceCount": 53, "citationCount": 312, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1789625", "name": "Binghui Wang"}, {"authorId": "144516687", "name": "N. Gong"}]}, {"paperId": "7d065e649e3bfc7d6d36166f50eab37b8404eae0", "url": "https://www.semanticscholar.org/paper/7d065e649e3bfc7d6d36166f50eab37b8404eae0", "title": "Interpretable Machine Learning in Healthcare", "abstract": "This tutorial extensively covers the definitions, nuances, challenges, and requirements for the design of interpretable and explainable machine learning models and systems in healthcare. We discuss many uses in which interpretable machine learning models are needed in healthcare and how they should be deployed. Additionally, we explore the landscape of recent advances to address the challenges model interpretability in healthcare and also describe how one would go about choosing the right interpretable machine learnig algorithm for a given problem in healthcare.", "year": 2018, "referenceCount": 46, "citationCount": 304, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145919340", "name": "M. Ahmad"}, {"authorId": "1752398", "name": "A. Teredesai"}, {"authorId": "36979326", "name": "C. Eckert"}]}, {"paperId": "29524f145db94cab2336da99f157e869d805dead", "url": "https://www.semanticscholar.org/paper/29524f145db94cab2336da99f157e869d805dead", "title": "SoK: Security and Privacy in Machine Learning", "abstract": "Advances in machine learning (ML) in recent years have enabled a dizzying array of applications such as data analytics, autonomous systems, and security diagnostics. ML is now pervasive—new systems and models are being deployed in every domain imaginable, leading to widespread deployment of software based inference and decision making. There is growing recognition that ML exposes new vulnerabilities in software systems, yet the technical community's understanding of the nature and extent of these vulnerabilities remains limited. We systematize findings on ML security and privacy, focusing on attacks identified on these systems and defenses crafted to date.We articulate a comprehensive threat model for ML, and categorize attacks and defenses within an adversarial framework. Key insights resulting from works both in the ML and security communities are identified and the effectiveness of approaches are related to structural elements of ML algorithms and the data used to train them. In particular, it is apparent that constructing a theoretical understanding of the sensitivity of modern ML algorithms to the data they analyze, à la PAC theory, will foster a science of security and privacy in ML.", "year": 2018, "referenceCount": 134, "citationCount": 324, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1967156", "name": "Nicolas Papernot"}, {"authorId": "144061974", "name": "P. Mcdaniel"}, {"authorId": "2370629", "name": "Arunesh Sinha"}, {"authorId": "1796536", "name": "Michael P. Wellman"}]}, {"paperId": "2a944564c2466883ec14a6f6ef461f0e34d21b38", "url": "https://www.semanticscholar.org/paper/2a944564c2466883ec14a6f6ef461f0e34d21b38", "title": "Fairness in Machine Learning: Lessons from Political Philosophy", "abstract": "What does it mean for a machine learning model to be `fair', in terms which can be operationalised? Should fairness consist of ensuring everyone has an equal probability of obtaining some benefit, or should we aim instead to minimise the harms to the least advantaged? Can the relevant ideal be determined by reference to some alternative state of affairs in which a particular social pattern of discrimination does not exist? Various definitions proposed in recent literature make different assumptions about what terms like discrimination and fairness mean and how they can be defined in mathematical terms. Questions of discrimination, egalitarianism and justice are of significant interest to moral and political philosophers, who have expended significant efforts in formalising and defending these central concepts. It is therefore unsurprising that attempts to formalise `fairness' in machine learning contain echoes of these old philosophical debates. This paper draws on existing work in moral and political philosophy in order to elucidate emerging debates about fair machine learning.", "year": 2017, "referenceCount": 42, "citationCount": 280, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Sociology", "Computer Science"], "authors": [{"authorId": "144147883", "name": "R. Binns"}]}, {"paperId": "0cc6dbfd929bc816d507527993f55f9b4e88615d", "url": "https://www.semanticscholar.org/paper/0cc6dbfd929bc816d507527993f55f9b4e88615d", "title": "Machine learning & artificial intelligence in the quantum domain: a review of recent progress", "abstract": "Quantum information technologies, on the one hand, and intelligent learning systems, on the other, are both emergent technologies that are likely to have a transformative impact on our society in the future. The respective underlying fields of basic research—quantum information versus machine learning (ML) and artificial intelligence (AI)—have their own specific questions and challenges, which have hitherto been investigated largely independently. However, in a growing body of recent work, researchers have been probing the question of the extent to which these fields can indeed learn and benefit from each other. Quantum ML explores the interaction between quantum computing and ML, investigating how results and techniques from one field can be used to solve the problems of the other. Recently we have witnessed significant breakthroughs in both directions of influence. For instance, quantum computing is finding a vital application in providing speed-ups for ML problems, critical in our ‘big data’ world. Conversely, ML already permeates many cutting-edge technologies and may become instrumental in advanced quantum technologies. Aside from quantum speed-up in data analysis, or classical ML optimization used in quantum experiments, quantum enhancements have also been (theoretically) demonstrated for interactive learning tasks, highlighting the potential of quantum-enhanced learning agents. Finally, works exploring the use of AI for the very design of quantum experiments and for performing parts of genuine research autonomously, have reported their first successes. Beyond the topics of mutual enhancement—exploring what ML/AI can do for quantum physics and vice versa—researchers have also broached the fundamental issue of quantum generalizations of learning and AI concepts. This deals with questions of the very meaning of learning and intelligence in a world that is fully described by quantum mechanics. In this review, we describe the main ideas, recent developments and progress in a broad spectrum of research investigating ML and AI in the quantum domain.", "year": 2017, "referenceCount": 375, "citationCount": 507, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Computer Science", "Medicine"], "authors": [{"authorId": "2878563", "name": "V. Dunjko"}, {"authorId": "32534184", "name": "H. Briegel"}]}, {"paperId": "8285e1b5536ce11d55462ae757f61c75ec6773c6", "url": "https://www.semanticscholar.org/paper/8285e1b5536ce11d55462ae757f61c75ec6773c6", "title": "The Frontiers of Fairness in Machine Learning", "abstract": "The last few years have seen an explosion of academic and popular interest in algorithmic fairness. Despite this interest and the volume and velocity of work that has been produced recently, the fundamental science of fairness in machine learning is still in a nascent state. In March 2018, we convened a group of experts as part of a CCC visioning workshop to assess the state of the field, and distill the most promising research directions going forward. This report summarizes the findings of that workshop. Along the way, it surveys recent theoretical work in the field and points towards promising directions for research.", "year": 2018, "referenceCount": 64, "citationCount": 276, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2082393", "name": "A. Chouldechova"}, {"authorId": "1682008", "name": "Aaron Roth"}]}, {"paperId": "d4de528645fdfc6d954364a8e6eeeed9480ccfa2", "url": "https://www.semanticscholar.org/paper/d4de528645fdfc6d954364a8e6eeeed9480ccfa2", "title": "Machine Learning for Networking: Workflow, Advances and Opportunities", "abstract": "Recently, machine learning has been used in every possible field to leverage its amazing power. For a long time, the networking and distributed computing system is the key infrastructure to provide efficient computational resources for machine learning. Networking itself can also benefit from this promising technology. This article focuses on the application of MLN, which can not only help solve the intractable old network questions but also stimulate new network applications. In this article, we summarize the basic workflow to explain how to apply machine learning technology in the networking domain. Then we provide a selective survey of the latest representative advances with explanations of their design principles and benefits. These advances are divided into several network design objectives and the detailed information of how they perform in each step of MLN workflow is presented. Finally, we shed light on the new opportunities in networking design and community building of this new inter-discipline. Our goal is to provide a broad research guideline on networking with machine learning to help motivate researchers to develop innovative algorithms, standards and frameworks.", "year": 2017, "referenceCount": 18, "citationCount": 278, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109018752", "name": "Mowei Wang"}, {"authorId": "143905357", "name": "Yong Cui"}, {"authorId": "2153687403", "name": "Xin Wang"}, {"authorId": "1994540", "name": "Shihan Xiao"}, {"authorId": "1727978", "name": "Junchen Jiang"}]}, {"paperId": "8d7238eea00059deb446b6309bcae2901c966049", "url": "https://www.semanticscholar.org/paper/8d7238eea00059deb446b6309bcae2901c966049", "title": "Predicting the Future - Big Data, Machine Learning, and Clinical Medicine.", "abstract": "The algorithms of machine learning, which can sift through vast numbers of variables looking for combinations that reliably predict outcomes, will improve prognosis, displace much of the work of radiologists and anatomical pathologists, and improve diagnostic accuracy.", "year": 2016, "referenceCount": 8, "citationCount": 1509, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "3797258", "name": "Z. Obermeyer"}, {"authorId": "39714312", "name": "E. Emanuel"}]}, {"paperId": "1ed33896e82cc3810b349cdffc2039f0b8edd82e", "url": "https://www.semanticscholar.org/paper/1ed33896e82cc3810b349cdffc2039f0b8edd82e", "title": "Deep learning and its applications to machine health monitoring", "abstract": null, "year": 2019, "referenceCount": 110, "citationCount": 1220, "influentialCitationCount": 33, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49832912", "name": "Rui Zhao"}, {"authorId": "35374692", "name": "Ruqiang Yan"}, {"authorId": "48354147", "name": "Zhenghua Chen"}, {"authorId": "144067957", "name": "K. Mao"}, {"authorId": "48319740", "name": "Peng Wang"}, {"authorId": "1700762", "name": "R. Gao"}]}, {"paperId": "920e561cee4fd4888212ed127d51aa09c02be6c3", "url": "https://www.semanticscholar.org/paper/920e561cee4fd4888212ed127d51aa09c02be6c3", "title": "Advances in Financial Machine Learning", "abstract": "Machine learning (ML) is changing virtually every aspect of our lives. Today ML algorithms accomplish tasks that until recently only expert humans could perform. As it relates to finance, this is the most exciting time to adopt a disruptive technology that will transform how everyone invests for generations. Readers will learn how to structure Big data in a way that is amenable to ML algorithms; how to conduct research with ML algorithms on that data; how to use supercomputing methods; how to backtest your discoveries while avoiding false positives. The book addresses real-life problems faced by practitioners on a daily basis, and explains scientifically sound solutions using math, supported by code and examples. Readers become active users who can test the proposed solutions in their particular setting. Written by a recognized expert and portfolio manager, this book will equip investment professionals with the groundbreaking tools needed to succeed in modern finance.", "year": 2018, "referenceCount": 0, "citationCount": 186, "influentialCitationCount": 35, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "144647352", "name": "M. L. Prado"}]}, {"paperId": "5fdc2223709079ba5c0f78661cdf66cec2173258", "url": "https://www.semanticscholar.org/paper/5fdc2223709079ba5c0f78661cdf66cec2173258", "title": "Current Applications and Future Impact of Machine Learning in Radiology.", "abstract": "Recent advances and future perspectives of machine learning techniques offer promising applications in medical imaging. Machine learning has the potential to improve different steps of the radiology workflow including order scheduling and triage, clinical decision support systems, detection and interpretation of findings, postprocessing and dose estimation, examination quality control, and radiology reporting. In this article, the authors review examples of current applications of machine learning and artificial intelligence techniques in diagnostic radiology. In addition, the future impact and natural extension of these techniques in radiology practice are discussed.", "year": 2018, "referenceCount": 92, "citationCount": 411, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2028947", "name": "G. Choy"}, {"authorId": "2088138", "name": "O. Khalilzadeh"}, {"authorId": "37305969", "name": "Mark H. Michalski"}, {"authorId": "1788855", "name": "Synho Do"}, {"authorId": "8132193", "name": "A. Samir"}, {"authorId": "3135569", "name": "O. Pianykh"}, {"authorId": "144304449", "name": "J. R. Geis"}, {"authorId": "11577160", "name": "P. Pandharipande"}, {"authorId": "144685698", "name": "J. Brink"}, {"authorId": "26654844", "name": "K. Dreyer"}]}, {"paperId": "161ce338538f94b0b9be51ae2336db0aa4b012e5", "url": "https://www.semanticscholar.org/paper/161ce338538f94b0b9be51ae2336db0aa4b012e5", "title": "Potential Biases in Machine Learning Algorithms Using Electronic Health Record Data", "abstract": "A promise of machine learning in health care is the avoidance of biases in diagnosis and treatment; a computer algorithm could objectively synthesize and interpret the data in the medical record. Integration of machine learning with clinical decision support tools, such as computerized alerts or diagnostic support, may offer physicians and others who provide health care targeted and timely information that can improve clinical decisions. Machine learning algorithms, however, may also be subject to biases. The biases include those related to missing data and patients not identified by algorithms, sample size and underestimation, and misclassification and measurement error. There is concern that biases and deficiencies in the data used by machine learning algorithms may contribute to socioeconomic disparities in health care. This Special Communication outlines the potential biases that may be introduced into machine learning–based clinical decision support tools that use electronic health record data and proposes potential solutions to the problems of overreliance on automation, algorithms based on biased data, and algorithms that do not provide information that is clinically meaningful. Existing health care disparities should not be amplified by thoughtless or excessive reliance on machines.", "year": 2018, "referenceCount": 32, "citationCount": 499, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "5086547", "name": "M. Gianfrancesco"}, {"authorId": "2364709", "name": "S. Tamang"}, {"authorId": "5441960", "name": "J. Yazdany"}, {"authorId": "5589030", "name": "G. Schmajuk"}]}, {"paperId": "fa9906b466bbbff3a8c206b499cd34323a91d1b2", "url": "https://www.semanticscholar.org/paper/fa9906b466bbbff3a8c206b499cd34323a91d1b2", "title": "Points of Significance: Statistics versus machine learning", "abstract": null, "year": 2018, "referenceCount": 14, "citationCount": 438, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1700231", "name": "D. Bzdok"}, {"authorId": "145019044", "name": "Naomi Altman"}, {"authorId": "2802123", "name": "M. Krzywinski"}]}, {"paperId": "a450156bd8a1e3b808f93e959ae9e79983c5751b", "url": "https://www.semanticscholar.org/paper/a450156bd8a1e3b808f93e959ae9e79983c5751b", "title": "Controlling an organic synthesis robot with machine learning to search for new reactivity", "abstract": null, "year": 2018, "referenceCount": 29, "citationCount": 316, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "143833570", "name": "J. Granda"}, {"authorId": "51094241", "name": "Liva Donina"}, {"authorId": "8624338", "name": "Vincenza Dragone"}, {"authorId": "144520265", "name": "D. Long"}, {"authorId": "144141592", "name": "L. Cronin"}]}, {"paperId": "66ce6a5b7f3e888f4ab75054bb9cf0271bb6f012", "url": "https://www.semanticscholar.org/paper/66ce6a5b7f3e888f4ab75054bb9cf0271bb6f012", "title": "A strategy to apply machine learning to small datasets in materials science", "abstract": null, "year": 2018, "referenceCount": 65, "citationCount": 300, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "2153391511", "name": "Ying Zhang"}, {"authorId": "2059987839", "name": "Chen Ling"}]}, {"paperId": "33d9d4593d44792e17a045e5f3407f0fe7a40dd1", "url": "https://www.semanticscholar.org/paper/33d9d4593d44792e17a045e5f3407f0fe7a40dd1", "title": "Machine learning of accurate energy-conserving molecular force fields", "abstract": "The law of energy conservation is used to develop an efficient machine learning approach to construct accurate force fields. Using conservation of energy—a fundamental property of closed classical and quantum mechanical systems—we develop an efficient gradient-domain machine learning (GDML) approach to construct accurate molecular force fields using a restricted number of samples from ab initio molecular dynamics (AIMD) trajectories. The GDML implementation is able to reproduce global potential energy surfaces of intermediate-sized molecules with an accuracy of 0.3 kcal mol−1 for energies and 1 kcal mol−1 Å̊−1 for atomic forces using only 1000 conformational geometries for training. We demonstrate this accuracy for AIMD trajectories of molecules, including benzene, toluene, naphthalene, ethanol, uracil, and aspirin. The challenge of constructing conservative force fields is accomplished in our work by learning in a Hilbert space of vector-valued functions that obey the law of energy conservation. The GDML approach enables quantitative molecular dynamics simulations for molecules at a fraction of cost of explicit AIMD calculations, thereby allowing the construction of efficient force fields with the accuracy and transferability of high-level ab initio methods.", "year": 2016, "referenceCount": 72, "citationCount": 635, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine", "Computer Science"], "authors": [{"authorId": "7631063", "name": "Stefan Chmiela"}, {"authorId": "2462983", "name": "A. Tkatchenko"}, {"authorId": "10667063", "name": "H. E. Sauceda"}, {"authorId": "5667638", "name": "I. Poltavsky"}, {"authorId": "33075217", "name": "Kristof T. Schütt"}, {"authorId": "145034054", "name": "K. Müller"}]}, {"paperId": "775a4e375cc79b53b94e37fa3eedff481823e4a6", "url": "https://www.semanticscholar.org/paper/775a4e375cc79b53b94e37fa3eedff481823e4a6", "title": "Efficient and Robust Automated Machine Learning", "abstract": "The success of machine learning in a broad range of applications has led to an ever-growing demand for machine learning systems that can be used off the shelf by non-experts. To be effective in practice, such systems need to automatically choose a good algorithm and feature preprocessing steps for a new dataset at hand, and also set their respective hyperparameters. Recent work has started to tackle this automated machine learning (AutoML) problem with the help of efficient Bayesian optimization methods. Building on this, we introduce a robust new AutoML system based on scikit-learn (using 15 classifiers, 14 feature preprocessing methods, and 4 data preprocessing methods, giving rise to a structured hypothesis space with 110 hyperparameters). This system, which we dub AUTO-SKLEARN, improves on existing AutoML methods by automatically taking into account past performance on similar datasets, and by constructing ensembles from the models evaluated during the optimization. Our system won the first phase of the ongoing ChaLearn AutoML challenge, and our comprehensive analysis on over 100 diverse datasets shows that it substantially outperforms the previous state of the art in AutoML. We also demonstrate the performance gains due to each of our contributions and derive insights into the effectiveness of the individual components of AUTO-SKLEARN.", "year": 2015, "referenceCount": 30, "citationCount": 1239, "influentialCitationCount": 176, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2868444", "name": "Matthias Feurer"}, {"authorId": "145227684", "name": "Aaron Klein"}, {"authorId": "2607675", "name": "Katharina Eggensperger"}, {"authorId": "2060551", "name": "J. T. Springenberg"}, {"authorId": "2058090778", "name": "Manuel Blum"}, {"authorId": "144661829", "name": "F. Hutter"}]}, {"paperId": "4e75a145f59400a8d646db770cc396de87d6b9d8", "url": "https://www.semanticscholar.org/paper/4e75a145f59400a8d646db770cc396de87d6b9d8", "title": "Image Reconstruction is a New Frontier of Machine Learning", "abstract": "Over past several years, machine learning, or more generally artificial intelligence, has generated overwhelming research interest and attracted unprecedented public attention. As tomographic imaging researchers, we share the excitement from our imaging perspective [item 1) in the Appendix], and organized this special issue dedicated to the theme of “Machine learning for image reconstruction.” This special issue is a sister issue of the special issue published in May 2016 of this journal with the theme “Deep learning in medical imaging” [item 2) in the Appendix]. While the previous special issue targeted medical image processing/analysis, this special issue focuses on data-driven tomographic reconstruction. These two special issues are highly complementary, since image reconstruction and image analysis are two of the main pillars for medical imaging. Together we cover the whole workflow of medical imaging: from tomographic raw data/features to reconstructed images and then extracted diagnostic features/readings.", "year": 2018, "referenceCount": 78, "citationCount": 279, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2108295460", "name": "Ge Wang"}, {"authorId": "2998762", "name": "J. C. Ye"}, {"authorId": "3367666", "name": "K. Mueller"}, {"authorId": "1711572", "name": "J. Fessler"}]}, {"paperId": "e3f8c8253767b6fe0891025cdf772cd286337921", "url": "https://www.semanticscholar.org/paper/e3f8c8253767b6fe0891025cdf772cd286337921", "title": "A Proposal on Machine Learning via Dynamical Systems", "abstract": null, "year": 2017, "referenceCount": 11, "citationCount": 435, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1789499", "name": "E. Weinan"}]}, {"paperId": "ca62b1904a4f3982b172c85204a588f494cb6a22", "url": "https://www.semanticscholar.org/paper/ca62b1904a4f3982b172c85204a588f494cb6a22", "title": "Taking Human out of Learning Applications: A Survey on Automated Machine Learning", "abstract": "Machine learning techniques have deeply rooted in our everyday life. However, since it is knowledge- and labor-intensive to pursue good learning performance, human experts are heavily involved in every aspect of machine learning. In order to make machine learning techniques easier to apply and reduce the demand for experienced human experts, automated machine learning (AutoML) has emerged as a hot topic with both industrial and academic interest. In this paper, we provide an up to date survey on AutoML. First, we introduce and define the AutoML problem, with inspiration from both realms of automation and machine learning. Then, we propose a general AutoML framework that not only covers most existing approaches to date but also can guide the design for new methods. Subsequently, we categorize and review the existing works from two aspects, i.e., the problem setup and the employed techniques. Finally, we provide a detailed analysis of AutoML approaches and explain the reasons underneath their successful applications. We hope this survey can serve as not only an insightful guideline for AutoML beginners but also an inspiration for future research.", "year": 2018, "referenceCount": 222, "citationCount": 256, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3259992", "name": "Quanming Yao"}, {"authorId": "9523174", "name": "Mengshuo Wang"}, {"authorId": "1742688", "name": "H. Escalante"}, {"authorId": "1743797", "name": "I. Guyon"}, {"authorId": "2166411332", "name": "Yi-Qi Hu"}, {"authorId": "2110463675", "name": "Yu-Feng Li"}, {"authorId": "47178228", "name": "Wei-Wei Tu"}, {"authorId": "152290618", "name": "Qiang Yang"}, {"authorId": "144705629", "name": "Yang Yu"}]}, {"paperId": "ad8faf6376e0b0a636f2a5210abc70c41d3d8a91", "url": "https://www.semanticscholar.org/paper/ad8faf6376e0b0a636f2a5210abc70c41d3d8a91", "title": "Quantum machine learning", "abstract": null, "year": 2016, "referenceCount": 168, "citationCount": 978, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2353247", "name": "J. Biamonte"}, {"authorId": "1756871", "name": "P. Wittek"}, {"authorId": "3438328", "name": "Nicola Pancotti"}, {"authorId": "3157522", "name": "P. Rebentrost"}, {"authorId": "3253856", "name": "N. Wiebe"}, {"authorId": "145762777", "name": "S. Lloyd"}]}, {"paperId": "959c9dbfceda3825787f75f63fd7c87f332dc271", "url": "https://www.semanticscholar.org/paper/959c9dbfceda3825787f75f63fd7c87f332dc271", "title": "Machine Learning-Based Sentiment Analysis for Twitter Accounts", "abstract": "Growth in the area of opinion mining and sentiment analysis has been rapid and aims to explore the opinions or text present on different platforms of social media through machine-learning techniques with sentiment, subjectivity analysis or polarity calculations. Despite the use of various machine-learning techniques and tools for sentiment analysis during elections, there is a dire need for a state-of-the-art approach. To deal with these challenges, the contribution of this paper includes the adoption of a hybrid approach that involves a sentiment analyzer that includes machine learning. Moreover, this paper also provides a comparison of techniques of sentiment analysis in the analysis of political views by applying supervised machine-learning algorithms such as Naive Bayes and support vector machines (SVM).", "year": 2018, "referenceCount": 60, "citationCount": 248, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "152757679", "name": "A. Hasan"}, {"authorId": "2069268061", "name": "Sana Moin"}, {"authorId": "145867316", "name": "Ahmad Karim"}, {"authorId": "1758091", "name": "Shahaboddin Shamshirband"}]}, {"paperId": "c46c0fc81d41d9561643d55f41626c5583b0b25e", "url": "https://www.semanticscholar.org/paper/c46c0fc81d41d9561643d55f41626c5583b0b25e", "title": "Machine Learning in Medicine.", "abstract": "Spurred by advances in processing power, memory, storage, and an unprecedented wealth of data, computers are being asked to tackle increasingly complex learning tasks, often with astonishing success. Computers have now mastered a popular variant of poker, learned the laws of physics from experimental data, and become experts in video games - tasks that would have been deemed impossible not too long ago. In parallel, the number of companies centered on applying complex data analysis to varying industries has exploded, and it is thus unsurprising that some analytic companies are turning attention to problems in health care. The purpose of this review is to explore what problems in medicine might benefit from such learning approaches and use examples from the literature to introduce basic concepts in machine learning. It is important to note that seemingly large enough medical data sets and adequate learning algorithms have been available for many decades, and yet, although there are thousands of papers applying machine learning algorithms to medical data, very few have contributed meaningfully to clinical care. This lack of impact stands in stark contrast to the enormous relevance of machine learning to many other industries. Thus, part of my effort will be to identify what obstacles there may be to changing the practice of medicine through statistical learning approaches, and discuss how these might be overcome.", "year": 2015, "referenceCount": 38, "citationCount": 1800, "influentialCitationCount": 24, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2077989", "name": "R. Deo"}]}, {"paperId": "4a8c332b09bb99333a8bce6a4640a20c1352aa63", "url": "https://www.semanticscholar.org/paper/4a8c332b09bb99333a8bce6a4640a20c1352aa63", "title": "A Survey on Security Threats and Defensive Techniques of Machine Learning: A Data Driven View", "abstract": "Machine learning is one of the most prevailing techniques in computer science, and it has been widely applied in image processing, natural language processing, pattern recognition, cybersecurity, and other fields. Regardless of successful applications of machine learning algorithms in many scenarios, e.g., facial recognition, malware detection, automatic driving, and intrusion detection, these algorithms and corresponding training data are vulnerable to a variety of security threats, inducing a significant performance decrease. Hence, it is vital to call for further attention regarding security threats and corresponding defensive techniques of machine learning, which motivates a comprehensive survey in this paper. Until now, researchers from academia and industry have found out many security threats against a variety of learning algorithms, including naive Bayes, logistic regression, decision tree, support vector machine (SVM), principle component analysis, clustering, and prevailing deep neural networks. Thus, we revisit existing security threats and give a systematic survey on them from two aspects, the training phase and the testing/inferring phase. After that, we categorize current defensive techniques of machine learning into four groups: security assessment mechanisms, countermeasures in the training phase, those in the testing or inferring phase, data security, and privacy. Finally, we provide five notable trends in the research on security threats and defensive techniques of machine learning, which are worth doing in-depth studies in future.", "year": 2018, "referenceCount": 109, "citationCount": 243, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48873711", "name": "Qiang Liu"}, {"authorId": "2112519091", "name": "Pan Li"}, {"authorId": "1681475", "name": "Wentao Zhao"}, {"authorId": "2089568220", "name": "Wei Cai"}, {"authorId": "144958145", "name": "Shui Yu"}, {"authorId": "143698682", "name": "Victor C. M. Leung"}]}, {"paperId": "95b8ea71e221314abc24d9912c408d9efb12e50d", "url": "https://www.semanticscholar.org/paper/95b8ea71e221314abc24d9912c408d9efb12e50d", "title": "Machine Learning", "abstract": null, "year": 2020, "referenceCount": 0, "citationCount": 3, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2140644613", "name": "Daniel Silveira Pereira"}]}, {"paperId": "3d1653512d2e85e0c46ce1c36657e7d4ae9a4d3e", "url": "https://www.semanticscholar.org/paper/3d1653512d2e85e0c46ce1c36657e7d4ae9a4d3e", "title": "ML-Plan: Automated machine learning via hierarchical planning", "abstract": null, "year": 2018, "referenceCount": 32, "citationCount": 124, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "33303942", "name": "Felix Mohr"}, {"authorId": "20851162", "name": "Marcel Wever"}, {"authorId": "1691955", "name": "E. Hüllermeier"}]}, {"paperId": "c7ce37d51ba01e17c9291f1dbf2ca8223b948b7f", "url": "https://www.semanticscholar.org/paper/c7ce37d51ba01e17c9291f1dbf2ca8223b948b7f", "title": "Machine learning for Internet of Things data analysis: A survey", "abstract": null, "year": 2017, "referenceCount": 158, "citationCount": 634, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35838436", "name": "M. Mahdavinejad"}, {"authorId": "143976214", "name": "M. Rezvan"}, {"authorId": "39393520", "name": "M. Barekatain"}, {"authorId": "49277935", "name": "Peyman Adibi"}, {"authorId": "1740880", "name": "P. Barnaghi"}, {"authorId": "144463965", "name": "A. Sheth"}]}, {"paperId": "f6d9106b0e169204a506eb1deec2b85e0f296e4a", "url": "https://www.semanticscholar.org/paper/f6d9106b0e169204a506eb1deec2b85e0f296e4a", "title": "Feature selection in machine learning: A new perspective", "abstract": null, "year": 2018, "referenceCount": 184, "citationCount": 754, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115669825", "name": "Jie Cai"}, {"authorId": "145619609", "name": "Jiawei Luo"}, {"authorId": "2117017967", "name": "Shulin Wang"}, {"authorId": "144823698", "name": "Sheng Yang"}]}, {"paperId": "b7621b358485eb3e34a874b97d1ecd6b5d5ac70b", "url": "https://www.semanticscholar.org/paper/b7621b358485eb3e34a874b97d1ecd6b5d5ac70b", "title": "Machine learning methods for solar radiation forecasting: A review", "abstract": null, "year": 2017, "referenceCount": 90, "citationCount": 905, "influentialCitationCount": 30, "isOpenAccess": true, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "2013408", "name": "C. Voyant"}, {"authorId": "2523574", "name": "G. Notton"}, {"authorId": "2606543", "name": "S. Kalogirou"}, {"authorId": "41174026", "name": "M. Nivet"}, {"authorId": "46325092", "name": "C. Paoli"}, {"authorId": "121644432", "name": "F. Motte"}, {"authorId": "31122309", "name": "A. Fouilloy"}]}, {"paperId": "7e355a8f42becb6648efc4cf0c129a7f560789be", "url": "https://www.semanticscholar.org/paper/7e355a8f42becb6648efc4cf0c129a7f560789be", "title": "Machine Learning Methods for Histopathological Image Analysis", "abstract": null, "year": 2017, "referenceCount": 116, "citationCount": 482, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3025343", "name": "D. Komura"}, {"authorId": "3324584", "name": "S. Ishikawa"}]}, {"paperId": "159eb7ca68d63300440d243671b9c185fff819d3", "url": "https://www.semanticscholar.org/paper/159eb7ca68d63300440d243671b9c185fff819d3", "title": "Machine Learning", "abstract": null, "year": 2020, "referenceCount": 5, "citationCount": 1, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2032197929", "name": "Ashrf Althbiti"}, {"authorId": "2136453743", "name": "Xiaogang Ma"}]}, {"paperId": "a821071ce32bdaa6130e618bb1ad1112a6a94915", "url": "https://www.semanticscholar.org/paper/a821071ce32bdaa6130e618bb1ad1112a6a94915", "title": "Machine learning in chemoinformatics and drug discovery.", "abstract": null, "year": 2018, "referenceCount": 115, "citationCount": 453, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2316213", "name": "Y. Lo"}, {"authorId": "5662611", "name": "Stefano E. Rensi"}, {"authorId": "4965649", "name": "Wen Torng"}, {"authorId": "144446128", "name": "R. Altman"}]}, {"paperId": "1d41d6ec4805f80b84a1ccd17f6753ba71e107f7", "url": "https://www.semanticscholar.org/paper/1d41d6ec4805f80b84a1ccd17f6753ba71e107f7", "title": "Gaussian Processes for Machine Learning (Adaptive Computation and Machine Learning)", "abstract": "Gaussian processes (GPs) provide a principled, practical, probabilistic approach to learning in kernel machines. GPs have received increased attention in the machine-learning community over the past decade, and this book provides a long-needed systematic and unified treatment of theoretical and practical aspects of GPs in machine learning. The treatment is comprehensive and self-contained, targeted at researchers and students in machine learning and applied statistics. The book deals with the supervised-learning problem for both regression and classification, and includes detailed algorithms. A wide variety of covariance (kernel) functions are presented and their properties discussed. Model selection is discussed both from a Bayesian and a classical perspective. Many connections to other well-known techniques from machine learning and statistics are discussed, including support-vector machines, neural networks, splines, regularization networks, relevance vector machines and others. Theoretical issues including learning curves and the PAC-Bayesian framework are treated, and several approximation methods for learning with large datasets are discussed. The book contains illustrative examples and exercises, and code and datasets are available on the Web. Appendixes provide mathematical background and a discussion of Gaussian Markov processes.", "year": 2005, "referenceCount": 0, "citationCount": 2751, "influentialCitationCount": 595, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3472959", "name": "C. Rasmussen"}, {"authorId": "145715698", "name": "Christopher K. I. Williams"}]}]}