{"total": 5120627, "offset": 2000, "next": 2100, "data": [{"paperId": "3f631c73b429fd2e59ab0b2a80a12a42d6fd00a8", "url": "https://www.semanticscholar.org/paper/3f631c73b429fd2e59ab0b2a80a12a42d6fd00a8", "title": "Pattern classification with missing data: a review", "abstract": null, "year": 2010, "referenceCount": 98, "citationCount": 572, "influentialCitationCount": 50, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1398630827", "name": "P. J. García-Laencina"}, {"authorId": "1398630816", "name": "J. Sancho-Gómez"}, {"authorId": "1398493114", "name": "A. Figueiras-Vidal"}]}, {"paperId": "9d72c286f24a51e24ae9e80e957d1f999baee17b", "url": "https://www.semanticscholar.org/paper/9d72c286f24a51e24ae9e80e957d1f999baee17b", "title": "Adding vs. Averaging in Distributed Primal-Dual Optimization", "abstract": "Distributed optimization methods for large-scale machine learning suffer from a communication bottleneck. It is difficult to reduce this bottleneck while still efficiently and accurately aggregating partial work from different machines. In this paper, we present a novel generalization of the recent communication-efficient primal-dual framework (COCOA) for distributed optimization. Our framework, COCOA+, allows for additive combination of local updates to the global parameters at each iteration, whereas previous schemes with convergence guarantees only allow conservative averaging. We give stronger (primal-dual) convergence rate guarantees for both COCOA as well as our new variants, and generalize the theory for both methods to cover non-smooth convex loss functions. We provide an extensive experimental comparison that shows the markedly improved performance of COCOA+ on several real-world distributed datasets, especially when scaling up the number of machines.", "year": 2015, "referenceCount": 45, "citationCount": 155, "influentialCitationCount": 28, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2008023", "name": "Chenxin Ma"}, {"authorId": "145260024", "name": "Virginia Smith"}, {"authorId": "2456863", "name": "Martin Jaggi"}, {"authorId": "1694621", "name": "Michael I. Jordan"}, {"authorId": "2662221", "name": "Peter Richtárik"}, {"authorId": "144696183", "name": "Martin Takác"}]}, {"paperId": "d73149832c5dc18c8a74b2cc0924eceb51be2e60", "url": "https://www.semanticscholar.org/paper/d73149832c5dc18c8a74b2cc0924eceb51be2e60", "title": "Hands-On Machine Learning with R", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 181, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46216076", "name": "Bradley C. Boehmke"}, {"authorId": "35664117", "name": "Brandon M. Greenwell"}]}, {"paperId": "2e5d2f2dc01b150dffc163a9f457848e9b5b5c38", "url": "https://www.semanticscholar.org/paper/2e5d2f2dc01b150dffc163a9f457848e9b5b5c38", "title": "On Hyperparameter Optimization of Machine Learning Algorithms: Theory and Practice", "abstract": null, "year": 2020, "referenceCount": 131, "citationCount": 344, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1624030637", "name": "Li Yang"}, {"authorId": "1743065", "name": "A. Shami"}]}, {"paperId": "1dae4d61cd74cc919ecc638bde6b7125728ea97b", "url": "https://www.semanticscholar.org/paper/1dae4d61cd74cc919ecc638bde6b7125728ea97b", "title": "Domain Adaptation via Transfer Component Analysis", "abstract": "Domain adaptation allows knowledge from a source domain to be transferred to a different but related target domain. Intuitively, discovering a good feature representation across domains is crucial. In this paper, we first propose to find such a representation through a new learning method, transfer component analysis (TCA), for domain adaptation. TCA tries to learn some transfer components across domains in a reproducing kernel Hilbert space using maximum mean miscrepancy. In the subspace spanned by these transfer components, data properties are preserved and data distributions in different domains are close to each other. As a result, with the new representations in this subspace, we can apply standard machine learning methods to train classifiers or regression models in the source domain for use in the target domain. Furthermore, in order to uncover the knowledge hidden in the relations between the data labels from the source and target domains, we extend TCA in a semisupervised learning setting, which encodes label information into transfer components learning. We call this extension semisupervised TCA. The main contribution of our work is that we propose a novel dimensionality reduction framework for reducing the distance between domains in a latent space for domain adaptation. We propose both unsupervised and semisupervised feature extraction approaches, which can dramatically reduce the distance between domain distributions by projecting data onto the learned transfer components. Finally, our approach can handle large datasets and naturally lead to out-of-sample generalization. The effectiveness and efficiency of our approach are verified by experiments on five toy datasets and two real-world applications: cross-domain indoor WiFi localization and cross-domain text classification.", "year": 2009, "referenceCount": 52, "citationCount": 2857, "influentialCitationCount": 579, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "1746914", "name": "Sinno Jialin Pan"}, {"authorId": "1807998", "name": "I. Tsang"}, {"authorId": "145193332", "name": "J. Kwok"}, {"authorId": "152290618", "name": "Qiang Yang"}]}, {"paperId": "3614e6b9313b0093bda33b719c28708637237323", "url": "https://www.semanticscholar.org/paper/3614e6b9313b0093bda33b719c28708637237323", "title": "A Comparison of Supervised Machine Learning Techniques for Predicting Short-Term In-Hospital Length of Stay among Diabetic Patients", "abstract": "Diabetes is a life-altering medical condition that affects millions of people and results in many hospitalizations per year. Consequently, predicting the length of stay of in-hospital diabetic patients has become increasingly important for staffing and resource planning. Although statistical methods have been used to predict length of stay in hospitalized patients, many powerful machine learning techniques have not yet been explored. In this paper, we compare and discuss the performance of various supervised machine learning algorithms (i.e., Multiple linear regression, support vector machines, multi-task learning, and random forests) for predicting long versus short-term length of stay of hospitalized diabetic patients.", "year": 2014, "referenceCount": 26, "citationCount": 51, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38569173", "name": "A. Morton"}, {"authorId": "1492038511", "name": "Eman N. Marzban"}, {"authorId": "46599451", "name": "G. Giannoulis"}, {"authorId": "27875247", "name": "Ayush Patel"}, {"authorId": "2154233", "name": "R. Aparasu"}, {"authorId": "1706204", "name": "I. Kakadiaris"}]}, {"paperId": "59c023d550a1673826c6f0e1751bf47e70afc99a", "url": "https://www.semanticscholar.org/paper/59c023d550a1673826c6f0e1751bf47e70afc99a", "title": "Face recognition based on extreme learning machine", "abstract": null, "year": 2011, "referenceCount": 33, "citationCount": 205, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2459175", "name": "Weiwei Zong"}, {"authorId": "145678691", "name": "G. Huang"}]}, {"paperId": "07b5093aace8e485e7d23b83edb6351618138127", "url": "https://www.semanticscholar.org/paper/07b5093aace8e485e7d23b83edb6351618138127", "title": "Does Distributionally Robust Supervised Learning Give Robust Classifiers?", "abstract": "Distributionally Robust Supervised Learning (DRSL) is necessary for building reliable machine learning systems. When machine learning is deployed in the real world, its performance can be significantly degraded because test data may follow a different distribution from training data. DRSL with f-divergences explicitly considers the worst-case distribution shift by minimizing the adversarially reweighted training loss. In this paper, we analyze this DRSL, focusing on the classification scenario. Since the DRSL is explicitly formulated for a distribution shift scenario, we naturally expect it to give a robust classifier that can aggressively handle shifted distributions. However, surprisingly, we prove that the DRSL just ends up giving a classifier that exactly fits the given training distribution, which is too pessimistic. This pessimism comes from two sources: the particular losses used in classification and the fact that the variety of distributions to which the DRSL tries to be robust is too wide. Motivated by our analysis, we propose simple DRSL that overcomes this pessimism and empirically demonstrate its effectiveness.", "year": 2016, "referenceCount": 37, "citationCount": 161, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48594758", "name": "Weihua Hu"}, {"authorId": "47537639", "name": "Gang Niu"}, {"authorId": "73355331", "name": "Issei Sato"}, {"authorId": "67154907", "name": "Masashi Sugiyama"}]}, {"paperId": "7eb733c8ac1b3d1dd8b50e066ddae10769e3b46e", "url": "https://www.semanticscholar.org/paper/7eb733c8ac1b3d1dd8b50e066ddae10769e3b46e", "title": "CrypTen: Secure Multi-Party Computation Meets Machine Learning", "abstract": "Secure multi-party computation (MPC) allows parties to perform computations on data while keeping that data private. This capability has great potential for machine-learning applications: it facilitates training of machine-learning models on private data sets owned by different parties, evaluation of one party’s private model using another party’s private data, etc. Although a range of studies implement machine-learning models via secure MPC, such implementations are not yet mainstream. Adoption of secure MPC is hampered by the absence of ﬂexible software frameworks that “speak the language” of machine-learning researchers and engineers. To foster adoption of secure MPC in machine learning, we present C RYP T EN : a software framework that exposes popular secure MPC primitives via abstractions that are common in modern machine-learning frameworks, such as tensor computations, automatic differentiation, and modular neural networks. This paper describes the design of C RYP T EN and measure its performance on state-of-the-art models for text classiﬁcation, speech recognition, and image classiﬁcation. Our benchmarks show that C RYP T EN ’s GPU support and high-performance communication between (an arbitrary number of) parties allows it to perform efﬁcient private evaluation of modern machine-learning models under a semi-honest threat model. For example, two parties using C RYP T EN can securely predict phonemes in speech recordings using Wav2Letter [18] faster than real-time. We hope that C RYP T EN will spur adoption of secure MPC in the machine-learning community.", "year": 2021, "referenceCount": 80, "citationCount": 77, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2713842", "name": "Brian Knott"}, {"authorId": "2262405", "name": "Shobha Venkataraman"}, {"authorId": "144479015", "name": "Awni Y. Hannun"}, {"authorId": "2264597", "name": "Shubho Sengupta"}, {"authorId": "3407874", "name": "Mark Ibrahim"}, {"authorId": "1803520", "name": "L. V. D. Maaten"}]}, {"paperId": "cf5dfc4a9f7a82b32640128ca10832eace55880e", "url": "https://www.semanticscholar.org/paper/cf5dfc4a9f7a82b32640128ca10832eace55880e", "title": "Quantum machine learning models are kernel methods", "abstract": "With near-term quantum devices available and the race for fault-tolerant quantum computers in full swing, researchers became interested in the question of what happens if we replace a machine learning model with a quantum circuit. While such “quantum models” are sometimes called “quantum neural networks”, it has been repeatedly noted that their mathematical structure is actually much more closely related to kernel methods: they analyse data in high-dimensional Hilbert spaces to which we only have access through inner products revealed by measurements. This technical manuscript summarises, formalises and extends the link by systematically rephrasing quantum models as a kernel method. It shows that most near-term and fault-tolerant quantum models can be replaced by a general support vector machine whose kernel computes distances between data-encoding quantum states. In particular, kernel-based training is guaranteed to find better or equally good quantum models than variational circuit training. Overall, the kernel perspective of quantum machine learning tells us that the way that data is encoded into quantum states is the main ingredient that can potentially set quantum models apart from classical machine learning models.", "year": 2021, "referenceCount": 34, "citationCount": 124, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Mathematics"], "authors": [{"authorId": "3048564", "name": "M. Schuld"}]}, {"paperId": "45e21cb575c6d1de13c22bfd3e09072c9354e5d7", "url": "https://www.semanticscholar.org/paper/45e21cb575c6d1de13c22bfd3e09072c9354e5d7", "title": "From Theories to Queries: Active Learning in Practice", "abstract": "This article surveys recent work in active learning aimed at making it more practical for real-world use. In general, active learning systems aim to make machine learning more economical, since they can participate in the acquisition of their own training data. An active learner might iteratively select informative query instances to be labeled by an oracle, for example. Work over the last two decades has shown that such approaches are eective at maintaining accuracy while reducing training set size in many machine learning applications. However, as we begin to deploy active learning in real ongoing learning systems and data annotation projects, we are encountering unexpected problems|due in part to practical realities that violate the basic assumptions of earlier foundational work. I review some of these issues, and discuss recent work being done to address the challenges.", "year": 2011, "referenceCount": 66, "citationCount": 192, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1717452", "name": "Burr Settles"}]}, {"paperId": "a2b5cb0285d593dde7c5a1b844ab0361aebfc85d", "url": "https://www.semanticscholar.org/paper/a2b5cb0285d593dde7c5a1b844ab0361aebfc85d", "title": "Comparative Experiments on Disambiguating Word Senses: An Illustration of the Role of Bias in Machine Learning", "abstract": "This paper describes an experimental comparison of seven different learning algorithms on the problem of learning to disambiguate the meaning of a word from context. The algorithms tested include statistical, neural-network, decision-tree, rule-based, and case-based classification techniques. The specific problem tested involves disambiguating six senses of the word ``line'' using the words in the current and proceeding sentence as context. The statistical and neural-network methods perform the best on this particular problem and we discuss a potential reason for this observed difference. We also discuss the role of bias in machine learning and its importance in explaining performance differences observed on specific problems.", "year": 1996, "referenceCount": 73, "citationCount": 256, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1797655", "name": "R. Mooney"}]}, {"paperId": "7293d7440d89fc038d7e9ee8d1460cc9b3759478", "url": "https://www.semanticscholar.org/paper/7293d7440d89fc038d7e9ee8d1460cc9b3759478", "title": "Modern Multivariate Statistical Techniques: Regression, Classification, and Manifold Learning", "abstract": "Remarkable advances in computation and data storage and the ready availability of huge data sets have been the keys to the growth of the new disciplines of data mining and machine learning, while the enormous success of the Human Genome Project has opened up the field of bioinformatics. These exciting developments, which led to the introduction of many innovative statistical tools for high-dimensional data analysis, are described here in detail. The author takes a broad perspective; for the first time in a book on multivariate analysis, nonlinear methods are discussed in detail as well as linear methods. Techniques covered range from traditional multivariate methods, such as multiple regression, principal components, canonical variates, linear discriminant analysis, factor analysis, clustering, multidimensional scaling, and correspondence analysis, to the newer methods of density estimation, projection pursuit, neural networks, multivariate reduced-rank regression, nonlinear manifold learning, bagging, boosting, random forests, independent component analysis, support vector machines, and classification and regression trees. Another unique feature of this book is the discussion of database management systems. This book is appropriate for advanced undergraduate students, graduate students, and researchers in statistics, computer science, artificial intelligence, psychology, cognitive sciences, business, medicine, bioinformatics, and engineering. Familiarity with multivariable calculus, linear algebra, and probability and statistics is required. The book presents a carefully-integrated mixture of theory and applications, and of classical and modern multivariate statistical techniques, including Bayesian methods. There are over 60 interesting data sets used as examples in the book, over 200 exercises, and many color illustrations and photographs.", "year": 2008, "referenceCount": 504, "citationCount": 627, "influentialCitationCount": 56, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47209015", "name": "A. Izenman"}]}, {"paperId": "95d8ab48f213e01f33c3af0b34a0cc0e4fba9349", "url": "https://www.semanticscholar.org/paper/95d8ab48f213e01f33c3af0b34a0cc0e4fba9349", "title": "Drug-target interaction prediction: databases, web servers and computational models", "abstract": "Identification of drug-target interactions is an important process in drug discovery. Although high-throughput screening and other biological assays are becoming available, experimental methods for drug-target interaction identification remain to be extremely costly, time-consuming and challenging even nowadays. Therefore, various computational models have been developed to predict potential drug-target associations on a large scale. In this review, databases and web servers involved in drug-target identification and drug discovery are summarized. In addition, we mainly introduced some state-of-the-art computational models for drug-target interactions prediction, including network-based method, machine learning-based method and so on. Specially, for the machine learning-based method, much attention was paid to supervised and semi-supervised models, which have essential difference in the adoption of negative samples. Although significant improvements for drug-target interaction prediction have been obtained by many effective computational models, both network-based and machine learning-based methods have their disadvantages, respectively. Furthermore, we discuss the future directions of the network-based drug discovery and network approach for personalized drug discovery based on personalized medicine, genome sequencing, tumor clone-based network and cancer hallmark-based network. Finally, we discussed the new evaluation validation framework and the formulation of drug-target interactions prediction problem by more realistic regression formulation based on quantitative bioactivity data.", "year": 2016, "referenceCount": 89, "citationCount": 361, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "48283613", "name": "Xing Chen"}, {"authorId": "7590116", "name": "C. Yan"}, {"authorId": "2130057502", "name": "Xiaotian Zhang"}, {"authorId": "2115462781", "name": "Xu Zhang"}, {"authorId": "152130996", "name": "Feng Dai"}, {"authorId": "2111611501", "name": "Jian Yin"}, {"authorId": "1699819", "name": "Yongdong Zhang"}]}, {"paperId": "c95b487d304e9e56b2d10e26c4f86ec2defc447d", "url": "https://www.semanticscholar.org/paper/c95b487d304e9e56b2d10e26c4f86ec2defc447d", "title": "Engineering safety in machine learning", "abstract": "Machine learning algorithms are increasingly influencing our decisions and interacting with us in all parts of our daily lives. Therefore, just like for power plants, highways, and myriad other engineered sociotechnical systems, we must consider the safety of systems involving machine learning. In this paper, we first discuss the definition of safety in terms of risk, epistemic uncertainty, and the harm incurred by unwanted outcomes. Then we examine dimensions, such as the choice of cost function and the appropriateness of minimizing the empirical average training cost, along which certain real-world applications may not be completely amenable to the foundational principle of modern statistical machine learning: empirical risk minimization. In particular, we note an emerging dichotomy of applications: ones in which safety is important and risk minimization is not the complete story (we name these Type A applications), and ones in which safety is not so critical and risk minimization is sufficient (we name these Type B applications). Finally, we discuss how four different strategies for achieving safety in engineering (inherently safe design, safety reserves, safe fail, and procedural safeguards) can be mapped to the machine learning context through inter-pretability and causality of predictive models, objectives beyond expected prediction accuracy, human involvement for labeling difficult or rare examples, and user experience design of software.", "year": 2016, "referenceCount": 22, "citationCount": 84, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1712865", "name": "K. Varshney"}]}, {"paperId": "306a42dd3d56bca19221a99a8fb7128ef065d06a", "url": "https://www.semanticscholar.org/paper/306a42dd3d56bca19221a99a8fb7128ef065d06a", "title": "Closed-loop brain training: the science of neurofeedback", "abstract": null, "year": 2017, "referenceCount": 235, "citationCount": 668, "influentialCitationCount": 39, "isOpenAccess": true, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "1784059", "name": "R. Sitaram"}, {"authorId": "145605552", "name": "T. Ros"}, {"authorId": "2926555", "name": "L. Stoeckel"}, {"authorId": "144398737", "name": "S. Haller"}, {"authorId": "2784146", "name": "F. Scharnowski"}, {"authorId": "1401833932", "name": "J. Lewis-Peacock"}, {"authorId": "2214204", "name": "N. Weiskopf"}, {"authorId": "1757311", "name": "M. Blefari"}, {"authorId": "40551898", "name": "M. Rana"}, {"authorId": "36859151", "name": "Ethan Oblak"}, {"authorId": "145198983", "name": "N. Birbaumer"}, {"authorId": "48466962", "name": "J. Sulzer"}]}, {"paperId": "006b577653e0e91e1cfd37c32c6d1cfb198a730e", "url": "https://www.semanticscholar.org/paper/006b577653e0e91e1cfd37c32c6d1cfb198a730e", "title": "Partially Supervised Classification of Text Documents", "abstract": "We investigate the following problem: Given a set of documents of a particular topic or class P , and a large set M of mixed documents that contains documents from class P and other types of documents, identify the documents from class P in M . The key feature of this problem is that there is no labeled nonP document, which makes traditional machine learning techniques inapplicable, as they all need labeled documents of both classes. We call this problem partially supervised classification. In this paper, we show that this problem can be posed as a constrained optimization problem and that under appropriate conditions, solutions to the constrained optimization problem will give good solutions to the partially supervised classification problem. We present a novel technique to solve the problem and demonstrate the effectiveness of the technique through extensive experimentation.", "year": 2002, "referenceCount": 34, "citationCount": 579, "influentialCitationCount": 60, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145321667", "name": "B. Liu"}, {"authorId": "1740222", "name": "Wee Sun Lee"}, {"authorId": "144019071", "name": "Philip S. Yu"}, {"authorId": "39952499", "name": "Xiaoli Li"}]}, {"paperId": "cbc3d8b04d37b2d4155f081cd423380220a91f13", "url": "https://www.semanticscholar.org/paper/cbc3d8b04d37b2d4155f081cd423380220a91f13", "title": "SVM Tutorial - Classification, Regression and Ranking", "abstract": null, "year": 2012, "referenceCount": 33, "citationCount": 156, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1723357", "name": "Hwanjo Yu"}, {"authorId": "2109571207", "name": "Sungchul Kim"}]}, {"paperId": "cfc1d089990f9b8652dade0dc8e221589c6430ce", "url": "https://www.semanticscholar.org/paper/cfc1d089990f9b8652dade0dc8e221589c6430ce", "title": "Bioinspired hierarchical composite design using machine learning: simulation, additive manufacturing, and experiment", "abstract": "Biomimicry, adapting and implementing nature's designs provides an adequate first-order solution to achieving superior mechanical properties. However, the design space is too vast even using biomimetic designs as prototypes for optimization. Here, we propose a new approach to design hierarchical materials using machine learning, trained with a database of hundreds of thousands of structures from finite element analysis, together with a self-learning algorithm for discovering high-performing materials where inferior designs are phased out for superior candidates. Results show that our approach can create microstructural patterns that lead to tougher and stronger materials, which are validated through additive manufacturing and testing. We further show that machine learning can be used as an alternative method of coarse-graining – analyzing and designing materials without the use of full microstructural data. This novel paradigm of smart additive manufacturing can aid in the discovery and fabrication of new material designs boasting orders of magnitude increase in computational efficacy over conventional methods.", "year": 2018, "referenceCount": 40, "citationCount": 211, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "11329466", "name": "Grace X. Gu"}, {"authorId": "153246325", "name": "Chun‐Teh Chen"}, {"authorId": "2121259897", "name": "Deon J. Richmond"}, {"authorId": "2273480", "name": "M. Buehler"}]}, {"paperId": "b5353611e61a50957f74a4862f2eff450c23993b", "url": "https://www.semanticscholar.org/paper/b5353611e61a50957f74a4862f2eff450c23993b", "title": "Machine Learning for Adaptive User Interfaces", "abstract": null, "year": 1997, "referenceCount": 15, "citationCount": 123, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1713919", "name": "P. Langley"}]}, {"paperId": "65d3e7fa7b452611aa729ac789d4373d6ee505b0", "url": "https://www.semanticscholar.org/paper/65d3e7fa7b452611aa729ac789d4373d6ee505b0", "title": "fastMRI: An Open Dataset and Benchmarks for Accelerated MRI", "abstract": "Accelerating Magnetic Resonance Imaging (MRI) by taking fewer measurements has the potential to reduce medical costs, minimize stress to patients and make MRI possible in applications where it is currently prohibitively slow or expensive. We introduce the fastMRI dataset, a large-scale collection of both raw MR measurements and clinical MR images, that can be used for training and evaluation of machine-learning approaches to MR image reconstruction. By introducing standardized evaluation criteria and a freely-accessible dataset, our goal is to help the community make rapid advances in the state of the art for MR image reconstruction. We also provide a self-contained introduction to MRI for machine learning researchers with no medical imaging background.", "year": 2018, "referenceCount": 63, "citationCount": 402, "influentialCitationCount": 65, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering", "Physics", "Mathematics"], "authors": [{"authorId": "3105120", "name": "Jure Zbontar"}, {"authorId": "3597472", "name": "F. Knoll"}, {"authorId": "8401284", "name": "Anuroop Sriram"}, {"authorId": "2954796", "name": "Matthew Muckley"}, {"authorId": "145219594", "name": "M. Bruno"}, {"authorId": "34597877", "name": "Aaron Defazio"}, {"authorId": "48674611", "name": "Marc Parente"}, {"authorId": "2376144", "name": "Krzysztof J Geras"}, {"authorId": "51983841", "name": "Joe Katsnelson"}, {"authorId": "2382287", "name": "H. Chandarana"}, {"authorId": "2476328", "name": "Zizhao Zhang"}, {"authorId": "3325894", "name": "M. Drozdzal"}, {"authorId": "144290131", "name": "Adriana Romero"}, {"authorId": "2066127975", "name": "Michael G. Rabbat"}, {"authorId": "145467703", "name": "Pascal Vincent"}, {"authorId": "2064937515", "name": "James Pinkerton"}, {"authorId": "2111247556", "name": "Duo Wang"}, {"authorId": "6584461", "name": "N. Yakubova"}, {"authorId": "2057049036", "name": "Erich Owens"}, {"authorId": "1699161", "name": "C. L. Zitnick"}, {"authorId": "5677770", "name": "M. Recht"}, {"authorId": "2827060", "name": "D. Sodickson"}, {"authorId": "2376478", "name": "Y. Lui"}]}, {"paperId": "516475a7cc96c86a4a4b31682bb0c3a48b41cb95", "url": "https://www.semanticscholar.org/paper/516475a7cc96c86a4a4b31682bb0c3a48b41cb95", "title": "Machine Learning in Financial Crisis Prediction: A Survey", "abstract": "For financial institutions, the ability to predict or forecast business failures is crucial, as incorrect decisions can have direct financial consequences. Bankruptcy prediction and credit scoring are the two major research problems in the accounting and finance domain. In the literature, a number of models have been developed to predict whether borrowers are in danger of bankruptcy and whether they should be considered a good or bad credit risk. Since the 1990s, machine-learning techniques, such as neural networks and decision trees, have been studied extensively as tools for bankruptcy prediction and credit score modeling. This paper reviews 130 related journal papers from the period between 1995 and 2010, focusing on the development of state-of-the-art machine-learning techniques, including hybrid and ensemble classifiers. Related studies are compared in terms of classifier design, datasets, baselines, and other experimental factors. This paper presents the current achievements and limitations associated with the development of bankruptcy-prediction and credit-scoring models employing machine learning. We also provide suggestions for future research.", "year": 2012, "referenceCount": 168, "citationCount": 225, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1682393", "name": "Wei-Yang Lin"}, {"authorId": "1802964", "name": "Ya-Han Hu"}, {"authorId": "1707262", "name": "Chih-Fong Tsai"}]}, {"paperId": "f01c9b8f4fae5fb66ed5dffe40484938d60e09f2", "url": "https://www.semanticscholar.org/paper/f01c9b8f4fae5fb66ed5dffe40484938d60e09f2", "title": "Monotonicity Maintenance in Information-Theoretic Machine Learning Algorithms", "abstract": null, "year": 1995, "referenceCount": 18, "citationCount": 87, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "1399062322", "name": "A. Ben-David"}]}, {"paperId": "1f9f29020556a574fe3de44e417deb367c13c426", "url": "https://www.semanticscholar.org/paper/1f9f29020556a574fe3de44e417deb367c13c426", "title": "Predicting Dark Triad Personality Traits from Twitter Usage and a Linguistic Analysis of Tweets", "abstract": "Social media sites are now the most popular destination for Internet users, providing social scientists with a great opportunity to understand online behaviour. There are a growing number of research papers related to social media, a small number of which focus on personality prediction. To date, studies have typically focused on the Big Five traits of personality, but one area which is relatively unexplored is that of the anti-social traits of narcissism, Machiavellians and psychopathy, commonly referred to as the Dark Triad. This study explored the extent to which it is possible to determine anti-social personality traits based on Twitter use. This was performed by comparing the Dark Triad and Big Five personality traits of 2,927 Twitter users with their profile attributes and use of language. Analysis shows that there are some statistically significant relationships between these variables. Through the use of crowd sourced machine learning algorithms, we show that machine learning provides useful prediction rates, but is imperfect in predicting an individual's Dark Triad traits from Twitter activity. While predictive models may be unsuitable for predicting an individual's personality, they may still be of practical importance when models are applied to large groups of people, such as gaining the ability to see whether anti-social traits are increasing or decreasing over a population. Our results raise important questions related to the unregulated use of social media analysis for screening purposes. It is important that the practical and ethical implications of drawing conclusions about personal information embedded in social media sites are better understood.", "year": 2012, "referenceCount": 45, "citationCount": 248, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38216109", "name": "Chris Sumner"}, {"authorId": "34227452", "name": "A. Byers"}, {"authorId": "3050127", "name": "Rachel Boochever"}, {"authorId": "32102400", "name": "Gregory J. Park"}]}, {"paperId": "3e7f5455e0ed81de16f9327ffc12093ec8245cf7", "url": "https://www.semanticscholar.org/paper/3e7f5455e0ed81de16f9327ffc12093ec8245cf7", "title": "Multiview Privileged Support Vector Machines", "abstract": "Multiview learning (MVL), by exploiting the complementary information among multiple feature sets, can improve the performance of many existing learning tasks. Support vector machine (SVM)-based models have been frequently used for MVL. A typical SVM-based MVL model is SVM-2K, which extends SVM for MVL by using the distance minimization version of kernel canonical correlation analysis. However, SVM-2K cannot fully unleash the power of the complementary information among different feature views. Recently, a framework of learning using privileged information (LUPI) has been proposed to model data with complementary information. Motivated by LUPI, we propose a new multiview privileged SVM model, multi-view privileged SVM model (PSVM-2V), for MVL. This brings a new perspective that extends LUPI to MVL. The optimization of PSVM-2V can be solved by the classical quadratic programming solver. We theoretically analyze the performance of PSVM-2V from the viewpoints of the consensus principle, the generalization error bound, and the SVM-2K learning model. Experimental results on 95 binary data sets demonstrate the effectiveness of the proposed method.", "year": 2018, "referenceCount": 49, "citationCount": 73, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "48252042", "name": "Jingjing Tang"}, {"authorId": "143790318", "name": "Ying-jie Tian"}, {"authorId": "2151332283", "name": "Peng Zhang"}, {"authorId": "87180246", "name": "Xiaohui Liu"}]}, {"paperId": "d3a857a4bccf9a23b2d1e523c89456de728403b3", "url": "https://www.semanticscholar.org/paper/d3a857a4bccf9a23b2d1e523c89456de728403b3", "title": "Drug discovery with explainable artificial intelligence", "abstract": null, "year": 2020, "referenceCount": 231, "citationCount": 209, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2065337592", "name": "Jos'e Jim'enez-Luna"}, {"authorId": "3674456", "name": "F. Grisoni"}, {"authorId": "144522872", "name": "G. Schneider"}]}, {"paperId": "94187ef33e34af2cdb42502083c6f9b4c3f5ba6b", "url": "https://www.semanticscholar.org/paper/94187ef33e34af2cdb42502083c6f9b4c3f5ba6b", "title": "Practical Black-Box Attacks against Deep Learning Systems using Adversarial Examples", "abstract": "Advances in deep learning have led to the broad adoption of Deep Neural Networks (DNNs) to a range of important machine learning problems, e.g., guiding autonomous vehicles, speech recognition, malware detection. Yet, machine learning models, including DNNs, were shown to be vulnerable to adversarial samples-subtly (and often humanly indistinguishably) modified malicious inputs crafted to compromise the integrity of their outputs. Adversarial examples thus enable adversaries to manipulate system behaviors. Potential attacks include attempts to control the behavior of vehicles, have spam content identified as legitimate content, or have malware identified as legitimate software. Adversarial examples are known to transfer from one model to another, even if the second model has a different architecture or was trained on a different set. We introduce the first practical demonstration that this cross-model transfer phenomenon enables attackers to control a remotely hosted DNN with no access to the model, its parameters, or its training data. In our demonstration, we only assume that the adversary can observe outputs from the target DNN given inputs chosen by the adversary. We introduce the attack strategy of fitting a substitute model to the input-output pairs in this manner, then crafting adversarial examples based on this auxiliary model. We evaluate the approach on existing DNN datasets and real-world settings. In one experiment, we force a DNN supported by MetaMind (one of the online APIs for DNN classifiers) to mis-classify inputs at a rate of 84.24%. We conclude with experiments exploring why adversarial samples transfer between DNNs, and a discussion on the applicability of our attack when targeting machine learning algorithms distinct from DNNs.", "year": 2016, "referenceCount": 47, "citationCount": 442, "influentialCitationCount": 46, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1967156", "name": "Nicolas Papernot"}, {"authorId": "144061974", "name": "P. Mcdaniel"}, {"authorId": "153440022", "name": "Ian J. Goodfellow"}, {"authorId": "1680133", "name": "S. Jha"}, {"authorId": "144643812", "name": "Z. B. Celik"}, {"authorId": "144231976", "name": "A. Swami"}]}, {"paperId": "3ff2ba8bd2658817c780b450028040ba78a10681", "url": "https://www.semanticscholar.org/paper/3ff2ba8bd2658817c780b450028040ba78a10681", "title": "Hardware for machine learning: Challenges and opportunities", "abstract": "Machine learning plays a critical role in extracting meaningful information out of the zetabytes of sensor data collected every day. For some applications, the goal is to analyze and understand the data to identify trends (e.g., surveillance, portable/wearable electronics); in other applications, the goal is to take immediate action based the data (e.g., robotics/drones, self-driving cars, smart Internet of Things). For many of these applications, local embedded processing near the sensor is preferred over the cloud due to privacy or latency concerns, or hmitations in the communication bandwidth. However, at the sensor there are often stringent constraints on energy consumption and cost in addition to throughput and accuracy requirements. Furthermore, flexibility is often required such that the processing can be adapted for different applications or environments (e.g., update the weights and model in the classifier). In many applications, machine learning often involves transforming the input data into a higher dimensional space, which, along with programmable weights, increases data movement and consequently energy consumption. In this paper, we will discuss how these challenges can be addressed at various levels of hardware design ranging from architecture, hardware-friendly algorithms, mixed-signal circuits, and advanced technologies (including memories and sensors).", "year": 2016, "referenceCount": 84, "citationCount": 137, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1691305", "name": "V. Sze"}, {"authorId": "50579876", "name": "Yu-hsin Chen"}, {"authorId": "1399426866", "name": "Joel Einer"}, {"authorId": "2071741", "name": "Amr Suleiman"}, {"authorId": "48805472", "name": "Zhengdong Zhang"}]}, {"paperId": "c92689ab1e100998231e8c8e35da21817f646f47", "url": "https://www.semanticscholar.org/paper/c92689ab1e100998231e8c8e35da21817f646f47", "title": "Clustering Learning Tasks and the Selective Cross-Task Transfer of Knowledge", "abstract": null, "year": 1998, "referenceCount": 50, "citationCount": 87, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144867807", "name": "S. Thrun"}, {"authorId": "1395754302", "name": "Joseph O'Sullivan"}]}, {"paperId": "804f822f9a6db8f559801f1c618b7d6c766741b4", "url": "https://www.semanticscholar.org/paper/804f822f9a6db8f559801f1c618b7d6c766741b4", "title": "Circuit-centric quantum classifiers", "abstract": "A machine learning design is developed to train a quantum circuit specialized in solving a classification problem. In addition to discussing the training method and effect of noise, it is shown that the circuits perform reasonably well on classical benchmarks.", "year": 2018, "referenceCount": 60, "citationCount": 321, "influentialCitationCount": 32, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "3048564", "name": "M. Schuld"}, {"authorId": "32954320", "name": "A. Bocharov"}, {"authorId": "1742466", "name": "K. Svore"}, {"authorId": "3253856", "name": "N. Wiebe"}]}, {"paperId": "4afa7d8e2de43b0b67366b1bce8768f5a246d153", "url": "https://www.semanticscholar.org/paper/4afa7d8e2de43b0b67366b1bce8768f5a246d153", "title": "Bayesian Optimization is Superior to Random Search for Machine Learning Hyperparameter Tuning: Analysis of the Black-Box Optimization Challenge 2020", "abstract": "This paper presents the results and insights from the black-box optimization (BBO) challenge at NeurIPS 2020 which ran from July–October, 2020. The challenge emphasized the importance of evaluating derivative-free optimizers for tuning the hyperparameters of machine learning models. This was the first black-box optimization challenge with a machine learning emphasis. It was based on tuning (validation set) performance of standard machine learning models on real datasets. This competition has widespread impact as black-box optimization (e.g., Bayesian optimization) is relevant for hyperparameter tuning in almost every machine learning project as well as many applications outside of machine learning. The final leaderboard was determined using the optimization performance on held-out (hidden) objective functions, where the optimizers ran without human intervention. Baselines were set using the default settings of several open-source black-box optimization packages as well as random search.", "year": 2021, "referenceCount": 79, "citationCount": 89, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2072787126", "name": "Ryan Turner"}, {"authorId": "152534486", "name": "David Eriksson"}, {"authorId": "145849642", "name": "M. McCourt"}, {"authorId": "2080026426", "name": "J. Kiili"}, {"authorId": "2054108513", "name": "Eero Laaksonen"}, {"authorId": "1819682268", "name": "Zhen Xu"}, {"authorId": "1743797", "name": "I. Guyon"}]}, {"paperId": "352056cf4cf7e44fb8ebf863c4b632b759a39344", "url": "https://www.semanticscholar.org/paper/352056cf4cf7e44fb8ebf863c4b632b759a39344", "title": "Robust Wasserstein profile inference and applications to machine learning", "abstract": "We show that several machine learning estimators, including square-root least absolute shrinkage and selection and regularized logistic regression, can be represented as solutions to distributionally robust optimization problems. The associated uncertainty regions are based on suitably defined Wasserstein distances. Hence, our representations allow us to view regularization as a result of introducing an artificial adversary that perturbs the empirical distribution to account for out-of-sample effects in loss estimation. In addition, we introduce RWPI (robust Wasserstein profile inference), a novel inference methodology which extends the use of methods inspired by empirical likelihood to the setting of optimal transport costs (of which Wasserstein distances are a particular case). We use RWPI to show how to optimally select the size of uncertainty regions, and as a consequence we are able to choose regularization parameters for these machine learning estimators without the use of cross validation. Numerical experiments are also given to validate our theoretical findings.", "year": 2016, "referenceCount": 58, "citationCount": 229, "influentialCitationCount": 26, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "50411298", "name": "J. Blanchet"}, {"authorId": "143855291", "name": "Yang Kang"}, {"authorId": "1399018387", "name": "M. KarthyekRajhaaA."}]}, {"paperId": "cef4d6ec6505d3d3dcbc9365802947dda107dba2", "url": "https://www.semanticscholar.org/paper/cef4d6ec6505d3d3dcbc9365802947dda107dba2", "title": "Top-down induction of decision trees classifiers - a survey", "abstract": "Decision trees are considered to be one of the most popular approaches for representing classifiers. Researchers from various disciplines such as statistics, machine learning, pattern recognition, and data mining considered the issue of growing a decision tree from available data. This paper presents an updated survey of current methods for constructing decision tree classifiers in a top-down manner. The paper suggests a unified algorithmic framework for presenting these algorithms and describes the various splitting criteria and pruning methodologies.", "year": 2005, "referenceCount": 89, "citationCount": 727, "influentialCitationCount": 32, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1732091", "name": "L. Rokach"}, {"authorId": "1770487", "name": "O. Maimon"}]}, {"paperId": "fb6e85d35fc7b10c16d465fc71748d819672ad24", "url": "https://www.semanticscholar.org/paper/fb6e85d35fc7b10c16d465fc71748d819672ad24", "title": "MILEPOST GCC: machine learning based research compiler", "abstract": "Tuning hardwired compiler optimizations for rapidly evolving hardware makes porting an optimizing compiler for each new platform extremely challenging. Our radical approach is to develop a modular, extensible, self-optimizing compiler that automatically learns the best optimization heuristics based on the behavior of the platform. In this paper we describe MILEPOST 1 GCC, a machine-learning-based compiler that automatically adjusts its optimization heuristics to improve the execution time, code size, or compilation time of specific programs on different architectures. Our preliminary experimental results show that it is possible to considerably reduce execution time of the MiBench benchmark suite on a range of platforms entirely automatically.", "year": 2008, "referenceCount": 39, "citationCount": 129, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2043821", "name": "G. Fursin"}, {"authorId": "2052818", "name": "Cupertino Miranda"}, {"authorId": "1731764", "name": "O. Temam"}, {"authorId": "3305063", "name": "Mircea Namolaru"}, {"authorId": "1388775854", "name": "E. Yom-Tov"}, {"authorId": "38737579", "name": "A. Zaks"}, {"authorId": "1795886", "name": "Bilha Mendelson"}, {"authorId": "30561807", "name": "Edwin V. Bonilla"}, {"authorId": "153031524", "name": "J. Thomson"}, {"authorId": "2476647", "name": "H. Leather"}, {"authorId": "145715698", "name": "Christopher K. I. Williams"}, {"authorId": "1401533251", "name": "M. O’Boyle"}, {"authorId": "38759952", "name": "Phil Barnard"}, {"authorId": "40580165", "name": "Elton Ashton"}, {"authorId": "2630186", "name": "E. Courtois"}, {"authorId": "1697641", "name": "F. Bodin"}]}, {"paperId": "0b96c12fd4e25b949dea4ff57df033bf16b2d100", "url": "https://www.semanticscholar.org/paper/0b96c12fd4e25b949dea4ff57df033bf16b2d100", "title": "Blockchained On-Device Federated Learning", "abstract": "By leveraging blockchain, this letter proposes a blockchained federated learning (BlockFL) architecture where local learning model updates are exchanged and verified. This enables on-device machine learning without any centralized training data or coordination by utilizing a consensus mechanism in blockchain. Moreover, we analyze an end-to-end latency model of BlockFL and characterize the optimal block generation rate by considering communication, computation, and consensus delays.", "year": 2018, "referenceCount": 16, "citationCount": 277, "influentialCitationCount": 32, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145063546", "name": "Hyesung Kim"}, {"authorId": "48490823", "name": "Jihong Park"}, {"authorId": "1702172", "name": "M. Bennis"}, {"authorId": "1692004", "name": "Seong-Lyun Kim"}]}, {"paperId": "ce2347d8fbeb3689a989ee13e7e0b4da50a6994a", "url": "https://www.semanticscholar.org/paper/ce2347d8fbeb3689a989ee13e7e0b4da50a6994a", "title": "Boosted Wrapper Induction", "abstract": "Recent work in machine learning for information extraction has focused on two distinct sub-problems: the conventional problem of filling template slots from natural language text, and the problem of wrapper induction, learning simple extraction procedures (“wrappers”) for highly structured text such as Web pages produced by CGI scripts. For suitably regular domains, existing wrapper induction algorithms can efficiently learn wrappers that are simple and highly accurate, but the regularity bias of these algorithms makes them unsuitable for most conventional information extraction tasks. Boosting is a technique for improving the performance of a simple machine learning algorithm by repeatedly applying it to the training set with different example weightings. We describe an algorithm that learns simple, low-coverage wrapper-like extraction patterns, which we then apply to conventional information extraction problems using boosting. The result is BWI, a trainable information extraction system with a strong precision bias and F1 performance better than state-of-the-art techniques in many domains.", "year": 2000, "referenceCount": 16, "citationCount": 293, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1758106", "name": "D. Freitag"}, {"authorId": "8551365", "name": "N. Kushmerick"}]}, {"paperId": "71a85e735a3686bef8cce3725ae5ba82e2cabb1b", "url": "https://www.semanticscholar.org/paper/71a85e735a3686bef8cce3725ae5ba82e2cabb1b", "title": "Underspecification Presents Challenges for Credibility in Modern Machine Learning", "abstract": "ML models often exhibit unexpectedly poor behavior when they are deployed in real-world domains. We identify underspecification as a key reason for these failures. An ML pipeline is underspecified when it can return many predictors with equivalently strong held-out performance in the training domain. Underspecification is common in modern ML pipelines, such as those based on deep learning. Predictors returned by underspecified pipelines are often treated as equivalent based on their training domain performance, but we show here that such predictors can behave very differently in deployment domains. This ambiguity can lead to instability and poor model behavior in practice, and is a distinct failure mode from previously identified issues arising from structural mismatch between training and deployment domains. We show that this problem appears in a wide variety of practical ML pipelines, using examples from computer vision, medical imaging, natural language processing, clinical risk prediction based on electronic health records, and medical genomics. Our results show the need to explicitly account for underspecification in modeling pipelines that are intended for real-world deployment in any domain.", "year": 2020, "referenceCount": 149, "citationCount": 319, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1396841807", "name": "A. D'Amour"}, {"authorId": "145993598", "name": "K. Heller"}, {"authorId": "40497400", "name": "D. Moldovan"}, {"authorId": "1874006", "name": "Ben Adlam"}, {"authorId": "48401711", "name": "B. Alipanahi"}, {"authorId": "2638246", "name": "Alex Beutel"}, {"authorId": "2110195795", "name": "Christina Chen"}, {"authorId": "1695378", "name": "Jonathan Deaton"}, {"authorId": "144154709", "name": "Jacob Eisenstein"}, {"authorId": "28552618", "name": "M. Hoffman"}, {"authorId": "2420527", "name": "F. Hormozdiari"}, {"authorId": "2815290", "name": "N. Houlsby"}, {"authorId": "3108448", "name": "Shaobo Hou"}, {"authorId": "3451901", "name": "Ghassen Jerfel"}, {"authorId": "6413143", "name": "A. Karthikesalingam"}, {"authorId": "34302129", "name": "Mario Lucic"}, {"authorId": "2146275249", "name": "Yi-An Ma"}, {"authorId": "6322777", "name": "C. McLean"}, {"authorId": "2007712128", "name": "Diana Mincu"}, {"authorId": "4836115", "name": "A. Mitani"}, {"authorId": "145071265", "name": "A. Montanari"}, {"authorId": "81408931", "name": "Zachary Nado"}, {"authorId": "144223091", "name": "Vivek Natarajan"}, {"authorId": "2065412355", "name": "Christopher Nielson"}, {"authorId": "25897803", "name": "Thomas F. Osborne"}, {"authorId": "2035210", "name": "R. Raman"}, {"authorId": "88478180", "name": "K. Ramasamy"}, {"authorId": "144042306", "name": "R. Sayres"}, {"authorId": "3212089", "name": "J. Schrouff"}, {"authorId": "6454443", "name": "Martin G. Seneviratne"}, {"authorId": "2007741250", "name": "Shannon Sequeira"}, {"authorId": "46537606", "name": "Harini Suresh"}, {"authorId": "2974320", "name": "Victor Veitch"}, {"authorId": "3316311", "name": "Max Vladymyrov"}, {"authorId": "1524732527", "name": "Xuezhi Wang"}, {"authorId": "20825661", "name": "Kellie Webster"}, {"authorId": "2856607", "name": "S. Yadlowsky"}, {"authorId": "2520251", "name": "Taedong Yun"}, {"authorId": "2743563", "name": "Xiaohua Zhai"}, {"authorId": "1733143", "name": "D. Sculley"}]}, {"paperId": "d0a21f94de312a0ff31657fd103d6b29db823caa", "url": "https://www.semanticscholar.org/paper/d0a21f94de312a0ff31657fd103d6b29db823caa", "title": "Facial Expression Analysis", "abstract": null, "year": 2011, "referenceCount": 147, "citationCount": 564, "influentialCitationCount": 27, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143867160", "name": "F. D. L. Torre"}, {"authorId": "1737918", "name": "J. Cohn"}]}, {"paperId": "10eec18a20954f9ac4d8f463524e5f160e23895f", "url": "https://www.semanticscholar.org/paper/10eec18a20954f9ac4d8f463524e5f160e23895f", "title": "Quantum generative adversarial networks", "abstract": "Quantum machine learning is expected to be one of the first potential general-purpose applications of near-term quantum devices. A major recent breakthrough in classical machine learning is the notion of generative adversarial training, where the gradients of a discriminator model are used to train a separate generative model. In this work and a companion paper, we extend adversarial training to the quantum domain and show how to construct generative adversarial networks using quantum circuits. Furthermore, we also show how to compute gradients -- a key element in generative adversarial network training -- using another quantum circuit. We give an example of a simple practical circuit ansatz to parametrize quantum machine learning models and perform a simple numerical experiment to demonstrate that quantum generative adversarial networks can be trained successfully.", "year": 2018, "referenceCount": 34, "citationCount": 187, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "1403778850", "name": "Pierre-Luc Dallaire-Demers"}, {"authorId": "3399181", "name": "N. Killoran"}]}, {"paperId": "fa9e21807c0518f995ff58313fec775b3c4f1c24", "url": "https://www.semanticscholar.org/paper/fa9e21807c0518f995ff58313fec775b3c4f1c24", "title": "Solar Flare Prediction Using Advanced Feature Extraction, Machine Learning, and Feature Selection", "abstract": null, "year": 2013, "referenceCount": 40, "citationCount": 124, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "143718844", "name": "O. Ahmed"}, {"authorId": "1713102", "name": "Rami Qahwaji"}, {"authorId": "49547430", "name": "T. Colak"}, {"authorId": "36731086", "name": "P. Higgins"}, {"authorId": "34559443", "name": "P. Gallagher"}, {"authorId": "143876697", "name": "D. S. Bloomfield"}]}, {"paperId": "6911114841189946f8ebf30998a60743c4a0ac06", "url": "https://www.semanticscholar.org/paper/6911114841189946f8ebf30998a60743c4a0ac06", "title": "Machine Learning in DNA Microarray Analysis for Cancer Classification", "abstract": "The development of microarray technology has supplied a large volume of data to many fields. In particular, it has been applied to prediction and diagnosis of cancer, so that it expectedly helps us to exactly predict and diagnose cancer. To precisely classify cancer we have to select genes related to cancer because extracted genes from microarray have many noises. In this paper, we attempt to explore many features and classifiers using three benchmark datasets to systematically evaluate the performances of the feature selection methods and machine learning classifiers. Three benchmark datasets are Leukemia cancer dataset, Colon cancer dataset and Lymphoma cancer data set. Pearson's and Spearman's correlation coefficients, Euclidean distance, cosine coefficient, information gain, mutual information and signal to noise ratio have been used for feature selection. Multi-layer perceptron, k-nearest neighbour, support vector machine and structure adaptive self-organizing map have been used for classification. Also, we have combined the classifiers to improve the performance of classification. Experimental results show that the ensemble with several basis classifiers produces the best recognition rate on the benchmark dataset.", "year": 2003, "referenceCount": 37, "citationCount": 254, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1723666", "name": "Sung-Bae Cho"}, {"authorId": "1763535", "name": "H. Won"}]}, {"paperId": "07dffd27ccea93113e8af99f1dfd1996ba179ad3", "url": "https://www.semanticscholar.org/paper/07dffd27ccea93113e8af99f1dfd1996ba179ad3", "title": "Notional machines and introductory programming education", "abstract": "This article brings together, summarizes, and comments on several threads of research that have contributed to our understanding of the challenges that novice programmers face when learning about the runtime dynamics of programs and the role of the computer in program execution. More specifically, the review covers the literature on programming misconceptions, the cognitive theory of mental models, constructivist theory of knowledge and learning, phenomenographic research on experiencing programming, and the theory of threshold concepts. These bodies of work are examined in relation to the concept of a “notional machine”—an abstract computer for executing programs of a particular kind. As a whole, the literature points to notional machines as a major challenge in introductory programming education. It is argued that instructors should acknowledge the notional machine as an explicit learning objective and address it in teaching. Teaching within some programming paradigms, such as object-oriented programming, may benefit from using multiple notional machines at different levels of abstraction. Pointers to some promising pedagogical techniques are provided.", "year": 2013, "referenceCount": 171, "citationCount": 223, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2936871", "name": "Juha Sorva"}]}, {"paperId": "36652428740cd30d245d55889f01a7fb04a91c93", "url": "https://www.semanticscholar.org/paper/36652428740cd30d245d55889f01a7fb04a91c93", "title": "Deeper Insights into Graph Convolutional Networks for Semi-Supervised Learning", "abstract": "\n \n Many interesting problems in machine learning are being revisited with new deep learning tools. For graph-based semi-supervised learning, a recent important development is graph convolutional networks (GCNs), which nicely integrate local vertex features and graph topology in the convolutional layers. Although the GCN model compares favorably with other state-of-the-art methods, its mechanisms are not clear and it still requires considerable amount of labeled data for validation and model selection. In this paper, we develop deeper insights into the GCN model and address its fundamental limits. First, we show that the graph convolution of the GCN model is actually a special form of Laplacian smoothing, which is the key reason why GCNs work, but it also brings potential concerns of over-smoothing with many convolutional layers. Second, to overcome the limits of the GCN model with shallow architectures, we propose both co-training and self-training approaches to train GCNs. Our approaches significantly improve GCNs in learning with very few labels, and exempt them from requiring additional labels for validation. Extensive experiments on benchmarks have verified our theory and proposals.\n \n", "year": 2018, "referenceCount": 33, "citationCount": 1387, "influentialCitationCount": 151, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "35692225", "name": "Qimai Li"}, {"authorId": "40592359", "name": "Zhichao Han"}, {"authorId": "19195265", "name": "Xiao-Ming Wu"}]}, {"paperId": "24b662202fbcfc9c6b2593d749273bc134012c17", "url": "https://www.semanticscholar.org/paper/24b662202fbcfc9c6b2593d749273bc134012c17", "title": "Electric Machines And Drives", "abstract": "Market_Desc: · Electrical Engineering Students · Electrical Engineering Instructors· Power Electronics Engineers Special Features: · Easy to follow step-by-step in depth treatment of all the theory.· Computer simulation chapter describes the role of computer simulations in power electronics. Examples and problems based on Pspice and MATLAB are included.· Introductory chapter offers a review of basic electrical and magnetic circuit concepts.· A new CD-ROM contains the following:· Over 100 of new problems of varying degrees of difficulty for homework assignments and self-learning.· PSpice-based simulation examples, which illustrate basic concepts and help in design of converters.· A newly-developed magnetic component design program that demonstrates design trade-offs.· PowerPoint-based slides, which will improve the learning experience and the ease of using the book About The Book: The text includes cohesive presentation of power electronics fundamentals for applications and design in the power range of 500 kW or less. It describes a variety of practical and emerging power electronic converters made feasible by the new generation of power semiconductor devices. Topics included in this book are an expanded discussion of diode rectifiers and thyristor converters as well as chapters on heat sinks, magnetic components which present a step-by-step design approach and a computer simulation of power electronics which introduces numerical techniques and commonly used simulation packages such as PSpice, MATLAB and EMTP.", "year": 1992, "referenceCount": 0, "citationCount": 247, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34833461", "name": "G. Slemon"}]}, {"paperId": "2776dcecb444e6c02a56b06480b8346e00e78353", "url": "https://www.semanticscholar.org/paper/2776dcecb444e6c02a56b06480b8346e00e78353", "title": "Wasserstein Propagation for Semi-Supervised Learning", "abstract": "Probability distributions and histograms are natural representations for product ratings, traffic measurements, and other data considered in many machine learning applications. Thus, this paper introduces a technique for graph-based semi-supervised learning of histograms, derived from the theory of optimal transportation. Our method has several properties making it suitable for this application; in particular, its behavior can be characterized by the moments and shapes of the histograms at the labeled nodes. In addition, it can be used for histograms on non-standard domains like circles, revealing a strategy for manifold-valued semi-supervised learning. We also extend this technique to related problems such as smoothing distributions on graph nodes.", "year": 2014, "referenceCount": 26, "citationCount": 113, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1932072", "name": "J. Solomon"}, {"authorId": "2559604", "name": "R. Rustamov"}, {"authorId": "1744254", "name": "L. Guibas"}, {"authorId": "2983668", "name": "Adrian Butscher"}]}, {"paperId": "29bdcd57f79bb4bffe498289f5732df9a5df99a2", "url": "https://www.semanticscholar.org/paper/29bdcd57f79bb4bffe498289f5732df9a5df99a2", "title": "Machine learning meets quantum physics", "abstract": "The marriage of the two fields may give birth to a new research frontier that could transform them both.", "year": 2019, "referenceCount": 25, "citationCount": 114, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Computer Science"], "authors": [{"authorId": "2888542", "name": "S. Sarma"}, {"authorId": "5204254", "name": "D. Deng"}, {"authorId": "144794202", "name": "L. Duan"}]}, {"paperId": "8a925cbda3d1561b5e7bbc9f38410659e4f056c0", "url": "https://www.semanticscholar.org/paper/8a925cbda3d1561b5e7bbc9f38410659e4f056c0", "title": "Predicting stock market index using fusion of machine learning techniques", "abstract": null, "year": 2015, "referenceCount": 26, "citationCount": 353, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2070426849", "name": "Jigar Patel"}, {"authorId": "144038908", "name": "Sahil R. Shah"}, {"authorId": "1977290", "name": "Priyank Thakkar"}, {"authorId": "1794896", "name": "K. Kotecha"}]}, {"paperId": "701d2f7c45277e74cc1f047d7681010a233ecc66", "url": "https://www.semanticscholar.org/paper/701d2f7c45277e74cc1f047d7681010a233ecc66", "title": "An Application of Machine Learning to Anomaly Detection", "abstract": "The anomaly detection problem has been widely studied in the computer security literature. In this paper we present a machine learning approach to anomaly detection. Our system builds user profiles based on command sequences and compares current input sequences to the profile using a similarity measure. The system must learn to classify current behavior as consistent or anomalous with past behavior using only positive examples of the account's valid user. Our empirical results demonstrate that this is a promising approach to distinguishing the legitamate user from an intruder.", "year": 1999, "referenceCount": 15, "citationCount": 233, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143673956", "name": "T. Lane"}]}, {"paperId": "afbacf32916c0fb1f18eed07c078e05eb48e5a52", "url": "https://www.semanticscholar.org/paper/afbacf32916c0fb1f18eed07c078e05eb48e5a52", "title": "Survey on Feature Selection", "abstract": "Feature selection plays an important role in the data mining process. It is needed to deal with the excessive number of features, which can become a computational burden on the learning algorithms. It is also necessary, even when computational resources are not scarce, since it improves the accuracy of the machine learning tasks, as we will see in the upcoming sections. In this review, we discuss the different feature selection approaches, and the relation between them and the various machine learning algorithms.", "year": 2015, "referenceCount": 41, "citationCount": 150, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "32738445", "name": "T. Abdallah"}, {"authorId": "8402134", "name": "B. D. L. Iglesia"}]}, {"paperId": "3888f7c3069fbe827175e8e69ed9e44c0b1c423d", "url": "https://www.semanticscholar.org/paper/3888f7c3069fbe827175e8e69ed9e44c0b1c423d", "title": "Chameleon: A Hybrid Secure Computation Framework for Machine Learning Applications", "abstract": "We present Chameleon, a novel hybrid (mixed-protocol) framework for secure function evaluation (SFE) which enables two parties to jointly compute a function without disclosing their private inputs. Chameleon combines the best aspects of generic SFE protocols with the ones that are based upon additive secret sharing. In particular, the framework performs linear operations in the ring $\\mathbbZ _2^l $ using additively secret shared values and nonlinear operations using Yao's Garbled Circuits or the Goldreich-Micali-Wigderson protocol. Chameleon departs from the common assumption of additive or linear secret sharing models where three or more parties need to communicate in the online phase: the framework allows two parties with private inputs to communicate in the online phase under the assumption of a third node generating correlated randomness in an offline phase. Almost all of the heavy cryptographic operations are precomputed in an offline phase which substantially reduces the communication overhead. Chameleon is both scalable and significantly more efficient than the ABY framework (NDSS'15) it is based on. Our framework supports signed fixed-point numbers. In particular, Chameleon's vector dot product of signed fixed-point numbers improves the efficiency of mining and classification of encrypted data for algorithms based upon heavy matrix multiplications. Our evaluation of Chameleon on a 5 layer convolutional deep neural network shows 133x and 4.2x faster executions than Microsoft CryptoNets (ICML'16) and MiniONN (CCS'17), respectively.", "year": 2018, "referenceCount": 94, "citationCount": 316, "influentialCitationCount": 37, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143788448", "name": "M. Riazi"}, {"authorId": "33811081", "name": "Christian Weinert"}, {"authorId": "145799071", "name": "Oleksandr Tkachenko"}, {"authorId": "2714003", "name": "Ebrahim M. Songhori"}, {"authorId": "145139628", "name": "T. Schneider"}, {"authorId": "3018662", "name": "F. Koushanfar"}]}, {"paperId": "3993b1005796fe45d4423daa973d3fe58ae7f798", "url": "https://www.semanticscholar.org/paper/3993b1005796fe45d4423daa973d3fe58ae7f798", "title": "Graph Laplacians and their Convergence on Random Neighborhood Graphs", "abstract": "Given a sample from a probability measure with support on a submanifold in Euclidean space one can construct a neighborhood graph which can be seen as an approximation of the submanifold. The graph Laplacian of such a graph is used in several machine learning methods like semi-supervised learning, dimensionality reduction and clustering. In this paper we determine the pointwise limit of three different graph Laplacians used in the literature as the sample size increases and the neighborhood size approaches zero. We show that for a uniform measure on the submanifold all graph Laplacians have the same limit up to constants. However in the case of a non-uniform measure on the submanifold only the so called random walk graph Laplacian converges to the weighted Laplace-Beltrami operator.", "year": 2006, "referenceCount": 48, "citationCount": 255, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "143610806", "name": "Matthias Hein"}, {"authorId": "3015507", "name": "Jean-Yves Audibert"}, {"authorId": "1728654", "name": "U. V. Luxburg"}]}, {"paperId": "c636a2dd242908fe2e598a1077c0c57bfdea8633", "url": "https://www.semanticscholar.org/paper/c636a2dd242908fe2e598a1077c0c57bfdea8633", "title": "ReasoNet: Learning to Stop Reading in Machine Comprehension", "abstract": "Teaching a computer to read and answer general questions pertaining to a document is a challenging yet unsolved problem. In this paper, we describe a novel neural network architecture called the Reasoning Network (ReasoNet) for machine comprehension tasks. ReasoNets make use of multiple turns to effectively exploit and then reason over the relation among queries, documents, and answers. Different from previous approaches using a fixed number of turns during inference, ReasoNets introduce a termination state to relax this constraint on the reasoning depth. With the use of reinforcement learning, ReasoNets can dynamically determine whether to continue the comprehension process after digesting intermediate results, or to terminate reading when it concludes that existing information is adequate to produce an answer. ReasoNets achieve superior performance in machine comprehension datasets, including unstructured CNN and Daily Mail datasets, the Stanford SQuAD dataset, and a structured Graph Reachability dataset.", "year": 2016, "referenceCount": 38, "citationCount": 295, "influentialCitationCount": 24, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1752875", "name": "Yelong Shen"}, {"authorId": "2421691", "name": "Po-Sen Huang"}, {"authorId": "1800422", "name": "Jianfeng Gao"}, {"authorId": "2109136147", "name": "Weizhu Chen"}]}, {"paperId": "313f91147e1a200585132dd0bf837d5ce337c7e3", "url": "https://www.semanticscholar.org/paper/313f91147e1a200585132dd0bf837d5ce337c7e3", "title": "Modelling and Control for Intelligent Industrial Systems - Adaptive Algorithms in Robotics and Industrial Engineering", "abstract": null, "year": 2011, "referenceCount": 0, "citationCount": 179, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "3174749", "name": "G. Rigatos"}]}, {"paperId": "45c9f19b1eb46095e61f3c1a9970a6161c13a861", "url": "https://www.semanticscholar.org/paper/45c9f19b1eb46095e61f3c1a9970a6161c13a861", "title": "ARTMAP: supervised real-time learning and classification of nonstationary data by a self-organizing neural network", "abstract": "Summary form only given. The authors introduced a neural network architecture, called ARTMAP, that autonomously learns to classify arbitrarily many, arbitrarily ordered vectors into recognition categories based on predictive success. This supervised learning system is built up from a pair of adaptive resonance theory modules (ART/sub a/ and ART/sub b/) that are capable of self-organizing stable recognition categories in response to arbitrary sequences of input patterns. Tested on a benchmark machine learning database in both online and offline simulations, the ARTMAP system learns orders of magnitude more quickly, efficiently, and accurately than alternative algorithms, and achieves 100% accuracy after training on less than half of the input patterns in the database.<<ETX>>", "year": 1991, "referenceCount": 30, "citationCount": 1087, "influentialCitationCount": 79, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143809344", "name": "G. Carpenter"}, {"authorId": "1682174", "name": "S. Grossberg"}, {"authorId": "3098745", "name": "J. Reynolds"}]}, {"paperId": "3089e828cda420db7936d5e1ad16a514aa51ae63", "url": "https://www.semanticscholar.org/paper/3089e828cda420db7936d5e1ad16a514aa51ae63", "title": "Learning in the “Real World”", "abstract": null, "year": 1998, "referenceCount": 118, "citationCount": 61, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1733522", "name": "L. Saitta"}, {"authorId": "34364442", "name": "F. Neri"}]}, {"paperId": "c2280e7b4391748ef6decdb16b07cfe68a68d685", "url": "https://www.semanticscholar.org/paper/c2280e7b4391748ef6decdb16b07cfe68a68d685", "title": "Learning Discrete Representations via Information Maximizing Self-Augmented Training", "abstract": "Learning discrete representations of data is a central machine learning task because of the compactness of the representations and ease of interpretation. The task includes clustering and hash learning as special cases. Deep neural networks are promising to be used because they can model the non-linearity of data and scale to large datasets. However, their model complexity is huge, and therefore, we need to carefully regularize the networks in order to learn useful representations that exhibit intended invariance for applications of interest. To this end, we propose a method called Information Maximizing Self-Augmented Training (IMSAT). In IMSAT, we use data augmentation to impose the invari-ance on discrete representations. More specifically, we encourage the predicted representations of augmented data points to be close to those of the original data points in an end-to-end fashion. At the same time, we maximize the information-theoretic dependency between data and their predicted discrete representations. Extensive experiments on benchmark datasets show that IMSAT produces state-of-the-art results for both clustering and unsupervised hash learning.", "year": 2017, "referenceCount": 67, "citationCount": 286, "influentialCitationCount": 52, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "48594758", "name": "Weihua Hu"}, {"authorId": "3213400", "name": "Takeru Miyato"}, {"authorId": "3117618", "name": "Seiya Tokui"}, {"authorId": "8252749", "name": "Eiichi Matsumoto"}, {"authorId": "67154907", "name": "Masashi Sugiyama"}]}, {"paperId": "4a358d2af408326f6f1e4f6023d606a9a981c74a", "url": "https://www.semanticscholar.org/paper/4a358d2af408326f6f1e4f6023d606a9a981c74a", "title": "Software Vulnerability Analysis and Discovery Using Machine-Learning and Data-Mining Techniques", "abstract": "Software security vulnerabilities are one of the critical issues in the realm of computer security. Due to their potential high severity impacts, many different approaches have been proposed in the past decades to mitigate the damages of software vulnerabilities. Machine-learning and data-mining techniques are also among the many approaches to address this issue. In this article, we provide an extensive review of the many different works in the field of software vulnerability analysis and discovery that utilize machine-learning and data-mining techniques. We review different categories of works in this domain, discuss both advantages and shortcomings, and point out challenges and some uncharted territories in the field.", "year": 2017, "referenceCount": 107, "citationCount": 190, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9153077", "name": "Seyed Mohammad Ghaffarian"}, {"authorId": "9072622", "name": "H. Shahriari"}]}, {"paperId": "1302319324d2ad831a5da553d03aba2c9259fc21", "url": "https://www.semanticscholar.org/paper/1302319324d2ad831a5da553d03aba2c9259fc21", "title": "A Digital Liquid State Machine With Biologically Inspired Learning and Its Application to Speech Recognition", "abstract": "This paper presents a bioinspired digital liquid-state machine (LSM) for low-power very-large-scale-integration (VLSI)-based machine learning applications. To the best of the authors' knowledge, this is the first work that employs a bioinspired spike-based learning algorithm for the LSM. With the proposed online learning, the LSM extracts information from input patterns on the fly without needing intermediate data storage as required in offline learning methods such as ridge regression. The proposed learning rule is local such that each synaptic weight update is based only upon the firing activities of the corresponding presynaptic and postsynaptic neurons without incurring global communications across the neural network. Compared with the backpropagation-based learning, the locality of computation in the proposed approach lends itself to efficient parallel VLSI implementation. We use subsets of the TI46 speech corpus to benchmark the bioinspired digital LSM. To reduce the complexity of the spiking neural network model without performance degradation for speech recognition, we study the impacts of synaptic models on the fading memory of the reservoir and hence the network performance. Moreover, we examine the tradeoffs between synaptic weight resolution, reservoir size, and recognition performance and present techniques to further reduce the overhead of hardware implementation. Our simulation results show that in terms of isolated word recognition evaluated using the TI46 speech corpus, the proposed digital LSM rivals the state-of-the-art hidden Markov-model-based recognizer Sphinx-4 and outperforms all other reported recognizers including the ones that are based upon the LSM or neural networks.", "year": 2015, "referenceCount": 63, "citationCount": 115, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2144289286", "name": "Yong Zhang"}, {"authorId": "2149247466", "name": "Peng Li"}, {"authorId": "3021143", "name": "Yingyezhe Jin"}, {"authorId": "1744412", "name": "Yoonsuck Choe"}]}, {"paperId": "c6bbfb4fcaecc779c899af4bb52083870f4b996a", "url": "https://www.semanticscholar.org/paper/c6bbfb4fcaecc779c899af4bb52083870f4b996a", "title": "Future Internet: The Internet of Things Architecture, Possible Applications and Key Challenges", "abstract": "The Internet is continuously changing and evolving. The main communication form of present Internet is human-human. The Internet of Things (IoT) can be considered as the future evaluation of the Internet that realizes machine-to-machine (M2M) learning. Thus, IoT provides connectivity for everyone and everything. The IoT embeds some intelligence in Internet-connected objects to communicate, exchange information, take decisions, invoke actions and provide amazing services. This paper addresses the existing development trends, the generic architecture of IoT, its distinguishing features and possible future applications. This paper also forecast the key challenges associated with the development of IoT. The IoT is getting increasing popularity for academia, industry as well as government that has the potential to bring significant personal, professional and economic benefits.", "year": 2012, "referenceCount": 14, "citationCount": 1104, "influentialCitationCount": 66, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1874286", "name": "R. Khan"}, {"authorId": "1727042", "name": "Sarmad Ullah Khan"}, {"authorId": "33498709", "name": "Rifaqat Zaheer"}, {"authorId": "2111266186", "name": "Shahid Khan"}]}, {"paperId": "5a391667242b4a631acdd5917681b16a86523987", "url": "https://www.semanticscholar.org/paper/5a391667242b4a631acdd5917681b16a86523987", "title": "Deep Recurrent Neural Networks for Hyperspectral Image Classification", "abstract": "In recent years, vector-based machine learning algorithms, such as random forests, support vector machines, and 1-D convolutional neural networks, have shown promising results in hyperspectral image classification. Such methodologies, nevertheless, can lead to information loss in representing hyperspectral pixels, which intrinsically have a sequence-based data structure. A recurrent neural network (RNN), an important branch of the deep learning family, is mainly designed to handle sequential data. Can sequence-based RNN be an effective method of hyperspectral image classification? In this paper, we propose a novel RNN model that can effectively analyze hyperspectral pixels as sequential data and then determine information categories via network reasoning. As far as we know, this is the first time that an RNN framework has been proposed for hyperspectral image classification. Specifically, our RNN makes use of a newly proposed activation function, parametric rectified tanh (PRetanh), for hyperspectral sequential data analysis instead of the popular tanh or rectified linear unit. The proposed activation function makes it possible to use fairly high learning rates without the risk of divergence during the training procedure. Moreover, a modified gated recurrent unit, which uses PRetanh for hidden representation, is adopted to construct the recurrent layer in our network to efficiently process hyperspectral data and reduce the total number of parameters. Experimental results on three airborne hyperspectral images suggest competitive performance in the proposed mode. In addition, the proposed network architecture opens a new window for future research, showcasing the huge potential of deep recurrent networks for hyperspectral data analysis.", "year": 2017, "referenceCount": 47, "citationCount": 629, "influentialCitationCount": 38, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35041003", "name": "Lichao Mou"}, {"authorId": "2370080", "name": "Pedram Ghamisi"}, {"authorId": "46875441", "name": "Xiaoxiang Zhu"}]}, {"paperId": "d3ae61c0a6f4c2d729cec772526248171fb3deba", "url": "https://www.semanticscholar.org/paper/d3ae61c0a6f4c2d729cec772526248171fb3deba", "title": "A primer on deep learning in genomics", "abstract": null, "year": 2018, "referenceCount": 66, "citationCount": 410, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "2114313066", "name": "James Zou"}, {"authorId": "2256805", "name": "M. Huss"}, {"authorId": "144948925", "name": "Abubakar Abid"}, {"authorId": "1906270", "name": "P. Mohammadi"}, {"authorId": "3286188", "name": "A. Torkamani"}, {"authorId": "2969256", "name": "A. Telenti"}]}, {"paperId": "9bc9fb325eb6783158065ce3f582e2d69f13f2ca", "url": "https://www.semanticscholar.org/paper/9bc9fb325eb6783158065ce3f582e2d69f13f2ca", "title": "On the interpretability of machine learning-based model for predicting hypertension", "abstract": null, "year": 2019, "referenceCount": 93, "citationCount": 126, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "5742338", "name": "Radwa Elshawi"}, {"authorId": "1397581130", "name": "M. Al-Mallah"}, {"authorId": "1783693", "name": "S. Sakr"}]}, {"paperId": "bdef7eb9b62e2a12b870957879f7a097b41f6012", "url": "https://www.semanticscholar.org/paper/bdef7eb9b62e2a12b870957879f7a097b41f6012", "title": "Cost-Sensitive Learning with Neural Networks", "abstract": "In the usual setting of Machine Learning, classifiers are typically evaluated by estimating their error rate (or equi valently, the classification accuracy) on the test data. However, this mak es sense only if all errors have equal (uniform) costs. When the costs of er- rors differ between each other, the classifiers should be eva luated by comparing the total costs of the errors. Classifiers are typically designed to minimize the number of errors (incorrect classifications) made. When misclassification c osts vary between classes, this approach is not suitable. In this case the total misclassification cost should be minimized. In Machine Learning, only little work for dealing with non- uniform misclassification costs has been done. This paper pr esents a few different approaches for cost-sensitive modifications of the back- propagation learning algorithm for multilayered feedforw ard neural networks . The described approaches are thoroughly tested and eval- uated on several standard benchmark domains.", "year": 1998, "referenceCount": 13, "citationCount": 266, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1719813", "name": "M. Kukar"}, {"authorId": "143986204", "name": "I. Kononenko"}]}, {"paperId": "386fdc9b881df8a1c8acd9c4526f283e2ecdd1c5", "url": "https://www.semanticscholar.org/paper/386fdc9b881df8a1c8acd9c4526f283e2ecdd1c5", "title": "Efficient and self-adaptive in-situ learning in multilayer memristor neural networks", "abstract": null, "year": 2018, "referenceCount": 53, "citationCount": 439, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2047503990", "name": "Can Li"}, {"authorId": "145110861", "name": "D. Belkin"}, {"authorId": "26915373", "name": "Yunning Li"}, {"authorId": "2068882266", "name": "Peng Yan"}, {"authorId": "143707095", "name": "Miao Hu"}, {"authorId": "152293847", "name": "Ning Ge"}, {"authorId": "2152630916", "name": "Hao Jiang"}, {"authorId": "2064434505", "name": "Eric Montgomery"}, {"authorId": "47476951", "name": "Peng Lin"}, {"authorId": "8685249", "name": "Zhongrui Wang"}, {"authorId": "3171946", "name": "Wenhao Song"}, {"authorId": "33102961", "name": "J. Strachan"}, {"authorId": "2042112", "name": "Mark D. Barnell"}, {"authorId": "145820480", "name": "Qing Wu"}, {"authorId": "1761983", "name": "R. Williams"}, {"authorId": "152905474", "name": "J. Yang"}, {"authorId": "144499811", "name": "Q. Xia"}]}, {"paperId": "9142637aab30d925a18881b79e0d3b8cdd1be1d4", "url": "https://www.semanticscholar.org/paper/9142637aab30d925a18881b79e0d3b8cdd1be1d4", "title": "A learning method for system identification", "abstract": "A method for system identification is proposed which is based on the error-correcting training procedure in learning machines, and is referred to as \"learning identification.\" This learning identification is nondisturbing, is applicable to cases where the input signal is random and nonstationary, and can be completed within a short time, so that it may be used to identify linear quasi-time-invariant systems in which some parameters vary slowly in comparison with the time required for identification. This merit also makes it possible to eliminate noise disturbances by means of the moving average method. Computer simulation of the learning identification was carried out and the times required for identification were obtained for various cases. Some modifications of the learning identification were also investigated together with their computer simulations.", "year": 1967, "referenceCount": 1, "citationCount": 522, "influentialCitationCount": 38, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2101765170", "name": "J. Nagumo"}, {"authorId": "52641565", "name": "A. Noda"}]}, {"paperId": "40f3404ae1b397860c921eda79f94b0f5195f2fb", "url": "https://www.semanticscholar.org/paper/40f3404ae1b397860c921eda79f94b0f5195f2fb", "title": "Machine learning using higher order correlation networks", "abstract": null, "year": 1986, "referenceCount": 0, "citationCount": 163, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2116687606", "name": "Y. C. Lee"}, {"authorId": "30086297", "name": "G. Doolen"}, {"authorId": "1769857", "name": "H. H. Chen"}, {"authorId": "2148800040", "name": "G. Sun"}, {"authorId": "152819463", "name": "T. Maxwell"}, {"authorId": "72152149", "name": "H. Y. Lee"}, {"authorId": "145200131", "name": "C. L. Giles"}]}, {"paperId": "9f63cc53122173598c80c367d03014d1ed49be9f", "url": "https://www.semanticscholar.org/paper/9f63cc53122173598c80c367d03014d1ed49be9f", "title": "From signals to knowledge: A conceptual model for multimodal learning analytics", "abstract": "Multimodality in learning analytics and learning science is under the spotlight. The landscape of sensors and wearable trackers that can be used for learning support is evolving rapidly, as well as data collection and analysis methods. Multimodal data can now be collected and processed in real time at an unprecedented scale. With sensors, it is possible to capture observable events of the learning process such as learner's behaviour and the learning context. The learning process, however, consists also of latent attributes, such as the learner's cognitions or emotions. These attributes are unobservable to sensors and need to be elicited by human‐driven interpretations. We conducted a literature survey of experiments using multimodal data to frame the young research field of multimodal learning analytics. The survey explored the multimodal data used in related studies (the input space) and the learning theories selected (the hypothesis space). The survey led to the formulation of the Multimodal Learning Analytics Model whose main objectives are of (O1) mapping the use of multimodal data to enhance the feedback in a learning context; (O2) showing how to combine machine learning with multimodal data; and (O3) aligning the terminology used in the field of machine learning and learning science", "year": 2018, "referenceCount": 58, "citationCount": 88, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3413100", "name": "D. D. Mitri"}, {"authorId": "40405611", "name": "J. Schneider"}, {"authorId": "143989442", "name": "M. Specht"}, {"authorId": "1714952", "name": "H. Drachsler"}]}, {"paperId": "b48dc12387cdfde97d778c0e792a3638003544ad", "url": "https://www.semanticscholar.org/paper/b48dc12387cdfde97d778c0e792a3638003544ad", "title": "A review on machine learning principles for multi-view biological data integration", "abstract": "Driven by high-throughput sequencing techniques, modern genomic and clinical studies are in a strong need of integrative machine learning models for better use of vast volumes of heterogeneous information in the deep understanding of biological systems and the development of predictive models. How data from multiple sources (called multi-view data) are incorporated in a learning system is a key step for successful analysis. In this article, we provide a comprehensive review on omics and clinical data integration techniques, from a machine learning perspective, for various analyses such as prediction, clustering, dimension reduction and association. We shall show that Bayesian models are able to use prior information and model measurements with various distributions; tree-based methods can either build a tree with all features or collectively make a final decision based on trees learned from each view; kernel methods fuse the similarity matrices learned from individual views together for a final similarity matrix or learning model; network-based fusion methods are capable of inferring direct and indirect associations in a heterogeneous network; matrix factorization models have potential to learn interactions among features from different views; and a range of deep neural networks can be integrated in multi-modal learning for capturing the complex mechanism of biological systems.", "year": 2016, "referenceCount": 194, "citationCount": 274, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2128128939", "name": "Yifeng Li"}, {"authorId": "145391153", "name": "Fang-Xiang Wu"}, {"authorId": "1723419", "name": "A. Ngom"}]}, {"paperId": "470966e6967c1a0932fa388c7ff7e7b07875aacd", "url": "https://www.semanticscholar.org/paper/470966e6967c1a0932fa388c7ff7e7b07875aacd", "title": "Machine Learning for Information Retrieval: Neural Networks, Symbolic Learning, and Genetic Algorithms", "abstract": "Information retrieval using probabilistic techniques has attracted significant attention on the part of researchers in information and computer science over the past few decades. In the 1980s, knowledge-based techniques also made an impressive contribution to “intelligent” information retrieval and indexing. More recently, information science researchers have turned to other newer artificial-intelligence-based inductive learning techniques including neural networks, symbolic learning, and genetic algorithms. These newer techniques, which are grounded on diverse paradigms, have provided great opportunities for researchers to enhance the information processing and retrieval capabilities of current information storage and retrieval systems. In this article, we first provide an overview of these newer techniques and their use in information science research. To familiarize readers with these techniques, we present three popular methods: the connectionist Hopfield network; the symbolic ID3/ID5R; and evolution-based genetic algorithms. We discuss their knowledge representations and algorithms in the context of information retrieval. Sample implementation and testing results from our own research are also provided for each technique. We believe these techniques are promising in their ability to analyze user queries, identify users' information needs, and suggest alternatives for search. With proper user-system interactions, these methods can greatly complement the prevailing full-text, keyword-based, probabilistic, and knowledge-based techniques. © 1995 John Wiley & Sons, Inc.", "year": 1995, "referenceCount": 112, "citationCount": 306, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47666658", "name": "Hsinchun Chen"}]}, {"paperId": "6a0d253053ce8646e49904efe0e062bcc30d8257", "url": "https://www.semanticscholar.org/paper/6a0d253053ce8646e49904efe0e062bcc30d8257", "title": "Learning to Remember Rare Events", "abstract": "Despite recent advances, memory-augmented deep neural networks are still limited when it comes to life-long and one-shot learning, especially in remembering rare events. We present a large-scale life-long memory module for use in deep learning. The module exploits fast nearest-neighbor algorithms for efficiency and thus scales to large memory sizes. Except for the nearest-neighbor query, the module is fully differentiable and trained end-to-end with no extra supervision. It operates in a life-long manner, i.e., without the need to reset it during training. \nOur memory module can be easily added to any part of a supervised neural network. To show its versatility we add it to a number of networks, from simple convolutional ones tested on image classification to deep sequence-to-sequence and recurrent-convolutional models. In all cases, the enhanced network gains the ability to remember and do life-long one-shot learning. Our module remembers training examples shown many thousands of steps in the past and it can successfully generalize from them. We set new state-of-the-art for one-shot learning on the Omniglot dataset and demonstrate, for the first time, life-long one-shot learning in recurrent neural networks on a large-scale machine translation task.", "year": 2017, "referenceCount": 31, "citationCount": 292, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40527594", "name": "Lukasz Kaiser"}, {"authorId": "7624658", "name": "Ofir Nachum"}, {"authorId": "39788470", "name": "Aurko Roy"}, {"authorId": "1751569", "name": "Samy Bengio"}]}, {"paperId": "264efad57d38a3146c93ea243f377650f2ed31c1", "url": "https://www.semanticscholar.org/paper/264efad57d38a3146c93ea243f377650f2ed31c1", "title": "Source localization in an ocean waveguide using supervised machine learning", "abstract": "Source localization in ocean acoustics is posed as a machine learning problem in which data-driven methods learn source ranges directly from observed acoustic data. The pressure received by a vertical linear array is preprocessed by constructing a normalized sample covariance matrix and used as the input for three machine learning methods: feed-forward neural networks (FNN), support vector machines (SVM), and random forests (RF). The range estimation problem is solved both as a classification problem and as a regression problem by these three machine learning algorithms. The results of range estimation for the Noise09 experiment are compared for FNN, SVM, RF, and conventional matched-field processing and demonstrate the potential of machine learning for underwater source localization.", "year": 2017, "referenceCount": 57, "citationCount": 89, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Medicine"], "authors": [{"authorId": "8792988", "name": "Haiqiang Niu"}, {"authorId": "1929240", "name": "P. Gerstoft"}, {"authorId": "145245006", "name": "Emma Reeves"}]}, {"paperId": "398c296d0cc7f9d180f84969f8937e6d3a413796", "url": "https://www.semanticscholar.org/paper/398c296d0cc7f9d180f84969f8937e6d3a413796", "title": "Multi-column deep neural networks for image classification", "abstract": "Traditional methods of computer vision and machine learning cannot match human performance on tasks such as the recognition of handwritten digits or traffic signs. Our biologically plausible, wide and deep artificial neural network architectures can. Small (often minimal) receptive fields of convolutional winner-take-all neurons yield large network depth, resulting in roughly as many sparsely connected neural layers as found in mammals between retina and visual cortex. Only winner neurons are trained. Several deep neural columns become experts on inputs preprocessed in different ways; their predictions are averaged. Graphics cards allow for fast training. On the very competitive MNIST handwriting benchmark, our method is the first to achieve near-human performance. On a traffic sign recognition benchmark it outperforms humans by a factor of two. We also improve the state-of-the-art on a plethora of common image classification benchmarks.", "year": 2012, "referenceCount": 42, "citationCount": 3568, "influentialCitationCount": 169, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1895356", "name": "D. Ciresan"}, {"authorId": "2514691", "name": "U. Meier"}, {"authorId": "145341374", "name": "J. Schmidhuber"}]}, {"paperId": "96c9f11fd9901f2edeaab8cf6bbff2590cea93c4", "url": "https://www.semanticscholar.org/paper/96c9f11fd9901f2edeaab8cf6bbff2590cea93c4", "title": "Deep Learning using Support Vector Machines", "abstract": "Recently, fully-connected and convolutional neural networks have been trained to reach state-of-the-art performance on a wide variety of tasks such as speech recognition, image classification, natural language processing, and bioinformatics data. For classification tasks, much of these “deep learning” models employ the softmax activation functions to learn output labels in 1-of-K format. In this paper, we demonstrate a small but consistent advantage of replacing softmax layer with a linear support vector machine. Learning minimizes a margin-based loss instead of the cross-entropy loss. In almost all of the previous works, hidden representation of deep networks are first learned using supervised or unsupervised techniques, and then are fed into SVMs as inputs. In contrast to those models, we are proposing to train all layers of the deep networks by backpropagating gradients through the top level SVM, learning features of all layers. Our experiments show that simply replacing softmax with linear SVMs gives significant gains on datasets MNIST, CIFAR-10, and the ICML 2013 Representation Learning Workshop’s face expression recognition challenge.", "year": 2013, "referenceCount": 17, "citationCount": 153, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34312504", "name": "Yichuan Tang"}]}, {"paperId": "62d4aaaf562df94c4bdb116ee1e5cc2843c88bec", "url": "https://www.semanticscholar.org/paper/62d4aaaf562df94c4bdb116ee1e5cc2843c88bec", "title": "What Role Does Hydrological Science Play in the Age of Machine Learning?", "abstract": "This paper is derived from a keynote talk given at the Google's 2020 Flood Forecasting Meets Machine Learning Workshop. Recent experiments applying deep learning to rainfall‐runoff simulation indicate that there is significantly more information in large‐scale hydrological data sets than hydrologists have been able to translate into theory or models. While there is a growing interest in machine learning in the hydrological sciences community, in many ways, our community still holds deeply subjective and nonevidence‐based preferences for models based on a certain type of “process understanding” that has historically not translated into accurate theory, models, or predictions. This commentary is a call to action for the hydrology community to focus on developing a quantitative understanding of where and when hydrological process understanding is valuable in a modeling discipline increasingly dominated by machine learning. We offer some potential perspectives and preliminary examples about how this might be accomplished.", "year": 2020, "referenceCount": 129, "citationCount": 129, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8451065", "name": "G. Nearing"}, {"authorId": "67249817", "name": "Frederik Kratzert"}, {"authorId": "1579255098", "name": "A. Sampson"}, {"authorId": "34983296", "name": "C. Pelissier"}, {"authorId": "40270530", "name": "D. Klotz"}, {"authorId": "1492153172", "name": "J. Frame"}, {"authorId": "1750699488", "name": "C. Prieto"}, {"authorId": "2055614078", "name": "H. Gupta"}]}, {"paperId": "b5ee991fd45fb7f12df815c1fdb0767a98f19127", "url": "https://www.semanticscholar.org/paper/b5ee991fd45fb7f12df815c1fdb0767a98f19127", "title": "Fault diagnosis of ball bearings using machine learning methods", "abstract": null, "year": 2011, "referenceCount": 16, "citationCount": 345, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39146522", "name": "P. K. Kankar"}, {"authorId": "2146390660", "name": "Satish C. Sharma"}, {"authorId": "144483234", "name": "S. Harsha"}]}, {"paperId": "4b752ee2c09426abfd79f6556014ef6599d19d0d", "url": "https://www.semanticscholar.org/paper/4b752ee2c09426abfd79f6556014ef6599d19d0d", "title": "Towards Making Unlabeled Data Never Hurt", "abstract": "It is usually expected that learning performance can be improved by exploiting unlabeled data, particularly when the number of labeled data is limited. However, it has been reported that, in some cases existing semi-supervised learning approaches perform even worse than supervised ones which only use labeled data. For this reason, it is desirable to develop safe semi-supervised learning approaches that will not significantly reduce learning performance when unlabeled data are used. This paper focuses on improving the safeness of semi-supervised support vector machines (S3VMs). First, the S3VM-us approach is proposed. It employs a conservative strategy and uses only the unlabeled instances that are very likely to be helpful, while avoiding the use of highly risky ones. This approach improves safeness but its performance improvement using unlabeled data is often much smaller than S3VMs. In order to develop a safe and well-performing approach, we examine the fundamental assumption of S3VMs, i.e., low-density separation. Based on the observation that multiple good candidate low-density separators may be identified from training data, safe semi-supervised support vector machines (S4VMs) are here proposed. This approach uses multiple low-density separators to approximate the ground-truth decision boundary and maximizes the improvement in performance of inductive SVMs for any candidate separator. Under the assumption employed by S3VMs, it is here shown that S4VMs are provably safe and that the performance improvement using unlabeled data can be maximized. An out-of-sample extension of S4VMs is also presented. This extension allows S4VMs to make predictions on unseen instances. Our empirical study on a broad range of data shows that the overall performance of S4VMs is highly competitive with S3VMs, whereas in contrast to S3VMs which hurt performance significantly in many cases, S4VMs rarely perform worse than inductive SVMs.", "year": 2011, "referenceCount": 62, "citationCount": 298, "influentialCitationCount": 41, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2110463675", "name": "Yu-Feng Li"}, {"authorId": "145624000", "name": "Zhi-Hua Zhou"}]}, {"paperId": "055e2b142026cadd9ebb7b740e1641d6fafa962b", "url": "https://www.semanticscholar.org/paper/055e2b142026cadd9ebb7b740e1641d6fafa962b", "title": "Machine Unlearning", "abstract": "Once users have shared their data online, it is generally difficult for them to revoke access and ask for the data to be deleted. Machine learning (ML) exacerbates this problem because any model trained with said data may have memorized it, putting users at risk of a successful privacy attack exposing their information. Yet, having models unlearn is notoriously difficult.We introduce SISA training, a framework that expedites the unlearning process by strategically limiting the influence of a data point in the training procedure. While our framework is applicable to any learning algorithm, it is designed to achieve the largest improvements for stateful algorithms like stochastic gradient descent for deep neural networks. SISA training reduces the computational overhead associated with unlearning, even in the worst-case setting where unlearning requests are made uniformly across the training set. In some cases, the service provider may have a prior on the distribution of unlearning requests that will be issued by users. We may take this prior into account to partition and order data accordingly, and further decrease overhead from unlearning.Our evaluation spans several datasets from different domains, with corresponding motivations for unlearning. Under no distributional assumptions, for simple learning tasks, we observe that SISA training improves time to unlearn points from the Purchase dataset by 4.63×, and 2.45× for the SVHN dataset, over retraining from scratch. SISA training also provides a speed-up of 1.36× in retraining for complex learning tasks such as ImageNet classification; aided by transfer learning, this results in a small degradation in accuracy. Our work contributes to practical data governance in machine unlearning.", "year": 2019, "referenceCount": 65, "citationCount": 103, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1452678444", "name": "Lucas Bourtoule"}, {"authorId": "143754359", "name": "Varun Chandrasekaran"}, {"authorId": "1415982317", "name": "Christopher A. Choquette-Choo"}, {"authorId": "120074583", "name": "Hengrui Jia"}, {"authorId": "1452679273", "name": "Adelin Travers"}, {"authorId": "23696685", "name": "Baiwu Zhang"}, {"authorId": "47412202", "name": "D. Lie"}, {"authorId": "1967156", "name": "Nicolas Papernot"}]}, {"paperId": "69c1d27722de73178e1ec71ab1caf5b3074d8ce4", "url": "https://www.semanticscholar.org/paper/69c1d27722de73178e1ec71ab1caf5b3074d8ce4", "title": "Society-in-the-loop: programming the algorithmic social contract", "abstract": null, "year": 2017, "referenceCount": 88, "citationCount": 209, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1705156", "name": "I. Rahwan"}]}, {"paperId": "4cc7507032779128bfc1b648a7892214c4eb6c43", "url": "https://www.semanticscholar.org/paper/4cc7507032779128bfc1b648a7892214c4eb6c43", "title": "Optimization with First-Order Surrogate Functions", "abstract": "In this paper, we study optimization methods consisting of iteratively minimizing surrogates of an objective function. By proposing several algorithmic variants and simple convergence analyses, we make two main contributions. First, we provide a unified viewpoint for several first-order optimization techniques such as accelerated proximal gradient, block coordinate descent, or Frank-Wolfe algorithms. Second, we introduce a new incremental scheme that experimentally matches or outperforms state-of-the-art solvers for large-scale optimization problems typically arising in machine learning.", "year": 2013, "referenceCount": 41, "citationCount": 182, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2599292", "name": "J. Mairal"}]}, {"paperId": "597a73c173b921b6adf17835ace73bfdb2de7111", "url": "https://www.semanticscholar.org/paper/597a73c173b921b6adf17835ace73bfdb2de7111", "title": "Modeling virtualized applications using machine learning techniques", "abstract": "With the growing adoption of virtualized datacenters and cloud hosting services, the allocation and sizing of resources such as CPU, memory, and I/O bandwidth for virtual machines (VMs) is becoming increasingly important. Accurate performance modeling of an application would help users in better VM sizing, thus reducing costs. It can also benefit cloud service providers who can offer a new charging model based on the VMs' performance instead of their configured sizes. In this paper, we present techniques to model the performance of a VM-hosted application as a function of the resources allocated to the VM and the resource contention it experiences. To address this multi-dimensional modeling problem, we propose and refine the use of two machine learning techniques: artificial neural network (ANN) and support vector machine (SVM). We evaluate these modeling techniques using five virtualized applications from the RUBiS and Filebench suite of benchmarks and demonstrate that their median and 90th percentile prediction errors are within 4.36% and 29.17% respectively. These results are substantially better than regression based approaches as well as direct applications of machine learning techniques without our refinements. We also present a simple and effective approach to VM sizing and empirically demonstrate that it can deliver optimal results for 65% of the sizing problems that we studied and produces close-to-optimal sizes for the remaining 35%.", "year": 2012, "referenceCount": 40, "citationCount": 128, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "3070722", "name": "Sajib Kundu"}, {"authorId": "1709495", "name": "R. Rangaswami"}, {"authorId": "2063996022", "name": "Ajay Gulati"}, {"authorId": "145914105", "name": "Ming Zhao"}, {"authorId": "145058524", "name": "K. Dutta"}]}, {"paperId": "8b6e8d71d17a1fb5a7172c5d44ebba1cf06a7dd4", "url": "https://www.semanticscholar.org/paper/8b6e8d71d17a1fb5a7172c5d44ebba1cf06a7dd4", "title": "Shallow and Deep Networks Intrusion Detection System: A Taxonomy and Survey", "abstract": "Intrusion detection has attracted a considerable interest from researchers and industries. The community, after many years of research, still faces the problem of building reliable and efficient IDS that are capable of handling large quantities of data, with changing patterns in real time situations. The work presented in this manuscript classifies intrusion detection systems (IDS). Moreover, a taxonomy and survey of shallow and deep networks intrusion detection systems is presented based on previous and current works. This taxonomy and survey reviews machine learning techniques and their performance in detecting anomalies. Feature selection which influences the effectiveness of machine learning (ML) IDS is discussed to explain the role of feature selection in the classification and training phase of ML IDS. Finally, a discussion of the false and true positive alarm rates is presented to help researchers model reliable and efficient machine learning based intrusion detection systems.", "year": 2017, "referenceCount": 164, "citationCount": 184, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8801229", "name": "Elike Hodo"}, {"authorId": "2778050", "name": "X. Bellekens"}, {"authorId": "153072596", "name": "Andrew W. Hamilton"}, {"authorId": "2954675", "name": "C. Tachtatzis"}, {"authorId": "153890027", "name": "Robert C. Atkinson"}]}, {"paperId": "006c846c72e77cb913be4b2c76664967e9e01ee0", "url": "https://www.semanticscholar.org/paper/006c846c72e77cb913be4b2c76664967e9e01ee0", "title": "AI^2: Training a Big Data Machine to Defend", "abstract": "We present AI2, an analyst-in-the-loop security system where Analyst Intuition (AI) is put together with state-of-the-art machine learning to build a complete end-to-end Artificially Intelligent solution (AI). The system presents four key features: a big data behavioral analytics platform, an outlier detection system, a mechanism to obtain feedback from security analysts, and a supervised learning module. We validate our system with a real-world data set consisting of 3.6 billion log lines and 70.2 million entities. The results show that the system is capable of learning to defend against unseen attacks. With respect to unsupervised outlier analysis, our system improves the detection rate in 2.92× and reduces false positives by more than 5×.", "year": 2016, "referenceCount": 20, "citationCount": 231, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1803567", "name": "K. Veeramachaneni"}, {"authorId": "2205099", "name": "Ignacio Arnaldo"}, {"authorId": "2066975057", "name": "Vamsi Korrapati"}, {"authorId": "115264590", "name": "Constantinos Bassias"}, {"authorId": "69486668", "name": "Kuan-Ching Li"}]}, {"paperId": "9e18f56bfee171cd53702ad028a1be957683eeaa", "url": "https://www.semanticscholar.org/paper/9e18f56bfee171cd53702ad028a1be957683eeaa", "title": "Asynchronous Byzantine Machine Learning (the case of SGD)", "abstract": "Asynchronous distributed machine learning solutions have proven very effective so far, but always assuming perfectly functioning workers. In practice, some of the workers can however exhibit Byzantine behavior, caused by hardware failures, software bugs, corrupt data, or even malicious attacks. We introduce \\emph{Kardam}, the first distributed asynchronous stochastic gradient descent (SGD) algorithm that copes with Byzantine workers. Kardam consists of two complementary components: a filtering and a dampening component. The first is scalar-based and ensures resilience against $\\frac{1}{3}$ Byzantine workers. Essentially, this filter leverages the Lipschitzness of cost functions and acts as a self-stabilizer against Byzantine workers that would attempt to corrupt the progress of SGD. The dampening component bounds the convergence rate by adjusting to stale information through a generic gradient weighting scheme. We prove that Kardam guarantees almost sure convergence in the presence of asynchrony and Byzantine behavior, and we derive its convergence rate. We evaluate Kardam on the CIFAR-100 and EMNIST datasets and measure its overhead with respect to non Byzantine-resilient solutions. We empirically show that Kardam does not introduce additional noise to the learning procedure but does induce a slowdown (the cost of Byzantine resilience) that we both theoretically and empirically show to be less than $f/n$, where $f$ is the number of Byzantine failures tolerated and $n$ the total number of workers. Interestingly, we also empirically observe that the dampening component is interesting in its own right for it enables to build an SGD algorithm that outperforms alternative staleness-aware asynchronous competitors in environments with honest workers.", "year": 2018, "referenceCount": 36, "citationCount": 81, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "11008382", "name": "Georgios Damaskinos"}, {"authorId": "9623412", "name": "El Mahdi El Mhamdi"}, {"authorId": "1727558", "name": "R. Guerraoui"}, {"authorId": "40051618", "name": "Rhicheek Patra"}, {"authorId": "3035974", "name": "Mahsa Taziki"}]}, {"paperId": "b20e117d5d05cba6dd070fe50afbb8a71d9a4618", "url": "https://www.semanticscholar.org/paper/b20e117d5d05cba6dd070fe50afbb8a71d9a4618", "title": "Deep learning for neuroimaging: a validation study", "abstract": "Deep learning methods have recently made notable advances in the tasks of classification and representation learning. These tasks are important for brain imaging and neuroscience discovery, making the methods attractive for porting to a neuroimager's toolbox. Success of these methods is, in part, explained by the flexibility of deep learning models. However, this flexibility makes the process of porting to new areas a difficult parameter optimization problem. In this work we demonstrate our results (and feasible parameter ranges) in application of deep learning methods to structural and functional brain imaging data. These methods include deep belief networks and their building block the restricted Boltzmann machine. We also describe a novel constraint-based approach to visualizing high dimensional data. We use it to analyze the effect of parameter choices on data transformations. Our results show that deep learning methods are able to learn physiologically important representations and detect latent relations in neuroimaging data.", "year": 2013, "referenceCount": 48, "citationCount": 497, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "2122479", "name": "S. Plis"}, {"authorId": "40482726", "name": "R. Devon Hjelm"}, {"authorId": "145124475", "name": "R. Salakhutdinov"}, {"authorId": "144048760", "name": "V. Calhoun"}]}, {"paperId": "a4e088a3d92f9299b6a8060c21a1082ecb251902", "url": "https://www.semanticscholar.org/paper/a4e088a3d92f9299b6a8060c21a1082ecb251902", "title": "Hyperbolic Entailment Cones for Learning Hierarchical Embeddings", "abstract": "Learning graph representations via low-dimensional embeddings that preserve relevant network properties is an important class of problems in machine learning. We here present a novel method to embed directed acyclic graphs. Following prior work, we first advocate for using hyperbolic spaces which provably model tree-like structures better than Euclidean geometry. Second, we view hierarchical relations as partial orders defined using a family of nested geodesically convex cones. We prove that these entailment cones admit an optimal shape with a closed form expression both in the Euclidean and hyperbolic spaces. Moreover, they canonically define the embedding learning process. Experiments show significant improvements of our method over strong recent baselines both in terms of representational capacity and generalization.", "year": 2018, "referenceCount": 37, "citationCount": 164, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1882451", "name": "O. Ganea"}, {"authorId": "9940262", "name": "Gary Bécigneul"}, {"authorId": "143936663", "name": "Thomas Hofmann"}]}, {"paperId": "9e9d1a8ac0307b66c19c42eef07910309c04c57f", "url": "https://www.semanticscholar.org/paper/9e9d1a8ac0307b66c19c42eef07910309c04c57f", "title": "Acceleration of saddle-point searches with machine learning.", "abstract": "In atomistic simulations, the location of the saddle point on the potential-energy surface (PES) gives important information on transitions between local minima, for example, via transition-state theory. However, the search for saddle points often involves hundreds or thousands of ab initio force calls, which are typically all done at full accuracy. This results in the vast majority of the computational effort being spent calculating the electronic structure of states not important to the researcher, and very little time performing the calculation of the saddle point state itself. In this work, we describe how machine learning (ML) can reduce the number of intermediate ab initio calculations needed to locate saddle points. Since machine-learning models can learn from, and thus mimic, atomistic simulations, the saddle-point search can be conducted rapidly in the machine-learning representation. The saddle-point prediction can then be verified by an ab initio calculation; if it is incorrect, this strategically has identified regions of the PES where the machine-learning representation has insufficient training data. When these training data are used to improve the machine-learning model, the estimates greatly improve. This approach can be systematized, and in two simple example problems we demonstrate a dramatic reduction in the number of ab initio force calls. We expect that this approach and future refinements will greatly accelerate searches for saddle points, as well as other searches on the potential energy surface, as machine-learning methods see greater adoption by the atomistics community.", "year": 2016, "referenceCount": 18, "citationCount": 95, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "34641730", "name": "A. Peterson"}]}, {"paperId": "ffd42963b10315d79fce48e8aa8e185e9a109152", "url": "https://www.semanticscholar.org/paper/ffd42963b10315d79fce48e8aa8e185e9a109152", "title": "Evaluating Different Machine Learning Methods for Upscaling Evapotranspiration from Flux Towers to the Regional Scale", "abstract": "Evapotranspiration (ET) is a vital variable for land‐atmosphere interactions that links surface energy balance, water, and carbon cycles. The in situ techniques can measure ET accurately but the observations have limited spatial and temporal coverage. Modeling approaches have been used to estimate ET at broad spatial and temporal scales, while accurately simulating ET at regional scales remains a major challenge. In this study, we upscale ET from eddy covariance flux tower sites to the regional scale with machine learning algorithms. Five machine learning algorithms are employed for ET upscaling including artificial neural network, Cubist, deep belief network, random forest, and support vector machine. The machine learning methods are trained and tested at 36 flux towers sites (65 site years) across the Heihe River Basin and are then applied to estimate ET for each grid cell (1 km × 1 km) within the watershed and for each day over the period 2012–2016. The artificial neural network, Cubist, random forest, and support vector machine algorithms have almost identical performance in estimating ET and have slightly lower root‐mean‐square error than deep belief network at the site scale. The random forest algorithm has slightly lower relative uncertainty at the regional scale than other methods based on three‐cornered hat method. Additionally, the machine learning methods perform better over densely vegetated conditions than barren land or sparsely vegetated conditions. The regional ET generated from the machine learning approaches captured the spatial and temporal patterns of ET at the regional scale.", "year": 2018, "referenceCount": 82, "citationCount": 104, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Environmental Science"], "authors": [{"authorId": "8739781", "name": "Tongren Xu"}, {"authorId": "49694840", "name": "Zhixia Guo"}, {"authorId": "83386822", "name": "Shaomin Liu"}, {"authorId": "2167426766", "name": "Xinlei He"}, {"authorId": "113243901", "name": "Yangfanyu Meng"}, {"authorId": "50070098", "name": "Ziwei Xu"}, {"authorId": "40684078", "name": "Youlong Xia"}, {"authorId": "2786708", "name": "Jingfeng Xiao"}, {"authorId": "104755339", "name": "Y. Zhang"}, {"authorId": "48521450", "name": "Yanfei Ma"}, {"authorId": "2634361", "name": "Lisheng Song"}]}, {"paperId": "b65aaa2038d25387a565babd16bfa7193e3a0268", "url": "https://www.semanticscholar.org/paper/b65aaa2038d25387a565babd16bfa7193e3a0268", "title": "Adversarial Neural Machine Translation", "abstract": "In this paper, we study a new learning paradigm for Neural Machine Translation (NMT). Instead of maximizing the likelihood of the human translation as in previous works, we minimize the distinction between human translation and the translation given by an NMT model. To achieve this goal, inspired by the recent success of generative adversarial networks (GANs), we employ an adversarial training architecture and name it as Adversarial-NMT. In Adversarial-NMT, the training of the NMT model is assisted by an adversary, which is an elaborately designed Convolutional Neural Network (CNN). The goal of the adversary is to differentiate the translation result generated by the NMT model from that by human. The goal of the NMT model is to produce high quality translations so as to cheat the adversary. A policy gradient method is leveraged to co-train the NMT model and the adversary. Experimental results on English$\\rightarrow$French and German$\\rightarrow$English translation tasks show that Adversarial-NMT can achieve significantly better translation quality than several strong baselines.", "year": 2017, "referenceCount": 47, "citationCount": 121, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "47767791", "name": "Lijun Wu"}, {"authorId": "2794096", "name": "Yingce Xia"}, {"authorId": "2004786514", "name": "Li Zhao"}, {"authorId": "143853336", "name": "Fei Tian"}, {"authorId": "143826491", "name": "Tao Qin"}, {"authorId": "66117656", "name": "J. Lai"}, {"authorId": "2110264337", "name": "Tie-Yan Liu"}]}, {"paperId": "8dff4207615846c2b65d79383363001fa1d60c8c", "url": "https://www.semanticscholar.org/paper/8dff4207615846c2b65d79383363001fa1d60c8c", "title": "Unachievable Region in Precision-Recall Space and Its Effect on Empirical Evaluation", "abstract": "Precision-recall (PR) curves and the areas under them are widely used to summarize machine learning results, especially for data sets exhibiting class skew. They are often used analogously to ROC curves and the area under ROC curves. It is known that PR curves vary as class skew changes. What was not recognized before this paper is that there is a region of PR space that is completely unachievable, and the size of this region depends only on the skew. This paper precisely characterizes the size of that region and discusses its implications for empirical evaluation methodology in machine learning.", "year": 2012, "referenceCount": 20, "citationCount": 81, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "35817698", "name": "Kendrick Boyd"}, {"authorId": "144815446", "name": "Jesse Davis"}, {"authorId": "144334798", "name": "David Page"}, {"authorId": "1706989", "name": "V. S. Costa"}]}, {"paperId": "c56e758ba18066a8cdc333f15dfdb7ea6af4d283", "url": "https://www.semanticscholar.org/paper/c56e758ba18066a8cdc333f15dfdb7ea6af4d283", "title": "Man vs. computer: Benchmarking machine learning algorithms for traffic sign recognition", "abstract": null, "year": 2012, "referenceCount": 37, "citationCount": 1031, "influentialCitationCount": 200, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "69539592", "name": "J. Stallkamp"}, {"authorId": "2502317", "name": "Marc Schlipsing"}, {"authorId": "2743486", "name": "J. Salmen"}, {"authorId": "1748824", "name": "C. Igel"}]}, {"paperId": "cae9d90524cccac5081666985d5d055b71697cee", "url": "https://www.semanticscholar.org/paper/cae9d90524cccac5081666985d5d055b71697cee", "title": "Tensor Comprehensions: Framework-Agnostic High-Performance Machine Learning Abstractions", "abstract": "Deep learning models with convolutional and recurrent networks are now ubiquitous and analyze massive amounts of audio, image, video, text and graph data, with applications in automatic translation, speech-to-text, scene understanding, ranking user preferences, ad placement, etc. Competing frameworks for building these networks such as TensorFlow, Chainer, CNTK, Torch/PyTorch, Caffe1/2, MXNet and Theano, explore different tradeoffs between usability and expressiveness, research or production orientation and supported hardware. They operate on a DAG of computational operators, wrapping high-performance libraries such as CUDNN (for NVIDIA GPUs) or NNPACK (for various CPUs), and automate memory allocation, synchronization, distribution. Custom operators are needed where the computation does not fit existing high-performance library calls, usually at a high engineering cost. This is frequently required when new operators are invented by researchers: such operators suffer a severe performance penalty, which limits the pace of innovation. Furthermore, even if there is an existing runtime call these frameworks can use, it often doesn't offer optimal performance for a user's particular network architecture and dataset, missing optimizations between operators as well as optimizations that can be done knowing the size and shape of data. Our contributions include (1) a language close to the mathematics of deep learning called Tensor Comprehensions offering both imperative and declarative styles, (2) a polyhedral Just-In-Time compiler to convert a mathematical description of a deep learning DAG into a CUDA kernel with delegated memory management and synchronization, also providing optimizations such as operator fusion and specialization for specific sizes, (3) a compilation cache populated by an autotuner. [Abstract cutoff]", "year": 2018, "referenceCount": 96, "citationCount": 313, "influentialCitationCount": 42, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1800919", "name": "Nicolas Vasilache"}, {"authorId": "2054833547", "name": "O. Zinenko"}, {"authorId": "2097631216", "name": "Theodoros Theodoridis"}, {"authorId": "47316088", "name": "Priya Goyal"}, {"authorId": "2375710", "name": "Zach DeVito"}, {"authorId": "16521420", "name": "William S. Moses"}, {"authorId": "1772079", "name": "Sven Verdoolaege"}, {"authorId": "144187067", "name": "Andrew Adams"}, {"authorId": "145509576", "name": "Albert Cohen"}]}, {"paperId": "18a4de46136efa1797a3a6cebb3ae9ed5aaf17bc", "url": "https://www.semanticscholar.org/paper/18a4de46136efa1797a3a6cebb3ae9ed5aaf17bc", "title": "Invariant kernel functions for pattern analysis and machine learning", "abstract": null, "year": 2007, "referenceCount": 77, "citationCount": 78, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2800929", "name": "B. Haasdonk"}, {"authorId": "36736177", "name": "H. Burkhardt"}]}, {"paperId": "27644a5f94db5cac7a97b4f2aeb612de7ee38d57", "url": "https://www.semanticscholar.org/paper/27644a5f94db5cac7a97b4f2aeb612de7ee38d57", "title": "Detecting cyber-physical attacks in CyberManufacturing systems with machine learning methods", "abstract": null, "year": 2019, "referenceCount": 27, "citationCount": 122, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "9969447", "name": "Mingtao Wu"}, {"authorId": "2114791217", "name": "Zhengyi Song"}, {"authorId": "32393545", "name": "Y. Moon"}]}, {"paperId": "4e4c56efc132ec1506cf7edb1077608b2483354e", "url": "https://www.semanticscholar.org/paper/4e4c56efc132ec1506cf7edb1077608b2483354e", "title": "On breast cancer detection: an application of machine learning algorithms on the wisconsin diagnostic dataset", "abstract": "This paper presents a comparison of six machine learning (ML) algorithms: GRU-SVM[1], Linear Regression, Multilayer Perceptron (MLP), Nearest Neighbor (NN) search, Softmax Regression, and Support Vector Machine (SVM) on the Wisconsin Diagnostic Breast Cancer (WDBC) dataset[2] by measuring their classification test accuracy, and their sensitivity and specificity values. The said dataset consists of features which were computed from digitized images of FNA tests on a breast mass[2]. For the implementation of the ML algorithms, the dataset was partitioned in the following fashion: 70% for training phase, and 30% for the testing phase. The hyper-parameters used for all the classifiers were manually assigned. Results show that all the presented ML algorithms performed well (all exceeded 90% test accuracy) on the classification task. The MLP algorithm stands out among the implemented algorithms with a test accuracy of ≈99.04%.", "year": 2017, "referenceCount": 20, "citationCount": 140, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "26412983", "name": "Abien Fred Agarap"}]}, {"paperId": "1f6b9766374d14d81c225c2ced5bb02fe0bccd43", "url": "https://www.semanticscholar.org/paper/1f6b9766374d14d81c225c2ced5bb02fe0bccd43", "title": "The What-If Tool: Interactive Probing of Machine Learning Models", "abstract": "A key challenge in developing and deploying Machine Learning (ML) systems is understanding their performance across a wide range of inputs. To address this challenge, we created the What-If Tool, an open-source application that allows practitioners to probe, visualize, and analyze ML systems, with minimal coding. The What-If Tool lets practitioners test performance in hypothetical situations, analyze the importance of different data features, and visualize model behavior across multiple models and subsets of input data. It also lets practitioners measure systems according to multiple ML fairness metrics. We describe the design of the tool, and report on real-life usage at different organizations.", "year": 2019, "referenceCount": 30, "citationCount": 225, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "authors": [{"authorId": "49556437", "name": "James Wexler"}, {"authorId": "51478016", "name": "Mahima Pushkarna"}, {"authorId": "2843215", "name": "Tolga Bolukbasi"}, {"authorId": "145233583", "name": "M. Wattenberg"}, {"authorId": "1765169", "name": "F. Viégas"}, {"authorId": "2109357255", "name": "Jimbo Wilson"}]}, {"paperId": "7313c770c84af50aa8e34ec21c8e50413f99c89f", "url": "https://www.semanticscholar.org/paper/7313c770c84af50aa8e34ec21c8e50413f99c89f", "title": "A Review on Ensembles for the Class Imbalance Problem: Bagging-, Boosting-, and Hybrid-Based Approaches", "abstract": "Classifier learning with data-sets that suffer from imbalanced class distributions is a challenging problem in data mining community. This issue occurs when the number of examples that represent one class is much lower than the ones of the other classes. Its presence in many real-world applications has brought along a growth of attention from researchers. In machine learning, the ensemble of classifiers are known to increase the accuracy of single classifiers by combining several of them, but neither of these learning techniques alone solve the class imbalance problem, to deal with this issue the ensemble learning algorithms have to be designed specifically. In this paper, our aim is to review the state of the art on ensemble techniques in the framework of imbalanced data-sets, with focus on two-class problems. We propose a taxonomy for ensemble-based methods to address the class imbalance where each proposal can be categorized depending on the inner ensemble methodology in which it is based. In addition, we develop a thorough empirical comparison by the consideration of the most significant published approaches, within the families of the taxonomy proposed, to show whether any of them makes a difference. This comparison has shown the good behavior of the simplest approaches which combine random undersampling techniques with bagging or boosting ensembles. In addition, the positive synergy between sampling techniques and bagging has stood out. Furthermore, our results show empirically that ensemble-based algorithms are worthwhile since they outperform the mere use of preprocessing techniques before learning the classifier, therefore justifying the increase of complexity by means of a significant enhancement of the results.", "year": 2012, "referenceCount": 121, "citationCount": 1981, "influentialCitationCount": 142, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1924061", "name": "M. Galar"}, {"authorId": "143741583", "name": "Alberto Fernández"}, {"authorId": "1695535", "name": "E. Tartas"}, {"authorId": "1715030", "name": "H. Bustince"}, {"authorId": "1699069", "name": "F. Herrera"}]}, {"paperId": "ab68ddbdd8d0b61d9f9c8fa500a4c13d06158060", "url": "https://www.semanticscholar.org/paper/ab68ddbdd8d0b61d9f9c8fa500a4c13d06158060", "title": "Variational Information Maximisation for Intrinsically Motivated Reinforcement Learning", "abstract": "The mutual information is a core statistical quantity that has applications in all areas of machine learning, whether this is in training of density models over multiple data modalities, in maximising the efficiency of noisy transmission channels, or when learning behaviour policies for exploration by artificial agents. Most learning algorithms that involve optimisation of the mutual information rely on the Blahut-Arimoto algorithm --- an enumerative algorithm with exponential complexity that is not suitable for modern machine learning applications. This paper provides a new approach for scalable optimisation of the mutual information by merging techniques from variational inference and deep learning. We develop our approach by focusing on the problem of intrinsically-motivated learning, where the mutual information forms the definition of a well-known internal drive known as empowerment. Using a variational lower bound on the mutual information, combined with convolutional networks for handling visual input streams, we develop a stochastic optimisation algorithm that allows for scalable information maximisation and empowerment-based reasoning directly from pixels to actions.", "year": 2015, "referenceCount": 32, "citationCount": 324, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "14594344", "name": "S. Mohamed"}, {"authorId": "1748523", "name": "Danilo Jimenez Rezende"}]}, {"paperId": "5f8b7ada7d5770861c61b50d269dc9afc86db735", "url": "https://www.semanticscholar.org/paper/5f8b7ada7d5770861c61b50d269dc9afc86db735", "title": "Class Imbalances versus Class Overlapping: An Analysis of a Learning System Behavior", "abstract": null, "year": 2004, "referenceCount": 18, "citationCount": 317, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1793286", "name": "R. Prati"}, {"authorId": "145666101", "name": "Gustavo E. A. P. A. Batista"}, {"authorId": "1737677", "name": "M. C. Monard"}]}, {"paperId": "a65b0ade2d7b4624230ba8a919235208c84b4831", "url": "https://www.semanticscholar.org/paper/a65b0ade2d7b4624230ba8a919235208c84b4831", "title": "Home", "abstract": "The team makes fundamental and applied research in the analysis of complex natural signals using paradigms and methods from Statistical Physics such as: scale invariance, predictabilit y , universal ity classes We study the parameters related to common statistical organization in different complex signals and systems, we derive new types of sparse and compact representations , and machine learning approaches . We are also developing tools for the analysis of complex signals that better match the statistical and geometrical organisation inside these data: as a typical example, we cite the evaluation of cascading properties of physical variables inside complex signals.", "year": 2016, "referenceCount": 15, "citationCount": 1314, "influentialCitationCount": 108, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "2068514638", "name": "A. Doria"}]}, {"paperId": "2f648f983164871656c579c5e043a3dd251f61f7", "url": "https://www.semanticscholar.org/paper/2f648f983164871656c579c5e043a3dd251f61f7", "title": "Evaluation of Machine-Learning Algorithms for Predicting Opioid Overdose Risk Among Medicare Beneficiaries With Opioid Prescriptions", "abstract": "Key Points Question Can machine-learning approaches predict opioid overdose risk among fee-for-service Medicare beneficiaries? Findings In this prognostic study of the administrative claims data of 560 057 Medicare beneficiaries, the deep neural network and gradient boosting machine models outperformed other methods for identifying risk, although positive predictive values were low given the low prevalence of overdose episodes. Meaning Machine-learning algorithms using administrative data appear to be a valuable and feasible tool for more accurate identification of opioid overdose risk.", "year": 2019, "referenceCount": 88, "citationCount": 111, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1397210927", "name": "W. Lo-Ciganic"}, {"authorId": "2110302871", "name": "James L. Huang"}, {"authorId": "1399987315", "name": "Hao Helen Zhang"}, {"authorId": "1898068", "name": "Jeremy C. Weiss"}, {"authorId": "2115859099", "name": "Yonghui Wu"}, {"authorId": "1380127072", "name": "C. Kwoh"}, {"authorId": "144175602", "name": "J. Donohue"}, {"authorId": "38091515", "name": "Gerald T. Cochran"}, {"authorId": "144907004", "name": "A. Gordon"}, {"authorId": "1753795", "name": "D. Malone"}, {"authorId": "11543058", "name": "Courtney C. Kuza"}, {"authorId": "4208860", "name": "W. Gellad"}]}]}