{"total": 5120627, "offset": 2300, "next": 2400, "data": [{"paperId": "8fb1b96dcc133b170e7e5b340f93c5f230d495ee", "url": "https://www.semanticscholar.org/paper/8fb1b96dcc133b170e7e5b340f93c5f230d495ee", "title": "A streaming ensemble algorithm (SEA) for large-scale classification", "abstract": "Ensemble methods have recently garnered a great deal of attention in the machine learning community. Techniques such as Boosting and Bagging have proven to be highly effective but require repeated resampling of the training data, making them inappropriate in a data mining context. The methods presented in this paper take advantage of plentiful data, building separate classifiers on sequential chunks of training points. These classifiers are combined into a fixed-size ensemble using a heuristic replacement strategy. The result is a fast algorithm for large-scale or streaming data that classifies as well as a single decision tree built on all the data, requires approximately constant memory, and adjusts quickly to concept drift.", "year": 2001, "referenceCount": 21, "citationCount": 1184, "influentialCitationCount": 166, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2562282", "name": "W. N. Street"}, {"authorId": "2117912702", "name": "YongSeog Kim"}]}, {"paperId": "e7924a71ff89f37f66298a6b42bcd26fa7c0f33b", "url": "https://www.semanticscholar.org/paper/e7924a71ff89f37f66298a6b42bcd26fa7c0f33b", "title": "River: machine learning for streaming data in Python", "abstract": "River is a machine learning library for dynamic data streams and continual learning. It provides multiple state-of-the-art learning methods, data generators/transformers, performance metrics and evaluators for different stream learning problems. It is the result from the merger of the two most popular packages for stream learning in Python: Creme and scikit-multiflow. River introduces a revamped architecture based on the lessons learnt from the seminal packages. River's ambition is to be the go-to library for doing machine learning on streaming data. Additionally, this open source package brings under the same umbrella a large community of practitioners and researchers. The source code is available at https://github.com/online-ml/river.", "year": 2020, "referenceCount": 49, "citationCount": 45, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35479220", "name": "Jacob Montiel"}, {"authorId": "104920778", "name": "Max Halford"}, {"authorId": "31757587", "name": "S. M. Mastelini"}, {"authorId": "2034015026", "name": "Geoffrey Bolmier"}, {"authorId": "2034015684", "name": "Raphael Sourty"}, {"authorId": "2034016270", "name": "Robin Vaysse"}, {"authorId": "103370422", "name": "Adil Zouitine"}, {"authorId": "13645563", "name": "Heitor Murilo Gomes"}, {"authorId": "1383995365", "name": "Jesse Read"}, {"authorId": "2831624", "name": "T. Abdessalem"}, {"authorId": "1762931", "name": "A. Bifet"}]}, {"paperId": "edb189b3d0f777525837b3136e109aa0ba01a99a", "url": "https://www.semanticscholar.org/paper/edb189b3d0f777525837b3136e109aa0ba01a99a", "title": "Multicategory Classification Using An Extreme Learning Machine for Microarray Gene Expression Cancer Diagnosis", "abstract": "In this paper, the recently developed Extreme Learning Machine (ELM) is used for directing multicategory classification problems in the cancer diagnosis area. ELM avoids problems like local minima, improper learning rate and overfitting commonly faced by iterative learning methods and completes the training very fast. We have evaluated the multicategory classification performance of ELM on three benchmark microarray data sets for cancer diagnosis, namely, the GCM data set, the Lung data set, and the Lymphoma data set. The results indicate that ELM produces comparable or better classification accuracies with reduced training time and implementation complexity compared to artificial neural networks methods like conventional back-propagation ANN, Linder's SANN, and Support Vector Machine methods like SVM-OVO and Ramaswamy's SVM-OVA. ELM also achieves better accuracies for classification of individual categories.", "year": 2007, "referenceCount": 21, "citationCount": 246, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2190082425", "name": "Runxuan Zhang"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "145411276", "name": "N. Sundararajan"}, {"authorId": "1800678", "name": "P. Saratchandran"}]}, {"paperId": "b862efa06baea0b032214675eb3c3645d5d69d46", "url": "https://www.semanticscholar.org/paper/b862efa06baea0b032214675eb3c3645d5d69d46", "title": "Query-Efficient Hard-label Black-box Attack: An Optimization-based Approach", "abstract": "We study the problem of attacking a machine learning model in the hard-label black-box setting, where no model information is revealed except that the attacker can make queries to probe the corresponding hard-label decisions. This is a very challenging problem since the direct extension of state-of-the-art white-box attacks (e.g., CW or PGD) to the hard-label black-box setting will require minimizing a non-continuous step function, which is combinatorial and cannot be solved by a gradient-based optimizer. The only current approach is based on random walk on the boundary, which requires lots of queries and lacks convergence guarantees. We propose a novel way to formulate the hard-label black-box attack as a real-valued optimization problem which is usually continuous and can be solved by any zeroth order optimization algorithm. For example, using the Randomized Gradient-Free method, we are able to bound the number of iterations needed for our algorithm to achieve stationary points. We demonstrate that our proposed method outperforms the previous random walk approach to attacking convolutional neural networks on MNIST, CIFAR, and ImageNet datasets. More interestingly, we show that the proposed algorithm can also be used to attack other discrete and non-continuous machine learning models, such as Gradient Boosting Decision Trees (GBDT).", "year": 2018, "referenceCount": 26, "citationCount": 260, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2424698", "name": "Minhao Cheng"}, {"authorId": "2067954216", "name": "Thong Le"}, {"authorId": "153191489", "name": "Pin-Yu Chen"}, {"authorId": "2882166", "name": "Jinfeng Yi"}, {"authorId": "49723481", "name": "Huan Zhang"}, {"authorId": "1793529", "name": "Cho-Jui Hsieh"}]}, {"paperId": "a178a0bdee7549d87402b6c6128c569109128458", "url": "https://www.semanticscholar.org/paper/a178a0bdee7549d87402b6c6128c569109128458", "title": "Challenges in Deploying Machine Learning: a Survey of Case Studies", "abstract": "In recent years, machine learning has transitioned from a field of academic research interest to a field capable of solving real-world business problems. However, the deployment of machine learning models in production systems can present a number of issues and concerns. This survey reviews published reports of deploying machine learning solutions in a variety of use cases, industries and applications and extracts practical considerations corresponding to stages of the machine learning deployment workflow. By mapping found challenges to the steps of the machine learning deployment workflow we show that practitioners face issues at each stage of the deployment process. The goal of this paper is to lay out a research agenda to explore approaches addressing these challenges.", "year": 2020, "referenceCount": 168, "citationCount": 76, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "133643337", "name": "Andrei Paleyes"}, {"authorId": "2000207", "name": "Raoul-Gabriel Urma"}, {"authorId": "145306271", "name": "Neil D. Lawrence"}]}, {"paperId": "05351b3abcca9e535c534c3b4bff0865ba96b3ac", "url": "https://www.semanticscholar.org/paper/05351b3abcca9e535c534c3b4bff0865ba96b3ac", "title": "Confidence-based active learning", "abstract": "This paper proposes a new active learning approach, confidence-based active learning, for training a wide range of classifiers. This approach is based on identifying and annotating uncertain samples. The uncertainty value of each sample is measured by its conditional error. The approach takes advantage of current classifiers' probability preserving and ordering properties. It calibrates the output scores of classifiers to conditional error. Thus, it can estimate the uncertainty value for each input sample according to its output score from a classifier and select only samples with uncertainty value above a user-defined threshold. Even though we cannot guarantee the optimality of the proposed approach, we find it to provide good performance. Compared with existing methods, this approach is robust without additional computational effort. A new active learning method for support vector machines (SVMs) is implemented following this approach. A dynamic bin width allocation method is proposed to accurately estimate sample conditional error and this method adapts to the underlying probabilities. The effectiveness of the proposed approach is demonstrated using synthetic and real data sets and its performance is compared with the widely used least certain active learning method", "year": 2006, "referenceCount": 44, "citationCount": 223, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "49140921", "name": "Mingkun Li"}, {"authorId": "1702517", "name": "I. Sethi"}]}, {"paperId": "f1fe19b2a90caeb0b6fa79cad7c972d5e7e413a5", "url": "https://www.semanticscholar.org/paper/f1fe19b2a90caeb0b6fa79cad7c972d5e7e413a5", "title": "Experimental search for high-temperature ferroelectric perovskites guided by two-step machine learning", "abstract": null, "year": 2018, "referenceCount": 77, "citationCount": 148, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science", "Medicine"], "authors": [{"authorId": "40454011", "name": "P. Balachandran"}, {"authorId": "38669973", "name": "B. Kowalski"}, {"authorId": "32996309", "name": "A. Sehirlioglu"}, {"authorId": "2891010", "name": "T. Lookman"}]}, {"paperId": "ce2d6de9cec4a6d135c32bb8d2d02bba09928b33", "url": "https://www.semanticscholar.org/paper/ce2d6de9cec4a6d135c32bb8d2d02bba09928b33", "title": "Context-sensitive learning methods for text categorization", "abstract": "Two recently implemented machine-learning algorithms, RIPPER and sleeping-experts for phrases, are evaluated on a number of large text categorization problems. These algorithms both construct classifiers that allow the “context” of a word w to affect how (or even whether) the presence or absence of w will contribute to a classification. However, RIPPER and sleeping-experts differ radically in many other respects: differences include different notions as to what constitutes a context, different ways of combining contexts to construct a classifier, different methods to search for a combination of contexts, and different criteria as to what contexts should be included in such a combination. In spite of these differences, both RIPPER and sleeping-experts perform extremely well across a wide variety of categorization problems, generally outperforming previously applied learning methods. We view this result as a confirmation of the usefulness of classifiers that represent contextual information.", "year": 1996, "referenceCount": 81, "citationCount": 572, "influentialCitationCount": 47, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50056360", "name": "William W. Cohen"}, {"authorId": "1740765", "name": "Y. Singer"}]}, {"paperId": "02de839bf682abb4c0e243e3de18f667cfbd9e71", "url": "https://www.semanticscholar.org/paper/02de839bf682abb4c0e243e3de18f667cfbd9e71", "title": "A survey of deep learning methods and software tools for image classification and object detection", "abstract": null, "year": 2016, "referenceCount": 44, "citationCount": 201, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3082976", "name": "P. Druzhkov"}, {"authorId": "2182827", "name": "V. Kustikova"}]}, {"paperId": "2dc36b8d0c08613fb213ad419973d379a2264765", "url": "https://www.semanticscholar.org/paper/2dc36b8d0c08613fb213ad419973d379a2264765", "title": "Training algorithms for linear text classifiers", "abstract": "Systems for text retrieval, routing, categorization and other IR tasks rely heavily on linear classifiers. We propose that two machine learning algorithms, the Widrow-Hoff and EG algorithms, be used in training linear text classifiers. In contrast to most IR methods, theoretical analysis provides performance guarantees and guidance on parameter settings for these algorithms. Experimental data is presented showing Widrow-Hoff and EG to be more effective than the widely used Rocchio algorithm on several categorization and routing tasks.", "year": 1996, "referenceCount": 57, "citationCount": 632, "influentialCitationCount": 34, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35153517", "name": "D. Lewis"}, {"authorId": "1716301", "name": "R. Schapire"}, {"authorId": "144987107", "name": "Jamie Callan"}, {"authorId": "47394834", "name": "R. Papka"}]}, {"paperId": "3984c09b19eca83aa78a5fcbc1f87106685b34c7", "url": "https://www.semanticscholar.org/paper/3984c09b19eca83aa78a5fcbc1f87106685b34c7", "title": "Monitoring Land-Cover Changes: A Machine-Learning Perspective", "abstract": "Monitoring land-cover changes is of prime importance for the effective planning and management of critical, natural and man-made resources. The growing availability of remote sensing data provides ample opportunities for monitoring land-cover changes on a global scale using machine-learning techniques. However, remote sensing data sets exhibit unique domain-specific properties that limit the usefulness of traditional machine-learning methods. This article presents a brief overview of these challenges from the perspective of machine learning and discusses some of the recent advances in machine learning that are relevant for addressing them. These approaches show promise for future research in the detection of land-cover change using machine-learning algorithms.", "year": 2016, "referenceCount": 58, "citationCount": 64, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2548167", "name": "A. Karpatne"}, {"authorId": "49165342", "name": "Zhe Jiang"}, {"authorId": "3001600", "name": "Ranga Raju Vatsavai"}, {"authorId": "145072875", "name": "S. Shekhar"}, {"authorId": "2107978833", "name": "Vipin Kumar"}]}, {"paperId": "4a3d34c3c23ded529c871150cb1f47d6e09ff0ba", "url": "https://www.semanticscholar.org/paper/4a3d34c3c23ded529c871150cb1f47d6e09ff0ba", "title": "Imaging patterns predict patient survival and molecular subtype in glioblastoma via machine learning techniques.", "abstract": "BACKGROUND\nMRI characteristics of brain gliomas have been used to predict clinical outcome and molecular tumor characteristics. However, previously reported imaging biomarkers have not been sufficiently accurate or reproducible to enter routine clinical practice and often rely on relatively simple MRI measures. The current study leverages advanced image analysis and machine learning algorithms to identify complex and reproducible imaging patterns predictive of overall survival and molecular subtype in glioblastoma (GB).\n\n\nMETHODS\nOne hundred five patients with GB were first used to extract approximately 60 diverse features from preoperative multiparametric MRIs. These imaging features were used by a machine learning algorithm to derive imaging predictors of patient survival and molecular subtype. Cross-validation ensured generalizability of these predictors to new patients. Subsequently, the predictors were evaluated in a prospective cohort of 29 new patients.\n\n\nRESULTS\nSurvival curves yielded a hazard ratio of 10.64 for predicted long versus short survivors. The overall, 3-way (long/medium/short survival) accuracy in the prospective cohort approached 80%. Classification of patients into the 4 molecular subtypes of GB achieved 76% accuracy.\n\n\nCONCLUSIONS\nBy employing machine learning techniques, we were able to demonstrate that imaging patterns are highly predictive of patient survival. Additionally, we found that GB subtypes have distinctive imaging phenotypes. These results reveal that when imaging markers related to infiltration, cell density, microvascularity, and blood-brain barrier compromise are integrated via advanced pattern analysis methods, they form very accurate predictive biomarkers. These predictive markers used solely preoperative images, hence they can significantly augment diagnosis and treatment of GB patients.", "year": 2016, "referenceCount": 43, "citationCount": 237, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "5658385", "name": "L. Macyszyn"}, {"authorId": "1836349", "name": "H. Akbari"}, {"authorId": "4043191", "name": "J. Pisapia"}, {"authorId": "145323531", "name": "X. Da"}, {"authorId": "6683318", "name": "M. Attiah"}, {"authorId": "1919457", "name": "Vadim Pigrish"}, {"authorId": "2706424", "name": "Y. Bi"}, {"authorId": "2908972", "name": "Sharmistha Pal"}, {"authorId": "3285990", "name": "R. Davuluri"}, {"authorId": "4190389", "name": "Laura Roccograndi"}, {"authorId": "4900874", "name": "N. Dahmane"}, {"authorId": "1397753907", "name": "M. Martinez-Lage"}, {"authorId": "2395747", "name": "G. Biros"}, {"authorId": "48750802", "name": "R. Wolf"}, {"authorId": "1981194", "name": "M. Bilello"}, {"authorId": "1390125065", "name": "D. O’Rourke"}, {"authorId": "1740714", "name": "C. Davatzikos"}]}, {"paperId": "4ea909c9509aa556786687fb044f2ce86100e4ec", "url": "https://www.semanticscholar.org/paper/4ea909c9509aa556786687fb044f2ce86100e4ec", "title": "Quantum Entanglement in Neural Network States", "abstract": "Machine learning, one of today's most rapidly growing interdisciplinary fields, promises an unprecedented perspective for solving intricate quantum many-body problems. Understanding the physical aspects of the representative artificial neural-network states is recently becoming highly desirable in the applications of machine learning techniques to quantum many-body physics. Here, we study the quantum entanglement properties of neural-network states, with a focus on the restricted-Boltzmann-machine (RBM) architecture. We prove that the entanglement of all short-range RBM states satisfies an area law for arbitrary dimensions and bipartition geometry. For long-range RBM states we show by using an exact construction that such states could exhibit volume-law entanglement, implying a notable capability of RBM in representing efficiently quantum states with massive entanglement. We further examine generic RBM states with random weight parameters. We find that their averaged entanglement entropy obeys volume-law scaling and meantime strongly deviates from the Page-entropy of the completely random pure states. We show that their entanglement spectrum has no universal part associated with random matrix theory and bears a Poisson-type level statistics. Using reinforcement learning, we demonstrate that RBM is capable of finding the ground state (with power-law entanglement) of a model Hamiltonian with long-range interaction. In addition, we show, through a concrete example of the one-dimensional symmetry-protected topological cluster states, that the RBM representation may also be used as a tool to analytically compute the entanglement spectrum. Our results uncover the unparalleled power of artificial neural networks in representing quantum many-body states, which paves a novel way to bridge computer science based machine learning techniques to outstanding quantum condensed matter physics problems.", "year": 2017, "referenceCount": 128, "citationCount": 271, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "5204254", "name": "D. Deng"}, {"authorId": "2108285127", "name": "Xiaopeng Li"}, {"authorId": "2888542", "name": "S. Sarma"}]}, {"paperId": "16d5d586ccc5b9a9f59f55266fb48fcc9436456e", "url": "https://www.semanticscholar.org/paper/16d5d586ccc5b9a9f59f55266fb48fcc9436456e", "title": "Beyond Manual Tuning of Hyperparameters", "abstract": null, "year": 2015, "referenceCount": 80, "citationCount": 126, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144661829", "name": "F. Hutter"}, {"authorId": "1790122", "name": "Jörg Lücke"}, {"authorId": "1388781075", "name": "L. Schmidt-Thieme"}]}, {"paperId": "c9172a3571e3c0b7032509dffdb5f16b4081241b", "url": "https://www.semanticscholar.org/paper/c9172a3571e3c0b7032509dffdb5f16b4081241b", "title": "Active Learning with Support Vector Machines in the Drug Discovery Process", "abstract": "We investigate the following data mining problem from computer-aided drug design: From a large collection of compounds, find those that bind to a target molecule in as few iterations of biochemical testing as possible. In each iteration a comparatively small batch of compounds is screened for binding activity toward this target. We employed the so-called \"active learning paradigm\" from Machine Learning for selecting the successive batches. Our main selection strategy is based on the maximum margin hyperplane-generated by \"Support Vector Machines\". This hyperplane separates the current set of active from the inactive compounds and has the largest possible distance from any labeled compound. We perform a thorough comparative study of various other selection strategies on data sets provided by DuPont Pharmaceuticals and show that the strategies based on the maximum margin hyperplane clearly outperform the simpler ones.", "year": 2003, "referenceCount": 25, "citationCount": 302, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1794034", "name": "Manfred K. Warmuth"}, {"authorId": "2075441787", "name": "Jun Liao"}, {"authorId": "2414086", "name": "G. Rätsch"}, {"authorId": "48453299", "name": "M. Mathieson"}, {"authorId": "3258830", "name": "S. Putta"}, {"authorId": "21313583", "name": "C. Lemmen"}]}, {"paperId": "2698bdb4673caa10e0f5eece28ae80393c5ff94f", "url": "https://www.semanticscholar.org/paper/2698bdb4673caa10e0f5eece28ae80393c5ff94f", "title": "Collaborative Writing Support Tools on the Cloud", "abstract": "Academic writing, individual or collaborative, is an essential skill for today's graduates. Unfortunately, managing writing activities and providing feedback to students is very labor intensive and academics often opt out of including such learning experiences in their teaching. We describe the architecture for a new collaborative writing support environment used to embed such collaborative learning activities in engineering courses. iWrite provides tools for managing collaborative and individual writing assignments in large cohorts. It outsources the writing tools and the storage of student content to third party cloud-computing vendors (i.e., Google). We further describe how using machine learning and NLP techniques, the architecture provides automated feedback, automatic question generation, and process analysis features.", "year": 2011, "referenceCount": 46, "citationCount": 128, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144792845", "name": "R. Calvo"}, {"authorId": "2073202565", "name": "Stephen T. O'Rourke"}, {"authorId": "145869583", "name": "Janet Jones"}, {"authorId": "1763220", "name": "K. Yacef"}, {"authorId": "20779579", "name": "P. Reimann"}]}, {"paperId": "395319753b2ed1f464f341654a26e380fd0d6aab", "url": "https://www.semanticscholar.org/paper/395319753b2ed1f464f341654a26e380fd0d6aab", "title": "Learning I/O Automata", "abstract": null, "year": 2010, "referenceCount": 40, "citationCount": 115, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39315305", "name": "F. Aarts"}, {"authorId": "1678787", "name": "F. Vaandrager"}]}, {"paperId": "dc2b3571907434dbe70cb9674ef16b18286f2cc9", "url": "https://www.semanticscholar.org/paper/dc2b3571907434dbe70cb9674ef16b18286f2cc9", "title": "Physics-informed machine learning approach for augmenting turbulence models: A comprehensive framework", "abstract": "We present a comprehensive framework for augmenting turbulence models with physics-informed machine learning, illustrating a complete workflow from identification of input/output to prediction of mean velocities. The learned model has Galilean invariance and coordinate rotational invariance.", "year": 2018, "referenceCount": 63, "citationCount": 216, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "47876141", "name": "Jinlong Wu"}, {"authorId": "41193045", "name": "Heng Xiao"}, {"authorId": "50524368", "name": "E. Paterson"}]}, {"paperId": "87576c49fab648c3c7bedf7642bc4e6b98d9d69d", "url": "https://www.semanticscholar.org/paper/87576c49fab648c3c7bedf7642bc4e6b98d9d69d", "title": "Quantum machine learning and quantum biomimetics: A perspective", "abstract": "Quantum machine learning has emerged as an exciting and promising paradigm inside quantum technologies. It may permit, on the one hand, to carry out more efficient machine learning calculations by means of quantum devices, while, on the other hand, to employ machine learning techniques to better control quantum systems. Inside quantum machine learning, quantum reinforcement learning aims at developing ‘intelligent’ quantum agents that may interact with the outer world and adapt to it, with the strategy of achieving some final goal. Another paradigm inside quantum machine learning is that of quantum autoencoders, which may allow one for employing fewer resources in a quantum device via a training process. Moreover, the field of quantum biomimetics aims at establishing analogies between biological and quantum systems, to look for previously inadvertent connections that may enable useful applications. Two recent examples are the concepts of quantum artificial life, as well as of quantum memristors. In this Perspective, we give an overview of these topics, describing the related research carried out by the scientific community.", "year": 2020, "referenceCount": 111, "citationCount": 39, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Computer Science", "Mathematics"], "authors": [{"authorId": "4291120", "name": "L. Lamata"}]}, {"paperId": "8d6e18785d75c9a40c3284cfb5726359c0ab0801", "url": "https://www.semanticscholar.org/paper/8d6e18785d75c9a40c3284cfb5726359c0ab0801", "title": "Machine Learning and Its Applications", "abstract": null, "year": 2001, "referenceCount": 112, "citationCount": 108, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "4738873", "name": "G. Paliouras"}, {"authorId": "1745631", "name": "V. Karkaletsis"}, {"authorId": "2124138", "name": "C. Spyropoulos"}]}, {"paperId": "3b09e6f6533005925c6ca7427d3d75ca95da6e09", "url": "https://www.semanticscholar.org/paper/3b09e6f6533005925c6ca7427d3d75ca95da6e09", "title": "Random access for machine-to-machine communication in LTE-advanced networks: issues and approaches", "abstract": "Machine-to-machine communication, a promising technology for the smart city concept, enables ubiquitous connectivity between one or more autonomous devices without or with minimal human interaction. M2M communication is the key technology to support data transfer among sensors and actuators to facilitate various smart city applications (e.g., smart metering, surveillance and security, infrastructure management, city automation, and eHealth). To support massive numbers of machine type communication (MTC) devices, one of the challenging issues is to provide an efficient way for multiple access in the network and to minimize network overload. In this article, we review the M2M communication techniques in Long Term Evolution- Advanced cellular networks and outline the major research issues. Also, we review the different random access overload control mechanisms to avoid congestion caused by random channel access of MTC devices. To this end, we propose a reinforcement learning-based eNB selection algorithm that allows the MTC devices to choose the eNBs (or base stations) to transmit packets in a self-organizing fashion.", "year": 2013, "referenceCount": 19, "citationCount": 481, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "26068612", "name": "M. Hasan"}, {"authorId": "144158811", "name": "E. Hossain"}, {"authorId": "1713586", "name": "D. Niyato"}]}, {"paperId": "e2682f2a2752cba7a05fd3db1cb43731c1afb002", "url": "https://www.semanticscholar.org/paper/e2682f2a2752cba7a05fd3db1cb43731c1afb002", "title": "Explaining AdaBoost", "abstract": null, "year": 2013, "referenceCount": 41, "citationCount": 483, "influentialCitationCount": 44, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1716301", "name": "R. Schapire"}]}, {"paperId": "abad343e6732abd4773543ac04f0ecfe46aab4ec", "url": "https://www.semanticscholar.org/paper/abad343e6732abd4773543ac04f0ecfe46aab4ec", "title": "The gesture recognition toolkit", "abstract": "The Gesture Recognition Toolkit is a cross-platform open-source C++ library designed to make real-time machine learning and gesture recognition more accessible for non-specialists. Emphasis is placed on ease of use, with a consistent, minimalist design that promotes accessibility while supporting flexibility and customization for advanced users. The toolkit features a broad range of classification and regression algorithms and has extensive support for building real-time systems. This includes algorithms for signal processing, feature extraction and automatic gesture spotting.", "year": 2014, "referenceCount": 48, "citationCount": 161, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1998265", "name": "N. Gillian"}, {"authorId": "1733194", "name": "J. Paradiso"}]}, {"paperId": "dd20272cba91c5a47bfd54a9d716a51acd28195f", "url": "https://www.semanticscholar.org/paper/dd20272cba91c5a47bfd54a9d716a51acd28195f", "title": "Machine Learning at Central Banks", "abstract": "We introduce machine learning in the context of central banking and policy analyses. Our aim is to give an overview broad enough to allow the reader to place machine learning within the wider range of statistical modelling and computational analyses, and provide an idea of its scope and limitations. We review the underlying technical sources and the nascent literature applying machine learning to economic and policy problems. We present popular modelling approaches, such as artificial neural networks, tree-based models, support vector machines, recommender systems and different clustering techniques. Important concepts like the bias-variance trade-off, optimal model complexity, regularisation and cross-validation are discussed to enrich the econometrics toolbox in their own right. We present three case studies relevant to central bank policy, financial regulation and economic modelling more widely. First, we model the detection of alerts on the balance sheets of financial institutions in the context of banking supervision. Second, we perform a projection exercise for UK CPI inflation on a medium-term horizon of two years. Here, we introduce a simple training-testing framework for time series analyses. Third, we investigate the funding patterns of technology start-ups with the aim to detect potentially disruptive innovators in financial technology. Machine learning models generally outperform traditional modelling approaches in prediction tasks, while open research questions remain with regard to their causal inference properties.", "year": 2017, "referenceCount": 0, "citationCount": 80, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "3000889", "name": "Chiranjit Chakraborty"}, {"authorId": "47476153", "name": "Andreas Joseph"}]}, {"paperId": "0cf102da6dd4276115c63cbb6797f24ed450fea1", "url": "https://www.semanticscholar.org/paper/0cf102da6dd4276115c63cbb6797f24ed450fea1", "title": "Towards Robust Interpretability with Self-Explaining Neural Networks", "abstract": "Most recent work on interpretability of complex machine learning models has focused on estimating a posteriori explanations for previously trained models around specific predictions. Self-explaining models where interpretability plays a key role already during learning have received much less attention. We propose three desiderata for explanations in general – explicitness, faithfulness, and stability – and show that existing methods do not satisfy them. In response, we design self-explaining models in stages, progressively generalizing linear classifiers to complex yet architecturally explicit models. Faithfulness and stability are enforced via regularization specifically tailored to such models. Experimental results across various benchmark datasets show that our framework offers a promising direction for reconciling model complexity and interpretability.", "year": 2018, "referenceCount": 28, "citationCount": 483, "influentialCitationCount": 59, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1390096054", "name": "David Alvarez-Melis"}, {"authorId": "35132120", "name": "T. Jaakkola"}]}, {"paperId": "6168b473825a7334b168f15c6be3e1d1edabf88e", "url": "https://www.semanticscholar.org/paper/6168b473825a7334b168f15c6be3e1d1edabf88e", "title": "Comparative study on classification performance between support vector machine and logistic regression", "abstract": null, "year": 2013, "referenceCount": 50, "citationCount": 63, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2675617", "name": "Abdallah Bashir Musa"}]}, {"paperId": "2d470f3f86bae26460339bef85420095e04c852b", "url": "https://www.semanticscholar.org/paper/2d470f3f86bae26460339bef85420095e04c852b", "title": "Three Approaches for Personalization with Applications to Federated Learning", "abstract": "The standard objective in machine learning is to train a single model for all users. However, in many learning scenarios, such as cloud computing and federated learning, it is possible to learn a personalized model per user. In this work, we present a systematic learning-theoretic study of personalization. We propose and analyze three approaches: user clustering, data interpolation, and model interpolation. For all three approaches, we provide learning-theoretic guarantees and efficient algorithms for which we also demonstrate the performance empirically. All of our algorithms are model-agnostic and work for any hypothesis class.", "year": 2020, "referenceCount": 57, "citationCount": 251, "influentialCitationCount": 42, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144830983", "name": "Y. Mansour"}, {"authorId": "81080659", "name": "M. Mohri"}, {"authorId": "2060769070", "name": "Jae Ro"}, {"authorId": "9486035", "name": "A. Suresh"}]}, {"paperId": "0b089e4a90d97c6cc815f131e7bcab014ceac336", "url": "https://www.semanticscholar.org/paper/0b089e4a90d97c6cc815f131e7bcab014ceac336", "title": "Machine learning techniques to diagnose breast cancer", "abstract": "Machine learning is a branch of artificial intelligence that employs a variety of statistical, probabilistic and optimization techniques that allows computers to “learn” from past examples and to detect hard-to-discern patterns from large, noisy or complex data sets. As a result, machine learning is frequently used in cancer diagnosis and detection. In this paper, support vector machines, K-nearest neighbours and probabilistic neural networks classifiers are combined with signal-to-noise ratio feature ranking, sequential forward selection-based feature selection and principal component analysis feature extraction to distinguish between the benign and malignant tumours of breast. The best overall accuracy for breast cancer diagnosis is achieved equal to 98.80% and 96.33% respectively using support vector machines classifier models against two widely used breast cancer benchmark datasets.", "year": 2010, "referenceCount": 24, "citationCount": 104, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3298090", "name": "A. Osareh"}, {"authorId": "3027267", "name": "B. Shadgar"}]}, {"paperId": "22cba8f244258e0bba7ff4bb70c4e5b5ac3e2382", "url": "https://www.semanticscholar.org/paper/22cba8f244258e0bba7ff4bb70c4e5b5ac3e2382", "title": "H2O AutoML: Scalable Automatic Machine Learning", "abstract": "H2O is an open source, distributed machine learning platform designed to scale to very large datasets, with APIs in R, Python, Java and Scala. We present H2O AutoML, a highly scalable, fully-automated, supervised learning algorithm which automates the process of training a large selection of candidate models and stacked ensembles within a single function. The result of the AutoML run is a “leaderboard”: a ranked list of models, all of which can be easily exported for use in a production environment. Models in the leaderboard can be ranked by numerous model performance metrics or other model attributes such as training time or average per-row prediction speed. The H2O AutoML algorithm relies on the efficient training of H2O machine learning algorithms to produce a large number of models in a short amount of time. H2O AutoML uses a combination of fast random search and stacked ensembles to achieve results competitive with, and often better than, other frameworks which rely on more complex model tuning techniques such as Bayesian optimization or genetic algorithms. H2O AutoML trains a variety of algorithms (e.g. GBMs, Random Forests, Deep Neural Networks, GLMs), yielding a healthy amount of diversity across candidate models, which can be exploited by stacked ensembles to produce a powerful final model. The effectiveness of this technique is reflected in the OpenML AutoML Benchmark, which compares the performance of several of the most well known, open source AutoML systems across a number of datasets.", "year": 2020, "referenceCount": 16, "citationCount": 117, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "3402980", "name": "E. LeDell"}]}, {"paperId": "be3a65ef15f79ebb8296e6a0e8d1a9cb5c0f3638", "url": "https://www.semanticscholar.org/paper/be3a65ef15f79ebb8296e6a0e8d1a9cb5c0f3638", "title": "Evaluating Prerequisite Qualities for Learning End-to-End Dialog Systems", "abstract": "A long-term goal of machine learning is to build intelligent conversational agents. One recent popular approach is to train end-to-end models on a large amount of real dialog transcripts between humans (Sordoni et al., 2015; Vinyals & Le, 2015; Shang et al., 2015). However, this approach leaves many questions unanswered as an understanding of the precise successes and shortcomings of each model is hard to assess. A contrasting recent proposal are the bAbI tasks (Weston et al., 2015b) which are synthetic data that measure the ability of learning machines at various reasoning tasks over toy language. Unfortunately, those tests are very small and hence may encourage methods that do not scale. In this work, we propose a suite of new tasks of a much larger scale that attempt to bridge the gap between the two regimes. Choosing the domain of movies, we provide tasks that test the ability of models to answer factual questions (utilizing OMDB), provide personalization (utilizing MovieLens), carry short conversations about the two, and finally to perform on natural dialogs from Reddit. We provide a dataset covering 75k movie entities and with 3.5M training examples. We present results of various models on these tasks, and evaluate their performance.", "year": 2015, "referenceCount": 48, "citationCount": 177, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34176020", "name": "Jesse Dodge"}, {"authorId": "3071104", "name": "Andreea Gane"}, {"authorId": "2190290316", "name": "Xiang Zhang"}, {"authorId": "1713934", "name": "Antoine Bordes"}, {"authorId": "3295092", "name": "S. Chopra"}, {"authorId": "143622869", "name": "Alexander H. Miller"}, {"authorId": "3149531", "name": "Arthur D. Szlam"}, {"authorId": "145183709", "name": "J. Weston"}]}, {"paperId": "4b5eb40e45110dffac9ad7be68a294ecedaec1d4", "url": "https://www.semanticscholar.org/paper/4b5eb40e45110dffac9ad7be68a294ecedaec1d4", "title": "A Roadmap for Foundational Research on Artificial Intelligence in Medical Imaging: From the 2018 NIH/RSNA/ACR/The Academy Workshop.", "abstract": "Imaging research laboratories are rapidly creating machine learning systems that achieve expert human performance using open-source methods and tools. These artificial intelligence systems are being developed to improve medical image reconstruction, noise reduction, quality assurance, triage, segmentation, computer-aided detection, computer-aided classification, and radiogenomics. In August 2018, a meeting was held in Bethesda, Maryland, at the National Institutes of Health to discuss the current state of the art and knowledge gaps and to develop a roadmap for future research initiatives. Key research priorities include: 1, new image reconstruction methods that efficiently produce images suitable for human interpretation from source data; 2, automated image labeling and annotation methods, including information extraction from the imaging report, electronic phenotyping, and prospective structured image reporting; 3, new machine learning methods for clinical imaging data, such as tailored, pretrained model architectures, and federated machine learning methods; 4, machine learning methods that can explain the advice they provide to human users (so-called explainable artificial intelligence); and 5, validated methods for image de-identification and data sharing to facilitate wide availability of clinical imaging data sets. This research roadmap is intended to identify and prioritize these needs for academic research laboratories, funding agencies, professional societies, and industry.", "year": 2019, "referenceCount": 97, "citationCount": 190, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2356307", "name": "C. Langlotz"}, {"authorId": "40221223", "name": "Bibb Allen"}, {"authorId": "144917634", "name": "B. Erickson"}, {"authorId": "1401724111", "name": "Jayashree Kalpathy-Cramer"}, {"authorId": "49265987", "name": "K. Bigelow"}, {"authorId": "2066982812", "name": "T. Cook"}, {"authorId": "1864663", "name": "A. Flanders"}, {"authorId": "4204731", "name": "M. Lungren"}, {"authorId": "2064211562", "name": "D. Mendelson"}, {"authorId": "2670463", "name": "J. Rudie"}, {"authorId": "2108296864", "name": "Ge Wang"}, {"authorId": "10234379", "name": "K. Kandarpa"}]}, {"paperId": "0cc52fd81656fad2d6d85e29b1360e1b6a919d42", "url": "https://www.semanticscholar.org/paper/0cc52fd81656fad2d6d85e29b1360e1b6a919d42", "title": "Theory-Guided Machine Learning in Materials Science", "abstract": "Materials scientists are increasingly adopting the use of machine learning tools to discover hidden trends in data and make predictions. Applying concepts from data science without foreknowledge of their limitations and the unique qualities of materials data, however, could lead to errant conclusions. The differences that exist between various kinds of experimental and calculated data require careful choices of data processing and machine learning methods. Here, we outline potential pitfalls involved in using machine learning without robust protocols. We address some problems of overfitting to training data using decision trees as an example, rational descriptor selection in the field of perovskites, and preserving physical interpretability in the application of dimensionality reducing techniques such as principal component analysis. We show how proceeding without the guidance of domain knowledge can lead to both quantitatively and qualitatively incorrect predictive models.", "year": 2016, "referenceCount": 44, "citationCount": 101, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "2062674058", "name": "Nicholas Wagner"}, {"authorId": "5137392", "name": "J. Rondinelli"}]}, {"paperId": "f1664bbaddedea8c250873e7610ab07e53fa7132", "url": "https://www.semanticscholar.org/paper/f1664bbaddedea8c250873e7610ab07e53fa7132", "title": "Machine learning pipeline for battery state of health estimation", "abstract": null, "year": 2021, "referenceCount": 86, "citationCount": 72, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "80025697", "name": "D. Roman"}, {"authorId": "49730050", "name": "Saurabh Saxena"}, {"authorId": "1718021", "name": "V. Robu"}, {"authorId": "145937021", "name": "M. Pecht"}, {"authorId": "143836960", "name": "D. Flynn"}]}, {"paperId": "0c8c500cec9b74ebc7be44c52b79d2bd78234605", "url": "https://www.semanticscholar.org/paper/0c8c500cec9b74ebc7be44c52b79d2bd78234605", "title": "Best practices in machine learning for chemistry", "abstract": null, "year": 2021, "referenceCount": 30, "citationCount": 81, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "11413392", "name": "Nongnuch Artrith"}, {"authorId": "3300287", "name": "K. Butler"}, {"authorId": "144646737", "name": "François-Xavier Coudert"}, {"authorId": "1964642", "name": "Seungwu Han"}, {"authorId": "2385206", "name": "O. Isayev"}, {"authorId": "2541031", "name": "Anubhav Jain"}, {"authorId": "2143601680", "name": "Aron Walsh"}]}, {"paperId": "d1faad340b63ac3c507701cb72ce5fef6c911c77", "url": "https://www.semanticscholar.org/paper/d1faad340b63ac3c507701cb72ce5fef6c911c77", "title": "Estimation of energy consumption in machine learning", "abstract": null, "year": 2019, "referenceCount": 78, "citationCount": 162, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1397181204", "name": "E. García-Martín"}, {"authorId": "30307951", "name": "Crefeda Faviola Rodrigues"}, {"authorId": "39609950", "name": "G. Riley"}, {"authorId": "2576615", "name": "Håkan Grahn"}]}, {"paperId": "561c6977d57d33990e4ff840570658d495d37373", "url": "https://www.semanticscholar.org/paper/561c6977d57d33990e4ff840570658d495d37373", "title": "Seismic facies analysis using machine learning", "abstract": "Seismic interpretations are, by definition, subjective and often require significant time and expertise from the interpreter. We are convinced that machine-learning techniques can help address these problems by performing seismic facies analyses in a rigorous, repeatable way. For this purpose, we use state-of-the-art 3D broadband seismic reflection data of the northern North Sea. Our workflow includes five basic steps. First, we extract seismic attributes to highlight features in the data. Second, we perform a manual seismic facies classification on 10,000 examples. Third, we use some of these examples to train a range of models to predict seismic facies. Fourth, we analyze the performance of these models on the remaining examples. Fifth, we select the “best” model (i.e., highest accuracy) and apply it to a seismic section. As such, we highlight that machine-learning techniques can increase the efficiency of seismic facies analyses.", "year": 2018, "referenceCount": 68, "citationCount": 112, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Geology"], "authors": [{"authorId": "46282847", "name": "T. Wrona"}, {"authorId": "2316212", "name": "I. Pan"}, {"authorId": "71764416", "name": "R. Gawthorpe"}, {"authorId": "28974766", "name": "H. Fossen"}]}, {"paperId": "a8589e96651a1ecd9bf434191a5a2b63bfed9d8c", "url": "https://www.semanticscholar.org/paper/a8589e96651a1ecd9bf434191a5a2b63bfed9d8c", "title": "An exact mapping between the Variational Renormalization Group and Deep Learning", "abstract": "Deep learning is a broad set of techniques that uses multiple layers of representation to automatically learn relevant features directly from structured data. Recently, such techniques have yielded record-breaking results on a diverse set of difficult machine learning tasks in computer vision, speech recognition, and natural language processing. Despite the enormous success of deep learning, relatively little is understood theoretically about why these techniques are so successful at feature learning and compression. Here, we show that deep learning is intimately related to one of the most important and successful techniques in theoretical physics, the renormalization group (RG). RG is an iterative coarse-graining scheme that allows for the extraction of relevant features (i.e. operators) as a physical system is examined at different length scales. We construct an exact mapping from the variational renormalization group, first introduced by Kadanoff, and deep learning architectures based on Restricted Boltzmann Machines (RBMs). We illustrate these ideas using the nearest-neighbor Ising Model in one and two-dimensions. Our results suggests that deep learning algorithms may be employing a generalized RG-like scheme to learn relevant features from data.", "year": 2014, "referenceCount": 20, "citationCount": 267, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Physics", "Computer Science"], "authors": [{"authorId": "143788219", "name": "Pankaj Mehta"}, {"authorId": "40111234", "name": "D. Schwab"}]}, {"paperId": "deafdf4c23a9c69fa968a39aa4ae09151a7ec20d", "url": "https://www.semanticscholar.org/paper/deafdf4c23a9c69fa968a39aa4ae09151a7ec20d", "title": "Machine learning by unitary tensor network of hierarchical tree structure", "abstract": "The resemblance between the methods used in quantum-many body physics and in machine learning has drawn considerable attention. In particular, tensor networks (TNs) and deep learning architectures bear striking similarities to the extent that TNs can be used for machine learning. Previous results used one-dimensional TNs in image recognition, showing limited scalability and flexibilities. In this work, we train two-dimensional hierarchical TNs to solve image recognition problems, using a training algorithm derived from the multi-scale entanglement renormalization ansatz. This approach introduces mathematical connections among quantum many-body physics, quantum information theory, and machine learning. While keeping the TN unitary in the training phase, TN states are defined, which encode classes of images into quantum many-body states. We study the quantum features of the TN states, including quantum entanglement and fidelity. We find these quantities could be properties that characterize the image classes, as well as the machine learning tasks.", "year": 2017, "referenceCount": 67, "citationCount": 85, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Physics"], "authors": [{"authorId": "1771885", "name": "Ding Liu"}, {"authorId": "12007172", "name": "Shi-Ju Ran"}, {"authorId": "1756871", "name": "P. Wittek"}, {"authorId": "46894925", "name": "C. Peng"}, {"authorId": "2148545250", "name": "R. Garc'ia"}, {"authorId": "143940612", "name": "G. Su"}, {"authorId": "145453642", "name": "M. Lewenstein"}]}, {"paperId": "120f4b0b33396fd3094d5bdf93107fc3fe838b4e", "url": "https://www.semanticscholar.org/paper/120f4b0b33396fd3094d5bdf93107fc3fe838b4e", "title": "An Experimental Evaluation of Integrating Machine Learning with Knowledge Acquisition", "abstract": null, "year": 1999, "referenceCount": 39, "citationCount": 36, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1726660", "name": "Geoffrey I. Webb"}, {"authorId": "145189421", "name": "Jason G. Wells"}, {"authorId": "49774164", "name": "Zijian Zheng"}]}, {"paperId": "d44ac0a7fd4734187bccafc4a2771027b8bb595e", "url": "https://www.semanticscholar.org/paper/d44ac0a7fd4734187bccafc4a2771027b8bb595e", "title": "Deep learning enables rapid identification of potent DDR1 kinase inhibitors", "abstract": null, "year": 2019, "referenceCount": 32, "citationCount": 489, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "143865664", "name": "A. Zhavoronkov"}, {"authorId": "3792453", "name": "Y. Ivanenkov"}, {"authorId": "4029506", "name": "A. Aliper"}, {"authorId": "5384886", "name": "M. Veselov"}, {"authorId": "11053912", "name": "V. Aladinskiy"}, {"authorId": "2067318599", "name": "Anastasiya V Aladinskaya"}, {"authorId": "91703425", "name": "V. Terentiev"}, {"authorId": "36061519", "name": "Daniil Polykovskiy"}, {"authorId": "2065397580", "name": "Maksim Kuznetsov"}, {"authorId": "40758146", "name": "Arip Asadulaev"}, {"authorId": "2057250573", "name": "Yury Volkov"}, {"authorId": "1416761815", "name": "Artem Zholus"}, {"authorId": "2021173899", "name": "Shayakhmetov Rim"}, {"authorId": "48534186", "name": "Alexander Zhebrak"}, {"authorId": "93487508", "name": "L. I. Minaeva"}, {"authorId": "94394596", "name": "B. Zagribelnyy"}, {"authorId": "1410564330", "name": "Lennart H Lee"}, {"authorId": "40091091", "name": "R. Soll"}, {"authorId": "88209786", "name": "David Madge"}, {"authorId": "2053892942", "name": "Li Xing"}, {"authorId": "2057580513", "name": "Tao Guo"}, {"authorId": "1380248954", "name": "Alán Aspuru-Guzik"}]}, {"paperId": "826a23c469321d3dff43cac2977c571964453349", "url": "https://www.semanticscholar.org/paper/826a23c469321d3dff43cac2977c571964453349", "title": "Predicting the Young’s Modulus of Silicate Glasses using High-Throughput Molecular Dynamics Simulations and Machine Learning", "abstract": null, "year": 2019, "referenceCount": 48, "citationCount": 77, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2118048276", "name": "Kai Yang"}, {"authorId": null, "name": "Xinyi Xu"}, {"authorId": "2110375361", "name": "Benjamin Yang"}, {"authorId": "2054077958", "name": "B. Cook"}, {"authorId": "2060003003", "name": "Herbert Ramos"}, {"authorId": "46382871", "name": "N. Krishnan"}, {"authorId": "4033865", "name": "M. Smedskjaer"}, {"authorId": "15407355", "name": "C. Hoover"}, {"authorId": "4728694", "name": "M. Bauchy"}]}, {"paperId": "aab7e4d55cebf531028a4b7e8d977c0bda732ab6", "url": "https://www.semanticscholar.org/paper/aab7e4d55cebf531028a4b7e8d977c0bda732ab6", "title": "Reconstructing quantum states with generative models", "abstract": null, "year": 2018, "referenceCount": 65, "citationCount": 171, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "5048394", "name": "J. Carrasquilla"}, {"authorId": "3422999", "name": "G. Torlai"}, {"authorId": "3422513", "name": "R. Melko"}, {"authorId": "50392358", "name": "L. Aolita"}]}, {"paperId": "d32e0f904574249af0a7995cf919df298422bafb", "url": "https://www.semanticscholar.org/paper/d32e0f904574249af0a7995cf919df298422bafb", "title": "Machine learning in breast MRI", "abstract": "Machine‐learning techniques have led to remarkable advances in data extraction and analysis of medical imaging. Applications of machine learning to breast MRI continue to expand rapidly as increasingly accurate 3D breast and lesion segmentation allows the combination of radiologist‐level interpretation (eg, BI‐RADS lexicon), data from advanced multiparametric imaging techniques, and patient‐level data such as genetic risk markers. Advances in breast MRI feature extraction have led to rapid dataset analysis, which offers promise in large pooled multiinstitutional data analysis. The object of this review is to provide an overview of machine‐learning and deep‐learning techniques for breast MRI, including supervised and unsupervised methods, anatomic breast segmentation, and lesion segmentation. Finally, it explores the role of machine learning, current limitations, and future applications to texture analysis, radiomics, and radiogenomics.", "year": 2020, "referenceCount": 146, "citationCount": 69, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "12542421", "name": "B. Reig"}, {"authorId": "3771591", "name": "L. Heacock"}, {"authorId": "2376144", "name": "Krzysztof J Geras"}, {"authorId": "3245122", "name": "L. Moy"}]}, {"paperId": "413b32dc8855f9db4c95657a3de5ca6c1d793da0", "url": "https://www.semanticscholar.org/paper/413b32dc8855f9db4c95657a3de5ca6c1d793da0", "title": "Policy gradient reinforcement learning for fast quadrupedal locomotion", "abstract": "This paper presents a machine learning approach to optimizing a quadrupedal trot gait for forward speed. Given a parameterized walk designed for a specific robot, we propose using a form of policy gradient reinforcement learning to automatically search the set of possible parameters with the goal of finding the fastest possible walk. We implement and test our approach on a commercially available quadrupedal robot platform, namely the Sony Aibo robot. After about three hours of learning, all on the physical robots and with no human intervention other than to change the batteries, the robots achieved a gait faster than any previously known gait known for the Aibo, significantly outperforming a variety of existing hand-coded and learned solutions.", "year": 2004, "referenceCount": 33, "citationCount": 602, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "2686687", "name": "Nate Kohl"}, {"authorId": "144848112", "name": "P. Stone"}]}, {"paperId": "7e11782fbf554d8fc6b4b726136f67f122d99ca0", "url": "https://www.semanticscholar.org/paper/7e11782fbf554d8fc6b4b726136f67f122d99ca0", "title": "TeleOphta: Machine learning and image processing methods for teleophthalmology", "abstract": null, "year": 2013, "referenceCount": 19, "citationCount": 301, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Art"], "authors": [{"authorId": "3204485", "name": "Etienne Decencière"}, {"authorId": "1721126", "name": "G. Cazuguel"}, {"authorId": "2130047489", "name": "Xiwei Zhang"}, {"authorId": "143684122", "name": "Guillaume Thibault"}, {"authorId": "121842854", "name": "J. Klein"}, {"authorId": "143765825", "name": "F. Meyer"}, {"authorId": "1740693", "name": "B. Marcotegui"}, {"authorId": "1684052", "name": "G. Quellec"}, {"authorId": "1727789", "name": "M. Lamard"}, {"authorId": "2216154", "name": "R. Danno"}, {"authorId": "108097915", "name": "D. Elie"}, {"authorId": "144923890", "name": "P. Massin"}, {"authorId": "2094485189", "name": "Z. Viktor"}, {"authorId": "2967327", "name": "A. Erginay"}, {"authorId": "34853254", "name": "B. Laÿ"}, {"authorId": "1880724", "name": "A. Chabouis"}]}, {"paperId": "9c48acda0de58b39b2b3fecea6754d37ad3300a7", "url": "https://www.semanticscholar.org/paper/9c48acda0de58b39b2b3fecea6754d37ad3300a7", "title": "Machine learning for renewable energy materials", "abstract": "Achieving the 2016 Paris agreement goal of limiting global warming below 2 °C and securing a sustainable energy future require materials innovations in renewable energy technologies. Machine learning has demonstrated many successes to accelerate the discovery renewable energy materials.", "year": 2019, "referenceCount": 178, "citationCount": 111, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39042323", "name": "Geun Ho Gu"}, {"authorId": "145251116", "name": "Juhwan Noh"}, {"authorId": "13247365", "name": "Inkyung Kim"}, {"authorId": "3008602", "name": "Yousung Jung"}]}, {"paperId": "8b836f2797a8008da6477426490d4afef0e9335b", "url": "https://www.semanticscholar.org/paper/8b836f2797a8008da6477426490d4afef0e9335b", "title": "On Learning Vector-Valued Functions", "abstract": "In this letter, we provide a study of learning in a Hilbert space of vector-valued functions. We motivate the need for extending learning theory of scalar-valued functions by practical considerations and establish some basic results for learning vector-valued functions that should prove useful in applications. Specifically, we allow an output space Y to be a Hilbert space, and we consider a reproducing kernel Hilbert space of functions whose values lie in Y. In this setting, we derive the form of the minimal norm interpolant to a finite set of data and apply it to study some regularization functionals that are important in learning theory. We consider specific examples of such functionals corresponding to multiple-output regularization networks and support vector machines, for both regression and classification. Finally, we provide classes of operator-valued kernels of the dot product and translation-invariant type.", "year": 2005, "referenceCount": 45, "citationCount": 493, "influentialCitationCount": 91, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "authors": [{"authorId": "1708279", "name": "C. Micchelli"}, {"authorId": "1704699", "name": "M. Pontil"}]}, {"paperId": "71cc9eefb17d7c4d1062162523b5fdad7ca66a2a", "url": "https://www.semanticscholar.org/paper/71cc9eefb17d7c4d1062162523b5fdad7ca66a2a", "title": "Neural-Symbolic Machine Learning for Retrosynthesis and Reaction Prediction.", "abstract": "Reaction prediction and retrosynthesis are the cornerstones of organic chemistry. Rule-based expert systems have been the most widespread approach to computationally solve these two related challenges to date. However, reaction rules often fail because they ignore the molecular context, which leads to reactivity conflicts. Herein, we report that deep neural networks can learn to resolve reactivity conflicts and to prioritize the most suitable transformation rules. We show that by training our model on 3.5 million reactions taken from the collective published knowledge of the entire discipline of chemistry, our model exhibits a top10-accuracy of 95 % in retrosynthesis and 97 % for reaction prediction on a validation set of almost 1 million reactions.", "year": 2017, "referenceCount": 31, "citationCount": 281, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Chemistry", "Medicine"], "authors": [{"authorId": "3451383", "name": "Marwin H. S. Segler"}, {"authorId": "2628485", "name": "M. Waller"}]}, {"paperId": "2ee53ddcc131bd5070888729b3d39e81419c27c5", "url": "https://www.semanticscholar.org/paper/2ee53ddcc131bd5070888729b3d39e81419c27c5", "title": "A DCT Statistics-Based Blind Image Quality Index", "abstract": "The development of general-purpose no-reference approaches to image quality assessment still lags recent advances in full-reference methods. Additionally, most no-reference or blind approaches are distortion-specific, meaning they assess only a specific type of distortion assumed present in the test image (such as blockiness, blur, or ringing). This limits their application domain. Other approaches rely on training a machine learning algorithm. These methods however, are only as effective as the features used to train their learning machines. Towards ameliorating this we introduce the BLIINDS index (BLind Image Integrity Notator using DCT Statistics) which is a no-reference approach to image quality assessment that does not assume a specific type of distortion of the image. It is based on predicting image quality based on observing the statistics of local discrete cosine transform coefficients, and it requires only minimal training. The method is shown to correlate highly with human perception of quality.", "year": 2010, "referenceCount": 20, "citationCount": 371, "influentialCitationCount": 36, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144672765", "name": "Michele A. Saad"}, {"authorId": "1747569", "name": "A. Bovik"}, {"authorId": "1777325", "name": "C. Charrier"}]}, {"paperId": "70a06b53211515577d263fe24681fa5c58506f71", "url": "https://www.semanticscholar.org/paper/70a06b53211515577d263fe24681fa5c58506f71", "title": "An Evaluation of Machine Learning Methods to Detect Malicious SCADA Communications", "abstract": "Critical infrastructure Supervisory Control and Data Acquisition (SCADA) systems have been designed to operate on closed, proprietary networks where a malicious insider posed the greatest threat potential. The centralization of control and the movement towards open systems and standards has improved the efficiency of industrial control, but has also exposed legacy SCADA systems to security threats that they were not designed to mitigate. This work explores the viability of machine learning methods in detecting the new threat scenarios of command and data injection. Similar to network intrusion detection systems in the cyber security domain, the command and control communications in a critical infrastructure setting are monitored, and vetted against examples of benign and malicious command traffic, in order to identify potential attack events. Multiple learning methods are evaluated using a dataset of Remote Terminal Unit communications, which included both normal operations and instances of command and data injection attack scenarios.", "year": 2013, "referenceCount": 23, "citationCount": 119, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3091321", "name": "J. Beaver"}, {"authorId": "1406398252", "name": "Raymond C. Borges-Hink"}, {"authorId": "31839130", "name": "M. Buckner"}]}, {"paperId": "56ebed5e1ab5c7ad0c17f21fbef520cfd14c7d53", "url": "https://www.semanticscholar.org/paper/56ebed5e1ab5c7ad0c17f21fbef520cfd14c7d53", "title": "Drug repositioning: a machine-learning approach through data integration", "abstract": null, "year": 2013, "referenceCount": 51, "citationCount": 230, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "47563433", "name": "F. Napolitano"}, {"authorId": "2119327178", "name": "Yan Zhao"}, {"authorId": "144693103", "name": "V. Moreira"}, {"authorId": "1716180", "name": "R. Tagliaferri"}, {"authorId": "145991916", "name": "J. Kere"}, {"authorId": "1394068254", "name": "M. D’Amato"}, {"authorId": "144319882", "name": "D. Greco"}]}, {"paperId": "ebb0a31c25e293e834eccb4b7d7f672dba669485", "url": "https://www.semanticscholar.org/paper/ebb0a31c25e293e834eccb4b7d7f672dba669485", "title": "Machine Learning for Hackers", "abstract": "Now that storage and collection technologies are cheaper and more precise, methods for extracting relevant information from large datasets is within the reach any experienced programmer willing to crunch data. With this book, you'll learn machine learning and statistics tools in a practical fashion, using black-box solutions and case studies instead of a traditional math-heavy presentation. By exploring each problem in this book in depth - including both viable and hopeless approaches - you'll learn to recognize when your situation closely matches traditional problems. Then you'll discover how to apply classical statistics tools to your problem. Machine Learning for Hackers is ideal for programmers from private, public, and academic sectors.", "year": 2012, "referenceCount": 21, "citationCount": 61, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46860256", "name": "D. Conway"}, {"authorId": "2111364829", "name": "J. White"}]}, {"paperId": "6488469af81515d76464a14da4b92c6eeb5063e9", "url": "https://www.semanticscholar.org/paper/6488469af81515d76464a14da4b92c6eeb5063e9", "title": "Graph Embedded Extreme Learning Machine", "abstract": "In this paper, we propose a novel extension of the extreme learning machine (ELM) algorithm for single-hidden layer feedforward neural network training that is able to incorporate subspace learning (SL) criteria on the optimization process followed for the calculation of the network's output weights. The proposed graph embedded ELM (GEELM) algorithm is able to naturally exploit both intrinsic and penalty SL criteria that have been (or will be) designed under the graph embedding framework. In addition, we extend the proposed GEELM algorithm in order to be able to exploit SL criteria in arbitrary (even infinite) dimensional ELM spaces. We evaluate the proposed approach on eight standard classification problems and nine publicly available datasets designed for three problems related to human behavior analysis, i.e., the recognition of human face, facial expression, and activity. Experimental results denote the effectiveness of the proposed approach, since it outperforms other ELM-based classification schemes in all the cases.", "year": 2016, "referenceCount": 65, "citationCount": 95, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3074923", "name": "Alexandros Iosifidis"}, {"authorId": "1737071", "name": "A. Tefas"}, {"authorId": "144064571", "name": "I. Pitas"}]}, {"paperId": "817a4aed2775063db9e74f1f3f530d9a18fce773", "url": "https://www.semanticscholar.org/paper/817a4aed2775063db9e74f1f3f530d9a18fce773", "title": "Machine Learning for Materials Scientists: An Introductory Guide toward Best Practices", "abstract": "This Editorial is intended for materials scientists interested in performing machine learning-centered research.We cover broad guidelines and best practices regarding the obtaining and treatment of data, feature engineering, model training, validation, evaluation and comparison, popular repositories for materials data and benchmarking datasets, model and architecture sharing, and finally publication.In addition, we include interactive Jupyter notebooks with example Python code to demonstrate some of the concepts, workflows, and best practices discussed.Overall, the data-driven methods and machine learning workflows and considerations are presented in a simple way, allowing interested readers to more intelligently guide their machine learning research using the suggested references, best practices, and their own materials domain expertise.", "year": 2020, "referenceCount": 130, "citationCount": 97, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50013769", "name": "A. Wang"}, {"authorId": "1572092577", "name": "Ryan Murdock"}, {"authorId": "51474082", "name": "Steven K. Kauwe"}, {"authorId": "15739628", "name": "A. Oliynyk"}, {"authorId": "144959484", "name": "A. Gurlo"}, {"authorId": "13191312", "name": "Jakoah Brgoch"}, {"authorId": "8474736", "name": "K. Persson"}, {"authorId": "15227654", "name": "Taylor D. Sparks"}]}, {"paperId": "136c05cb8dd359fb8e0dc7947172a9ecb74ccbec", "url": "https://www.semanticscholar.org/paper/136c05cb8dd359fb8e0dc7947172a9ecb74ccbec", "title": "Learning by Abstraction: The Neural State Machine", "abstract": "We introduce the Neural State Machine, seeking to bridge the gap between the neural and symbolic views of AI and integrate their complementary strengths for the task of visual reasoning. Given an image, we first predict a probabilistic graph that represents its underlying semantics and serves as a structured world model. Then, we perform sequential reasoning over the graph, iteratively traversing its nodes to answer a given question or draw a new inference. In contrast to most neural architectures that are designed to closely interact with the raw sensory data, our model operates instead in an abstract latent space, by transforming both the visual and linguistic modalities into semantic concept-based representations, thereby achieving enhanced transparency and modularity. We evaluate our model on VQA-CP and GQA, two recent VQA datasets that involve compositionality, multi-step inference and diverse reasoning skills, achieving state-of-the-art results in both cases. We provide further experiments that illustrate the model's strong generalization capacity across multiple dimensions, including novel compositions of concepts, changes in the answer distribution, and unseen linguistic structures, demonstrating the qualities and efficacy of our approach.", "year": 2019, "referenceCount": 89, "citationCount": 167, "influentialCitationCount": 29, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "152951058", "name": "Drew A. Hudson"}, {"authorId": "144783904", "name": "Christopher D. Manning"}]}, {"paperId": "c60905a1971f649c73845cee46866356d2026f90", "url": "https://www.semanticscholar.org/paper/c60905a1971f649c73845cee46866356d2026f90", "title": "Machine-Learning Models for Sales Time Series Forecasting", "abstract": "In this paper, we study the usage of machine-learning models for sales predictive analytics. The main goal of this paper is to consider main approaches and case studies of using machine learning for sales forecasting. The effect of machine-learning generalization has been considered. This effect can be used to make sales predictions when there is a small amount of historical data for specific sales time series in the case when a new product or store is launched. A stacking approach for building regression ensemble of single models has been studied. The results show that using stacking techniques, we can improve the performance of predictive models for sales time series forecasting.", "year": 2019, "referenceCount": 47, "citationCount": 94, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3008532", "name": "B. Pavlyshenko"}]}, {"paperId": "dbfa6c59c2f73cad5418938176c5dc37cd678ca7", "url": "https://www.semanticscholar.org/paper/dbfa6c59c2f73cad5418938176c5dc37cd678ca7", "title": "A General Method for Scaling Up Machine Learning Algorithms and its Application to Clustering", "abstract": null, "year": 2001, "referenceCount": 0, "citationCount": 220, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1740213", "name": "Pedro M. Domingos"}, {"authorId": "1740077", "name": "Geoff Hulten"}]}, {"paperId": "30501640908567ef13640d82c633b6ac6b265dfc", "url": "https://www.semanticscholar.org/paper/30501640908567ef13640d82c633b6ac6b265dfc", "title": "Applications of Deep Learning in Biomedicine.", "abstract": "Increases in throughput and installed base of biomedical research equipment led to a massive accumulation of -omics data known to be highly variable, high-dimensional, and sourced from multiple often incompatible data platforms. While this data may be useful for biomarker identification and drug discovery, the bulk of it remains underutilized. Deep neural networks (DNNs) are efficient algorithms based on the use of compositional layers of neurons, with advantages well matched to the challenges -omics data presents. While achieving state-of-the-art results and even surpassing human accuracy in many challenging tasks, the adoption of deep learning in biomedicine has been comparatively slow. Here, we discuss key features of deep learning that may give this approach an edge over other machine learning methods. We then consider limitations and review a number of applications of deep learning in biomedical studies demonstrating proof of concept and practical utility.", "year": 2016, "referenceCount": 50, "citationCount": 471, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "4017984", "name": "Polina Mamoshina"}, {"authorId": "144468061", "name": "Armando Vieira"}, {"authorId": "5955824", "name": "E. Putin"}, {"authorId": "143865664", "name": "A. Zhavoronkov"}]}, {"paperId": "c931d0106cc540eb3a940dfbed51ce822679311f", "url": "https://www.semanticscholar.org/paper/c931d0106cc540eb3a940dfbed51ce822679311f", "title": "The RSNA Pediatric Bone Age Machine Learning Challenge.", "abstract": "Purpose The Radiological Society of North America (RSNA) Pediatric Bone Age Machine Learning Challenge was created to show an application of machine learning (ML) and artificial intelligence (AI) in medical imaging, promote collaboration to catalyze AI model creation, and identify innovators in medical imaging. Materials and Methods The goal of this challenge was to solicit individuals and teams to create an algorithm or model using ML techniques that would accurately determine skeletal age in a curated data set of pediatric hand radiographs. The primary evaluation measure was the mean absolute distance (MAD) in months, which was calculated as the mean of the absolute values of the difference between the model estimates and those of the reference standard, bone age. Results A data set consisting of 14 236 hand radiographs (12 611 training set, 1425 validation set, 200 test set) was made available to registered challenge participants. A total of 260 individuals or teams registered on the Challenge website. A total of 105 submissions were uploaded from 48 unique users during the training, validation, and test phases. Almost all methods used deep neural network techniques based on one or more convolutional neural networks (CNNs). The best five results based on MAD were 4.2, 4.4, 4.4, 4.5, and 4.5 months, respectively. Conclusion The RSNA Pediatric Bone Age Machine Learning Challenge showed how a coordinated approach to solving a medical imaging problem can be successfully conducted. Future ML challenges will catalyze collaboration and development of ML tools and methods that can potentially improve diagnostic accuracy and patient care. © RSNA, 2018 Online supplemental material is available for this article. See also the editorial by Siegel in this issue.", "year": 2019, "referenceCount": 10, "citationCount": 200, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "143970433", "name": "S. Halabi"}, {"authorId": "144477836", "name": "L. Prevedello"}, {"authorId": "1401724111", "name": "Jayashree Kalpathy-Cramer"}, {"authorId": "49551886", "name": "Artem Mamonov"}, {"authorId": "1752776896", "name": "A. Bilbily"}, {"authorId": "40915057", "name": "Mark D Cicero"}, {"authorId": "38804532", "name": "I. Pan"}, {"authorId": "120829977", "name": "Lucas A. Pereira"}, {"authorId": "50590019", "name": "R. T. Sousa"}, {"authorId": "4793156", "name": "N. Abdala"}, {"authorId": "52014948", "name": "F. Kitamura"}, {"authorId": "2052393", "name": "H. H. Thodberg"}, {"authorId": "2146073251", "name": "Leon Chen"}, {"authorId": "1778950", "name": "G. Shih"}, {"authorId": "1798929", "name": "K. Andriole"}, {"authorId": "145744080", "name": "M. Kohli"}, {"authorId": "144917634", "name": "B. Erickson"}, {"authorId": "1864663", "name": "A. Flanders"}]}, {"paperId": "171a37d680daa11a85c99c76a9cf0d5a56e1568c", "url": "https://www.semanticscholar.org/paper/171a37d680daa11a85c99c76a9cf0d5a56e1568c", "title": "Quantum machine learning for electronic structure calculations", "abstract": null, "year": 2018, "referenceCount": 63, "citationCount": 89, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Medicine"], "authors": [{"authorId": "27778453", "name": "Rongxin Xia"}, {"authorId": "1699217", "name": "S. Kais"}]}, {"paperId": "17fb6c82f9725cd781c91fb8ece15733ea82f66e", "url": "https://www.semanticscholar.org/paper/17fb6c82f9725cd781c91fb8ece15733ea82f66e", "title": "Photonic delay systems as machine learning implementations", "abstract": "Nonlinear photonic delay systems present interesting implementation platforms for machine learning models. They can be extremely fast, offer great degrees of parallelism and potentially consume far less power than digital processors. So far they have been successfully employed for signal processing using the Reservoir Computing paradigm. In this paper we show that their range of applicability can be greatly extended if we use gradient descent with backpropagation through time on a model of the system to optimize the input encoding of such systems. We perform physical experiments that demonstrate that the obtained input encodings work well in reality, and we show that optimized systems perform significantly better than the common Reservoir Computing approach. The results presented here demonstrate that common gradient descent techniques from machine learning may well be applicable on physical neuro-inspired analog computers.", "year": 2015, "referenceCount": 36, "citationCount": 43, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2179062", "name": "Michiel Hermans"}, {"authorId": "144524298", "name": "M. C. Soriano"}, {"authorId": "2309489", "name": "J. Dambre"}, {"authorId": "3275560", "name": "P. Bienstman"}, {"authorId": "1795232", "name": "Ingo Fischer"}]}, {"paperId": "18c39ba04333d31c6cb10faf79d1f18692c38d0f", "url": "https://www.semanticscholar.org/paper/18c39ba04333d31c6cb10faf79d1f18692c38d0f", "title": "Deep Patient: An Unsupervised Representation to Predict the Future of Patients from the Electronic Health Records", "abstract": null, "year": 2016, "referenceCount": 53, "citationCount": 1110, "influentialCitationCount": 52, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1829350", "name": "R. Miotto"}, {"authorId": "2156055664", "name": "Li Li"}, {"authorId": "32827676", "name": "B. Kidd"}, {"authorId": "13964487", "name": "J. Dudley"}]}, {"paperId": "3bc4c90a7bbc7badd47b78043cdf540144557efc", "url": "https://www.semanticscholar.org/paper/3bc4c90a7bbc7badd47b78043cdf540144557efc", "title": "Machine Learning in Banking Risk Management: A Literature Review", "abstract": "There is an increasing influence of machine learning in business applications, with many solutions already implemented and many more being explored. Since the global financial crisis, risk management in banks has gained more prominence, and there has been a constant focus around how risks are being detected, measured, reported and managed. Considerable research in academia and industry has focused on the developments in banking and risk management and the current and emerging challenges. This paper, through a review of the available literature seeks to analyse and evaluate machine-learning techniques that have been researched in the context of banking risk management, and to identify areas or problems in risk management that have been inadequately explored and are potential areas for further research. The review has shown that the application of machine learning in the management of banking risks such as credit risk, market risk, operational risk and liquidity risk has been explored; however, it doesn’t appear commensurate with the current industry level of focus on both risk management and machine learning. A large number of areas remain in bank risk management that could significantly benefit from the study of how machine learning can be applied to address specific problems.", "year": 2019, "referenceCount": 76, "citationCount": 106, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Business"], "authors": [{"authorId": "65758874", "name": "M. Leo"}, {"authorId": "2109864289", "name": "Suneel Sharma"}, {"authorId": "31112068", "name": "K. Maddulety"}]}, {"paperId": "3b861df6aab06bec855ec96ff10b3d47092c544f", "url": "https://www.semanticscholar.org/paper/3b861df6aab06bec855ec96ff10b3d47092c544f", "title": "Learning pulse: a machine learning approach for predicting performance in self-regulated learning using multimodal data", "abstract": "Learning Pulse explores whether using a machine learning approach on multimodal data such as heart rate, step count, weather condition and learning activity can be used to predict learning performance in self-regulated learning settings. An experiment was carried out lasting eight weeks involving PhD students as participants, each of them wearing a Fitbit HR wristband and having their application on their computer recorded during their learning and working activities throughout the day. A software infrastructure for collecting multimodal learning experiences was implemented. As part of this infrastructure a Data Processing Application was developed to pre-process, analyse and generate predictions to provide feedback to the users about their learning performance. Data from different sources were stored using the xAPI standard into a cloud-based Learning Record Store. The participants of the experiment were asked to rate their learning experience through an Activity Rating Tool indicating their perceived level of productivity, stress, challenge and abilities. These self-reported performance indicators were used as markers to train a Linear Mixed Effect Model to generate learner-specific predictions of the learning performance. We discuss the advantages and the limitations of the used approach, highlighting further development points.", "year": 2017, "referenceCount": 35, "citationCount": 64, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3413100", "name": "D. D. Mitri"}, {"authorId": "144398813", "name": "M. Scheffel"}, {"authorId": "1714952", "name": "H. Drachsler"}, {"authorId": "2305518", "name": "D. Börner"}, {"authorId": "2534790", "name": "Stefaan Ternier"}, {"authorId": "143989442", "name": "M. Specht"}]}, {"paperId": "87038966ecc2708af4c5c1543b1e1a456d37f743", "url": "https://www.semanticscholar.org/paper/87038966ecc2708af4c5c1543b1e1a456d37f743", "title": "An Efficient Deep Learning Model to Predict Cloud Workload for Industry Informatics", "abstract": "Deep learning, as the most important architecture of current computational intelligence, achieves super performance to predict the cloud workload for industry informatics. However, it is a nontrivial task to train a deep learning model efficiently since the deep learning model often includes a great number of parameters. In this paper, an efficient deep learning model based on the canonical polyadic decomposition is proposed to predict the cloud workload for industry informatics. In the proposed model, the parameters are compressed significantly by converting the weight matrices to the canonical polyadic format. Furthermore, an efficient learning algorithm is designed to train the parameters. Finally, the proposed efficient deep learning model is applied to the workload prediction of virtual machines on cloud. Experiments are conducted on the datasets collected from PlanetLab to validate the performance of the proposed model by comparing with other machine-learning-based approaches for workload prediction of virtual machines. Results indicate that the proposed model achieves a higher training efficiency and workload prediction accuracy than state-of-the-art machine-learning-based approaches, proving the potential of the proposed model to provide predictive services for industry informatics.", "year": 2018, "referenceCount": 29, "citationCount": 129, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2108076070", "name": "Qingchen Zhang"}, {"authorId": "1690341", "name": "L. Yang"}, {"authorId": "2152532057", "name": "Zheng Yan"}, {"authorId": "1803933", "name": "Zhikui Chen"}, {"authorId": "47471114", "name": "Peng Li"}]}, {"paperId": "d9bdff5eac0d0d1ebd8d09960f195b838ce16f4e", "url": "https://www.semanticscholar.org/paper/d9bdff5eac0d0d1ebd8d09960f195b838ce16f4e", "title": "Accelerated proximal stochastic dual coordinate ascent for regularized loss minimization", "abstract": null, "year": 2013, "referenceCount": 34, "citationCount": 440, "influentialCitationCount": 61, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1389955537", "name": "S. Shalev-Shwartz"}, {"authorId": "49104973", "name": "Tong Zhang"}]}, {"paperId": "965b92478205bb51f9cd158c2a9734b542242bec", "url": "https://www.semanticscholar.org/paper/965b92478205bb51f9cd158c2a9734b542242bec", "title": "The FLUXCOM ensemble of global land-atmosphere energy fluxes", "abstract": null, "year": 2018, "referenceCount": 54, "citationCount": 233, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Computer Science", "Mathematics", "Environmental Science", "Medicine"], "authors": [{"authorId": "95799904", "name": "M. Jung"}, {"authorId": "50417779", "name": "Sujan Koirala"}, {"authorId": "2058489397", "name": "U. Weber"}, {"authorId": "40638530", "name": "K. Ichii"}, {"authorId": "5536084", "name": "F. Gans"}, {"authorId": "1397959153", "name": "G. Camps-Valls"}, {"authorId": "2184976", "name": "D. Papale"}, {"authorId": "2139023", "name": "C. Schwalm"}, {"authorId": "2591511", "name": "G. Tramontana"}, {"authorId": "2530948", "name": "M. Reichstein"}]}, {"paperId": "e0fa4cccc48d3deda3414c7f62eda73b10722c4d", "url": "https://www.semanticscholar.org/paper/e0fa4cccc48d3deda3414c7f62eda73b10722c4d", "title": "Machine learning: an indispensable tool in bioinformatics.", "abstract": null, "year": 2010, "referenceCount": 29, "citationCount": 89, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1788277", "name": "Iñaki Inza"}, {"authorId": "145892659", "name": "Borja Calvo"}, {"authorId": "2708156", "name": "Rubén Armañanzas"}, {"authorId": "2643561", "name": "E. Bengoetxea"}, {"authorId": "144999310", "name": "P. Larrañaga"}, {"authorId": "144762651", "name": "J. A. Lozano"}]}, {"paperId": "586f5b3aaae4ff6e3a537e215f06a9333166baee", "url": "https://www.semanticscholar.org/paper/586f5b3aaae4ff6e3a537e215f06a9333166baee", "title": "Some experiments in machine learning using vector evaluated genetic algorithms (artificial intelligence, optimization, adaptation, pattern recognition)", "abstract": "This dissertation describes experiments conducted to explore the efficacy of using vector-valued feedback with a class of adaptive procedures called genetic algorithms. The software system developed was called VEGA for Vector Evaluated Genetic Algorithm and was first used on multiple objective optimization problems. The principle conclusion of these experiments was that VEGA provided a powerful and robust search technique for complex multiobjective optimization problems of high order when little or no a priori knowledge was available to guide the search. These results were similar to those found by previous researchers using scalar genetic algorithms for scalar optimization problems. \nThe VEGA technique was then applied to multiclass pattern discrimination tasks. The resulting software system was called LS-2 for Learning System - Two since it followed closely the lead of a scalar-valued learning system called LS-1 developed by Stephen Smith. The experiments revealed that LS-2 was able to evolve high performance production system programs to perform the pattern discrimination tasks it was given. In addition, experiments which varied several of the parameters of LS-2 revealed something of the sensitivity of vector-valued genetic search to the settings of these parameters. \nIn sum it may be said that the VEGA approach has demonstrated the efficacy of extending the previously demonstrated power of genetic algorithms to vector-valued problems and thereby provides a new approach to machine learning.", "year": 1984, "referenceCount": 0, "citationCount": 377, "influentialCitationCount": 37, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145738991", "name": "J. D. Schaffer"}]}, {"paperId": "c47a860451768d329e5d7e492ef209614f5ef7c8", "url": "https://www.semanticscholar.org/paper/c47a860451768d329e5d7e492ef209614f5ef7c8", "title": "Machine learning quantum phases of matter beyond the fermion sign problem", "abstract": null, "year": 2016, "referenceCount": 57, "citationCount": 249, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Medicine"], "authors": [{"authorId": "13916768", "name": "Peter Broecker"}, {"authorId": "5048394", "name": "J. Carrasquilla"}, {"authorId": "3422513", "name": "R. Melko"}, {"authorId": "2877530", "name": "S. Trebst"}]}, {"paperId": "c96f7099e2e8b6d402440700ca5fd2bf247ca81f", "url": "https://www.semanticscholar.org/paper/c96f7099e2e8b6d402440700ca5fd2bf247ca81f", "title": "Supervised Noun Phrase Coreference Research: The First Fifteen Years", "abstract": "The research focus of computational coreference resolution has exhibited a shift from heuristic approaches to machine learning approaches in the past decade. This paper surveys the major milestones in supervised coreference research since its inception fifteen years ago.", "year": 2010, "referenceCount": 172, "citationCount": 282, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145106110", "name": "Vincent Ng"}]}, {"paperId": "b4c4c48148f2df5e5ec99d4b5bcf4b2ba52a89dc", "url": "https://www.semanticscholar.org/paper/b4c4c48148f2df5e5ec99d4b5bcf4b2ba52a89dc", "title": "Identification and Resolution of Chinese Zero Pronouns: A Machine Learning Approach", "abstract": "In this paper, we present a machine learning approach to the identification and resolution of Chinese anaphoric zero pronouns. We perform both identification and resolution automatically, with two sets of easily computable features. Experimental results show that our proposed learning approach achieves anaphoric zero pronoun resolution accuracy comparable to a previous state-ofthe-art, heuristic rule-based approach. To our knowledge, our work is the first to perform both identification and resolution of Chinese anaphoric zero pronouns using a machine learning approach.", "year": 2007, "referenceCount": 20, "citationCount": 100, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2935745", "name": "Shanheng Zhao"}, {"authorId": "34789794", "name": "H. Ng"}]}, {"paperId": "e7e6684e5e73eae210c6d7adfc57e245f0fa0fdf", "url": "https://www.semanticscholar.org/paper/e7e6684e5e73eae210c6d7adfc57e245f0fa0fdf", "title": "Survey on Automated Machine Learning", "abstract": "Machine learning has become a vital part in many aspects of our daily life. However, building well performing machine learning applications requires highly specialized data scientists and domain experts. Automated machine learning (AutoML) aims to reduce the demand for data scientists by enabling domain experts to automatically build machine learning applications without extensive knowledge of statistics and machine learning. In this survey, we summarize the recent developments in academy and industry regarding AutoML. First, we introduce a holistic problem formulation. Next, approaches for solving various subproblems of AutoML are presented. Finally, we provide an extensive empirical evaluation of the presented approaches on synthetic and real data.", "year": 2019, "referenceCount": 188, "citationCount": 60, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "114984566", "name": "Marc-André Zöller"}, {"authorId": "1959068", "name": "Marco F. Huber"}]}, {"paperId": "0fd357e4e4d84629bdb0b49c83a5a71cd6c43359", "url": "https://www.semanticscholar.org/paper/0fd357e4e4d84629bdb0b49c83a5a71cd6c43359", "title": "Machine Learning Methods for Demand Estimation", "abstract": "We survey and apply several techniques from the statistical and computer science literature to the problem of demand estimation. To improve out-of-sample prediction accuracy, we propose a method of combining the underlying models via linear regression. Our method is robust to a large number of regressors; scales easily to very large data sets; combines model selection and estimation; and can flexibly approximate arbitrary non-linear functions. We illustrate our method using a standard scanner panel data set and find that our estimates are considerably more accurate in out-of-sample predictions of demand than some commonly used alternatives.", "year": 2015, "referenceCount": 14, "citationCount": 142, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "52624594", "name": "Patrick Bajari"}, {"authorId": "2307080", "name": "Denis Nekipelov"}, {"authorId": "3288177", "name": "Stephen P. Ryan"}, {"authorId": "152790172", "name": "Miaoyu Yang"}]}, {"paperId": "c3be9cfae1e49799abae236d30e5e078249af949", "url": "https://www.semanticscholar.org/paper/c3be9cfae1e49799abae236d30e5e078249af949", "title": "Cost-sensitive learning methods for imbalanced data", "abstract": "Class imbalance is one of the challenging problems for machine learning algorithms. When learning from highly imbalanced data, most classifiers are overwhelmed by the majority class examples, so the false negative rate is always high. Although researchers have introduced many methods to deal with this problem, including resampling techniques and cost-sensitive learning (CSL), most of them focus on either of these techniques. This study presents two empirical methods that deal with class imbalance using both resampling and CSL. The first method combines and compares several sampling techniques with CSL using support vector machines (SVM). The second method proposes using CSL by optimizing the cost ratio (cost matrix) locally. Our experimental results on 18 imbalanced datasets from the UCI repository show that the first method can reduce the misclassification costs, and the second method can improve the classifier performance.", "year": 2010, "referenceCount": 43, "citationCount": 239, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1398807584", "name": "Nguyen Thai-Nghe"}, {"authorId": "2382247", "name": "Zeno Gantner"}, {"authorId": "1388781075", "name": "L. Schmidt-Thieme"}]}, {"paperId": "593338fbbb79065891beaf985a95860bd39f52bf", "url": "https://www.semanticscholar.org/paper/593338fbbb79065891beaf985a95860bd39f52bf", "title": "Semi-Supervised Learning for Neural Machine Translation", "abstract": "While end-to-end neural machine translation (NMT) has made remarkable progress recently, NMT systems only rely on parallel corpora for parameter estimation. Since parallel corpora are usually limited in quantity, quality, and coverage, especially for low-resource languages, it is appealing to exploit monolingual corpora to improve NMT. We propose a semi-supervised approach for training NMT models on the concatenation of labeled (parallel corpora) and unlabeled (monolingual corpora) data. The central idea is to reconstruct the monolingual corpora using an autoencoder, in which the source-to-target and target-to-source translation models serve as the encoder and decoder, respectively. Our approach can not only exploit the monolingual corpora of the target language, but also of the source language. Experiments on the Chinese-English dataset show that our approach achieves significant improvements over state-of-the-art SMT and NMT systems.", "year": 2016, "referenceCount": 34, "citationCount": 161, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145161801", "name": "Yong Cheng"}, {"authorId": "47210460", "name": "W. Xu"}, {"authorId": "37985966", "name": "Zhongjun He"}, {"authorId": "48692318", "name": "W. He"}, {"authorId": "40354707", "name": "Hua Wu"}, {"authorId": "1753344", "name": "Maosong Sun"}, {"authorId": "2152798100", "name": "Yang Liu"}]}, {"paperId": "8b31cde846da855340fe6ec1feaba3d9bb6592b3", "url": "https://www.semanticscholar.org/paper/8b31cde846da855340fe6ec1feaba3d9bb6592b3", "title": "Comparison of Discrimination Methods for the Classification of Tumors Using Gene Expression Data", "abstract": "A reliable and precise classification of tumors is essential for successful diagnosis and treatment of cancer. cDNA microarrays and high-density oligonucleotide chips are novel biotechnologies increasingly used in cancer research. By allowing the monitoring of expression levels in cells for thousands of genes simultaneously, microarray experiments may lead to a more complete understanding of the molecular variations among tumors and hence to a finer and more informative classification. The ability to successfully distinguish between tumor classes (already known or yet to be discovered) using gene expression data is an important aspect of this novel approach to cancer classification. This article compares the performance of different discrimination methods for the classification of tumors based on gene expression data. The methods include nearest-neighbor classifiers, linear discriminant analysis, and classification trees. Recent machine learning approaches, such as bagging and boosting, are also considered. The discrimination methods are applied to datasets from three recently published cancer gene expression studies.", "year": 2002, "referenceCount": 59, "citationCount": 2821, "influentialCitationCount": 283, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "2225350", "name": "S. Dudoit"}, {"authorId": "2711125", "name": "J. Fridlyand"}, {"authorId": "2673932", "name": "T. Speed"}]}, {"paperId": "b7c565e002471173b1b342dbee9c593b52e96f50", "url": "https://www.semanticscholar.org/paper/b7c565e002471173b1b342dbee9c593b52e96f50", "title": "A Machine Learning Approach for Non-blind Image Deconvolution", "abstract": "Image deconvolution is the ill-posed problem of recovering a sharp image, given a blurry one generated by a convolution. In this work, we deal with space-invariant non-blind deconvolution. Currently, the most successful methods involve a regularized inversion of the blur in Fourier domain as a first step. This step amplifies and colors the noise, and corrupts the image information. In a second (and arguably more difficult) step, one then needs to remove the colored noise, typically using a cleverly engineered algorithm. However, the methods based on this two-step approach do not properly address the fact that the image information has been corrupted. In this work, we also rely on a two-step procedure, but learn the second step on a large dataset of natural images, using a neural network. We will show that this approach outperforms the current state-of-the-art on a large dataset of artificially blurred images. We demonstrate the practical applicability of our method in a real-world example with photographic out-of-focus blur.", "year": 2013, "referenceCount": 33, "citationCount": 268, "influentialCitationCount": 30, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1814533", "name": "Christian J. Schuler"}, {"authorId": "2068427959", "name": "Harold Christopher Burger"}, {"authorId": "1734990", "name": "S. Harmeling"}, {"authorId": "1707625", "name": "B. Schölkopf"}]}, {"paperId": "488a3f9092093d4f52b25df4342ec79f0327a325", "url": "https://www.semanticscholar.org/paper/488a3f9092093d4f52b25df4342ec79f0327a325", "title": "Proceedings of the 28th International Conference on Machine Learning", "abstract": null, "year": 2011, "referenceCount": 0, "citationCount": 285, "influentialCitationCount": 44, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1398777358", "name": "J. Hernández-Orallo"}, {"authorId": "47840704", "name": "Peter A. Flach"}, {"authorId": "1785006", "name": "C. Ferri"}]}, {"paperId": "2c39148333e6061d6c118fe2f1cf0b5990cc4dcc", "url": "https://www.semanticscholar.org/paper/2c39148333e6061d6c118fe2f1cf0b5990cc4dcc", "title": "On Applied Research in Machine Learning", "abstract": "Common arguments for including applications papers in the Machine Learning literature are often based on the papers' value for advertising success stories and for morale boosting. For example, high-proole applications can help to secure funding for future research and can help to attract high caliber students. However, there is another reason why such papers are of value to the eld, which is, arguably, even more vital. Application papers are essential in order for Machine Learning to remain a viable science. They focus research on important unsolved problems that currently restrict the practical applicability of machine learning methods. Much of the \\science\" of Machine Learning is a science of engineering. 1 By this we mean that it is dedicated to creating and compiling veriiable knowledge related to the design and construction of artifacts. The scientiic knowledge comprises theoretical arguments, observational categorizations, empirical studies, and practical demonstrations. The artifacts are computer programs that use data to build models that are practically or theoretically useful. Because the objects of study are intended to have practical utility, it is essential for research activities to be focused (in part) on the elimination of obstacles that impede their practical application. Most often these obstacles take the form of restrictive simplifying assumptions commonly made in research. Consider as an example the assumption, common in classiier learning research, that misclassiication errors have equal costs. The vast majority of classiier learning research in Machine Learning has been conducted under this assumption, through the use of classiication accuracy as the primary (or sole) evaluation metric. Is this a reasonable assumption under which we should be operating? The answer is unclear. It is diicult to imagine a real-world classii-cation problem where error costs are equal, and researchers come in from the eld time after time citing problems dealing with unequal misclassiication costs. Nevertheless , we continue to press on with research on increasing classiication accuracy. In the Machine Learning literature isolated studies suggest that it is possible to weaken this assumption and still learn eeectively (Turney 1997), but there have been no comprehensive studies. This is but one small example of a common simplifying assumption that may be too strong. Of course it is not clear that even a very solid applications paper pointing out the inapplicability of this assumption would be suucient to convince the eld to shift its scientiic paradigm (Kuhn 1970). In fact, with respect to this particular …", "year": 1998, "referenceCount": 20, "citationCount": 103, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1752722", "name": "F. Provost"}]}, {"paperId": "27d7e51794a243039c52a1265ee7b91bcc22bcdd", "url": "https://www.semanticscholar.org/paper/27d7e51794a243039c52a1265ee7b91bcc22bcdd", "title": "Machine Learning With Neuromorphic Photonics", "abstract": "Neuromorphic photonics has experienced a recent surge of interest over the last few years, promising orders of magnitude improvements in both speed and energy efficiency over digital electronics. This paper provides a tutorial overview of neuromorphic photonic systems and their application to optimization and machine learning problems. We discuss the physical advantages of photonic processing systems, and we describe underlying device models that allow practical systems to be constructed. We also describe several real-world applications for control and deep learning inference. Finally, we discuss scalability in the context of designing a full-scale neuromorphic photonic processing system, considering aspects such as signal integrity, noise, and hardware fabrication platforms. The paper is intended for a wide audience and teaches how theory, research, and device concepts from neuromorphic photonics could be applied in practical machine learning systems.", "year": 2019, "referenceCount": 111, "citationCount": 78, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "27054786", "name": "T. F. de Lima"}, {"authorId": "35428986", "name": "Hsuan-Tung Peng"}, {"authorId": "2304580", "name": "A. Tait"}, {"authorId": "1827568", "name": "M. Nahmias"}, {"authorId": "2057332761", "name": "Heidi B. Miller"}, {"authorId": "2694890", "name": "B. Shastri"}, {"authorId": "144504492", "name": "P. Prucnal"}]}, {"paperId": "542df9c07b06202e6df417d80e4a026cd567f30a", "url": "https://www.semanticscholar.org/paper/542df9c07b06202e6df417d80e4a026cd567f30a", "title": "Deep Learning with R", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 103, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Geology"], "authors": [{"authorId": "47380999", "name": "A. Ghatak"}]}, {"paperId": "fc0884effaa73b9dd91e683accb4068343bc776b", "url": "https://www.semanticscholar.org/paper/fc0884effaa73b9dd91e683accb4068343bc776b", "title": "Extracting certainty from uncertainty: regret bounded by variation in costs", "abstract": null, "year": 2008, "referenceCount": 29, "citationCount": 146, "influentialCitationCount": 23, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "34840427", "name": "Elad Hazan"}, {"authorId": "144055676", "name": "Satyen Kale"}]}, {"paperId": "35c2814858423862353e100c6e7979c58187fdcf", "url": "https://www.semanticscholar.org/paper/35c2814858423862353e100c6e7979c58187fdcf", "title": "High-Throughput Machine-Learning-Driven Synthesis of Full-Heusler Compounds", "abstract": "A machine-learning model has been trained to discover Heusler compounds, which are intermetallics exhibiting diverse physical properties attractive for applications in thermoelectric and spintronic materials. Improving these properties requires knowledge of crystal structures, which occur in three subtle variations (Heusler, inverse Heusler, and CsCl-type structures) that are difficult, and at times impossible, to distinguish by diffraction techniques. Compared to alternative approaches, this Heusler discovery engine performs exceptionally well, making fast and reliable predictions of the occurrence of Heusler vs non-Heusler compounds for an arbitrary combination of elements with no structural input on over 400 000 candidates. The model has a true positive rate of 0.94 (and false positive rate of 0.01). It is also valuable for data sanitizing, by flagging questionable entries in crystallographic databases. It was applied to screen candidates with the formula AB2C and predict the existence of 12 novel gall...", "year": 2016, "referenceCount": 39, "citationCount": 218, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "15739628", "name": "A. Oliynyk"}, {"authorId": "4995443", "name": "Erin Antono"}, {"authorId": "15227654", "name": "Taylor D. Sparks"}, {"authorId": "13336968", "name": "Leila Ghadbeigi"}, {"authorId": "10019044", "name": "M. Gaultois"}, {"authorId": "8839934", "name": "B. Meredig"}, {"authorId": "34052585", "name": "A. Mar"}]}, {"paperId": "df013a17ab84d5403361da4538a04d574f58be83", "url": "https://www.semanticscholar.org/paper/df013a17ab84d5403361da4538a04d574f58be83", "title": "TVM: An Automated End-to-End Optimizing Compiler for Deep Learning", "abstract": "There is an increasing need to bring machine learning to a wide diversity of hardware devices. Current frameworks rely on vendor-specific operator libraries and optimize for a narrow range of server-class GPUs. Deploying workloads to new platforms -- such as mobile phones, embedded devices, and accelerators (e.g., FPGAs, ASICs) -- requires significant manual effort. We propose TVM, a compiler that exposes graph-level and operator-level optimizations to provide performance portability to deep learning workloads across diverse hardware back-ends. TVM solves optimization challenges specific to deep learning, such as high-level operator fusion, mapping to arbitrary hardware primitives, and memory latency hiding. It also automates optimization of low-level programs to hardware characteristics by employing a novel, learning-based cost modeling method for rapid exploration of code optimizations. Experimental results show that TVM delivers performance across hardware back-ends that are competitive with state-of-the-art, hand-tuned libraries for low-power CPU, mobile GPU, and server-class GPUs. We also demonstrate TVM's ability to target new accelerator back-ends, such as the FPGA-based generic deep learning accelerator. The system is open sourced and in production use inside several major companies.", "year": 2018, "referenceCount": 48, "citationCount": 845, "influentialCitationCount": 215, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1913774", "name": "Tianqi Chen"}, {"authorId": "47108160", "name": "T. Moreau"}, {"authorId": "1732910", "name": "Ziheng Jiang"}, {"authorId": "2149970173", "name": "Lianmin Zheng"}, {"authorId": "2621619", "name": "Eddie Q. Yan"}, {"authorId": "3050154", "name": "Haichen Shen"}, {"authorId": "37270394", "name": "M. Cowan"}, {"authorId": "2185540", "name": "Leyuan Wang"}, {"authorId": "49994783", "name": "Yuwei Hu"}, {"authorId": "1717411", "name": "L. Ceze"}, {"authorId": "1730156", "name": "Carlos Guestrin"}, {"authorId": "144695691", "name": "A. Krishnamurthy"}]}, {"paperId": "071021a11f418852a0e3e9805b51e44cc6639a9e", "url": "https://www.semanticscholar.org/paper/071021a11f418852a0e3e9805b51e44cc6639a9e", "title": "Recognizing names in biomedical texts: a machine learning approach", "abstract": "MOTIVATION\nWith an overwhelming amount of textual information in molecular biology and biomedicine, there is a need for effective and efficient literature mining and knowledge discovery that can help biologists to gather and make use of the knowledge encoded in text documents. In order to make organized and structured information available, automatically recognizing biomedical entity names becomes critical and is important for information retrieval, information extraction and automated knowledge acquisition.\n\n\nRESULTS\nIn this paper, we present a named entity recognition system in the biomedical domain, called PowerBioNE. In order to deal with the special phenomena of naming conventions in the biomedical domain, we propose various evidential features: (1) word formation pattern; (2) morphological pattern, such as prefix and suffix; (3) part-of-speech; (4) head noun trigger; (5) special verb trigger and (6) name alias feature. All the features are integrated effectively and efficiently through a hidden Markov model (HMM) and a HMM-based named entity recognizer. In addition, a k-Nearest Neighbor (k-NN) algorithm is proposed to resolve the data sparseness problem in our system. Finally, we present a pattern-based post-processing to automatically extract rules from the training data to deal with the cascaded entity name phenomenon. From our best knowledge, PowerBioNE is the first system which deals with the cascaded entity name phenomenon. Evaluation shows that our system achieves the F-measure of 66.6 and 62.2 on the 23 classes of GENIA V3.0 and V1.1, respectively. In particular, our system achieves the F-measure of 75.8 on the \"protein\" class of GENIA V3.0. For comparison, our system outperforms the best published result by 7.8 on GENIA V1.1, without help of any dictionaries. It also shows that our HMM and the k-NN algorithm outperform other models, such as back-off HMM, linear interpolated HMM, support vector machines, C4.5, C4.5 rules and RIPPER, by effectively capturing the local context dependency and resolving the data sparseness problem. Moreover, evaluation on GENIA V3.0 shows that the post-processing for the cascaded entity name phenomenon improves the F-measure by 3.9. Finally, error analysis shows that about half of the errors are caused by the strict annotation scheme and the annotation inconsistency in the GENIA corpus. This suggests that our system achieves an acceptable F-measure of 83.6 on the 23 classes of GENIA V3.0 and in particular 86.2 on the \"protein\" class, without help of any dictionaries. We think that a F-measure of 90 on the 23 classes of GENIA V3.0 and in particular 92 on the \"protein\" class, can be achieved through refining of the annotation scheme in the GENIA corpus, such as flexible annotation scheme and annotation consistency, and inclusion of a reasonable biomedical dictionary.\n\n\nAVAILABILITY\nA demo system is available at http://textmining.i2r.a-star.edu.sg/NLS/demo.htm. Technology license is available upon the bilateral agreement.", "year": 2004, "referenceCount": 30, "citationCount": 274, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "143740945", "name": "Guodong Zhou"}, {"authorId": "2159189624", "name": "Jie Zhang"}, {"authorId": "144538026", "name": "Jian Su"}, {"authorId": "2065249478", "name": "Dan Shen"}, {"authorId": "1679749", "name": "C. Tan"}]}, {"paperId": "52b15103417a47ad20465bccf86e6302391fe9ce", "url": "https://www.semanticscholar.org/paper/52b15103417a47ad20465bccf86e6302391fe9ce", "title": "Dual Supervised Learning", "abstract": null, "year": 2017, "referenceCount": 44, "citationCount": 114, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2794096", "name": "Yingce Xia"}, {"authorId": "143826491", "name": "Tao Qin"}, {"authorId": null, "name": "Wei Chen"}, {"authorId": "152441498", "name": "Jiang Bian"}, {"authorId": "1708598", "name": "Nenghai Yu"}, {"authorId": "2110264337", "name": "Tie-Yan Liu"}]}, {"paperId": "8fcf64410eb024ccfb0b4d5303a80b605a9d004a", "url": "https://www.semanticscholar.org/paper/8fcf64410eb024ccfb0b4d5303a80b605a9d004a", "title": "Learning from Little: Comparison of Classifiers Given Little Training", "abstract": null, "year": 2004, "referenceCount": 19, "citationCount": 173, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3332330", "name": "George Forman"}, {"authorId": "49641404", "name": "I. Cohen"}]}, {"paperId": "6338670193f9fdcfd3b6e7cec414f15ca906a85f", "url": "https://www.semanticscholar.org/paper/6338670193f9fdcfd3b6e7cec414f15ca906a85f", "title": "SVDFeature: a toolkit for feature-based collaborative filtering", "abstract": "In this paper we introduce SVDFeature, a machine learning toolkit for feature-based collaborative filtering. SVDFeature is designed to efficiently solve the feature-based matrix factorization. The feature-based setting allows us to build factorization models incorporating side information such as temporal dynamics, neighborhood relationship, and hierarchical information. The toolkit is capable of both rate prediction and collaborative ranking, and is carefully designed for efficient training on large-scale data set. Using this toolkit, we built solutions to win KDD Cup for two consecutive years.", "year": 2012, "referenceCount": 3, "citationCount": 231, "influentialCitationCount": 33, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1913774", "name": "Tianqi Chen"}, {"authorId": "2108309275", "name": "Weinan Zhang"}, {"authorId": "2117522623", "name": "Qiuxia Lu"}, {"authorId": "1995670", "name": "Kailong Chen"}, {"authorId": "2115548759", "name": "Zhao Zheng"}, {"authorId": "1811427", "name": "Yong Yu"}]}, {"paperId": "93000baf4185d1d1d63aeb18a9f6a5df6e51a22a", "url": "https://www.semanticscholar.org/paper/93000baf4185d1d1d63aeb18a9f6a5df6e51a22a", "title": "Machine learning predictive models for mineral prospectivity: an evaluation of neural networks, random forest, regression trees and support vector machines", "abstract": null, "year": 2015, "referenceCount": 104, "citationCount": 523, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Geology"], "authors": [{"authorId": "1387450722", "name": "V. Rodriguez-Galiano"}, {"authorId": "1402209662", "name": "M. Sánchez-Castillo"}, {"authorId": "1390132462", "name": "M. Chica-Olmo"}, {"authorId": "1402209682", "name": "M. Chica-Rivas"}]}, {"paperId": "3b6fae512d213079cf8856b318450e3969840805", "url": "https://www.semanticscholar.org/paper/3b6fae512d213079cf8856b318450e3969840805", "title": "Finding latent code errors via machine learning over program executions", "abstract": "This paper proposes a technique for identifying program properties that indicate errors. The technique generates machine learning models of program properties known to result from errors, and applies these models to program properties of user-written code to classify and rank properties that may lead the user to errors. Given a set of properties produced by the program analysis, the technique selects a subset of properties that are most likely to reveal an error. An implementation, the fault invariant classifier, demonstrates the efficacy of the technique. The implementation uses dynamic invariant detection to generate program properties. It uses support vector machine and decision tree learning tools to classify those properties. In our experimental evaluation, the technique increases the relevance (the concentration of fault-revealing properties) by a factor of 50 on average for the C programs, and 4.8 for the Java programs. Preliminary experience suggests that most of the fault-revealing properties do lead a programmer to an error.", "year": 2004, "referenceCount": 39, "citationCount": 196, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2932798", "name": "Yuriy Brun"}, {"authorId": "6698059", "name": "Michael D. Ernst"}]}, {"paperId": "e44f0460f0dd2aefdaedf232a67fc183211e9f71", "url": "https://www.semanticscholar.org/paper/e44f0460f0dd2aefdaedf232a67fc183211e9f71", "title": "Comparing Bayesian Network Classifiers", "abstract": "In this paper, we empirically evaluate algorithms for learning four types of Bayesian network (BN) classifiers - Naive-Bayes, tree augmented Naive-Bayes, BN augmented Naive-Bayes and general BNs, where the latter two are learned using two variants of a conditional-independence (CI) based BN-learning algorithm. Experimental results show the obtained classifiers, learned using the CI based algorithms, are competitive with (or superior to) the best known classifiers, based on both Bayesian networks and other formalisms; and that the computational time for learning and using these classifiers is relatively small. Moreover, these results also suggest a way to learn yet more effective classifiers; we demonstrate empirically that this new algorithm does work as expected. Collectively, these results argue that BN classifiers deserve more attention in machine learning and data mining communities.", "year": 1999, "referenceCount": 17, "citationCount": 460, "influentialCitationCount": 46, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2112427179", "name": "Jie Cheng"}, {"authorId": "143686063", "name": "R. Greiner"}]}, {"paperId": "e7ed4f39858957c9862a52ba6b09b4a7fcb5d3e1", "url": "https://www.semanticscholar.org/paper/e7ed4f39858957c9862a52ba6b09b4a7fcb5d3e1", "title": "Considerations for Evaluation and Generalization in Interpretable Machine Learning", "abstract": null, "year": 2018, "referenceCount": 75, "citationCount": 94, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1388372395", "name": "Finale Doshi-Velez"}, {"authorId": "3351164", "name": "Been Kim"}]}, {"paperId": "ba4a34680e09e77984624c95f5245d91b54373f6", "url": "https://www.semanticscholar.org/paper/ba4a34680e09e77984624c95f5245d91b54373f6", "title": "XTREME: A Massively Multilingual Multi-task Benchmark for Evaluating Cross-lingual Generalization", "abstract": "Much recent progress in applications of machine learning models to NLP has been driven by benchmarks that evaluate models across a wide variety of tasks. However, these broad-coverage benchmarks have been mostly limited to English, and despite an increasing interest in multilingual models, a benchmark that enables the comprehensive evaluation of such methods on a diverse range of languages and tasks is still missing. To this end, we introduce the Cross-lingual TRansfer Evaluation of Multilingual Encoders XTREME benchmark, a multi-task benchmark for evaluating the cross-lingual generalization capabilities of multilingual representations across 40 languages and 9 tasks. We demonstrate that while models tested on English reach human performance on many tasks, there is still a sizable gap in the performance of cross-lingually transferred models, particularly on syntactic and sentence retrieval tasks. There is also a wide spread of results across languages. We release the benchmark to encourage research on cross-lingual learning methods that transfer linguistic knowledge across a diverse and representative set of languages and tasks.", "year": 2020, "referenceCount": 63, "citationCount": 510, "influentialCitationCount": 135, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2149221827", "name": "Junjie Hu"}, {"authorId": "2884561", "name": "Sebastian Ruder"}, {"authorId": "9356387", "name": "Aditya Siddhant"}, {"authorId": "1700325", "name": "Graham Neubig"}, {"authorId": "2345617", "name": "Orhan Firat"}, {"authorId": "145657834", "name": "Melvin Johnson"}]}, {"paperId": "65b6c541ac4f1b57382fb4f95fe3cf4ccc8752be", "url": "https://www.semanticscholar.org/paper/65b6c541ac4f1b57382fb4f95fe3cf4ccc8752be", "title": "Model-Free Prediction of Large Spatiotemporally Chaotic Systems from Data: A Reservoir Computing Approach.", "abstract": "We demonstrate the effectiveness of using machine learning for model-free prediction of spatiotemporally chaotic systems of arbitrarily large spatial extent and attractor dimension purely from observations of the system's past evolution. We present a parallel scheme with an example implementation based on the reservoir computing paradigm and demonstrate the scalability of our scheme using the Kuramoto-Sivashinsky equation as an example of a spatiotemporally chaotic system.", "year": 2018, "referenceCount": 42, "citationCount": 614, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "35620505", "name": "Jaideep Pathak"}, {"authorId": "1868698", "name": "B. Hunt"}, {"authorId": "3269691", "name": "M. Girvan"}, {"authorId": "34949672", "name": "Zhixin Lu"}, {"authorId": "144596753", "name": "E. Ott"}]}, {"paperId": "b3e025049142be3d97d559cca12b027f16c6349e", "url": "https://www.semanticscholar.org/paper/b3e025049142be3d97d559cca12b027f16c6349e", "title": "Deep Architectures and Deep Learning in Chemoinformatics: The Prediction of Aqueous Solubility for Drug-Like Molecules", "abstract": "Shallow machine learning methods have been applied to chemoinformatics problems with some success. As more data becomes available and more complex problems are tackled, deep machine learning methods may also become useful. Here, we present a brief overview of deep learning methods and show in particular how recursive neural network approaches can be applied to the problem of predicting molecular properties. However, molecules are typically described by undirected cyclic graphs, while recursive approaches typically use directed acyclic graphs. Thus, we develop methods to address this discrepancy, essentially by considering an ensemble of recursive neural networks associated with all possible vertex-centered acyclic orientations of the molecular graph. One advantage of this approach is that it relies only minimally on the identification of suitable molecular descriptors because suitable representations are learned automatically from the data. Several variants of this approach are applied to the problem of predicting aqueous solubility and tested on four benchmark data sets. Experimental results show that the performance of the deep learning methods matches or exceeds the performance of other state-of-the-art methods according to several evaluation metrics and expose the fundamental limitations arising from training sets that are too small or too noisy. A Web-based predictor, AquaSol, is available online through the ChemDB portal ( cdb.ics.uci.edu ) together with additional material.", "year": 2013, "referenceCount": 74, "citationCount": 385, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "3318293", "name": "A. Lusci"}, {"authorId": "2028880", "name": "G. Pollastri"}, {"authorId": "144902513", "name": "P. Baldi"}]}, {"paperId": "7793e3f51f3c373bd75f9768e927ff6632fe8d69", "url": "https://www.semanticscholar.org/paper/7793e3f51f3c373bd75f9768e927ff6632fe8d69", "title": "Multilabel dimensionality reduction via dependence maximization", "abstract": "Multilabel learning deals with data associated with multiple labels simultaneously. Like other data mining and machine learning tasks, multilabel learning also suffers from the curse of dimensionality. Dimensionality reduction has been studied for many years, however, multilabel dimensionality reduction remains almost untouched. In this article, we propose a multilabel dimensionality reduction method, MDDM, with two kinds of projection strategies, attempting to project the original data into a lower-dimensional feature space maximizing the dependence between the original feature description and the associated class labels. Based on the Hilbert-Schmidt Independence Criterion, we derive a eigen-decomposition problem which enables the dimensionality reduction process to be efficient. Experiments validate the performance of MDDM.", "year": 2008, "referenceCount": 49, "citationCount": 328, "influentialCitationCount": 40, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2108506794", "name": "Yin Zhang"}, {"authorId": "145624000", "name": "Zhi-Hua Zhou"}]}, {"paperId": "c9fa1cb56feeeb5033aa7ba40fa035ca2b9018ce", "url": "https://www.semanticscholar.org/paper/c9fa1cb56feeeb5033aa7ba40fa035ca2b9018ce", "title": "50 Years of Test (Un)fairness: Lessons for Machine Learning", "abstract": "Quantitative definitions of what is unfair and what is fair have been introduced in multiple disciplines for well over 50 years, including in education, hiring, and machine learning. We trace how the notion of fairness has been defined within the testing communities of education and hiring over the past half century, exploring the cultural and social context in which different fairness definitions have emerged. In some cases, earlier definitions of fairness are similar or identical to definitions of fairness in current machine learning research, and foreshadow current formal work. In other cases, insights into what fairness means and how to measure it have largely gone overlooked. We compare past and current notions of fairness along several dimensions, including the fairness criteria, the focus of the criteria (e.g., a test, a model, or its use), the relationship of fairness to individuals, groups, and subgroups, and the mathematical method for measuring fairness (e.g., classification, regression). This work points the way towards future research and measurement of (un)fairness that builds from our modern understanding of fairness while incorporating insights from the past.", "year": 2018, "referenceCount": 76, "citationCount": 207, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2083807", "name": "B. Hutchinson"}, {"authorId": "49501003", "name": "Margaret Mitchell"}]}, {"paperId": "1e3154b10b872c100b86181ac2931c8e26f67912", "url": "https://www.semanticscholar.org/paper/1e3154b10b872c100b86181ac2931c8e26f67912", "title": "Theory of Disagreement-Based Active Learning", "abstract": "Active learning is a protocol for supervised machine learning, in which a learning algorithm sequentially requests the labels of selected data points from a large pool of unlabeled data. This contrasts with passive learning, where the labeled data are taken at random. The objective in active learning is to produce a highly-accurate classifier, ideally using fewer labels than the number of random labeled data sufficient for passive learning to achieve the same. This article describes recent advances in our understanding of the theoretical benefits of active learning, and implications for the design of effective active learning algorithms. Much of the article focuses on a particular technique, namely disagreement-based active learning, which by now has amassed a mature and coherent literature. It also briefly surveys several alternative approaches from the literature. The emphasis is on theorems regarding the performance of a few general algorithms, including rigorous proofs where appropriate. However, the presentation is intended to be pedagogical, focusing on results that illustrate fundamental ideas, rather than obtaining the strongest or most general known theorems. The intended audience includes researchers and advanced graduate students in machine learning and statistics, interested in gaining a deeper understanding of the recent and ongoing developments in the theory of active learning.", "year": 2014, "referenceCount": 86, "citationCount": 202, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1762565", "name": "Steve Hanneke"}]}, {"paperId": "36a3eed52ff0a694aa73ce6a0d592cb440ed3d31", "url": "https://www.semanticscholar.org/paper/36a3eed52ff0a694aa73ce6a0d592cb440ed3d31", "title": "Robust Physical-World Attacks on Machine Learning Models", "abstract": "Deep neural network-based classifiers are known to be vulnerable to adversarial examples that can fool them into misclassifying their input through the addition of small-magnitude perturbations. However, recent studies have demonstrated that such adversarial examples are not very effective in the physical world--they either completely fail to cause misclassification or only work in restricted cases where a relatively complex image is perturbed and printed on paper. In this paper we propose a new attack algorithm--Robust Physical Perturbations (RP2)-- that generates perturbations by taking images under different conditions into account. Our algorithm can create spatially-constrained perturbations that mimic vandalism or art to reduce the likelihood of detection by a casual observer. We show that adversarial examples generated by RP2 achieve high success rates under various conditions for real road sign recognition by using an evaluation methodology that captures physical world conditions. We physically realized and evaluated two attacks, one that causes a Stop sign to be misclassified as a Speed Limit sign in 100% of the testing conditions, and one that causes a Right Turn sign to be misclassified as either a Stop or Added Lane sign in 100% of the testing conditions.", "year": 2017, "referenceCount": 22, "citationCount": 263, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "22229139", "name": "I. Evtimov"}, {"authorId": "1825256", "name": "Kevin Eykholt"}, {"authorId": "35064352", "name": "Earlence Fernandes"}, {"authorId": "1769675", "name": "T. Kohno"}, {"authorId": "2165245296", "name": "Bo Li"}, {"authorId": "49428285", "name": "Atul Prakash"}, {"authorId": "145416145", "name": "Amir Rahmati"}, {"authorId": "143711382", "name": "D. Song"}]}]}