{"total": 5120627, "offset": 3300, "next": 3400, "data": [{"paperId": "a8ed44cbf02da0f135335bc2986ddff9109d9b53", "url": "https://www.semanticscholar.org/paper/a8ed44cbf02da0f135335bc2986ddff9109d9b53", "title": "MLACP: machine-learning-based prediction of anticancer peptides", "abstract": "Cancer is the second leading cause of death globally, and use of therapeutic peptides to target and kill cancer cells has received considerable attention in recent years. Identification of anticancer peptides (ACPs) through wet-lab experimentation is expensive and often time consuming; therefore, development of an efficient computational method is essential to identify potential ACP candidates prior to in vitro experimentation. In this study, we developed support vector machine- and random forest-based machine-learning methods for the prediction of ACPs using the features calculated from the amino acid sequence, including amino acid composition, dipeptide composition, atomic composition, and physicochemical properties. We trained our methods using the Tyagi-B dataset and determined the machine parameters by 10-fold cross-validation. Furthermore, we evaluated the performance of our methods on two benchmarking datasets, with our results showing that the random forest-based method outperformed the existing methods with an average accuracy and Matthews correlation coefficient value of 88.7% and 0.78, respectively. To assist the scientific community, we also developed a publicly accessible web server at www.thegleelab.org/MLACP.html.", "year": 2017, "referenceCount": 79, "citationCount": 149, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "49557292", "name": "Balachandran Manavalan"}, {"authorId": "2793986", "name": "S. Basith"}, {"authorId": "7143195", "name": "T. Shin"}, {"authorId": "144073777", "name": "Sun Choi"}, {"authorId": "2224756", "name": "M. Kim"}, {"authorId": "145543795", "name": "Gwang Lee"}]}, {"paperId": "7e02c5b0e83cd6bba4c94c458bdb7079e97c36cd", "url": "https://www.semanticscholar.org/paper/7e02c5b0e83cd6bba4c94c458bdb7079e97c36cd", "title": "Entity Resolution: Theory, Practice & Open Challenges", "abstract": "This tutorial brings together perspectives on ER from a variety of fields, including databases, machine learning, natural language processing and information retrieval, to provide, in one setting, a survey of a large body of work. We discuss both the practical aspects and theoretical underpinnings of ER. We describe existing solutions, current challenges, and open research problems.", "year": 2012, "referenceCount": 32, "citationCount": 293, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1746034", "name": "L. Getoor"}, {"authorId": "2357165", "name": "Ashwin Machanavajjhala"}]}, {"paperId": "3a7d3ce9e69b102dc4e8863752e956e19f125e9a", "url": "https://www.semanticscholar.org/paper/3a7d3ce9e69b102dc4e8863752e956e19f125e9a", "title": "Depression detection from social network data using machine learning techniques", "abstract": null, "year": 2018, "referenceCount": 59, "citationCount": 149, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2110073056", "name": "Md. Rafiqul Islam"}, {"authorId": "3207804", "name": "M. A. Kabir"}, {"authorId": "50731932", "name": "Ashir Ahmed"}, {"authorId": "28904888", "name": "A. Kamal"}, {"authorId": "2113255188", "name": "Hua Wang"}, {"authorId": "35035828", "name": "A. Ulhaq"}]}, {"paperId": "bb82053d4229357925b28ffe647377f56d93b06e", "url": "https://www.semanticscholar.org/paper/bb82053d4229357925b28ffe647377f56d93b06e", "title": "Intelligent nanophotonics: merging photonics and artificial intelligence at the nanoscale", "abstract": "Abstract Nanophotonics has been an active research field over the past two decades, triggered by the rising interests in exploring new physics and technologies with light at the nanoscale. As the demands of performance and integration level keep increasing, the design and optimization of nanophotonic devices become computationally expensive and time-inefficient. Advanced computational methods and artificial intelligence, especially its subfield of machine learning, have led to revolutionary development in many applications, such as web searches, computer vision, and speech/image recognition. The complex models and algorithms help to exploit the enormous parameter space in a highly efficient way. In this review, we summarize the recent advances on the emerging field where nanophotonics and machine learning blend. We provide an overview of different computational methods, with the focus on deep learning, for the nanophotonic inverse design. The implementation of deep neural networks with photonic platforms is also discussed. This review aims at sketching an illustration of the nanophotonic design with machine learning and giving a perspective on the future tasks.", "year": 2018, "referenceCount": 237, "citationCount": 170, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine", "Computer Science"], "authors": [{"authorId": "2305129", "name": "Kan Yao"}, {"authorId": "1944881178", "name": "R. Unni"}, {"authorId": "4011641", "name": "Yuebing Zheng"}]}, {"paperId": "9fba31ec64ce23405e36cabf4f31c2fe2d12826c", "url": "https://www.semanticscholar.org/paper/9fba31ec64ce23405e36cabf4f31c2fe2d12826c", "title": "Reinforcement Learning in a large scale photonic Recurrent Neural Network", "abstract": "Photonic Neural Network implementations have been gaining considerable attention as a potentially disruptive future technology. Demonstrating learning in large scale neural networks is essential to establish photonic machine learning substrates as viable information processing systems. Realizing photonic Neural Networks with numerous nonlinear nodes in a fully parallel and efficient learning hardware was lacking so far. We demonstrate a network of up to 2500 diffractively coupled photonic nodes, forming a large scale Recurrent Neural Network. Using a Digital Micro Mirror Device, we realize reinforcement learning. Our scheme is fully parallel, and the passive weights maximize energy efficiency and bandwidth. The computational output efficiently converges and we achieve very good performance.", "year": 2017, "referenceCount": 34, "citationCount": 197, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "49206957", "name": "Julián Bueno"}, {"authorId": "3445665", "name": "S. Maktoobi"}, {"authorId": "1783005", "name": "L. Froehly"}, {"authorId": "1795232", "name": "Ingo Fischer"}, {"authorId": "143753357", "name": "M. Jacquot"}, {"authorId": "1760452", "name": "L. Larger"}, {"authorId": "145711155", "name": "D. Brunner"}]}, {"paperId": "2d55ff4542eaae18dcd10c2cd74199396e260402", "url": "https://www.semanticscholar.org/paper/2d55ff4542eaae18dcd10c2cd74199396e260402", "title": "Rawlsian Fairness for Machine Learning", "abstract": "Motivated by concerns that automated decision-making procedures can unintentionally lead to discriminatory behavior, we study a technical definition of fairness modeled after John Rawls' notion of \"fair equality of opportunity\". In the context of a simple model of online decision making, we give an algorithm that satisfies this fairness constraint, while still being able to learn at a rate that is comparable to (but necessarily worse than) that of the best algorithms absent a fairness constraint. We prove a regret bound for fair algorithms in the linear contextual bandit framework that is a significant improvement over our technical companion paper [16], which gives black-box reductions in a more general setting. We analyze our algorithms both theoretically and experimentally. Finally, we introduce the notion of a \"discrimination index\", and show that standard algorithms for our problem exhibit structured discriminatory behavior, whereas the \"fair\" algorithms we develop do not.", "year": 2016, "referenceCount": 36, "citationCount": 74, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "144525693", "name": "Matthew Joseph"}, {"authorId": "81338045", "name": "M. Kearns"}, {"authorId": "144848816", "name": "Jamie H. Morgenstern"}, {"authorId": "5880154", "name": "Seth Neel"}, {"authorId": "1682008", "name": "Aaron Roth"}]}, {"paperId": "81fd20c2b903d979075e0c6a59258b0a84213095", "url": "https://www.semanticscholar.org/paper/81fd20c2b903d979075e0c6a59258b0a84213095", "title": "Strategic Classification", "abstract": "Machine learning relies on the assumption that unseen test instances of a classification problem follow the same distribution as observed training data. However, this principle can break down when machine learning is used to make important decisions about the welfare (employment, education, health) of strategic individuals. Knowing information about the classifier, such individuals may manipulate their attributes in order to obtain a better classification outcome. As a result of this behavior -- often referred to as gaming -- the performance of the classifier may deteriorate sharply. Indeed, gaming is a well-known obstacle for using machine learning methods in practice; in financial policy-making, the problem is widely known as Goodhart's law. In this paper, we formalize the problem, and pursue algorithms for learning classifiers that are robust to gaming. We model classification as a sequential game between a player named \"Jury\" and a player named \"Contestant.\" Jury designs a classifier, and Contestant receives an input to the classifier drawn from a distribution. Before being classified, Contestant may change his input based on Jury's classifier. However, Contestant incurs a cost for these changes according to a cost function. Jury's goal is to achieve high classification accuracy with respect to Contestant's original input and some underlying target classification function, assuming Contestant plays best response. Contestant's goal is to achieve a favorable classification outcome while taking into account the cost of achieving it. For a natural class of \"separable\" cost functions, and certain generalizations, we obtain computationally efficient learning algorithms which are near optimal, achieving a classification error that is arbitrarily close to the theoretical minimum. Surprisingly, our algorithms are efficient even on concept classes that are computationally hard to learn. For general cost functions, designing an approximately optimal strategy-proof classifier, for inverse-polynomial approximation, is NP-hard.", "year": 2015, "referenceCount": 15, "citationCount": 215, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1775622", "name": "Moritz Hardt"}, {"authorId": "1706816", "name": "N. Megiddo"}, {"authorId": "144102674", "name": "C. Papadimitriou"}, {"authorId": "1759738", "name": "Mary Wootters"}]}, {"paperId": "c094a192dbc6478b57e14d101a0afdbba13f39e2", "url": "https://www.semanticscholar.org/paper/c094a192dbc6478b57e14d101a0afdbba13f39e2", "title": "On Testing Machine Learning Programs", "abstract": null, "year": 2018, "referenceCount": 57, "citationCount": 76, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "51125810", "name": "Houssem Ben Braiek"}, {"authorId": "1703493", "name": "F. Khomh"}]}, {"paperId": "3d25eb8241345f86101fda145d95d89c27844fd1", "url": "https://www.semanticscholar.org/paper/3d25eb8241345f86101fda145d95d89c27844fd1", "title": "Distributed Submodular Maximization: Identifying Representative Elements in Massive Data", "abstract": "Many large-scale machine learning problems (such as clustering, non-parametric learning, kernel machines, etc.) require selecting, out of a massive data set, a manageable yet representative subset. Such problems can often be reduced to maximizing a submodular set function subject to cardinality constraints. Classical approaches require centralized access to the full data set; but for truly large-scale problems, rendering the data centrally is often impractical. In this paper, we consider the problem of submodular function maximization in a distributed fashion. We develop a simple, two-stage protocol GREEDI, that is easily implemented using MapReduce style computations. We theoretically analyze our approach, and show, that under certain natural conditions, performance close to the (impractical) centralized approach can be achieved. In our extensive experiments, we demonstrate the effectiveness of our approach on several applications, including sparse Gaussian process inference and exemplar-based clustering, on tens of millions of data points using Hadoop.", "year": 2013, "referenceCount": 35, "citationCount": 248, "influentialCitationCount": 29, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2389094", "name": "Baharan Mirzasoleiman"}, {"authorId": "1697131", "name": "Amin Karbasi"}, {"authorId": "2810893", "name": "R. Sarkar"}, {"authorId": "145343838", "name": "Andreas Krause"}]}, {"paperId": "00bc2153cd21001860e43758273945110f0ae40d", "url": "https://www.semanticscholar.org/paper/00bc2153cd21001860e43758273945110f0ae40d", "title": "Consistent Feature Selection for Pattern Recognition in Polynomial Time", "abstract": "We analyze two different feature selection problems: finding a minimal feature set optimal for classification (MINIMAL-OPTIMAL) vs. finding all features relevant to the target variable (ALL-RELEVANT). The latter problem is motivated by recent applications within bioinformatics, particularly gene expression analysis. For both problems, we identify classes of data distributions for which there exist consistent, polynomial-time algorithms. We also prove that ALL-RELEVANT is much harder than MINIMAL-OPTIMAL and propose two consistent, polynomial-time algorithms. We argue that the distribution classes considered are reasonable in many practical cases, so that our results simplify feature selection in a wide range of machine learning tasks.", "year": 2007, "referenceCount": 40, "citationCount": 161, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1681221", "name": "R. Nilsson"}, {"authorId": "70048667", "name": "J. Peña"}, {"authorId": "145491933", "name": "J. Björkegren"}, {"authorId": "1687483", "name": "J. Tegner"}]}, {"paperId": "1c4b2bf81643cc3584efd2812510b33015a0d661", "url": "https://www.semanticscholar.org/paper/1c4b2bf81643cc3584efd2812510b33015a0d661", "title": "Expert-augmented machine learning", "abstract": "Significance Machine learning is increasingly used across fields to derive insights from data, which further our understanding of the world and help us anticipate the future. The performance of predictive modeling is dependent on the amount and quality of available data. In practice, we rely on human experts to perform certain tasks and on machine learning for others. However, the optimal learning strategy may involve combining the complementary strengths of humans and machines. We present expert-augmented machine learning, an automated way to automatically extract problem-specific human expert knowledge and integrate it with machine learning to build robust, dependable, and data-efficient predictive models. Machine learning is proving invaluable across disciplines. However, its success is often limited by the quality and quantity of available data, while its adoption is limited by the level of trust afforded by given models. Human vs. machine performance is commonly compared empirically to decide whether a certain task should be performed by a computer or an expert. In reality, the optimal learning strategy may involve combining the complementary strengths of humans and machines. Here, we present expert-augmented machine learning (EAML), an automated method that guides the extraction of expert knowledge and its integration into machine-learned models. We used a large dataset of intensive-care patient data to derive 126 decision rules that predict hospital mortality. Using an online platform, we asked 15 clinicians to assess the relative risk of the subpopulation defined by each rule compared to the total sample. We compared the clinician-assessed risk to the empirical risk and found that, while clinicians agreed with the data in most cases, there were notable exceptions where they overestimated or underestimated the true risk. Studying the rules with greatest disagreement, we identified problems with the training data, including one miscoded variable and one hidden confounder. Filtering the rules based on the extent of disagreement between clinician-assessed risk and empirical risk, we improved performance on out-of-sample data and were able to train with less data. EAML provides a platform for automated creation of problem-specific priors, which help build robust and dependable machine-learning models in critical applications.", "year": 2019, "referenceCount": 38, "citationCount": 46, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Mathematics"], "authors": [{"authorId": "3088421", "name": "Efstathios D. Gennatas"}, {"authorId": "3056361", "name": "J. Friedman"}, {"authorId": "1412391493", "name": "L. Ungar"}, {"authorId": "4372658", "name": "R. Pirracchio"}, {"authorId": "144020269", "name": "Eric Eaton"}, {"authorId": "150192444", "name": "L. Reichman"}, {"authorId": "3304169", "name": "Y. Interian"}, {"authorId": "1697525", "name": "C. Simone"}, {"authorId": "2059212508", "name": "A. Auerbach"}, {"authorId": "2055966654", "name": "E. Delgado"}, {"authorId": "145099512", "name": "M. J. Laan"}, {"authorId": "2286161", "name": "T. Solberg"}, {"authorId": "145295389", "name": "G. Valdes"}]}, {"paperId": "bc85ed64d59af0ad57e090215945b70498c6d19a", "url": "https://www.semanticscholar.org/paper/bc85ed64d59af0ad57e090215945b70498c6d19a", "title": "Clinical applications of continual learning machine learning.", "abstract": null, "year": 2020, "referenceCount": 10, "citationCount": 65, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "1390581576", "name": "Cecilia S Lee"}, {"authorId": "33556235", "name": "Aaron Y. Lee"}]}, {"paperId": "77d02ff7f3b8897e58663af52ccdbd48e81b068b", "url": "https://www.semanticscholar.org/paper/77d02ff7f3b8897e58663af52ccdbd48e81b068b", "title": "Toward Large-Scale Vulnerability Discovery using Machine Learning", "abstract": "With sustained growth of software complexity, finding security vulnerabilities in operating systems has become an important necessity. Nowadays, OS are shipped with thousands of binary executables. Unfortunately, methodologies and tools for an OS scale program testing within a limited time budget are still missing. In this paper we present an approach that uses lightweight static and dynamic features to predict if a test case is likely to contain a software vulnerability using machine learning techniques. To show the effectiveness of our approach, we set up a large experiment to detect easily exploitable memory corruptions using 1039 Debian programs obtained from its bug tracker, collected 138,308 unique execution traces and statically explored 76,083 different subsequences of function calls. We managed to predict with reasonable accuracy which programs contained dangerous memory corruptions. We also developed and implemented VDiscover, a tool that uses state-of-the-art Machine Learning techniques to predict vulnerabilities in test cases. Such tool will be released as open-source to encourage the research of vulnerability discovery at a large scale, together with VDiscovery, a public dataset that collects raw analyzed data.", "year": 2016, "referenceCount": 58, "citationCount": 145, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39340848", "name": "Gustavo Grieco"}, {"authorId": "2224372", "name": "G. L. Grinblat"}, {"authorId": "2588271", "name": "Lucas C. Uzal"}, {"authorId": "32295255", "name": "Sanjay Rawat"}, {"authorId": "34803759", "name": "Josselin Feist"}, {"authorId": "1722719", "name": "L. Mounier"}]}, {"paperId": "5ffa8bf1bf3e39227be28de4ff6915d3b21eb52d", "url": "https://www.semanticscholar.org/paper/5ffa8bf1bf3e39227be28de4ff6915d3b21eb52d", "title": "Deep Generative Stochastic Networks Trainable by Backprop", "abstract": "We introduce a novel training principle for probabilistic models that is an alternative to maximum likelihood. The proposed Generative Stochastic Networks (GSN) framework is based on learning the transition operator of a Markov chain whose stationary distribution estimates the data distribution. The transition distribution of the Markov chain is conditional on the previous state, generally involving a small move, so this conditional distribution has fewer dominant modes, being unimodal in the limit of small moves. Thus, it is easier to learn because it is easier to approximate its partition function, more like learning to perform supervised function approximation, with gradients that can be obtained by backprop. We provide theorems that generalize recent work on the probabilistic interpretation of denoising autoencoders and obtain along the way an interesting justification for dependency networks and generalized pseudolikelihood, along with a definition of an appropriate joint distribution and sampling mechanism even when the conditionals are not consistent. GSNs can be used with missing inputs and can be used to sample subsets of variables given the rest. We validate these theoretical results with experiments on two image datasets using an architecture that mimics the Deep Boltzmann Machine Gibbs sampler but allows training to proceed with simple backprop, without the need for layerwise pretraining.", "year": 2013, "referenceCount": 45, "citationCount": 370, "influentialCitationCount": 27, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1751762", "name": "Yoshua Bengio"}, {"authorId": "1398746441", "name": "Eric Thibodeau-Laufer"}, {"authorId": "1815021", "name": "Guillaume Alain"}, {"authorId": "2965424", "name": "J. Yosinski"}]}, {"paperId": "cb410e6ebdee42b710c9a99ac9af7c2bc6c1726e", "url": "https://www.semanticscholar.org/paper/cb410e6ebdee42b710c9a99ac9af7c2bc6c1726e", "title": "Rollout sampling approximate policy iteration", "abstract": null, "year": 2008, "referenceCount": 16, "citationCount": 65, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1720480", "name": "Christos Dimitrakakis"}, {"authorId": "1784072", "name": "M. Lagoudakis"}]}, {"paperId": "a70e8c69fe806f9cd2e04ace4b5581c25ec8db46", "url": "https://www.semanticscholar.org/paper/a70e8c69fe806f9cd2e04ace4b5581c25ec8db46", "title": "Knowledge Discovery in Databases: An Attribute-Oriented Approach", "abstract": "Knowledge discovery in databases, or data mining, is an important issue in the development of data- and knowledge-base systems. An attribute-oriented induction method has been developed for knowledge discovery in databases. The method integrates a machine learning paradigm, especially learning-from-examples techniques, with set-oriented database operations and extracts generalized data from actual data in databases. An attribute-oriented concept tree ascension technique is applied in generalization, which substantially reduces the computational complex@ of database learning processes. Different kinas of knowledge rules, including characteristic rules, discrimination rules, quantitative rules, and data evolution regularities can be discovered efficiently using the attribute-oriented approach. In addition to learning in relational databases, the approach can be applied to knowledge discovery in nested relational and deductive databases. Learning can also be performed with databases containing noisy data and exceptional cases using database statistics. Furthermore, the rules discovered can be used to query database knowledge, answer cooperative queries and facilitate semantic query optimization. Based upon these principles, a prototyped database learning system, DBLEARN, has been constructed for experimentation.", "year": 1992, "referenceCount": 26, "citationCount": 480, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145325584", "name": "Jiawei Han"}, {"authorId": "2224532", "name": "Yandong Cai"}, {"authorId": "1701942", "name": "N. Cercone"}]}, {"paperId": "41653772fd26829aae3e3106a573322b47129b8f", "url": "https://www.semanticscholar.org/paper/41653772fd26829aae3e3106a573322b47129b8f", "title": "Extreme learning machine: A review", "abstract": "Feedforward neural networks (FFNN) have been utilised for various research in machine learning and they have gained a significantly wide acceptance. However, it was recently noted that the feedforward neural network has been functioning slower than needed. As a result, it has created critical bottlenecks among its applications. Extreme Learning Machines (ELM) were suggested as alternative learning algorithms instead of FFNN. The former is characterised by single-hidden layer feedforward neural networks (SLFN). It selects hidden nodes randomly and analytically determines their output weight. This review aims to, first, present a short mathematical explanation to explain the basic ELM. Second, because of its notable simplicity, efficiency, and remarkable generalisation performance, ELM has had wide uses in various domains, such as computer vision, biomedical engineering, control and robotics, system identification, etc. Thus, in this review, we will aim to present a complete view of these ELM advances for different applications. Finally, ELM’s strengths and weakness will be presented, along with its future perspectives.", "year": 2017, "referenceCount": 132, "citationCount": 68, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "13696977", "name": "Musatafa Abbas Abbood Albadr"}, {"authorId": "9211469", "name": "S. Tiun"}]}, {"paperId": "96baf66b1ead911d18b64ad674c9512e189c290b", "url": "https://www.semanticscholar.org/paper/96baf66b1ead911d18b64ad674c9512e189c290b", "title": "Machine Learning and Deep Learning in Medical Imaging: Intelligent Imaging.", "abstract": null, "year": 2019, "referenceCount": 35, "citationCount": 103, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "3948517", "name": "G. Currie"}, {"authorId": "151073947", "name": "K. Hawk"}, {"authorId": "4308674", "name": "E. Rohren"}, {"authorId": "35686882", "name": "Alanna Vial"}, {"authorId": "38920132", "name": "R. Klein"}]}, {"paperId": "0d3b51f94a5934fdda8f1e728f1b56c9bfeb1cb6", "url": "https://www.semanticscholar.org/paper/0d3b51f94a5934fdda8f1e728f1b56c9bfeb1cb6", "title": "Learning Finite State Machines With Self-Clustering Recurrent Networks", "abstract": "Recent work has shown that recurrent neural networks have the ability to learn finite state automata from examples. In particular, networks using second-order units have been successful at this task. In studying the performance and learning behavior of such networks we have found that the second-order network model attempts to form clusters in activation space as its internal representation of states. However, these learned states become unstable as longer and longer test input strings are presented to the network. In essence, the network forgets where the individual states are in activation space. In this paper we propose a new method to force such a network to learn stable states by introducing discretization into the network and using a pseudo-gradient learning rule to perform training. The essence of the learning rule is that in doing gradient descent, it makes use of the gradient of a sigmoid function as a heuristic hint in place of that of the hard-limiting function, while still using the discretized value in the feedback update path. The new structure uses isolated points in activation space instead of vague clusters as its internal representation of states. It is shown to have similar capabilities in learning finite state automata as the original network, but without the instability problem. The proposed pseudo-gradient learning rule may also be used as a basis for training other types of networks that have hard-limiting threshold activation functions.", "year": 1993, "referenceCount": 25, "citationCount": 147, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2075413715", "name": "Zheng Zeng"}, {"authorId": "145135018", "name": "R. Goodman"}, {"authorId": "50860274", "name": "Padhraic Smyth"}]}, {"paperId": "8351b7666cafafcca6c369e27cea34a0dc1cab28", "url": "https://www.semanticscholar.org/paper/8351b7666cafafcca6c369e27cea34a0dc1cab28", "title": "Statistical Mechanics of Deep Learning", "abstract": "The recent striking success of deep neural networks in machine learning raises profound questions about the theoretical principles underlying their success. For example, what can such deep networks...", "year": 2020, "referenceCount": 9, "citationCount": 110, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "12383244", "name": "Yasaman Bahri"}, {"authorId": "4298623", "name": "Jonathan Kadmon"}, {"authorId": "143845796", "name": "Jeffrey Pennington"}, {"authorId": "2601641", "name": "S. Schoenholz"}, {"authorId": "1407546424", "name": "Jascha Narain Sohl-Dickstein"}, {"authorId": "25769960", "name": "S. Ganguli"}]}, {"paperId": "0dc51bf6a831de64e7db32b1692b140545a037bc", "url": "https://www.semanticscholar.org/paper/0dc51bf6a831de64e7db32b1692b140545a037bc", "title": "Machine learning in digital games: a survey", "abstract": null, "year": 2008, "referenceCount": 133, "citationCount": 82, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2259368", "name": "L. Galway"}, {"authorId": "145374778", "name": "D. Charles"}, {"authorId": "1679578", "name": "Michaela M. Black"}]}, {"paperId": "17f9bf0d72ed1c08f6914da67c58341ac8c3f5ab", "url": "https://www.semanticscholar.org/paper/17f9bf0d72ed1c08f6914da67c58341ac8c3f5ab", "title": "Molecular dynamics with on-the-fly machine learning of quantum-mechanical forces.", "abstract": "We present a molecular dynamics scheme which combines first-principles and machine-learning (ML) techniques in a single information-efficient approach. Forces on atoms are either predicted by Bayesian inference or, if necessary, computed by on-the-fly quantum-mechanical (QM) calculations and added to a growing ML database, whose completeness is, thus, never required. As a result, the scheme is accurate and general, while progressively fewer QM calls are needed when a new chemical process is encountered for the second and subsequent times, as demonstrated by tests on crystalline and molten silicon.", "year": 2015, "referenceCount": 91, "citationCount": 380, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine"], "authors": [{"authorId": "2144233686", "name": "Zhenwei Li"}, {"authorId": "11724553", "name": "J. Kermode"}, {"authorId": "48920231", "name": "A. De Vita"}]}, {"paperId": "417fd5b826344010caf8f9c3504c7f7a1959602e", "url": "https://www.semanticscholar.org/paper/417fd5b826344010caf8f9c3504c7f7a1959602e", "title": "Quantum Chemistry in the Age of Machine Learning.", "abstract": "As quantum chemistry (QC) community embraces machine learning (ML), the surging number of new methods and applications based on combination of QC and ML is emerging. In this Perspective a view on the current state of affairs in this new exciting research field is offered, challenges of using ML in QC applications are described, and potential future developments are outlined. Specifically, examples of how ML is used to improve the accuracy and accelerate QC research are shown. Generalization and classification of existing techniques is provided to ease the navigation in the sea of literature and to guide the researchers entering the field. The emphasis of this Perspective is on the supervised ML.", "year": 2020, "referenceCount": 187, "citationCount": 146, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "5378288", "name": "Pavlo O. Dral"}]}, {"paperId": "e0cbda831f37460a56ea74ee655802b3014d1e3f", "url": "https://www.semanticscholar.org/paper/e0cbda831f37460a56ea74ee655802b3014d1e3f", "title": "Learning and Evaluating Boltzmann Machines", "abstract": "We provide a brief overview of the variational framework for obtaining deterministic approximations or upper bounds for the log-partition function. We also review some of the Monte Carlo based methods for estimating partition functions of arbitrary Markov Random Fields. We then develop an annealed importance sampling (AIS) procedure for estimating partition functions of rest ricted Boltzmann machines (RBM’s), semi-restricted Boltzmann machines (SRBM’s), an d Boltzmann machines (BM’s). Our empirical results indicate that the AIS procedu re provides much better estimates of the partition function than some of the popular variational-based methods. Finally, we develop a new learning algorithm for training general Boltzmann machines and show that it can be successfully applied to learning good generative models.", "year": 2008, "referenceCount": 28, "citationCount": 70, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "145124475", "name": "R. Salakhutdinov"}]}, {"paperId": "d340af39d88840e0e3e0a5f85807a4d84006b664", "url": "https://www.semanticscholar.org/paper/d340af39d88840e0e3e0a5f85807a4d84006b664", "title": "Web mining: Machine learning for web applications", "abstract": "L'A. examine la recherche sur l'apprentissage automatique et les techniques de recherche d'information traditionnelles, et leurs possibles applications pour les systemes de fouille sur le Web. La fouille du Web est entendue comme la decouverte et l'analyse d'information utile sur le Web, domaine d'etudes a la croisee de la recherche d'information, la recherche sur le Web, l'apprentissage automatique, les bases de donnees, la fouille de donnees et la fouille de texte. Les etudes sur la fouille du Web se repartissent en trois categories, selon que l'on considere le contenu du Web, sa structure ou son usage.", "year": 2005, "referenceCount": 167, "citationCount": 105, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Political Science", "Computer Science"], "authors": [{"authorId": "47666658", "name": "Hsinchun Chen"}, {"authorId": "145884195", "name": "M. Chau"}]}, {"paperId": "5cd3d3339061991eaabdd206d7b8179b8e6a0f1c", "url": "https://www.semanticscholar.org/paper/5cd3d3339061991eaabdd206d7b8179b8e6a0f1c", "title": "Computers and Automata", "abstract": "This paper reviews briefly some of the recent developments in the field of automata and nonnumerical computation. A number of typical machines are described, including logic machines, game-playing machines and learning machines. Some theoretical questions and developments are discussed, such as a comparison of computers and the brain, Turing's formulation of computing machines and von Neumann's models of self-reproducing machines.", "year": 1953, "referenceCount": 7, "citationCount": 103, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144461837", "name": "C. Shannon"}]}, {"paperId": "44b3b3bb40a9055eccdf86ea1702f6ae8b38934c", "url": "https://www.semanticscholar.org/paper/44b3b3bb40a9055eccdf86ea1702f6ae8b38934c", "title": "Decentralized Stochastic Optimization and Gossip Algorithms with Compressed Communication", "abstract": "We consider decentralized stochastic optimization with the objective function (e.g. data samples for machine learning task) being distributed over $n$ machines that can only communicate to their neighbors on a fixed communication graph. To reduce the communication bottleneck, the nodes compress (e.g. quantize or sparsify) their model updates. We cover both unbiased and biased compression operators with quality denoted by $\\omega \\leq 1$ ($\\omega=1$ meaning no compression). We (i) propose a novel gossip-based stochastic gradient descent algorithm, CHOCO-SGD, that converges at rate $\\mathcal{O}\\left(1/(nT) + 1/(T \\delta^2 \\omega)^2\\right)$ for strongly convex objectives, where $T$ denotes the number of iterations and $\\delta$ the eigengap of the connectivity matrix. Despite compression quality and network connectivity affecting the higher order terms, the first term in the rate, $\\mathcal{O}(1/(nT))$, is the same as for the centralized baseline with exact communication. We (ii) present a novel gossip algorithm, CHOCO-GOSSIP, for the average consensus problem that converges in time $\\mathcal{O}(1/(\\delta^2\\omega) \\log (1/\\epsilon))$ for accuracy $\\epsilon > 0$. This is (up to our knowledge) the first gossip algorithm that supports arbitrary compressed messages for $\\omega > 0$ and still exhibits linear convergence. We (iii) show in experiments that both of our algorithms do outperform the respective state-of-the-art baselines and CHOCO-SGD can reduce communication by at least two orders of magnitudes.", "year": 2019, "referenceCount": 58, "citationCount": 284, "influentialCitationCount": 46, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "51904731", "name": "Anastasia Koloskova"}, {"authorId": "2127057", "name": "Sebastian U. Stich"}, {"authorId": "2456863", "name": "Martin Jaggi"}]}, {"paperId": "edf56e3644157a2bdb4a25027cc49d8b69d086ed", "url": "https://www.semanticscholar.org/paper/edf56e3644157a2bdb4a25027cc49d8b69d086ed", "title": "A systematic review of fundamental and technical analysis of stock market predictions", "abstract": null, "year": 2019, "referenceCount": 244, "citationCount": 112, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "66913822", "name": "Isaac Kofi Nti"}, {"authorId": "51966799", "name": "Adebayo Felix Adekoya"}, {"authorId": "1870529", "name": "B. A. Weyori"}]}, {"paperId": "e69c18f7e5c424e57adb0d93445997d348ae2cc9", "url": "https://www.semanticscholar.org/paper/e69c18f7e5c424e57adb0d93445997d348ae2cc9", "title": "Materials Synthesis Insights from Scientific Literature via Text Extraction and Machine Learning", "abstract": "In the past several years, Materials Genome Initiative (MGI) efforts have produced myriad examples of computationally designed materials in the fields of energy storage, catalysis, thermoelectrics, and hydrogen storage as well as large data resources that are used to screen for potentially transformative compounds. The bottleneck in high-throughput materials design has thus shifted to materials synthesis, which motivates our development of a methodology to automatically compile materials synthesis parameters across tens of thousands of scholarly publications using natural language processing techniques. To demonstrate our framework’s capabilities, we examine the synthesis conditions for various metal oxides across more than 12 thousand manuscripts. We then apply machine learning methods to predict the critical parameters needed to synthesize titania nanotubes via hydrothermal methods and verify this result against known mechanisms. Finally, we demonstrate the capacity for transfer learning by using machin...", "year": 2017, "referenceCount": 61, "citationCount": 261, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "2117008214", "name": "Edward Kim"}, {"authorId": "2112441097", "name": "Kevin Huang"}, {"authorId": "2071771634", "name": "Adam Saunders"}, {"authorId": "143753639", "name": "A. McCallum"}, {"authorId": "2807088", "name": "G. Ceder"}, {"authorId": "46651096", "name": "E. Olivetti"}]}, {"paperId": "5f115ac87b891d3873099508456c120f85b87698", "url": "https://www.semanticscholar.org/paper/5f115ac87b891d3873099508456c120f85b87698", "title": "MLPerf Training Benchmark", "abstract": "Machine learning (ML) needs industry-standard performance benchmarks to support design and competitive evaluation of the many emerging software and hardware solutions for ML. But ML training presents three unique benchmarking challenges absent from other domains: optimizations that improve training throughput can increase the time to solution, training is stochastic and time to solution exhibits high variance, and software and hardware systems are so diverse that fair benchmarking with the same binary, code, and even hyperparameters is difficult. We therefore present MLPerf, an ML benchmark that overcomes these challenges. Our analysis quantitatively evaluates MLPerf's efficacy at driving performance and scalability improvements across two rounds of results from multiple vendors.", "year": 2019, "referenceCount": 81, "citationCount": 171, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2065823421", "name": "Peter Mattson"}, {"authorId": "2109795452", "name": "Christine Cheng"}, {"authorId": "2866919", "name": "Cody A. Coleman"}, {"authorId": "2040049", "name": "G. Diamos"}, {"authorId": "1802359", "name": "P. Micikevicius"}, {"authorId": "2084633463", "name": "David A. Patterson"}, {"authorId": "39278465", "name": "Hanlin Tang"}, {"authorId": "2255803", "name": "Gu-Yeon Wei"}, {"authorId": "2740804", "name": "Peter D. Bailis"}, {"authorId": "2932580", "name": "Victor Bittorf"}, {"authorId": "1896817", "name": "D. Brooks"}, {"authorId": "7167328", "name": "Dehao Chen"}, {"authorId": "46905001", "name": "Debo Dutta"}, {"authorId": "2633839", "name": "Udit Gupta"}, {"authorId": "1775500", "name": "Kim M. Hazelwood"}, {"authorId": "145076564", "name": "A. Hock"}, {"authorId": "2048519015", "name": "Xinyuan Huang"}, {"authorId": "33920592", "name": "Bill Jia"}, {"authorId": "35342489", "name": "Daniel Kang"}, {"authorId": "2033833485", "name": "David Kanter"}, {"authorId": "2116960562", "name": "Naveen Kumar"}, {"authorId": "2075442427", "name": "Jeffery Liao"}, {"authorId": "1388813853", "name": "Guokai Ma"}, {"authorId": "22252150", "name": "D. Narayanan"}, {"authorId": "2814407", "name": "Tayo Oguntebi"}, {"authorId": "3257164", "name": "Gennady Pekhimenko"}, {"authorId": "3329554", "name": "Lillian Pentecost"}, {"authorId": "1805668", "name": "V. Reddi"}, {"authorId": "46887039", "name": "Taylor Robie"}, {"authorId": "22033768", "name": "T. S. John"}, {"authorId": "2797270", "name": "Carole-Jean Wu"}, {"authorId": "47775733", "name": "Lingjie Xu"}, {"authorId": "39660914", "name": "C. Young"}, {"authorId": "143834867", "name": "M. Zaharia"}]}, {"paperId": "ee105266d83c8992d70a7d0cb0af198d95bbef72", "url": "https://www.semanticscholar.org/paper/ee105266d83c8992d70a7d0cb0af198d95bbef72", "title": "An overview on semi-supervised support vector machine", "abstract": null, "year": 2017, "referenceCount": 84, "citationCount": 67, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145613107", "name": "Shifei Ding"}, {"authorId": "2118353383", "name": "Zhibin Zhu"}, {"authorId": "3376545", "name": "Xiekai Zhang"}]}, {"paperId": "55bdc4ad158e272ccf796ae52b0ab7086a834352", "url": "https://www.semanticscholar.org/paper/55bdc4ad158e272ccf796ae52b0ab7086a834352", "title": "A Machine Learning Approach for Automatic Student Model Discovery", "abstract": "Student modeling is one of the key factors that affects automated tutoring systems in making instructional decisions. A student model is a model to predict the probability of a student making errors on given problems. A good student model that matches with student behavior patterns often provides useful information on learning task difficulty and transfer of learning between related problems, and thus often yields better instruction. Manual construction of such models usually requires substantial human effort, and may still miss distinctions in content and learning that have important instructional implications. In this paper, we propose an approach that automatically discovers student models using a state-of-art machine learning agent, SimStudent. We show that the discovered model is of higher quality than human-generated models, and demonstrate how the discovered model can be used to improve a tutoring system’s instruction strategy.", "year": 2011, "referenceCount": 22, "citationCount": 102, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49088383", "name": "Nan Li"}, {"authorId": "50056360", "name": "William W. Cohen"}, {"authorId": "1718810", "name": "K. Koedinger"}, {"authorId": "1761834", "name": "Noboru Matsuda"}]}, {"paperId": "f5182bf3b13bc2bb18074933acc9c198efe102c8", "url": "https://www.semanticscholar.org/paper/f5182bf3b13bc2bb18074933acc9c198efe102c8", "title": "Autonomous Vehicle Safety: An Interdisciplinary Challenge", "abstract": "Ensuring the safety of fully autonomous vehicles requires a multi-disciplinary approach across all the levels of functional hierarchy, from hardware fault tolerance, to resilient machine learning, to cooperating with humans driving conventional vehicles, to validating systems for operation in highly unstructured environments, to appropriate regulatory approaches. Significant open technical challenges include validating inductive learning in the face of novel environmental inputs and achieving the very high levels of dependability required for full-scale fleet deployment. However, the biggest challenge may be in creating an end-to-end design and deployment process that integrates the safety concerns of a myriad of technical specialties into a unified approach.", "year": 2017, "referenceCount": 47, "citationCount": 312, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "144734491", "name": "P. Koopman"}, {"authorId": "2114342378", "name": "Michael D. Wagner"}]}, {"paperId": "b79870d22d85dde31c72df6ae147f64d462d177b", "url": "https://www.semanticscholar.org/paper/b79870d22d85dde31c72df6ae147f64d462d177b", "title": "Machine learning in GI endoscopy: practical guidance in how to interpret a novel field", "abstract": "There has been a vast increase in GI literature focused on the use of machine learning in endoscopy. The relative novelty of this field poses a challenge for reviewers and readers of GI journals. To appreciate scientific quality and novelty of machine learning studies, understanding of the technical basis and commonly used techniques is required. Clinicians often lack this technical background, while machine learning experts may be unfamiliar with clinical relevance and implications for daily practice. Therefore, there is an increasing need for a multidisciplinary, international evaluation on how to perform high-quality machine learning research in endoscopy. This review aims to provide guidance for readers and reviewers of peer-reviewed GI journals to allow critical appraisal of the most relevant quality requirements of machine learning studies. The paper provides an overview of common trends and their potential pitfalls and proposes comprehensive quality requirements in six overarching themes: terminology, data, algorithm description, experimental setup, interpretation of results and machine learning in clinical practice.", "year": 2020, "referenceCount": 41, "citationCount": 53, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "15065097", "name": "F. van der Sommen"}, {"authorId": "1423745025", "name": "Jeroen de Groof"}, {"authorId": "120631502", "name": "Maarten P. Struyvenberg"}, {"authorId": "118341291", "name": "J. van der Putten"}, {"authorId": "1482569768", "name": "T. Boers"}, {"authorId": "1430744224", "name": "K. Fockens"}, {"authorId": "2151647", "name": "E. Schoon"}, {"authorId": "3553816", "name": "W. Curvers"}, {"authorId": "122835730", "name": "P. D. De with"}, {"authorId": "2558826", "name": "Y. Mori"}, {"authorId": "2167748", "name": "M. Byrne"}, {"authorId": "1398465128", "name": "J. Bergman"}]}, {"paperId": "d143fa58a437dc3cf68972e87f8621583058039d", "url": "https://www.semanticscholar.org/paper/d143fa58a437dc3cf68972e87f8621583058039d", "title": "Derivation and Validation of Machine Learning Approaches to Predict Acute Kidney Injury after Cardiac Surgery", "abstract": "Machine learning approaches were introduced for better or comparable predictive ability than statistical analysis to predict postoperative outcomes. We sought to compare the performance of machine learning approaches with that of logistic regression analysis to predict acute kidney injury after cardiac surgery. We retrospectively reviewed 2010 patients who underwent open heart surgery and thoracic aortic surgery. Baseline medical condition, intraoperative anesthesia, and surgery-related data were obtained. The primary outcome was postoperative acute kidney injury (AKI) defined according to the Kidney Disease Improving Global Outcomes criteria. The following machine learning techniques were used: decision tree, random forest, extreme gradient boosting, support vector machine, neural network classifier, and deep learning. The performance of these techniques was compared with that of logistic regression analysis regarding the area under the receiver-operating characteristic curve (AUC). During the first postoperative week, AKI occurred in 770 patients (38.3%). The best performance regarding AUC was achieved by the gradient boosting machine to predict the AKI of all stages (0.78, 95% confidence interval (CI) 0.75–0.80) or stage 2 or 3 AKI. The AUC of logistic regression analysis was 0.69 (95% CI 0.66–0.72). Decision tree, random forest, and support vector machine showed similar performance to logistic regression. In our comprehensive comparison of machine learning approaches with logistic regression analysis, gradient boosting technique showed the best performance with the highest AUC and lower error rate. We developed an Internet–based risk estimator which could be used for real-time processing of patient data to estimate the risk of AKI at the end of surgery.", "year": 2018, "referenceCount": 50, "citationCount": 85, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2110208828", "name": "Hyung‐Chul Lee"}, {"authorId": "152696865", "name": "H. Yoon"}, {"authorId": "6255329", "name": "K. Nam"}, {"authorId": "6412480", "name": "Y. Cho"}, {"authorId": "3875084", "name": "T. K. Kim"}, {"authorId": "47902458", "name": "W. Kim"}, {"authorId": "145569375", "name": "J. Bahk"}]}, {"paperId": "19ba16e12ee08e55c5f54873ddfe46390b99a9e0", "url": "https://www.semanticscholar.org/paper/19ba16e12ee08e55c5f54873ddfe46390b99a9e0", "title": "Detection of SARS-CoV-2 in nasal swabs using MALDI-MS", "abstract": null, "year": 2020, "referenceCount": 25, "citationCount": 112, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "5448547", "name": "F. M. Nachtigall"}, {"authorId": "2109688549", "name": "Alfredo Pereira"}, {"authorId": "50412564", "name": "O. Trofymchuk"}, {"authorId": "145210275", "name": "Leonardo S. Santos"}]}, {"paperId": "f4842e1d61d02e5fb3087b85759348252bea21a2", "url": "https://www.semanticscholar.org/paper/f4842e1d61d02e5fb3087b85759348252bea21a2", "title": "Automated Solar Activity Prediction: A hybrid computer platform using machine learning and solar imaging for automated prediction of solar flares", "abstract": "The importance of real‐time processing of solar data especially for space weather applications is increasing continuously. In this paper, we present an automated hybrid computer platform for the short‐term prediction of significant solar flares using SOHO/Michelson Doppler Imager images. This platform is called the Automated Solar Activity Prediction tool (ASAP). This system integrates image processing and machine learning to deliver these predictions. A machine learning‐based system is designed to analyze years of sunspot and flare data to create associations that can be represented using computer‐based learning rules. An imaging‐based real‐time system that provides automated detection, grouping, and then classification of recent sunspots based on the McIntosh classification is also created and integrated within this system. The properties of the sunspot regions are extracted automatically by the imaging system and processed using the machine learning rules to generate the real‐time predictions. Several performance measurement criteria are used and the results are provided in this paper. Also, quadratic score is used to compare the prediction results of ASAP with NOAA Space Weather Prediction Center (SWPC) between 1999 and 2002, and it is shown that ASAP generates more accurate predictions compared to SWPC.", "year": 2009, "referenceCount": 17, "citationCount": 136, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "49547430", "name": "T. Colak"}, {"authorId": "1713102", "name": "Rami Qahwaji"}]}, {"paperId": "0526e714f286dd4140a789a03b6d77c2267520e8", "url": "https://www.semanticscholar.org/paper/0526e714f286dd4140a789a03b6d77c2267520e8", "title": "Towards Poisoning of Deep Learning Algorithms with Back-gradient Optimization", "abstract": "A number of online services nowadays rely upon machine learning to extract valuable information from data collected in the wild. This exposes learning algorithms to the threat of data poisoning, i.e., a coordinate attack in which a fraction of the training data is controlled by the attacker and manipulated to subvert the learning process. To date, these attacks have been devised only against a limited class of binary learning algorithms, due to the inherent complexity of the gradient-based procedure used to optimize the poisoning points (a.k.a. adversarial training examples). In this work, we first extend the definition of poisoning attacks to multiclass problems. We then propose a novel poisoning algorithm based on the idea of back-gradient optimization, i.e., to compute the gradient of interest through automatic differentiation, while also reversing the learning procedure to drastically reduce the attack complexity. Compared to current poisoning strategies, our approach is able to target a wider class of learning algorithms, trained with gradient-based procedures, including neural networks and deep learning architectures. We empirically evaluate its effectiveness on several application examples, including spam filtering, malware detection, and handwritten digit recognition. We finally show that, similarly to adversarial test examples, adversarial training examples can also be transferred across different learning algorithms.", "year": 2017, "referenceCount": 40, "citationCount": 387, "influentialCitationCount": 38, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1399031454", "name": "Luis Muñoz-González"}, {"authorId": "1684175", "name": "B. Biggio"}, {"authorId": "2272441", "name": "Ambra Demontis"}, {"authorId": "3055305", "name": "Andrea Paudice"}, {"authorId": "1411162446", "name": "Vasin Wongrassamee"}, {"authorId": "1791748", "name": "Emil C. Lupu"}, {"authorId": "1710171", "name": "F. Roli"}]}, {"paperId": "49ab3776d88ff76612a7738358912db834639177", "url": "https://www.semanticscholar.org/paper/49ab3776d88ff76612a7738358912db834639177", "title": "A Stochastic Gradient Method with an Exponential Convergence Rate for Finite Training Sets", "abstract": "We propose a new stochastic gradient method for optimizing the sum of a finite set of smooth functions, where the sum is strongly convex. While standard stochastic gradient methods converge at sublinear rates for this problem, the proposed method incorporates a memory of previous gradient values in order to achieve a linear convergence rate. In a machine learning context, numerical experiments indicate that the new algorithm can dramatically outperform standard algorithms, both in terms of optimizing the training error and reducing the test error quickly.", "year": 2012, "referenceCount": 56, "citationCount": 703, "influentialCitationCount": 101, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "7245737", "name": "Nicolas Le Roux"}, {"authorId": "145610994", "name": "Mark W. Schmidt"}, {"authorId": "144570279", "name": "F. Bach"}]}, {"paperId": "f8f0eea355306e9d8c6ded82f10f1d4df69a0ed1", "url": "https://www.semanticscholar.org/paper/f8f0eea355306e9d8c6ded82f10f1d4df69a0ed1", "title": "Machine learning in neuroimaging: Progress and challenges", "abstract": null, "year": 2019, "referenceCount": 46, "citationCount": 115, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1740714", "name": "C. Davatzikos"}]}, {"paperId": "5e94e97c50063f4552278f9cb9729909d82a100b", "url": "https://www.semanticscholar.org/paper/5e94e97c50063f4552278f9cb9729909d82a100b", "title": "Robot Learning", "abstract": null, "year": 2019, "referenceCount": 21, "citationCount": 36, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145197867", "name": "Jan Peters"}, {"authorId": "1726802", "name": "Russ Tedrake"}, {"authorId": "2054985487", "name": "Nicholas Roy"}, {"authorId": "50414121", "name": "J. Morimoto"}]}, {"paperId": "b6b483e0ff8d39ab5d5fada757b7ab43995e65bc", "url": "https://www.semanticscholar.org/paper/b6b483e0ff8d39ab5d5fada757b7ab43995e65bc", "title": "Practical Hidden Voice Attacks against Speech and Speaker Recognition Systems", "abstract": "Voice Processing Systems (VPSes), now widely deployed, have been made significantly more accurate through the application of recent advances in machine learning. However, adversarial machine learning has similarly advanced and has been used to demonstrate that VPSes are vulnerable to the injection of hidden commands - audio obscured by noise that is correctly recognized by a VPS but not by human beings. Such attacks, though, are often highly dependent on white-box knowledge of a specific machine learning model and limited to specific microphones and speakers, making their use across different acoustic hardware platforms (and thus their practicality) limited. In this paper, we break these dependencies and make hidden command attacks more practical through model-agnostic (blackbox) attacks, which exploit knowledge of the signal processing algorithms commonly used by VPSes to generate the data fed into machine learning systems. Specifically, we exploit the fact that multiple source audio samples have similar feature vectors when transformed by acoustic feature extraction algorithms (e.g., FFTs). We develop four classes of perturbations that create unintelligible audio and test them against 12 machine learning models, including 7 proprietary models (e.g., Google Speech API, Bing Speech API, IBM Speech API, Azure Speaker API, etc), and demonstrate successful attacks against all targets. Moreover, we successfully use our maliciously generated audio samples in multiple hardware configurations, demonstrating effectiveness across both models and real systems. In so doing, we demonstrate that domain-specific knowledge of audio signal processing represents a practical means of generating successful hidden voice command attacks.", "year": 2019, "referenceCount": 76, "citationCount": 97, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "47994360", "name": "H. Abdullah"}, {"authorId": "47238599", "name": "Washington Garcia"}, {"authorId": "48278898", "name": "Christian Peeters"}, {"authorId": "145744451", "name": "Patrick Traynor"}, {"authorId": "1784947", "name": "Kevin R. B. Butler"}, {"authorId": "2157436332", "name": "Joseph N. Wilson"}]}, {"paperId": "89998030721e58ade6349b9426cc8c8d81103028", "url": "https://www.semanticscholar.org/paper/89998030721e58ade6349b9426cc8c8d81103028", "title": "A Comprehensive Survey of Loss Functions in Machine Learning", "abstract": null, "year": 2020, "referenceCount": 61, "citationCount": 81, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2151570286", "name": "Qi Wang"}, {"authorId": "2109386966", "name": "Yue Ma"}, {"authorId": "2074108386", "name": "Kun Zhao"}, {"authorId": "143790318", "name": "Ying-jie Tian"}]}, {"paperId": "a3fbcc58694ea3450200e934e235ae32299f5d38", "url": "https://www.semanticscholar.org/paper/a3fbcc58694ea3450200e934e235ae32299f5d38", "title": "Machine Learning for Semi Linear PDEs", "abstract": null, "year": 2018, "referenceCount": 45, "citationCount": 76, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1456795384", "name": "Quentin Chan-Wai-Nam"}, {"authorId": "80018335", "name": "Joseph Mikael"}, {"authorId": "3215934", "name": "X. Warin"}]}, {"paperId": "c66338caa9e8e79a35c4fcff3485eac37866ba11", "url": "https://www.semanticscholar.org/paper/c66338caa9e8e79a35c4fcff3485eac37866ba11", "title": "The Higgs Machine Learning Challenge", "abstract": "The Higgs Machine Learning Challenge was an open data analysis competition that took place between May and September 2014. Samples of simulated data from the ATLAS Experiment at the LHC corresponding to signal events with Higgs bosons decaying to τ+τ– together with background events were made available to the public through the website of the data science organization Kaggle (kaggle.com). Participants attempted to identify the search region in a space of 30 kinematic variables that would maximize the expected discovery significance of the signal process. One of the primary goals of the Challenge was to promote communication of new ideas between the Machine Learning (ML) and HEP communities. In this regard it was a resounding success, with almost 2,000 participants from HEP, ML and other areas. The process of understanding and integrating the new ideas, particularly from ML into HEP, is currently underway.", "year": 2015, "referenceCount": 12, "citationCount": 60, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "1404968468", "name": "C. Adam-Bourdarios"}, {"authorId": "152525722", "name": "G. Cowan"}, {"authorId": "1403829364", "name": "C. Germain-Renaud"}, {"authorId": "2177099864", "name": "I. Guyon"}, {"authorId": "143674326", "name": "B. Kégl"}, {"authorId": "3200334", "name": "D. Rousseau"}]}, {"paperId": "b9c386fc7b22ff1ef7ba700df05057f81cc97186", "url": "https://www.semanticscholar.org/paper/b9c386fc7b22ff1ef7ba700df05057f81cc97186", "title": "Machine Learning for Electronically Excited States of Molecules", "abstract": "Electronically excited states of molecules are at the heart of photochemistry, photophysics, as well as photobiology and also play a role in material science. Their theoretical description requires highly accurate quantum chemical calculations, which are computationally expensive. In this review, we focus on not only how machine learning is employed to speed up such excited-state simulations but also how this branch of artificial intelligence can be used to advance this exciting research field in all its aspects. Discussed applications of machine learning for excited states include excited-state dynamics simulations, static calculations of absorption spectra, as well as many others. In order to put these studies into context, we discuss the promises and pitfalls of the involved machine learning techniques. Since the latter are mostly based on quantum chemistry calculations, we also provide a short introduction into excited-state electronic structure methods and approaches for nonadiabatic dynamics simulations and describe tricks and problems when using them in machine learning for excited states of molecules.", "year": 2020, "referenceCount": 684, "citationCount": 98, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Mathematics", "Medicine", "Chemistry"], "authors": [{"authorId": "90050189", "name": "J. Westermayr"}, {"authorId": "4850899", "name": "P. Marquetand"}]}, {"paperId": "23244c485cda26b3b5063746a4cced85319d05ad", "url": "https://www.semanticscholar.org/paper/23244c485cda26b3b5063746a4cced85319d05ad", "title": "Machine learning for high performance organic solar cells: current scenario and future prospects", "abstract": "Machine learning (ML) is a field of computer science that uses algorithms and techniques for automating solutions to complex problems that are hard to program using conventional programming methods. Owing to the chemical versatility of organic building blocks, a large number of organic semi-conductors have been used for organic solar cells. Selecting a suitable organic semi-conductor is like searching for a needle in a haystack. Data-driven science, the fourth paradigm of science, has the potential to guide experimentalists to discover and develop new high-performance materials. The last decade has seen impressive progress in materials informatics and data science; however, data-driven molecular design of organic solar cell materials is still challenging. The data-analysis capability of machine learning methods is well known. This review is written about the use of machine learning methods for organic solar cell research. In this review, we have outlined the basics of machine learning and common procedures for applying machine learning. A brief introduction on different classes of machine learning algorithms as well as related software and tools is provided. Then, the current research status of machine learning in organic solar cells is reviewed. We have discussed the challenges in anticipating the data driven material design, such as the complexity metric of organic solar cells, diversity of chemical structures and necessary programming ability. We have also proposed some suggestions that can enhance the usefulness of machine learning for organic solar cell research enterprises.", "year": 2021, "referenceCount": 96, "citationCount": 54, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47466754", "name": "A. Mahmood"}, {"authorId": "114017846", "name": "Jin-liang Wang"}]}, {"paperId": "f4c7e853371bd539c5469244ddfdecb0f1f97fb6", "url": "https://www.semanticscholar.org/paper/f4c7e853371bd539c5469244ddfdecb0f1f97fb6", "title": "A Stability-based Validation Procedure for Differentially Private Machine Learning", "abstract": "Differential privacy is a cryptographically motivated definition of privacy which has gained considerable attention in the algorithms, machine-learning and data-mining communities. While there has been an explosion of work on differentially private machine learning algorithms, a major barrier to achieving end-to-end differential privacy in practical machine learning applications is the lack of an effective procedure for differentially private parameter tuning, or, determining the parameter value, such as a bin size in a histogram, or a regularization parameter, that is suitable for a particular application. \n \nIn this paper, we introduce a generic validation procedure for differentially private machine learning algorithms that apply when a certain stability condition holds on the training algorithm and the validation performance metric. The training data size and the privacy budget used for training in our procedure is independent of the number of parameter values searched over. We apply our generic procedure to two fundamental tasks in statistics and machine-learning - training a regularized linear classifier and building a histogram density estimator that result in end-to-end differentially private solutions for these problems.", "year": 2013, "referenceCount": 30, "citationCount": 75, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38120884", "name": "Kamalika Chaudhuri"}, {"authorId": "2711007", "name": "S. Vinterbo"}]}, {"paperId": "1d88162907ff9a0b4ca9e39db3b8d593fb83bc64", "url": "https://www.semanticscholar.org/paper/1d88162907ff9a0b4ca9e39db3b8d593fb83bc64", "title": "Demystifying Membership Inference Attacks in Machine Learning as a Service", "abstract": "Membership inference attacks seek to infer membership of individual training instances of a model to which an adversary has black-box access through a machine learning-as-a-service API. In providing an in-depth characterization of membership privacy risks against machine learning models, this paper presents a comprehensive study towards demystifying membership inference attacks from two complimentary perspectives. First, we provide a generalized formulation of the development of a black-box membership inference attack model. Second, we characterize the importance of model choice on model vulnerability through a systematic evaluation of a variety of machine learning models and model combinations using multiple datasets. Through formal analysis and empirical evidence from extensive experimentation, we characterize under what conditions a model may be vulnerable to such black-box membership inference attacks. We show that membership inference vulnerability is data-driven and corresponding attack models are largely transferable. Though different model types display different vulnerabilities to membership inference, so do different datasets. Our empirical results additionally show that (1) using the type of target model under attack within the attack model may not increase attack effectiveness and (2) collaborative learning exposes vulnerabilities to membership inference risks when the adversary is a participant. We also discuss countermeasure and mitigation strategies.", "year": 2019, "referenceCount": 0, "citationCount": 117, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "25121568", "name": "Stacey Truex"}, {"authorId": "46458150", "name": "Ling Liu"}, {"authorId": "2327300", "name": "M. E. Gursoy"}, {"authorId": "2112531949", "name": "Lei Yu"}, {"authorId": "47747953", "name": "Wenqi Wei"}]}, {"paperId": "f42549dc2efdab086af81e06522783409b0e79ec", "url": "https://www.semanticscholar.org/paper/f42549dc2efdab086af81e06522783409b0e79ec", "title": "Optimal kernel selection in Kernel Fisher discriminant analysis", "abstract": "In Kernel Fisher discriminant analysis (KFDA), we carry out Fisher linear discriminant analysis in a high dimensional feature space defined implicitly by a kernel. The performance of KFDA depends on the choice of the kernel; in this paper, we consider the problem of finding the optimal kernel, over a given convex set of kernels. We show that this optimal kernel selection problem can be reformulated as a tractable convex optimization problem which interior-point methods can solve globally and efficiently. The kernel selection method is demonstrated with some UCI machine learning benchmark examples.", "year": 2006, "referenceCount": 28, "citationCount": 161, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2695019", "name": "Seung-Jean Kim"}, {"authorId": "2052320550", "name": "A. Magnani"}, {"authorId": "1843103", "name": "Stephen P. Boyd"}]}, {"paperId": "3add8c6c36af4755cecaf994bda0e5a202035811", "url": "https://www.semanticscholar.org/paper/3add8c6c36af4755cecaf994bda0e5a202035811", "title": "Discriminative models for information retrieval", "abstract": "Discriminative models have been preferred over generative models in many machine learning problems in the recent past owing to some of their attractive theoretical properties. In this paper, we explore the applicability of discriminative classifiers for IR. We have compared the performance of two popular discriminative models, namely the maximum entropy model and support vector machines with that of language modeling, the state-of-the-art generative model for IR. Our experiments on ad-hoc retrieval indicate that although maximum entropy is significantly worse than language models, support vector machines are on par with language models. We argue that the main reason to prefer SVMs over language models is their ability to learn arbitrary features automatically as demonstrated by our experiments on the home-page finding task of TREC-10.", "year": 2004, "referenceCount": 38, "citationCount": 317, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1701451", "name": "Ramesh Nallapati"}]}, {"paperId": "e33af1f3b3bfa615b2399deb5390f96f3cfb86f4", "url": "https://www.semanticscholar.org/paper/e33af1f3b3bfa615b2399deb5390f96f3cfb86f4", "title": "Grammatical evolution - evolutionary automatic programming in an arbitrary language", "abstract": "From the Publisher: \nGrammatical Evolution: Evolutionary Automatic Programming in an Arbitrary Language provides the first comprehensive introduction to Grammatical Evolution, a novel approach to Genetic Programming that adopts principles from molecular biology in a simple and useful manner, coupled with the use of grammars to specify legal structures in a search. Grammatical Evolution's rich modularity gives a unique flexibility, making it possible to use alternative search strategies - whether evolutionary, deterministics or some other approach - and to radically change its behavior by merely changing the grammar supplied. This approach to Genetic Programming represents a powerful new weapon in the Machine Learning toolkit that can be applied to a diverse set of problem domains.", "year": 2003, "referenceCount": 1, "citationCount": 679, "influentialCitationCount": 49, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "117838237", "name": "M. O’Neill"}, {"authorId": "144063088", "name": "C. Ryan"}]}, {"paperId": "b88ac410c97dee2b63f819d3d05a274da2c95835", "url": "https://www.semanticscholar.org/paper/b88ac410c97dee2b63f819d3d05a274da2c95835", "title": "Concept features in Re:Agent, an intelligent Email agent", "abstract": "An important issue in the application of machine learning techniques to information management tasks is the nature of features extracted from textual information. We have created an intelligent email agent that can learn actions such as filtering, prioritizing, downloading to palmtops, and forwarding cmail to voicemail using automatic feature extraction, Our agent’s new feature extraction approach is based on first learning concepts present within the mail, then using these concepts as features for learning actions to perform on the messages, What features should be chosen? This paper describes the concept features approach and considers two sources for learning conceptual features: groups defined by the user and groups defined by the agent’s task. Additionally, features may be defined by vectorized examples or keywords, Experimental results are provided for two email sorting tasks, I<aywords Electronic mail, intelligent agents, machine Iearning, informntion management, feature selection, concept features", "year": 1998, "referenceCount": 34, "citationCount": 149, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2291243", "name": "Gary N. Boone"}]}, {"paperId": "97d667dbff26423037bc23240579a42d39e68aee", "url": "https://www.semanticscholar.org/paper/97d667dbff26423037bc23240579a42d39e68aee", "title": "The Role of Balanced Training and Testing Data Sets for Binary Classifiers in Bioinformatics", "abstract": "Training and testing of conventional machine learning models on binary classification problems depend on the proportions of the two outcomes in the relevant data sets. This may be especially important in practical terms when real-world applications of the classifier are either highly imbalanced or occur in unknown proportions. Intuitively, it may seem sensible to train machine learning models on data similar to the target data in terms of proportions of the two binary outcomes. However, we show that this is not the case using the example of prediction of deleterious and neutral phenotypes of human missense mutations in human genome data, for which the proportion of the binary outcome is unknown. Our results indicate that using balanced training data (50% neutral and 50% deleterious) results in the highest balanced accuracy (the average of True Positive Rate and True Negative Rate), Matthews correlation coefficient, and area under ROC curves, no matter what the proportions of the two phenotypes are in the testing data. Besides balancing the data by undersampling the majority class, other techniques in machine learning include oversampling the minority class, interpolating minority-class data points and various penalties for misclassifying the minority class. However, these techniques are not commonly used in either the missense phenotype prediction problem or in the prediction of disordered residues in proteins, where the imbalance problem is substantial. The appropriate approach depends on the amount of available data and the specific problem at hand.", "year": 2013, "referenceCount": 87, "citationCount": 208, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "48477610", "name": "Qiong Wei"}, {"authorId": "2656699", "name": "Roland L. Dunbrack"}]}, {"paperId": "8515a302b8f389f8f1008cc2650e5ec0a6913e24", "url": "https://www.semanticscholar.org/paper/8515a302b8f389f8f1008cc2650e5ec0a6913e24", "title": "Optimizing Spatial filters for Robust EEG Single-Trial Analysis", "abstract": "Due to the volume conduction multichannel electroencephalogram (EEG) recordings give a rather blurred image of brain activity. Therefore spatial filters are extremely useful in single-trial analysis in order to improve the signal-to-noise ratio. There are powerful methods from machine learning and signal processing that permit the optimization of spatio-temporal filters for each subject in a data dependent fashion beyond the fixed filters based on the sensor geometry, e.g., Laplacians. Here we elucidate the theoretical background of the common spatial pattern (CSP) algorithm, a popular method in brain-computer interface (BCD research. Apart from reviewing several variants of the basic algorithm, we reveal tricks of the trade for achieving a powerful CSP performance, briefly elaborate on theoretical aspects of CSP, and demonstrate the application of CSP-type preprocessing in our studies of the Berlin BCI (BBCI) project.", "year": 2008, "referenceCount": 66, "citationCount": 1704, "influentialCitationCount": 217, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3156886", "name": "B. Blankertz"}, {"authorId": "2870603", "name": "Ryota Tomioka"}, {"authorId": "3294736", "name": "S. Lemm"}, {"authorId": "1716788", "name": "M. Kawanabe"}, {"authorId": "72571095", "name": "K.-R. Muller"}]}, {"paperId": "0278bbaf1db5df036f02393679d485260b1daeb7", "url": "https://www.semanticscholar.org/paper/0278bbaf1db5df036f02393679d485260b1daeb7", "title": "Machine Learning Techniques for Anomaly Detection: An Overview", "abstract": "Intrusion detection has gain a broad attention and become a fertile field for several researches, and still being the subject of widespread interest by researchers. The intrusion detection community still confronts difficult problems even after many years of research. Reducing the large number of false alerts during the process of detecting unknown attack patterns remains unresolved problem. However, several research results recently have shown that there are potential solutions to this problem. Anomaly detection is a key issue of intrusion detection in which perturbations of normal behavior indicates a presence of intended or unintended induced attacks, faults, defects and others. This paper presents an overview of research directions for applying supervised and unsupervised methods for managing the problem of anomaly detection. The references cited will cover the major theoretical issues, guiding the researcher in interesting research directions.", "year": 2013, "referenceCount": 70, "citationCount": 178, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47878132", "name": "S. Omar"}, {"authorId": "97512570", "name": "A. Ngadi"}, {"authorId": "2359381", "name": "Hamid H. Jebur"}]}, {"paperId": "83c137c3ca9e14b3d87f5b2c96ff021a3ba76b1a", "url": "https://www.semanticscholar.org/paper/83c137c3ca9e14b3d87f5b2c96ff021a3ba76b1a", "title": "Journal of Machine Learning Technologies", "abstract": "The Journal of Machine Learning Technologies, ISSN: 2229–3981 & ISSN: 2229-399X, aims to publish all the latest and outstanding research articles, reviews and letters in all areas of Machine Learning Technologie. Each issue contains a series of timely, in-depth written articles by leaders in the field, covering a wide range of the integration of multidimensional challenges of research including integration issues of Machine Learning Technologie.", "year": 2013, "referenceCount": 4, "citationCount": 56, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "52022340", "name": "Publisher Bioinfo Publications"}]}, {"paperId": "8c104e4f9c4206874f530b7151cdb43e181f6c37", "url": "https://www.semanticscholar.org/paper/8c104e4f9c4206874f530b7151cdb43e181f6c37", "title": "Double machine learning for treatment and causal parameters", "abstract": "Most modern supervised statistical/machine learning (ML) methods are explicitly designed to solve prediction problems very well. Achieving this goal does not imply that these methods automatically deliver good estimators of causal parameters. Examples of such parameters include individual regression coffiecients, average treatment e ffects, average lifts, and demand or supply elasticities. In fact, estimators of such causal parameters obtained via naively plugging ML estimators into estimating equations for such parameters can behave very poorly. For example, the resulting estimators may formally have inferior rates of convergence with respect to the sample size n caused by regularization bias. Fortunately, this regularization bias can be removed by solving auxiliary prediction problems via ML tools. Speci ficially, we can form an efficient score for the target low-dimensional parameter by combining auxiliary and main ML predictions. The efficient score may then be used to build an efficient estimator of the target parameter which typically will converge at the fastest possible 1/v n rate and be approximately unbiased and normal, allowing simple construction of valid con fidence intervals for parameters of interest. The resulting method thus could be called a \"double ML\" method because it relies on estimating primary and auxiliary predictive models. Such double ML estimators achieve the fastest rates of convergence and exhibit robust good behavior with respect to a broader class of probability distributions than naive \"single\" ML estimators. In order to avoid overfi tting, following [3], our construction also makes use of the K-fold sample splitting, which we call cross- fitting. The use of sample splitting allows us to use a very broad set of ML predictive methods in solving the auxiliary and main prediction problems, such as random forests, lasso, ridge, deep neural nets, boosted trees, as well as various hybrids and aggregates of these methods (e.g. a hybrid of a random forest and lasso). We illustrate the application of the general theory through application to the leading cases of estimation and inference on the main parameter in a partially linear regression model and estimation and inference on average treatment eff ects and average treatment e ffects on the treated under conditional random assignment of the treatment. These applications cover randomized control trials as a special case. We then use the methods in an empirical application which estimates the e ffect of 401(k) eligibility on accumulated financial assets.", "year": 2016, "referenceCount": 65, "citationCount": 161, "influentialCitationCount": 24, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "26331346", "name": "V. Chernozhukov"}, {"authorId": "88741529", "name": "D. Chetverikov"}, {"authorId": "88741890", "name": "Mert Demirer"}, {"authorId": "2259683", "name": "E. Duflo"}, {"authorId": "144613163", "name": "Christian Hansen"}, {"authorId": "3646527", "name": "W. Newey"}]}, {"paperId": "6704cac662a0968215644c13fa4324b05b1e420b", "url": "https://www.semanticscholar.org/paper/6704cac662a0968215644c13fa4324b05b1e420b", "title": "Machine learning of Calabi-Yau volumes", "abstract": "We employ machine learning techniques to investigate the volume minimum of Sasaki-Einstein base manifolds of noncompact toric Calabi-Yau three-folds. We find that the minimum volume can be approxim ...", "year": 2017, "referenceCount": 22, "citationCount": 81, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics"], "authors": [{"authorId": "32496630", "name": "D. Krefl"}, {"authorId": "87283663", "name": "Rak-Kyeong Seong"}]}, {"paperId": "48aa48ad0ec699ed19fb7c0ce813ac2e80eb0eb9", "url": "https://www.semanticscholar.org/paper/48aa48ad0ec699ed19fb7c0ce813ac2e80eb0eb9", "title": "Ultrafast machine vision with 2D material neural network image sensors", "abstract": null, "year": 2020, "referenceCount": 41, "citationCount": 271, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "35497055", "name": "L. Mennel"}, {"authorId": "71361685", "name": "J. Symonowicz"}, {"authorId": "2053637971", "name": "S. Wachter"}, {"authorId": "5023088", "name": "D. Polyushkin"}, {"authorId": "1398316142", "name": "A. Molina‐Mendoza"}, {"authorId": "41191233", "name": "T. Mueller"}]}, {"paperId": "c71f9dbd705b606b96c0b92aaf9c07c93beecf20", "url": "https://www.semanticscholar.org/paper/c71f9dbd705b606b96c0b92aaf9c07c93beecf20", "title": "Learning new physics from a machine", "abstract": "We propose using neural networks to detect data departures from a given reference model, with no prior bias on the nature of the new physics responsible for the discrepancy. The virtues of neural networks as unbiased function approximants make them particularly suited for this task. An algorithm that implements this idea is constructed, as a straightforward application of the likelihood-ratio hypothesis test. The algorithm compares observations with an auxiliary set of reference-distributed events, possibly obtained with a Monte Carlo event generator. It returns a $p$ value, which measures the compatibility of the reference model with the data. It also identifies the most discrepant phase-space region of the data set, to be selected for further investigation. The most interesting potential applications are model-independent new physics searches, although our approach could also be used to compare the theoretical predictions of different Monte Carlo event generators, or for data validation algorithms. In this work we study the performance of our algorithm on a few simple examples. The results confirm the model independence of the approach, namely that it displays good sensitivity to a variety of putative signals. Furthermore, we show that the reach does not depend much on whether a favorable signal region is selected based on prior expectations. We identify directions for improvement towards applications to real experimental data sets.", "year": 2018, "referenceCount": 79, "citationCount": 114, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "1399455467", "name": "R. D’Agnolo"}, {"authorId": "30169372", "name": "A. Wulzer"}]}, {"paperId": "9a67a46acfd1bfff24eec719d8090357cb0d253b", "url": "https://www.semanticscholar.org/paper/9a67a46acfd1bfff24eec719d8090357cb0d253b", "title": "Linear Regression under Fixed-Rank Constraints: A Riemannian Approach", "abstract": "In this paper, we tackle the problem of learning a linear regression model whose parameter is a fixed-rank matrix. We study the Riemannian manifold geometry of the set of fixed-rank matrices and develop efficient line-search algorithms. The proposed algorithms have many applications, scale to high-dimensional problems, enjoy local convergence properties and confer a geometric basis to recent contributions on learning fixed-rank matrices. Numerical experiments on benchmarks suggest that the proposed algorithms compete with the state-of-the-art, and that manifold optimization offers a versatile framework for the design of rank-constrained machine learning algorithms.", "year": 2011, "referenceCount": 21, "citationCount": 71, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2055980070", "name": "Gilles Meyer"}, {"authorId": "144699172", "name": "S. Bonnabel"}, {"authorId": "1707966", "name": "R. Sepulchre"}]}, {"paperId": "1772cb98a2218793ea08bd46d9ebe6a88d9f8580", "url": "https://www.semanticscholar.org/paper/1772cb98a2218793ea08bd46d9ebe6a88d9f8580", "title": "Improving Fairness in Machine Learning Systems: What Do Industry Practitioners Need?", "abstract": "The potential for machine learning (ML) systems to amplify social inequities and unfairness is receiving increasing popular and academic attention. A surge of recent work has focused on the development of algorithmic tools to assess and mitigate such unfairness. If these tools are to have a positive impact on industry practice, however, it is crucial that their design be informed by an understanding of real-world needs. Through 35 semi-structured interviews and an anonymous survey of 267 ML practitioners, we conduct the first systematic investigation of commercial product teams' challenges and needs for support in developing fairer ML systems. We identify areas of alignment and disconnect between the challenges faced by teams in practice and the solutions proposed in the fair ML research literature. Based on these findings, we highlight directions for future ML and HCI research that will better address practitioners' needs.", "year": 2018, "referenceCount": 111, "citationCount": 402, "influentialCitationCount": 40, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2257481", "name": "Kenneth Holstein"}, {"authorId": "4006636", "name": "Jennifer Wortman Vaughan"}, {"authorId": "1722360", "name": "Hal Daumé"}, {"authorId": "144652072", "name": "Miroslav Dudík"}, {"authorId": "1831395", "name": "H. Wallach"}]}, {"paperId": "26575bb2ca7eab29d2f5d1d22ed0e41428035db7", "url": "https://www.semanticscholar.org/paper/26575bb2ca7eab29d2f5d1d22ed0e41428035db7", "title": "Automated Color Model-Based Concrete Detection in Construction-Site Images by Using Machine Learning Algorithms", "abstract": "AbstractConcrete structural component detection in color images is a key pre-process in various applications such as construction progress measurement, structural health monitoring, and three-dimensional as-built modeling. The goal of this research was to identify an automated color model–based concrete detection method that (by using a machine learning algorithm) can detect concrete structural components in color images with a high level of accuracy. A data set consisting of more than 87 million pixels was generated from 108 images of concrete surfaces with a variety of surfaces. Transformations from the RGB color space to non-RGB color spaces were performed to increase separability between concrete and background classes and to achieve robustness to changes in illumination. To find the optimal combination of color space and machine learning algorithm, the performance of three machine learning algorithms (e.g., a Gaussian mixture model, an artificial neural network model, and a support vector machine mod...", "year": 2012, "referenceCount": 69, "citationCount": 81, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "2119014", "name": "H. Son"}, {"authorId": "8967785", "name": "Changmin Kim"}, {"authorId": "2924231", "name": "Changwan Kim"}]}, {"paperId": "57f6c958eeb94e96e8a8817671033e4c954e179f", "url": "https://www.semanticscholar.org/paper/57f6c958eeb94e96e8a8817671033e4c954e179f", "title": "Combining Machine Learning Systems and Multiple Docking Simulation Packages to Improve Docking Prediction Reliability for Network Pharmacology", "abstract": "Increased availability of bioinformatics resources is creating opportunities for the application of network pharmacology to predict drug effects and toxicity resulting from multi-target interactions. Here we present a high-precision computational prediction approach that combines two elaborately built machine learning systems and multiple molecular docking tools to assess binding potentials of a test compound against proteins involved in a complex molecular network. One of the two machine learning systems is a re-scoring function to evaluate binding modes generated by docking tools. The second is a binding mode selection function to identify the most predictive binding mode. Results from a series of benchmark validations and a case study show that this approach surpasses the prediction reliability of other techniques and that it also identifies either primary or off-targets of kinase inhibitors. Integrating this approach with molecular network maps makes it possible to address drug safety issues by comprehensively investigating network-dependent effects of a drug or drug candidate.", "year": 2013, "referenceCount": 50, "citationCount": 174, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "2042374", "name": "Kun-Yi Hsin"}, {"authorId": "34868112", "name": "Samik Ghosh"}, {"authorId": "1742807", "name": "H. Kitano"}]}, {"paperId": "97b9cfbc775bf45a485920a0dd1b3ef05b1c70c7", "url": "https://www.semanticscholar.org/paper/97b9cfbc775bf45a485920a0dd1b3ef05b1c70c7", "title": "Machine learning in suicide science: Applications and ethics.", "abstract": "For decades, our ability to predict suicide has remained at near-chance levels. Machine learning has recently emerged as a promising tool for advancing suicide science, particularly in the domain of suicide prediction. The present review provides an introduction to machine learning and its potential application to open questions in suicide research. Although only a few studies have implemented machine learning for suicide prediction, results to date indicate considerable improvement in accuracy and positive predictive value. Potential barriers to algorithm integration into clinical practice are discussed, as well as attendant ethical issues. Overall, machine learning approaches hold promise for accurate, scalable, and effective suicide risk detection; however, many critical questions and issues remain unexplored.", "year": 2019, "referenceCount": 29, "citationCount": 68, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "14864293", "name": "Kathryn P Linthicum"}, {"authorId": "67345170", "name": "K. Schafer"}, {"authorId": "144945435", "name": "J. Ribeiro"}]}, {"paperId": "d5c7fd7af5b09b2652347bb7f660b7ebc657f42a", "url": "https://www.semanticscholar.org/paper/d5c7fd7af5b09b2652347bb7f660b7ebc657f42a", "title": "Learning in high-dimensional multimedia data: the state of the art", "abstract": null, "year": 2017, "referenceCount": 116, "citationCount": 91, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2671321", "name": "Lianli Gao"}, {"authorId": "2346105", "name": "Jingkuan Song"}, {"authorId": "2146035487", "name": "Xingyi Liu"}, {"authorId": "40161233", "name": "Junming Shao"}, {"authorId": "49721729", "name": "Jiajun Liu"}, {"authorId": "145496509", "name": "Jie Shao"}]}, {"paperId": "439bff63ff98a5617d19913b5d6528e5f7967a5b", "url": "https://www.semanticscholar.org/paper/439bff63ff98a5617d19913b5d6528e5f7967a5b", "title": "Supervised Classification Algorithms in Machine Learning: A Survey and Review", "abstract": null, "year": 2019, "referenceCount": 33, "citationCount": 100, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "151425848", "name": "P. C. Sen"}, {"authorId": "151427488", "name": "Mahimarnab Hajra"}, {"authorId": "151372703", "name": "Mitadru Ghosh"}]}, {"paperId": "293f9ac78ea3cf7be6d661f75fae1568c5bb090e", "url": "https://www.semanticscholar.org/paper/293f9ac78ea3cf7be6d661f75fae1568c5bb090e", "title": "Active Learning From Imbalanced Data: A Solution of Online Weighted Extreme Learning Machine", "abstract": "It is well known that active learning can simultaneously improve the quality of the classification model and decrease the complexity of training instances. However, several previous studies have indicated that the performance of active learning is easily disrupted by an imbalanced data distribution. Some existing imbalanced active learning approaches also suffer from either low performance or high time consumption. To address these problems, this paper describes an efficient solution based on the extreme learning machine (ELM) classification model, called active online-weighted ELM (AOW-ELM). The main contributions of this paper include: 1) the reasons why active learning can be disrupted by an imbalanced instance distribution and its influencing factors are discussed in detail; 2) the hierarchical clustering technique is adopted to select initially labeled instances in order to avoid the missed cluster effect and cold start phenomenon as much as possible; 3) the weighted ELM (WELM) is selected as the base classifier to guarantee the impartiality of instance selection in the procedure of active learning, and an efficient online updated mode of WELM is deduced in theory; and 4) an early stopping criterion that is similar to but more flexible than the margin exhaustion criterion is presented. The experimental results on 32 binary-class data sets with different imbalance ratios demonstrate that the proposed AOW-ELM algorithm is more effective and efficient than several state-of-the-art active learning algorithms that are specifically designed for the class imbalance scenario.", "year": 2019, "referenceCount": 55, "citationCount": 70, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "145191483", "name": "Hualong Yu"}, {"authorId": "2290382", "name": "Xibei Yang"}, {"authorId": "2111070500", "name": "Shang Zheng"}, {"authorId": "145928755", "name": "Changyin Sun"}]}, {"paperId": "e39054d8b3c10aaa50e716230ef27db40f2f0c5c", "url": "https://www.semanticscholar.org/paper/e39054d8b3c10aaa50e716230ef27db40f2f0c5c", "title": "Learning with matrix factorizations", "abstract": "Matrices that can be factored into a product of two simpler matrices can serve as a useful and often natural model in the analysis of tabulated or high-dimensional data. Models based on matrix factorization (Factor Analysis, PCA) have been extensively used in statistical analysis and machine learning for over a century, with many new formulations and models suggested in recent years (Latent Semantic Indexing, Aspect Models, Probabilistic PCA, Exponential PCA, Non-Negative Matrix Factorization and others). In this thesis we address several issues related to learning with matrix factorizations: we study the asymptotic behavior and generalization ability of existing methods, suggest new optimization methods, and present a novel maximum-margin high-dimensional matrix factorization formulation. (Copies available exclusively from MIT Libraries, Rm. 14-0551, Cambridge, MA 02139-4307. Ph. 617-253-5668; Fax 617-253-1690.)", "year": 2004, "referenceCount": 100, "citationCount": 245, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1706280", "name": "Nathan Srebro"}]}, {"paperId": "183898655299b70cf7fd198b373c93137337b31a", "url": "https://www.semanticscholar.org/paper/183898655299b70cf7fd198b373c93137337b31a", "title": "Prediction of protein-protein interactions from amino acid sequences with ensemble extreme learning machines and principal component analysis", "abstract": null, "year": 2013, "referenceCount": 41, "citationCount": 238, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science", "Biology"], "authors": [{"authorId": "144640870", "name": "Zhuhong You"}, {"authorId": "40454694", "name": "Ying-Ke Lei"}, {"authorId": "39397633", "name": "Lin Zhu"}, {"authorId": "4417093", "name": "Junfeng Xia"}, {"authorId": "46270356", "name": "Bing Wang"}]}, {"paperId": "f28349edf0cd78d89d2e00ae5e4fcf589774826c", "url": "https://www.semanticscholar.org/paper/f28349edf0cd78d89d2e00ae5e4fcf589774826c", "title": "Towards Vision-Based Deep Reinforcement Learning for Robotic Motion Control", "abstract": "This paper introduces a machine learning based system for controlling a robotic manipulator with visual perception only. The capability to autonomously learn robot controllers solely from raw-pixel images and without any prior knowledge of configuration is shown for the first time. We build upon the success of recent deep reinforcement learning and develop a system for learning target reaching with a three-joint robot manipulator using external visual observation. A Deep Q Network (DQN) was demonstrated to perform target reaching after training in simulation. Transferring the network to real hardware and real observation in a naive approach failed, but experiments show that the network works when replacing camera images with synthetic images.", "year": 2015, "referenceCount": 26, "citationCount": 228, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2896212", "name": "Fangyi Zhang"}, {"authorId": "40548044", "name": "J. Leitner"}, {"authorId": "1809144", "name": "Michael Milford"}, {"authorId": "1803115", "name": "B. Upcroft"}, {"authorId": "1714296", "name": "Peter Corke"}]}, {"paperId": "afb2e3bed02ab8d4ad568abc8d79faa4f399875b", "url": "https://www.semanticscholar.org/paper/afb2e3bed02ab8d4ad568abc8d79faa4f399875b", "title": "Self-Adaptive Systems for Machine Intelligence", "abstract": "Preface. Acknowledgments. Chapter 1. Introduction. 1.1 The Machine Intelligence Research. 1.2 The Two-Fold Objectives: Data-Driven and Biologically-Inspired Approaches. 1.3 How to Read this Book. 1.4 Summary and Further Reading. References. Chapter 2. Incremental Learning. 2.1 Introduction. 2.2 Problem Foundation. 2.3 An Adaptive Incremental Learning Framework. 2.4 Design of the Mapping Function. 2.5 Case Study. 2.6 Summary. Chapter 3. Imbalanced Learning. 3.1 Introduction. 3.2 Nature of the Imbalanced Learning. 3.3 Solutions for Imbalanced Learning. 3.4 Assessment Metrics for Imbalanced Learning. 3.5 Opportunities and Challenges. 3.6 Case Study. 3.7 Summary. Chapter 4. Ensemble Learning. 4.1 Introduction. 4.2 Hypothesis Diversity. 4.3 Developing Multiple Hypotheses. 4.4 Integrating Multiple Hypotheses. 4.5 Case Study. 4.6 Summary. Chapter 5. Adaptive Dynamic Programming for Machine Intelligence. 5.1 Introduction. 5.2 Fundamental Objectives: Optimization and Prediction. 5.3 ADP for Machine Intelligence. 5.4 Case Study. 5.5 Summary. Chapter 6. Associative Learning. 6.1 Introduction. 6.2 Associative Learning Mechanism. 6.3 Associative Learning in Hierarchical Neural Networks. 6.4 Case Study. 6.5 Summary. Chapter 7. Sequence Learning. 7.1 Introduction. 7.2 Foundations for Sequence Learning. 7.3 Sequence Learning in Hierarchical Neural Structure. 7.4 Level 0: A Modified Hebbian Learning Architecture. 7.5 Level 1 to Level N: Sequence Storage, Prediction and Retrieval. 7.6 Memory Requirement. 7.7 Learning and Anticipation of Multiple Sequences. 7.8 Case Study. 7.9 Summary. Chapter 8. Hardware Design for Machine Intelligence. 8.1 A Final Comment. References.", "year": 2011, "referenceCount": 5, "citationCount": 70, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2198278", "name": "Haibo He"}]}, {"paperId": "a51d191e076092be9f9eeea82cb6e9d4516323ac", "url": "https://www.semanticscholar.org/paper/a51d191e076092be9f9eeea82cb6e9d4516323ac", "title": "Kernel-based machine learning protocol for predicting DNA-binding proteins", "abstract": "DNA-binding proteins (DNA-BPs) play a pivotal role in various intra- and extra-cellular activities ranging from DNA replication to gene expression control. Attempts have been made to identify DNA-BPs based on their sequence and structural information with moderate accuracy. Here we develop a machine learning protocol for the prediction of DNA-BPs where the classifier is Support Vector Machines (SVMs). Information used for classification is derived from characteristics that include surface and overall composition, overall charge and positive potential patches on the protein surface. In total 121 DNA-BPs and 238 non-binding proteins are used to build and evaluate the protocol. In self-consistency, accuracy value of 100% has been achieved. For cross-validation (CV) optimization over entire dataset, we report an accuracy of 90%. Using leave 1-pair holdout evaluation, the accuracy of 86.3% has been achieved. When we restrict the dataset to less than 20% sequence identity amongst the proteins, the holdout accuracy is achieved at 85.8%. Furthermore, seven DNA-BPs with unbounded structures are all correctly predicted. The current performances are better than results published previously. The higher accuracy value achieved here originates from two factors: the ability of the SVM to handle features that demonstrate a wide range of discriminatory power and, a different definition of the positive patch. Since our protocol does not lean on sequence or structural homology, it can be used to identify or predict proteins with DNA-binding function(s) regardless of their homology to the known ones.", "year": 2005, "referenceCount": 45, "citationCount": 149, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "39739035", "name": "N. Bhardwaj"}, {"authorId": "2160854", "name": "R. Langlois"}, {"authorId": "47153448", "name": "Guijun Zhao"}, {"authorId": "144050065", "name": "Hui Lu"}]}, {"paperId": "1d7e2f3516b211c3efd33dd679229aae5d5c2dc3", "url": "https://www.semanticscholar.org/paper/1d7e2f3516b211c3efd33dd679229aae5d5c2dc3", "title": "USING MACHINE LEARNING TECHNIQUES", "abstract": "This paper presents a novel application of advanced machine learning techniques for Mars terrain image classification. Fuzzy-rough feature selection (FRFS) is employed in conjunction with Support Vector Machines (SVMs) to construct image classifiers. These techniques are for the first time, integrated to address problems in space engineering where the images are of many classes and large-scale. The use of FRFS allows the induction of low-dimensionality feature sets from feature patterns of a much higher dimensionality. Experimental results demonstrate that FRFS helps to enhance the efficacy of the conventional classifiers. The resultant SVM-based classifiers which utilise FRFS-selected features generally outperform K-Nearest Neighbours and Decision Tree based classifiers and those which use PCA-returned features.", "year": 2011, "referenceCount": 20, "citationCount": 49, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "144109865", "name": "C. Shang"}, {"authorId": "145907048", "name": "D. Barnes"}]}, {"paperId": "a5ae9087733111e23f89b744c3fae5ec1be0ce75", "url": "https://www.semanticscholar.org/paper/a5ae9087733111e23f89b744c3fae5ec1be0ce75", "title": "Learnware: on the future of machine learning", "abstract": null, "year": 2016, "referenceCount": 13, "citationCount": 85, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145624000", "name": "Zhi-Hua Zhou"}]}, {"paperId": "5ce030f1650145a103527e883e7a9d9a25c45547", "url": "https://www.semanticscholar.org/paper/5ce030f1650145a103527e883e7a9d9a25c45547", "title": "A Machine Learning Approach to Visual Perception of Forest Trails for Mobile Robots", "abstract": "We study the problem of perceiving forest or mountain trails from a single monocular image acquired from the viewpoint of a robot traveling on the trail itself. Previous literature focused on trail segmentation, and used low-level features such as image saliency or appearance contrast; we propose a different approach based on a deep neural network used as a supervised image classifier. By operating on the whole image at once, our system outputs the main direction of the trail compared to the viewing direction. Qualitative and quantitative results computed on a large real-world dataset (which we provide for download) show that our approach outperforms alternatives, and yields an accuracy comparable to the accuracy of humans that are tested on the same image classification task. Preliminary results on using this information for quadrotor control in unseen trails are reported. To the best of our knowledge, this is the first letter that describes an approach to perceive forest trials, which is demonstrated on a quadrotor micro aerial vehicle.", "year": 2016, "referenceCount": 37, "citationCount": 564, "influentialCitationCount": 29, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "33354551", "name": "A. Giusti"}, {"authorId": "2144778", "name": "Jérôme Guzzi"}, {"authorId": "1895356", "name": "D. Ciresan"}, {"authorId": "2065070888", "name": "Fangwei He"}, {"authorId": "2116901955", "name": "Juan P. Rodríguez"}, {"authorId": "2065687478", "name": "Flavio Fontana"}, {"authorId": "36984610", "name": "M. Faessler"}, {"authorId": "144789467", "name": "Christian Forster"}, {"authorId": "145341374", "name": "J. Schmidhuber"}, {"authorId": "1744127", "name": "G. D. Caro"}, {"authorId": "2075371", "name": "D. Scaramuzza"}, {"authorId": "6803671", "name": "L. Gambardella"}]}, {"paperId": "923db0aeb26a6dc1cb42069c9db04e5dd2d2200a", "url": "https://www.semanticscholar.org/paper/923db0aeb26a6dc1cb42069c9db04e5dd2d2200a", "title": "Use of Support Vector Learning for Chunk Identification", "abstract": "In this paper, we explore the use of Support Vector Machines (SVMs) for CoNLL-2000 shared task, chunk identification. SVMs are so-called large margin classifiers and are well-known as their good generalization performance. We investigate how SVMs with a very large number of features perform with the classification task of chunk labelling.", "year": 2000, "referenceCount": 8, "citationCount": 342, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3131784", "name": "Taku Kudoh"}, {"authorId": "1681502", "name": "Yuji Matsumoto"}]}, {"paperId": "765892e82d00e461c2b8bbb55a232785e042f8f6", "url": "https://www.semanticscholar.org/paper/765892e82d00e461c2b8bbb55a232785e042f8f6", "title": "A Survey on Medical Diagnosis of Diabetes Using Machine Learning Techniques", "abstract": null, "year": 2018, "referenceCount": 19, "citationCount": 54, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153776780", "name": "Ambika Choudhury"}, {"authorId": "144786228", "name": "D. Gupta"}]}, {"paperId": "8d3a8121c91e2218960d6767986ff3687a1a972e", "url": "https://www.semanticscholar.org/paper/8d3a8121c91e2218960d6767986ff3687a1a972e", "title": "Opprentice: Towards Practical and Automatic Anomaly Detection Through Machine Learning", "abstract": "Closely monitoring service performance and detecting anomalies are critical for Internet-based services. However, even though dozens of anomaly detectors have been proposed over the years, deploying them to a given service remains a great challenge, requiring manually and iteratively tuning detector parameters and thresholds. This paper tackles this challenge through a novel approach based on supervised machine learning. With our proposed system, Opprentice (Operators' apprentice), operators' only manual work is to periodically label the anomalies in the performance data with a convenient tool. Multiple existing detectors are applied to the performance data in parallel to extract anomaly features. Then the features and the labels are used to train a random forest classifier to automatically select the appropriate detector-parameter combinations and the thresholds. For three different service KPIs in a top global search engine, Opprentice can automatically satisfy or approximate a reasonable accuracy preference (recall >= 0.66 and precision>= 0.66). More importantly, Opprentice allows operators to label data in only tens of minutes, while operators traditionally have to spend more than ten days selecting and tuning detectors, which may still turn out not to work in the end.", "year": 2015, "referenceCount": 53, "citationCount": 158, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115199601", "name": "Dapeng Liu"}, {"authorId": "3022584", "name": "Youjian Zhao"}, {"authorId": "46485716", "name": "Haowen Xu"}, {"authorId": "2116606497", "name": "Yongqian Sun"}, {"authorId": "1784745", "name": "Dan Pei"}, {"authorId": "2119195643", "name": "Jiao Luo"}, {"authorId": "3227358", "name": "Xiaowei Jing"}, {"authorId": "144313308", "name": "Mei Feng"}]}, {"paperId": "a2314a4e763fd9a7120ab852a6b069eefc5b191b", "url": "https://www.semanticscholar.org/paper/a2314a4e763fd9a7120ab852a6b069eefc5b191b", "title": "Machine Learning in Automatic Speech Recognition: A Survey", "abstract": "ABSTRACT Over the past few decades, there has been tremendous development in machine learning paradigms used in automatic speech recognition (ASR) for home automation to space exploration. Though commercial speech recognizers are available for certain well-defined applications like dictation and transcription, many issues in ASR like recognition in noisy environments, multilingual recognition, and multi-modal recognition are yet to be addressed effectively. A comprehensive review of common machine learning techniques like artificial neural networks, support vector machines, and Gaussian mixture models along with hidden Markov models employed in ASR is provided. A thorough review on the recent developments in deep learning which has provided significant improvements in ASR performance, along with its relevance in the future of ASR, is also presented.", "year": 2015, "referenceCount": 81, "citationCount": 91, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2514990", "name": "Jayashree Padmanabhan"}, {"authorId": "145657834", "name": "Melvin Johnson"}]}, {"paperId": "cbe7deabc11b4b95032f97322bbef5239d5a84ca", "url": "https://www.semanticscholar.org/paper/cbe7deabc11b4b95032f97322bbef5239d5a84ca", "title": "Automatic Recognition of Facial Actions in Spontaneous Expressions", "abstract": "Spontaneous facial expressions differ from posed expressions in both which muscles are moved, and in the dynamics of the movement. Advances in the field of automatic facial expression measurement will require development and assessment on spontaneous behavior. Here we present preliminary results on a task of facial action detection in spontaneous facial expressions. We employ a user independent fully automatic system for real time recognition of facial actions from the Facial Action Coding System (FACS). The system automatically detects frontal faces in the video stream and coded each frame with respect to 20 Action units. The approach applies machine learning methods such as support vector machines and AdaBoost, to texture-based image representations. The output margin for the learned classifiers predicts action unit intensity. Frame-by-frame intensity measurements will enable investigations into facial expression dynamics which were previously intractable by human coding.", "year": 2006, "referenceCount": 75, "citationCount": 497, "influentialCitationCount": 63, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2218905", "name": "M. Bartlett"}, {"authorId": "46548046", "name": "G. Littlewort"}, {"authorId": "145595070", "name": "M. Frank"}, {"authorId": "2767464", "name": "C. Lainscsek"}, {"authorId": "2039025", "name": "I. Fasel"}, {"authorId": "1741200", "name": "J. Movellan"}]}, {"paperId": "7fc1320139696e352900698072f4453f02e4e795", "url": "https://www.semanticscholar.org/paper/7fc1320139696e352900698072f4453f02e4e795", "title": "Comparison of Machine Learning algorithms performance in detecting network intrusion", "abstract": "Organization has come to realize that network security technology has become very important in protecting its information. With tremendous growth of internet, attack cases are increasing each day along with the modern attack method. One of the solutions to this problem is by using Intrusion Detection System (IDS). Machine Learning is one of the methods used in the IDS. In recent years, Machine Learning Intrusion Detection system has been giving high accuracy and good detection on novel attacks. In this paper the performance of a Machine Learning algorithm called Decision Tree (J48) is evaluated and compared with two other Machine Learning algorithms namely Neural Network and Support Vector Machines which has been conducted by A. Osareh [1] for detecting intrusion. The algorithms were tested based on accuracy, detection rate, false alarm rate and accuracy of four categories of attacks. From the experiments conducted, it was found that the Decision tree (J48) algorithm outperformed the other two algorithms.", "year": 2010, "referenceCount": 17, "citationCount": 61, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3267786", "name": "K. A. Jalil"}, {"authorId": "32291020", "name": "M. H. Kamarudin"}, {"authorId": "98601674", "name": "M. N. Masrek"}]}, {"paperId": "3362c5df179e709aa4ad411b10ce852cefd3e30a", "url": "https://www.semanticscholar.org/paper/3362c5df179e709aa4ad411b10ce852cefd3e30a", "title": "Applying Machine Learning Methods in Diagnosing Heart Disease for Diabetic Patients", "abstract": "Classifying data is a common task in Machine learning. Data mining plays an essential role for extracting knowledge from large databases from enterprises operational databases. Data mining in health care is an emerging field of high importance for providing prognosis and a deeper understanding of medical data. Most data mining methods depend on a set of features that define the behaviour of the learning algorithm and directly or indirectly influence the complexity of resulting models. Heart disease is the leading cause of death in the world over the past 10 years. Researches have been using several data mining techniques in the diagnosis of heart disease. Diabetes is a chronic disease that occurs when the pancreas does not produce enough insulin, or when the body cannot effectively use the insulin it produces. Most of these systems have successfully employed Machine learning methods such as Naive Bayes and Support Vector Machines for the classification purpose. Support vector machines are a modern technique in the field of machine learning and have been successfully used in different fields of application. Using diabetics’ diagnosis, the system exhibited good accuracy and predicts attributes such as age, sex, blood pressure and blood sugar and the chances of a diabetic patient getting a heart disease.", "year": 2012, "referenceCount": 34, "citationCount": 90, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2087549", "name": "G. Parthiban"}, {"authorId": "144209906", "name": "S. Srivatsa"}]}, {"paperId": "bcd69aa8233d413397428d15dbb41113dbf6bcec", "url": "https://www.semanticscholar.org/paper/bcd69aa8233d413397428d15dbb41113dbf6bcec", "title": "Machine learning research that matters for music creation: A case study", "abstract": "ABSTRACT Research applying machine learning to music modelling and generation typically proposes model architectures, training methods and datasets, and gauges system performance using quantitative measures like sequence likelihoods and/or qualitative listening tests. Rarely does such work explicitly question and analyse its usefulness for and impact on real-world practitioners, and then build on those outcomes to inform the development and application of machine learning. This article attempts to do these things for machine learning applied to music creation. Together with practitioners, we develop and use several applications of machine learning for music creation, and present a public concert of the results. We reflect on the entire experience to arrive at several ways of advancing these and similar applications of machine learning to music creation.", "year": 2018, "referenceCount": 75, "citationCount": 57, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2479962", "name": "Bob L. Sturm"}, {"authorId": "1400943928", "name": "Oded Ben-Tal"}, {"authorId": "115110404", "name": "Úna Monaghan"}, {"authorId": "144723390", "name": "N. Collins"}, {"authorId": "3320845", "name": "Dorien Herremans"}, {"authorId": "143925008", "name": "E. Chew"}, {"authorId": "3254356", "name": "Gaëtan Hadjeres"}, {"authorId": "2552800", "name": "Emmanuel Deruty"}, {"authorId": "1986454", "name": "F. Pachet"}]}, {"paperId": "2435cd100deb345d9cae65b1cd3218c74ccec992", "url": "https://www.semanticscholar.org/paper/2435cd100deb345d9cae65b1cd3218c74ccec992", "title": "Machine learning techniques for in silico modeling of drug metabolism.", "abstract": "The computational assessment of drug metabolism has gained considerable interest in pharmaceutical research. Amongst others, machine learning techniques have been employed to model relationships between the chemical structure of a compound and its metabolic fate. Examples for these techniques, which were originally developed in fields far from drug discovery, are artificial neural networks or support vector machines. This paper summarizes the application of various machine learning techniques to predict the interaction between organic molecules and metabolic enzymes. More complex endpoints such as metabolic stability or in vivo clearance will also be addressed. It is shown that the prediction of metabolic endpoints with machine learning techniques has made considerable progress over the past few years. Depending on the procedure used, either classification or quantitative prediction is possible for even large and diverse compound sets. Together with the expanding experimental data basis, these in silico methods have become valuable tools in the drug discovery and development process.", "year": 2006, "referenceCount": 0, "citationCount": 79, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "33819826", "name": "T. Fox"}, {"authorId": "1735729", "name": "Jan M. Kriegl"}]}, {"paperId": "70c25a7b3b285d90dbe3d528d96638f6208279ca", "url": "https://www.semanticscholar.org/paper/70c25a7b3b285d90dbe3d528d96638f6208279ca", "title": "Dynamic Differential Privacy for ADMM-Based Distributed Classification Learning", "abstract": "Privacy-preserving distributed machine learning becomes increasingly important due to the recent rapid growth of data. This paper focuses on a class of regularized empirical risk minimization machine learning problems, and develops two methods to provide differential privacy to distributed learning algorithms over a network. We first decentralize the learning algorithm using the alternating direction method of multipliers, and propose the methods of dual variable perturbation and primal variable perturbation to provide dynamic differential privacy. The two mechanisms lead to algorithms that can provide privacy guarantees under mild conditions of the convexity and differentiability of the loss function and the regularizer. We study the performance of the algorithms, and show that the dual variable perturbation outperforms its primal counterpart. To design an optimal privacy mechanism, we analyze the fundamental tradeoff between privacy and accuracy, and provide guidelines to choose privacy parameters. Numerical experiments using customer information database are performed to corroborate the results on privacy and utility tradeoffs and design.", "year": 2017, "referenceCount": 26, "citationCount": 141, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2146341513", "name": "Tao Zhang"}, {"authorId": "1709793", "name": "Quanyan Zhu"}]}, {"paperId": "9473cb0866dc711fd00b7d3b5e294bbf0eed5d14", "url": "https://www.semanticscholar.org/paper/9473cb0866dc711fd00b7d3b5e294bbf0eed5d14", "title": "Machine learning in automotive industry", "abstract": "• A submitted manuscript is the version of the article upon submission and before peer-review. There can be important differences between the submitted version and the official published version of record. People interested in the research are advised to contact the author for the final version of the publication, or visit the DOI to the publisher's website. • The final author version and the galley proof are versions of the publication after peer review. • The final published version features the final layout of the paper including the volume, issue and page numbers.", "year": 2018, "referenceCount": 13, "citationCount": 72, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "7703317", "name": "B. Yao"}, {"authorId": "2056029787", "name": "Tao Feng"}]}, {"paperId": "d8b65198c37ada92cada81fe315508fc5bdbab8f", "url": "https://www.semanticscholar.org/paper/d8b65198c37ada92cada81fe315508fc5bdbab8f", "title": "Graph Networks as a Universal Machine Learning Framework for Molecules and Crystals", "abstract": "Graph networks are a new machine learning (ML) paradigm that supports both relational reasoning and combinatorial generalization. Here, we develop, for the first time, universal MatErials Graph Network (MEGNet) models for accurate property prediction in both molecules and crystals. We demonstrate that our MEGNet models significantly outperform prior ML models in 11 out of 13 properties of the QM9 molecule data set. Furthermore, a single-task unified MEGNet model can accurately predict the internal energy at 0 K and room temperature, enthalpy and Gibbs free energy, with temperature, pressure and entropy being global state inputs. Similarly, we show that MEGNet models trained on $\\sim 60,000$ crystals in the Materials Project substantially outperform prior ML models in the prediction of the formation energies, band gaps and elastic moduli of crystals, achieving better than DFT accuracy over a much larger data set. Such MEGNet models are highly interpretable, and well-established periodic chemical trends can be extracted from the elemental embeddings. Finally, we demonstrate the transfer learning of elemental embeddings from a property model trained on a larger data set (formation energies) to accelerate the training of property models with smaller amounts of data (band gaps and elastic moduli)", "year": 2018, "referenceCount": 65, "citationCount": 395, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "143915066", "name": "Chi Chen"}, {"authorId": "15698847", "name": "Weike Ye"}, {"authorId": "11844524", "name": "Yunxing Zuo"}, {"authorId": "102693597", "name": "Chen Zheng"}, {"authorId": "2381325", "name": "S. Ong"}]}, {"paperId": "5029362f4e0966d21a2ebf788bfadb5ae55697aa", "url": "https://www.semanticscholar.org/paper/5029362f4e0966d21a2ebf788bfadb5ae55697aa", "title": "Sparse Bayesian learning for efficient visual tracking", "abstract": "This paper extends the use of statistical learning algorithms for object localization. It has been shown that object recognizers using kernel-SVMs can be elegantly adapted to localization by means of spatial perturbation of the SVM. While this SVM applies to each frame of a video independently of other frames, the benefits of temporal fusion of data are well-known. This is addressed here by using a fully probabilistic relevance vector machine (RVM) to generate observations with Gaussian distributions that can be fused over time. Rather than adapting a recognizer, we build a displacement expert which directly estimates displacement from the target region. An object detector is used in tandem, for object verification, providing the capability for automatic initialization and recovery. This approach is demonstrated in real-time tracking systems where the sparsity of the RVM means that only a fraction of CPU time is required to track at frame rate. An experimental evaluation compares this approach to the state of the art showing it to be a viable method for long-term region tracking.", "year": 2005, "referenceCount": 38, "citationCount": 224, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144609496", "name": "Oliver Williams"}, {"authorId": "145162067", "name": "A. Blake"}, {"authorId": "1745672", "name": "R. Cipolla"}]}, {"paperId": "c69d219f5c10ba81d5e974c05fdf9bf0d62bd30e", "url": "https://www.semanticscholar.org/paper/c69d219f5c10ba81d5e974c05fdf9bf0d62bd30e", "title": "Machine Learning with SVM and other Kernel methods", "abstract": null, "year": 2009, "referenceCount": 0, "citationCount": 202, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2541418", "name": "K. P. Soman"}, {"authorId": "144124588", "name": "R. Loganathan"}, {"authorId": "47961817", "name": "Ajay"}]}, {"paperId": "d7eeffce7df899dd9ca35c541350ee6b690ec629", "url": "https://www.semanticscholar.org/paper/d7eeffce7df899dd9ca35c541350ee6b690ec629", "title": "Generating Factoid Questions With Recurrent Neural Networks: The 30M Factoid Question-Answer Corpus", "abstract": "Over the past decade, large-scale supervised learning corpora have enabled machine learning researchers to make substantial advances. However, to this date, there are no large-scale question-answer corpora available. In this paper we present the 30M Factoid Question-Answer Corpus, an enormous question answer pair corpus produced by applying a novel neural network architecture on the knowledge base Freebase to transduce facts into natural language questions. The produced question answer pairs are evaluated both by human evaluators and using automatic evaluation metrics, including well-established machine translation and sentence similarity metrics. Across all evaluation criteria the question-generation model outperforms the competing template-based baseline. Furthermore, when presented to human evaluators, the generated questions appear comparable in quality to real human-generated questions.", "year": 2016, "referenceCount": 42, "citationCount": 239, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35224828", "name": "Iulian Serban"}, {"authorId": "1405061488", "name": "Alberto García-Durán"}, {"authorId": "1854385", "name": "Çaglar Gülçehre"}, {"authorId": "3103594", "name": "Sungjin Ahn"}, {"authorId": "144631588", "name": "A. Chandar"}, {"authorId": "1760871", "name": "Aaron C. Courville"}, {"authorId": "1751762", "name": "Yoshua Bengio"}]}, {"paperId": "9490867c0516c64f06a5f12b59d0a00c804c9bba", "url": "https://www.semanticscholar.org/paper/9490867c0516c64f06a5f12b59d0a00c804c9bba", "title": "Machine and deep learning meet genome-scale metabolic modeling", "abstract": "Omic data analysis is steadily growing as a driver of basic and applied molecular biology research. Core to the interpretation of complex and heterogeneous biological phenotypes are computational approaches in the fields of statistics and machine learning. In parallel, constraint-based metabolic modeling has established itself as the main tool to investigate large-scale relationships between genotype, phenotype, and environment. The development and application of these methodological frameworks have occurred independently for the most part, whereas the potential of their integration for biological, biomedical, and biotechnological research is less known. Here, we describe how machine learning and constraint-based modeling can be combined, reviewing recent works at the intersection of both domains and discussing the mathematical and practical aspects involved. We overlap systematic classifications from both frameworks, making them accessible to nonexperts. Finally, we delineate potential future scenarios, propose new joint theoretical frameworks, and suggest concrete points of investigation for this joint subfield. A multiview approach merging experimental and knowledge-driven omic data through machine learning methods can incorporate key mechanistic information in an otherwise biologically-agnostic learning process.", "year": 2019, "referenceCount": 121, "citationCount": 129, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "35455237", "name": "Guido Zampieri"}, {"authorId": "30459096", "name": "S. Vijayakumar"}, {"authorId": "10018679", "name": "E. Yaneske"}, {"authorId": "2377807", "name": "C. Angione"}]}, {"paperId": "2f871fda8e3dd460a19f6e07f1f52ad8e9e34806", "url": "https://www.semanticscholar.org/paper/2f871fda8e3dd460a19f6e07f1f52ad8e9e34806", "title": "Prediction‐based fingerprints of protein–protein interactions", "abstract": "The recognition of protein interaction sites is an important intermediate step toward identification of functionally relevant residues and understanding protein function, facilitating experimental efforts in that regard. Toward that goal, the authors propose a novel representation for the recognition of protein–protein interaction sites that integrates enhanced relative solvent accessibility (RSA) predictions with high resolution structural data. An observation that RSA predictions are biased toward the level of surface exposure consistent with protein complexes led the authors to investigate the difference between the predicted and actual (i.e., observed in an unbound structure) RSA of an amino acid residue as a fingerprint of interaction sites. The authors demonstrate that RSA prediction‐based fingerprints of protein interactions significantly improve the discrimination between interacting and noninteracting sites, compared with evolutionary conservation, physicochemical characteristics, structure‐derived and other features considered before. On the basis of these observations, the authors developed a new method for the prediction of protein–protein interaction sites, using machine learning approaches to combine the most informative features into the final predictor. For training and validation, the authors used several large sets of protein complexes and derived from them nonredundant representative chains, with interaction sites mapped from multiple complexes. Alternative machine learning techniques are used, including Support Vector Machines and Neural Networks, so as to evaluate the relative effects of the choice of a representation and a specific learning algorithm. The effects of induced fit and uncertainty of the negative (noninteracting) class assignment are also evaluated. Several representative methods from the literature are reimplemented to enable direct comparison of the results. Using rigorous validation protocols, the authors estimated that the new method yields the overall classification accuracy of about 74% and Matthews correlation coefficients of 0.42, as opposed to up to 70% classification accuracy and up to 0.3 Matthews correlation coefficient for methods that do not utilize RSA prediction‐based fingerprints. The new method is available at http://sppider.cchmc.org. Proteins 2007. © 2006 Wiley‐Liss, Inc.", "year": 2006, "referenceCount": 69, "citationCount": 331, "influentialCitationCount": 51, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3192177", "name": "A. Porollo"}, {"authorId": "49806460", "name": "J. Meller"}]}, {"paperId": "c7f81751848c4ecacad4917fec2903602e0fcc37", "url": "https://www.semanticscholar.org/paper/c7f81751848c4ecacad4917fec2903602e0fcc37", "title": "Bayesian inference with posterior regularization and applications to infinite latent SVMs", "abstract": "Existing Bayesian models, especially nonparametric Bayesian methods, rely on specially conceived priors to incorporate domain knowledge for discovering improved latent representations. While priors can affect posterior distributions through Bayes' rule, imposing posterior regularization is arguably more direct and in some cases more natural and general. In this paper, we present regularized Bayesian inference (RegBayes), a novel computational framework that performs posterior inference with a regularization term on the desired post-data posterior distribution under an information theoretical formulation. RegBayes is more flexible than the procedure that elicits expert knowledge via priors, and it covers both directed Bayesian networks and undirected Markov networks whose Bayesian formulation results in hybrid chain graph models. When the regularization is induced from a linear operator on the posterior distributions, such as the expectation operator, we present a general convex-analysis theorem to characterize the solution of RegBayes. Furthermore, we present two concrete examples of RegBayes, infinite latent support vector machines (iLSVM) and multi-task infinite latent support vector machines (MT-iLSVM), which explore the large-margin idea in combination with a nonparametric Bayesian model for discovering predictive latent features for classification and multi-task learning, respectively. We present efficient inference methods and report empirical studies on several benchmark datasets, which appear to demonstrate the merits inherited from both large-margin learning and Bayesian nonparametrics. Such results were not available until now, and contribute to push forward the interface between these two important subfields, which have been largely treated as isolated in the community.", "year": 2012, "referenceCount": 89, "citationCount": 142, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145254043", "name": "Jun Zhu"}, {"authorId": "1406245631", "name": "Ning Chen"}, {"authorId": "143977260", "name": "E. Xing"}]}, {"paperId": "c8bcfb6a13546e12c3bb4a346057158c26b02611", "url": "https://www.semanticscholar.org/paper/c8bcfb6a13546e12c3bb4a346057158c26b02611", "title": "Image driven machine learning methods for microstructure recognition", "abstract": null, "year": 2016, "referenceCount": 39, "citationCount": 200, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "70327435", "name": "Aritra Chowdhury"}, {"authorId": "100466411", "name": "E. Kautz"}, {"authorId": "7834060", "name": "B. Yener"}, {"authorId": "48938293", "name": "D. Lewis"}]}, {"paperId": "6112f728389e635675cd6f29c77c2dce6cabc6b0", "url": "https://www.semanticscholar.org/paper/6112f728389e635675cd6f29c77c2dce6cabc6b0", "title": "Object Detection in Optical Remote Sensing Images Based on Weakly Supervised Learning and High-Level Feature Learning", "abstract": "The abundant spatial and contextual information provided by the advanced remote sensing technology has facilitated subsequent automatic interpretation of the optical remote sensing images (RSIs). In this paper, a novel and effective geospatial object detection framework is proposed by combining the weakly supervised learning (WSL) and high-level feature learning. First, deep Boltzmann machine is adopted to infer the spatial and structural information encoded in the low-level and middle-level features to effectively describe objects in optical RSIs. Then, a novel WSL approach is presented to object detection where the training sets require only binary labels indicating whether an image contains the target object or not. Based on the learnt high-level features, it jointly integrates saliency, intraclass compactness, and interclass separability in a Bayesian framework to initialize a set of training examples from weakly labeled images and start iterative learning of the object detector. A novel evaluation criterion is also developed to detect model drift and cease the iterative learning. Comprehensive experiments on three optical RSI data sets have demonstrated the efficacy of the proposed approach in benchmarking with several state-of-the-art supervised-learning-based object detection approaches.", "year": 2015, "referenceCount": 46, "citationCount": 616, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "7181955", "name": "Junwei Han"}, {"authorId": "39901030", "name": "Dingwen Zhang"}, {"authorId": "2152127024", "name": "Gong Cheng"}, {"authorId": "143621713", "name": "Lei Guo"}, {"authorId": "145811527", "name": "Jinchang Ren"}]}, {"paperId": "1f399026772d6823a85e3883970fdfcde075cadf", "url": "https://www.semanticscholar.org/paper/1f399026772d6823a85e3883970fdfcde075cadf", "title": "Machine Learning Glove Using Self‐Powered Conductive Superhydrophobic Triboelectric Textile for Gesture Recognition in VR/AR Applications", "abstract": "The rapid progress of Internet of things (IoT) technology raises an imperative demand on human machine interfaces (HMIs) which provide a critical linkage between human and machines. Using a glove as an intuitive and low‐cost HMI can expediently track the motions of human fingers, resulting in a straightforward communication media of human–machine interactions. When combining several triboelectric textile sensors and proper machine learning technique, it has great potential to realize complex gesture recognition with the minimalist‐designed glove for the comprehensive control in both real and virtual space. However, humidity or sweat may negatively affect the triboelectric output as well as the textile itself. Hence, in this work, a facile carbon nanotubes/thermoplastic elastomer (CNTs/TPE) coating approach is investigated in detail to achieve superhydrophobicity of the triboelectric textile for performance improvement. With great energy harvesting and human motion sensing capabilities, the glove using the superhydrophobic textile realizes a low‐cost and self‐powered interface for gesture recognition. By leveraging machine learning technology, various gesture recognition tasks are done in real time by using gestures to achieve highly accurate virtual reality/augmented reality (VR/AR) controls including gun shooting, baseball pitching, and flower arrangement, with minimized effect from sweat during operation.", "year": 2020, "referenceCount": 121, "citationCount": 147, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2052575409", "name": "Feng Wen"}, {"authorId": "2109819978", "name": "Zhongda Sun"}, {"authorId": "48748590", "name": "Tianyiyi He"}, {"authorId": "2403001", "name": "Qiongfeng Shi"}, {"authorId": "9570142", "name": "Minglu Zhu"}, {"authorId": "9338775", "name": "Zixuan Zhang"}, {"authorId": "1491164292", "name": "Lianhui Li"}, {"authorId": "2146319724", "name": "Ting Zhang"}, {"authorId": "2144827722", "name": "Chengkuo Lee"}]}, {"paperId": "4ed0286846d776da4f7db09518557ff324d0eb24", "url": "https://www.semanticscholar.org/paper/4ed0286846d776da4f7db09518557ff324d0eb24", "title": "On Quality Control and Machine Learning in Crowdsourcing", "abstract": "The advent of crowdsourcing has created a variety of new opportunities for improving upon traditional methods of data collection and annotation. This in turn has created intriguing new opportunities for data-driven machine learning (ML). Convenient access to crowd workers for simple data collection has further generalized to leveraging more arbitrary crowd-based human computation (von Ahn 2005) to supplement automated ML. While new potential applications of crowdsourcing continue to emerge, a variety of practical and sometimes unexpected obstacles have already limited the degree to which its promised potential can be actually realized in practice. This paper considers two particular aspects of crowdsourcing and their interplay, data quality control (QC) and ML, reflecting on where we have been, where we are, and where we might go from here.", "year": 2011, "referenceCount": 26, "citationCount": 143, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1747771", "name": "Matthew Lease"}]}, {"paperId": "999619bf0800b2865e65f61c8d89ce465d02622f", "url": "https://www.semanticscholar.org/paper/999619bf0800b2865e65f61c8d89ce465d02622f", "title": "Advances in the prediction of protein targeting signals", "abstract": "Enlarged sets of reference data and special machine learning approaches have improved the accuracy of the prediction of protein subcellular localization. Recent approaches report over 95% correct predictions with low fractions of false‐positives for secretory proteins. A clear trend is to develop specifically tailored organism‐ and organelle‐specific prediction tools rather than using one general method. Focus of the review is on machine learning systems, highlighting four concepts: the artificial neural feed‐forward network, the self‐organizing map (SOM), the Hidden‐Markov‐Model (HMM), and the support vector machine (SVM).", "year": 2004, "referenceCount": 65, "citationCount": 111, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "144522872", "name": "G. Schneider"}, {"authorId": "1892803", "name": "U. Fechner"}]}]}