{"total": 5120627, "offset": 3700, "next": 3800, "data": [{"paperId": "3dacce6baae86dd74467e5187907b65ce1c8ca49", "url": "https://www.semanticscholar.org/paper/3dacce6baae86dd74467e5187907b65ce1c8ca49", "title": "A survey of surveys on the use of visualization for interpreting machine learning models", "abstract": "Research in machine learning has become very popular in recent years, with many types of models proposed to comprehend and predict patterns and trends in data originating from different domains. As these models get more and more complex, it also becomes harder for users to assess and trust their results, since their internal operations are mostly hidden in black boxes. The interpretation of machine learning models is currently a hot topic in the information visualization community, with results showing that insights from machine learning models can lead to better predictions and improve the trustworthiness of the results. Due to this, multiple (and extensive) survey articles have been published recently trying to summarize the high number of original research papers published on the topic. But there is not always a clear definition of what these surveys cover, what is the overlap between them, which types of machine learning models they deal with, or what exactly is the scenario that the readers will find in each of them. In this article, we present a meta-analysis (i.e. a “survey of surveys”) of manually collected survey papers that refer to the visual interpretation of machine learning models, including the papers discussed in the selected surveys. The aim of our article is to serve both as a detailed summary and as a guide through this survey ecosystem by acquiring, cataloging, and presenting fundamental knowledge of the state of the art and research opportunities in the area. Our results confirm the increasing trend of interpreting machine learning with visualizations in the past years, and that visualization can assist in, for example, online training processes of deep learning models and enhancing trust into machine learning. However, the question of exactly how this assistance should take place is still considered as an open challenge of the visualization community.", "year": 2020, "referenceCount": 101, "citationCount": 60, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "52197250", "name": "Angelos Chatzimparmpas"}, {"authorId": "47758081", "name": "R. M. Martins"}, {"authorId": "2810989", "name": "Ilir Jusufi"}, {"authorId": "2569160", "name": "A. Kerren"}]}, {"paperId": "dd54140215bd0441b46dc5e9f7b8976f9f2b2ac5", "url": "https://www.semanticscholar.org/paper/dd54140215bd0441b46dc5e9f7b8976f9f2b2ac5", "title": "On Representing and Generating Kernels by Fuzzy Equivalence Relations", "abstract": "Kernels are two-placed functions that can be interpreted as inner products in some Hilbert space. It is this property which makes kernels predestinated to carry linear models of learning, optimization or classification strategies over to non-linear variants. Following this idea, various kernel-based methods like support vector machines or kernel principal component analysis have been conceived which prove to be successful for machine learning, data mining and computer vision applications. When applying a kernel-based method a central question is the choice and the design of the kernel function. This paper provides a novel view on kernels based on fuzzy-logical concepts which allows to incorporate prior knowledge in the design process. It is demonstrated that kernels mapping to the unit interval with constant one in its diagonal can be represented by a commonly used fuzzy-logical formula for representing fuzzy rule bases. This means that a great class of kernels can be represented by fuzzy-logical concepts. Apart from this result, which only guarantees the existence of such a representation, constructive examples are presented and the relation to unlabeled learning is pointed out.", "year": 2006, "referenceCount": 38, "citationCount": 86, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2064375222", "name": "Bernhard Moser"}]}, {"paperId": "12f837243ae634623606b37f4d3c6166e37ba6a8", "url": "https://www.semanticscholar.org/paper/12f837243ae634623606b37f4d3c6166e37ba6a8", "title": "Learning classification models of cognitive conditions from subtle behaviors in the digital Clock Drawing Test", "abstract": null, "year": 2015, "referenceCount": 125, "citationCount": 109, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1404454391", "name": "William Souillard-Mandar"}, {"authorId": "108395015", "name": "Randall Davis"}, {"authorId": "48395540", "name": "C. Rudin"}, {"authorId": "2179847", "name": "R. Au"}, {"authorId": "2098437", "name": "D. Libon"}, {"authorId": "48254377", "name": "R. Swenson"}, {"authorId": "2171290", "name": "C. Price"}, {"authorId": "144002362", "name": "M. Lamar"}, {"authorId": "37352958", "name": "D. Penney"}]}, {"paperId": "5fa645235e87a1d064b5792348048130bfb15a58", "url": "https://www.semanticscholar.org/paper/5fa645235e87a1d064b5792348048130bfb15a58", "title": "Software effort estimation using machine learning methods", "abstract": "In software engineering, the main aim is to develop projects that produce the desired results within limited schedule and budget. The most important factor affecting the budget of a project is the effort. Therefore, estimating effort is crucial because hiring people more than needed leads to a loss of income and hiring people less than needed leads to an extension of schedule. The main objective of this research is making an analysis of software effort estimation to overcome problems related to it: budget and schedule extension. To accomplish this, we propose a model that uses machine learning methods. We evaluate these models on public datasets and data gathered from software organizations in Turkey. It is found out in the experiments that the best method for a dataset may change and this proves the point that the usage of one model cannot always produce the best results.", "year": 2007, "referenceCount": 20, "citationCount": 79, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9390767", "name": "B. Baskeles"}, {"authorId": "1705424", "name": "Burak Turhan"}, {"authorId": "1730000", "name": "A. Bener"}]}, {"paperId": "21e7aba2edc890fd6cef760b93b48d20daa3f275", "url": "https://www.semanticscholar.org/paper/21e7aba2edc890fd6cef760b93b48d20daa3f275", "title": "Static Malware Analysis Using Machine Learning Methods", "abstract": null, "year": 2014, "referenceCount": 35, "citationCount": 71, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2765092", "name": "Hiran V. Nath"}, {"authorId": "1952510", "name": "B. Mehtre"}]}, {"paperId": "580c8581c5b792d98f8d8e271cf4bd7a9b8bdc1b", "url": "https://www.semanticscholar.org/paper/580c8581c5b792d98f8d8e271cf4bd7a9b8bdc1b", "title": "The Gap Between Promise and Reality: On the Insecurity of XOR Arbiter PUFs", "abstract": null, "year": 2015, "referenceCount": 34, "citationCount": 186, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "4277384", "name": "G. Becker"}]}, {"paperId": "126113d251297812e091c5990064c8300effa684", "url": "https://www.semanticscholar.org/paper/126113d251297812e091c5990064c8300effa684", "title": "Bridged Refinement for Transfer Learning", "abstract": null, "year": 2007, "referenceCount": 20, "citationCount": 77, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "15146619", "name": "Dikan Xing"}, {"authorId": "1752769", "name": "Wenyuan Dai"}, {"authorId": "1701421", "name": "Gui-Rong Xue"}, {"authorId": "1811427", "name": "Yong Yu"}]}, {"paperId": "336241edd63791cc92e00774cee4de48bc92c75f", "url": "https://www.semanticscholar.org/paper/336241edd63791cc92e00774cee4de48bc92c75f", "title": "Machine Learning Approach to RF Transmitter Identification", "abstract": "With the increasing domain and widespread use of wireless devices in recent years (mobile phones, Internet of Things, Wi-Fi), the electromagnetic spectrum has become extremely crowded. To counter security threats posed by rogue or unknown transmitters, we must identify RF transmitters not only by the data content of the transmissions but also based on the intrinsic physical characteristics of the transmitters. RF waveforms represent a particular challenge because of the extremely high data rates involved and the potentially large number of transmitters sharing a channel in a given location. These factors outline the need for rapid fingerprinting and identification methods that go beyond the traditional hand-engineered approaches. In this paper, we investigate the use of machine learning strategies to the classification and identification problem. We evaluate four different strategies: conventional deep neural nets, convolutional neural nets, support vector machines, and deep neural nets with multi-stage training. The latter was by far the most accurate, achieving 100% classification accuracy of 12 transmitters, and showing remarkable potential for scalability to large transmitter populations.", "year": 2017, "referenceCount": 68, "citationCount": 82, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "authors": [{"authorId": "47226368", "name": "K. Youssef"}, {"authorId": "46798560", "name": "Louis-S. Bouchard"}, {"authorId": "145296351", "name": "K. Haigh"}, {"authorId": "3330139", "name": "J. Silovský"}, {"authorId": "34830793", "name": "B. Thapa"}, {"authorId": "116019827", "name": "Chris Vander Valk"}]}, {"paperId": "241ce679cfd2903f0e56cf7a5e1979bd67f3f2fe", "url": "https://www.semanticscholar.org/paper/241ce679cfd2903f0e56cf7a5e1979bd67f3f2fe", "title": "Foolbox Native: Fast adversarial attacks to benchmark the robustness of machine learning models in PyTorch, TensorFlow, and JAX", "abstract": "Machine learning has made enormous progress in recent years and is now being used in many real-world applications. Nevertheless, even state-of-the-art machine learning models can be fooled by small, maliciously crafted perturbations of their input data. Foolbox is a popular Python library to benchmark the robustness of machine learning models against these adversarial perturbations. It comes with a huge collection of state-of-the-art adversarial attacks to find adversarial perturbations and thanks to its framework-agnostic design it is ideally suited for comparing the robustness of many different models implemented in different frameworks. Foolbox 3 aka Foolbox Native has been rewritten from scratch to achieve native performance on models developed in PyTorch (Paszke et al., 2019), TensorFlow (Abadi et al., 2016), and JAX (Bradbury et al., 2018), all with one codebase without code duplication.", "year": 2020, "referenceCount": 13, "citationCount": 90, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "19237612", "name": "Jonas Rauber"}, {"authorId": "149408648", "name": "Roland S. Zimmermann"}, {"authorId": "1731199", "name": "M. Bethge"}, {"authorId": "40634590", "name": "Wieland Brendel"}]}, {"paperId": "0f94847d93b7d2e4292cdc0a946075e86e5d1f5a", "url": "https://www.semanticscholar.org/paper/0f94847d93b7d2e4292cdc0a946075e86e5d1f5a", "title": "Learning Efficient Sparse and Low Rank Models", "abstract": "Parsimony, including sparsity and low rank, has been shown to successfully model data in numerous machine learning and signal processing tasks. Traditionally, such modeling approaches rely on an iterative algorithm that minimizes an objective function with parsimony-promoting terms. The inherently sequential structure and data-dependent complexity and latency of iterative optimization constitute a major limitation in many applications requiring real-time performance or involving large-scale data. Another limitation encountered by these modeling techniques is the difficulty of their inclusion in discriminative learning scenarios. In this work, we propose to move the emphasis from the model to the pursuit algorithm, and develop a process-centric view of parsimonious modeling, in which a learned deterministic fixed-complexity pursuit process is used in lieu of iterative optimization. We show a principled way to construct learnable pursuit process architectures for structured sparse and robust low rank models, derived from the iteration of proximal descent algorithms. These architectures learn to approximate the exact parsimonious representation at a fraction of the complexity of the standard optimization methods. We also show that appropriate training regimes allow to naturally extend parsimonious models to discriminative settings. State-of-the-art results are demonstrated on several challenging problems in image and audio processing with several orders of magnitude speed-up compared to the exact optimization algorithms.", "year": 2012, "referenceCount": 64, "citationCount": 175, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2905900", "name": "P. Sprechmann"}, {"authorId": "49791556", "name": "A. Bronstein"}, {"authorId": "1699339", "name": "G. Sapiro"}]}, {"paperId": "00cf63a7926a826f7cf73c1d5edb117f98d70c2c", "url": "https://www.semanticscholar.org/paper/00cf63a7926a826f7cf73c1d5edb117f98d70c2c", "title": "Variational algorithms for approximate Bayesian inference", "abstract": "The Bayesian framework for machine learning allows for the incorporation of prior knowledge in a coherent way, avoids overfitting problems, and provides a principled basis for selecting between alternative models. Unfortunately the computations required are usually intractable. This thesis presents a unified variational Bayesian (VB) framework which approximates these computations in models with latent variables using a lower bound on the marginal likelihood. Chapter 1 presents background material on Bayesian inference, graphical models, and propagation algorithms. Chapter 2 forms the theoretical core of the thesis, generalising the expectationmaximisation (EM) algorithm for learning maximum likelihood parameters to the VB EM algorithm which integrates over model parameters. The algorithm is then specialised to the large family of conjugate-exponential (CE) graphical models, and several theorems are presented to pave the road for automated VB derivation procedures in both directed and undirected graphs (Bayesian and Markov networks, respectively). Chapters 3-5 derive and apply the VB EM algorithm to three commonly-used and important models: mixtures of factor analysers, linear dynamical systems, and hidden Markov models. It is shown how model selection tasks such as determining the dimensionality, cardinality, or number of variables are possible using VB approximations. Also explored are methods for combining sampling procedures with variational approximations, to estimate the tightness of VB bounds and to obtain more effective sampling algorithms. Chapter 6 applies VB learning to a long-standing problem of scoring discrete-variable directed acyclic graphs, and compares the performance to annealed importance sampling amongst other methods. Throughout, the VB approximation is compared to other methods including sampling, Cheeseman-Stutz, and asymptotic approximations such as BIC. The thesis concludes with a discussion of evolving directions for model selection including infinite models and alternative approximations to the marginal likelihood.", "year": 2003, "referenceCount": 166, "citationCount": 1900, "influentialCitationCount": 276, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1773821", "name": "Matthew J. Beal"}]}, {"paperId": "cfddbf2e58ec39bd8573a28e718041c79006b8e0", "url": "https://www.semanticscholar.org/paper/cfddbf2e58ec39bd8573a28e718041c79006b8e0", "title": "Machine translation using deep learning: An overview", "abstract": "This Paper reveals the information about Deep Neural Network (DNN) and concept of deep learning in field of natural language processing i.e. machine translation. Now day's DNN is playing major role in machine leaning technics. Recursive recurrent neural network (R2NN) is a best technic for machine learning. It is the combination of recurrent neural network and recursive neural network (such as Recursive auto encoder). This paper presents how to train the recurrent neural network for reordering for source to target language by using Semi-supervised learning methods. Word2vec tool is required to generate word vectors of source language and Auto encoder helps us in reconstruction of the vectors for target language in tree structure. Results of word2vec play an important role in word alignment of the input vectors. RNN structure is very complicated and to train the large data file on word2vec is also a time-consuming task. Hence, a powerful hardware support (GPU) is required. GPU improves the system performance by decreasing training time period.", "year": 2017, "referenceCount": 14, "citationCount": 88, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2108407081", "name": "S. Singh"}, {"authorId": "2109186487", "name": "Ajai Kumar"}, {"authorId": "2992038", "name": "H. Darbari"}, {"authorId": "39259906", "name": "Lenali Singh"}, {"authorId": "31158157", "name": "Anshika Rastogi"}, {"authorId": "49837642", "name": "Shikha Jain"}]}, {"paperId": "1b310cd2322cb14faa7d99038717c313a9441539", "url": "https://www.semanticscholar.org/paper/1b310cd2322cb14faa7d99038717c313a9441539", "title": "Kernel methods in system identification, machine learning and function estimation: A survey", "abstract": null, "year": 2014, "referenceCount": 194, "citationCount": 552, "influentialCitationCount": 35, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1719301", "name": "G. Pillonetto"}, {"authorId": "3125402", "name": "Francesco Dinuzzo"}, {"authorId": "7934735", "name": "Tianshi Chen"}, {"authorId": "7648294", "name": "G. Nicolao"}, {"authorId": "1699388", "name": "L. Ljung"}]}, {"paperId": "454443a6f19a67f2c2e0c0e3ccaabf35884b38ca", "url": "https://www.semanticscholar.org/paper/454443a6f19a67f2c2e0c0e3ccaabf35884b38ca", "title": "Handbook of pattern recognition and image processing", "abstract": "Principles of Computer Vision. Three-Dimensional Shape Representation. Three-Dimensional Shape Recovery from Line Drawings. Recovery of 3D Shape of Curved Objects. Surface Reflection Mechanism. Extracting Shape from Shading. Range Image Analysis. Stereo Vision. Machine Learning of Computer Vision Algorithms. Image Sequence Analysis for 3D Perception of Dynamic Scenes. Nonrigid Motion Analysis. Analysis and Synthesis of Human Movement. Relational Matching. Three-Dimensional Object Recognition. Fundamental Principles of Robot Vision. Chapter References.", "year": 1986, "referenceCount": 0, "citationCount": 357, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1842031", "name": "T. Young"}, {"authorId": "97306284", "name": "K. Fu"}]}, {"paperId": "40063d384be8d0a3a8ade0794e64426fef9d3566", "url": "https://www.semanticscholar.org/paper/40063d384be8d0a3a8ade0794e64426fef9d3566", "title": "MEKA: A Multi-label/Multi-target Extension to WEKA", "abstract": "Multi-label classification has rapidly attracted interest in the machine learning literature, and there are now a large number and considerable variety of methods for this type of learning. We present MEKA: an open-source Java framework based on the well-known WEKA library. MEKA provides interfaces to facilitate practical application, and a wealth of multi-label classifiers, evaluation metrics, and tools for multi-label experiments and development. It supports multi-label and multi-target data, including in incremental and semi-supervised contexts.", "year": 2016, "referenceCount": 11, "citationCount": 188, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39998815", "name": "J. Read"}, {"authorId": "2840271", "name": "P. Reutemann"}, {"authorId": "1737420", "name": "B. Pfahringer"}, {"authorId": "144282963", "name": "G. Holmes"}]}, {"paperId": "361c7858fa8f55928dc6358bc25d18fe3316d735", "url": "https://www.semanticscholar.org/paper/361c7858fa8f55928dc6358bc25d18fe3316d735", "title": "Imperceptible, Robust, and Targeted Adversarial Examples for Automatic Speech Recognition", "abstract": "Adversarial examples are inputs to machine learning models designed by an adversary to cause an incorrect output. So far, adversarial examples have been studied most extensively in the image domain. In this domain, adversarial examples can be constructed by imperceptibly modifying images to cause misclassification, and are practical in the physical world. In contrast, current targeted adversarial examples applied to speech recognition systems have neither of these properties: humans can easily identify the adversarial perturbations, and they are not effective when played over-the-air. This paper makes advances on both of these fronts. First, we develop effectively imperceptible audio adversarial examples (verified through a human study) by leveraging the psychoacoustic principle of auditory masking, while retaining 100% targeted success rate on arbitrary full-sentence targets. Next, we make progress towards physical-world over-the-air audio adversarial examples by constructing perturbations which remain effective even after applying realistic simulated environmental distortions.", "year": 2019, "referenceCount": 29, "citationCount": 255, "influentialCitationCount": 46, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "authors": [{"authorId": "145592705", "name": "Yao Qin"}, {"authorId": "2483738", "name": "Nicholas Carlini"}, {"authorId": "153440022", "name": "Ian J. Goodfellow"}, {"authorId": "48524582", "name": "G. Cottrell"}, {"authorId": "2402716", "name": "Colin Raffel"}]}, {"paperId": "a058935fd019c2367fd32c16cd1ce6983a29aafb", "url": "https://www.semanticscholar.org/paper/a058935fd019c2367fd32c16cd1ce6983a29aafb", "title": "Efficient mini-batch training for stochastic optimization", "abstract": "Stochastic gradient descent (SGD) is a popular technique for large-scale optimization problems in machine learning. In order to parallelize SGD, minibatch training needs to be employed to reduce the communication cost. However, an increase in minibatch size typically decreases the rate of convergence. This paper introduces a technique based on approximate optimization of a conservatively regularized objective function within each minibatch. We prove that the convergence rate does not decrease with increasing minibatch size. Experiments demonstrate that with suitable implementations of approximate optimization, the resulting algorithm can outperform standard SGD in many scenarios.", "year": 2014, "referenceCount": 28, "citationCount": 607, "influentialCitationCount": 33, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2124778071", "name": "Mu Li"}, {"authorId": "38144094", "name": "T. Zhang"}, {"authorId": "2143412706", "name": "Yuqiang Chen"}, {"authorId": "46234526", "name": "Alex Smola"}]}, {"paperId": "544e86212be7138b17ca00262973b9e9582b4b31", "url": "https://www.semanticscholar.org/paper/544e86212be7138b17ca00262973b9e9582b4b31", "title": "Nonlinear difference-differential equations in prediction and learning theory.", "abstract": "1. Introduction.-This note introduces some nonlinear difference-differential equations which can be interpreted as a learning theory or, alternatively, as a prediction theory whose goal is to discuss the prediction of individual events, in a fixed order, and at prescribed times. The theory provides a mathematical description of the following kind of experiment. An experimenter g, confronted by a machine MlZ, presents M with a list of \"letters\" or \"events\" to be learned. Suppose, for example, that g wishes to teach 9Mt the list of letters AB, or to predict the event B, given the event A. g does this by presenting A and then B to M several times. To find out if SE has learned the list as a result of these list presentations, the letter A alone is then presented to M. If M responds with the letter B, and M does this whenever A alone is said, then we have good evidence that MR has indeed learned the list AB. Thus M learns to predict the event B whenever the event A occurs as a result of repeated presentations of the list AB. We will introduce some mathematical machines that learn lists in the above manner. These machines have some properties that have a familiar intuitive interpretation. For example, in our simplest machine, it is possible to make rigorous the heuristic statements that (1) \"practice makes perfect,\" (2) an isolated system suffers no memory loss, (3) an isolated system remembers without practicing overtly, (4) the memory of an isolated system sometimes spontaneously improves without practice, (5) all errors can be corrected, although the rate of correction is sometimes diminished by response interference due to prior learning, (6) increasing the number of response alternatives sometimes diminishes the learning rate, and so on. All of the machines we will introduce possess the same dynamical laws. Nonetheless , the exact manner in which a given machine learns and remembers depends crucially on the particular way in which the components of the machine are interconnected ; i.e., on its \"geometry.\" For example, properties (2) and (3) above do not hold in all the machines we shall describe. In this note, we will sketch some results for our simplest machine. These results, along with results for more complicated machines, are described in greater detail in another place.' 2. The Nonlinear Systems.-Each of our machines M is described in terms of a", "year": 1967, "referenceCount": 4, "citationCount": 115, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Medicine"], "authors": [{"authorId": "1682174", "name": "S. Grossberg"}]}, {"paperId": "d0f95a9ae047ca69ca30b0ca88be7387b2074c23", "url": "https://www.semanticscholar.org/paper/d0f95a9ae047ca69ca30b0ca88be7387b2074c23", "title": "A Machine Learning Approach to Software Requirements Prioritization", "abstract": "Deciding which, among a set of requirements, are to be considered first and in which order is a strategic process in software development. This task is commonly referred to as requirements prioritization. This paper describes a requirements prioritization method called Case-Based Ranking (CBRank), which combines project's stakeholders preferences with requirements ordering approximations computed through machine learning techniques, bringing promising advantages. First, the human effort to input preference information can be reduced, while preserving the accuracy of the final ranking estimates. Second, domain knowledge encoded as partial order relations defined over the requirement attributes can be exploited, thus supporting an adaptive elicitation process. The techniques CBRank rests on and the associated prioritization process are detailed. Empirical evaluations of properties of CBRank are performed on simulated data and compared with a state-of-the-art prioritization method, providing evidence of the method ability to support the management of the tradeoff between elicitation effort and ranking accuracy and to exploit domain knowledge. A case study on a real software project complements these experimental measurements. Finally, a positioning of CBRank with respect to state-of-the-art requirements prioritization methods is proposed, together with a discussion of benefits and limits of the method.", "year": 2013, "referenceCount": 43, "citationCount": 138, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144124986", "name": "A. Perini"}, {"authorId": "145030257", "name": "A. Susi"}, {"authorId": "1744234", "name": "P. Avesani"}]}, {"paperId": "5966d7c7f60898d610812e24c64d4d57855ad86a", "url": "https://www.semanticscholar.org/paper/5966d7c7f60898d610812e24c64d4d57855ad86a", "title": "Semantics derived automatically from language corpora necessarily contain human biases", "abstract": "Artificial intelligence and machine learning are in a period of astounding growth. However, there are concerns that these technologies may be used, either with or without intention, to perpetuate the prejudice and unfairness that unfortunately characterizes many human institutions. Here we show for the first time that human-like semantic biases result from the application of standard machine learning to ordinary language---the same sort of language humans are exposed to every day. We replicate a spectrum of standard human biases as exposed by the Implicit Association Test and other well-known psychological studies. We replicate these using a widely used, purely statistical machine-learning model---namely, the GloVe word embedding---trained on a corpus of text from the Web. Our results indicate that language itself contains recoverable and accurate imprints of our historic biases, whether these are morally neutral as towards insects or flowers, problematic as towards race or gender, or even simply veridical, reflecting the status quo for the distribution of gender with respect to careers or first names. These regularities are captured by machine learning along with the rest of semantics. In addition to our empirical findings concerning language, we also contribute new methods for evaluating bias in text, the Word Embedding Association Test (WEAT) and the Word Embedding Factual Association Test (WEFAT). Our results have implications not only for AI and machine learning, but also for the fields of psychology, sociology, and human ethics, since they raise the possibility that mere exposure to everyday language can account for the biases we replicate here.", "year": 2016, "referenceCount": 58, "citationCount": 117, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144537437", "name": "Aylin Caliskan"}, {"authorId": "145315445", "name": "J. Bryson"}, {"authorId": "47735253", "name": "A. Narayanan"}]}, {"paperId": "3aa1b70fdc97ae96091c5fb39cd911015ac5253e", "url": "https://www.semanticscholar.org/paper/3aa1b70fdc97ae96091c5fb39cd911015ac5253e", "title": "Novel methods improve prediction of species' distributions from occurrence data", "abstract": "Prediction of species' distributions is central to diverse applications in ecology, evolution and conservation science. There is increasing electronic access to vast sets of occurrence records in museums and herbaria, yet little effective guidance on how best to use this information in the context of numerous approaches for modelling distributions. To meet this need, we compared 16 modelling methods over 226 species from 6 regions of the world, creating the most comprehensive set of model comparisons to date. We used presence-only data to fit models, and independent presence-absence data to evaluate the predictions. Along with well-established modelling methods such as generalised additive models and GARP and BIOCLIM, we explored methods that either have been developed recently or have rarely been applied to modelling species' distributions. These include machine-learning methods and community models, both of which have features that may make them particularly well suited to noisy or sparse information, as is typical of species' occurrence data. Presence-only data were effective for modelling species' distributions for many species and regions. The novel methods consistently outperformed more established methods. The results of our analysis are promising for the use of data from museums and herbaria, especially as methods suited to the noise inherent in such data improve.", "year": 2006, "referenceCount": 118, "citationCount": 7293, "influentialCitationCount": 599, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2686171", "name": "J. Elith"}, {"authorId": "50488198", "name": "C. Graham"}, {"authorId": "145803736", "name": "Robert P. Anderson"}, {"authorId": "144652072", "name": "Miroslav Dudík"}, {"authorId": "2147861", "name": "S. Ferrier"}, {"authorId": "1830349", "name": "A. Guisan"}, {"authorId": "2130462", "name": "R. Hijmans"}, {"authorId": "2628877", "name": "F. Huettmann"}, {"authorId": "4429495", "name": "J. Leathwick"}, {"authorId": "2771547", "name": "A. Lehmann"}, {"authorId": "2118398703", "name": "Jin Li"}, {"authorId": "1718656", "name": "L. Lohmann"}, {"authorId": "5249055", "name": "B. Loiselle"}, {"authorId": "4453374", "name": "G. Manion"}, {"authorId": "47729929", "name": "C. Moritz"}, {"authorId": "46292352", "name": "Miguel Nakamura"}, {"authorId": "9467398", "name": "Y. Nakazawa"}, {"authorId": "46584835", "name": "J. Overton"}, {"authorId": "143794119", "name": "A. Peterson"}, {"authorId": "30352875", "name": "Steven J. Phillips"}, {"authorId": "30271605", "name": "K. Richardson"}, {"authorId": "1403810063", "name": "R. Scachetti-Pereira"}, {"authorId": "1716301", "name": "R. Schapire"}, {"authorId": "145285455", "name": "Jorge Soberón"}, {"authorId": "144242153", "name": "S. Williams"}, {"authorId": "46409715", "name": "M. Wisz"}, {"authorId": "34674791", "name": "N. Zimmermann"}]}, {"paperId": "f9622f2f3ce645303435c576b920258bff0c83c6", "url": "https://www.semanticscholar.org/paper/f9622f2f3ce645303435c576b920258bff0c83c6", "title": "Ranking Chemical Structures for Drug Discovery: A New Machine Learning Approach", "abstract": "With chemical libraries increasingly containing millions of compounds or more, there is a fast-growing need for computational methods that can rank or prioritize compounds for screening. Machine learning methods have shown considerable promise for this task; indeed, classification methods such as support vector machines (SVMs), together with their variants, have been used in virtual screening to distinguish active compounds from inactive ones, while regression methods such as partial least-squares (PLS) and support vector regression (SVR) have been used in quantitative structure-activity relationship (QSAR) analysis for predicting biological activities of compounds. Recently, a new class of machine learning methods - namely, ranking methods, which are designed to directly optimize ranking performance - have been developed for ranking tasks such as web search that arise in information retrieval (IR) and other applications. Here we report the application of these new ranking methods in machine learning to the task of ranking chemical structures. Our experiments show that the new ranking methods give better ranking performance than both classification based methods in virtual screening and regression methods in QSAR analysis. We also make some interesting connections between ranking performance measures used in cheminformatics and those used in IR studies.", "year": 2010, "referenceCount": 62, "citationCount": 112, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2797063", "name": "S. Agarwal"}, {"authorId": "2053583", "name": "Deepak Dugar"}, {"authorId": "145593976", "name": "Shiladitya Sengupta"}]}, {"paperId": "319d5e5e51c8b7fab0e1364b065fefc75b091814", "url": "https://www.semanticscholar.org/paper/319d5e5e51c8b7fab0e1364b065fefc75b091814", "title": "Modeling maize above-ground biomass based on machine learning approaches using UAV remote-sensing data", "abstract": null, "year": 2019, "referenceCount": 93, "citationCount": 165, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2118502414", "name": "Liang Han"}, {"authorId": "34831475", "name": "Guijun Yang"}, {"authorId": "3300393", "name": "Huayang Dai"}, {"authorId": "143778544", "name": "Bo Xu"}, {"authorId": "2115537296", "name": "Hao Yang"}, {"authorId": "2156262", "name": "Haikuan Feng"}, {"authorId": "48458509", "name": "Zhenhai Li"}, {"authorId": "2115881391", "name": "Xiaodong Yang"}]}, {"paperId": "fa285fe4f10ffd91327c081942474d928ddd9ba7", "url": "https://www.semanticscholar.org/paper/fa285fe4f10ffd91327c081942474d928ddd9ba7", "title": "A note on scheduling problems with learning effect and deteriorating jobs", "abstract": "In this note, we consider the machine scheduling problems with the effects of deterioration and learning. In this model, job processing times are defined by functions of their starting times and positions in the sequence. The scheduling objectives are makespan (weighted) sum of completion times and maximum lateness. It is shown that even with the introduction of deterioration and learning effect to job processing times, several single machine problems and several flow shop problems remain polynomially solvable, respectively.", "year": 2006, "referenceCount": 32, "citationCount": 116, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109720245", "name": "J.-B. Wang"}]}, {"paperId": "431e61648a59abcd05411503ead56de8aa97906b", "url": "https://www.semanticscholar.org/paper/431e61648a59abcd05411503ead56de8aa97906b", "title": "PLOW: A Collaborative Task Learning Agent", "abstract": "To be effective, an agent that collaborates with humans needs to be able to learn new tasks from humans they work with. This paper describes a system that learns executable task models from a single collaborative learning session consisting of demonstration, explanation and dialogue. To accomplish this, the system integrates a range of AI technologies: deep natural language understanding, knowledge representation and reasoning, dialogue systems, planning/agent-based systems and machine learning. A formal evaluation shows the approach has great promise.", "year": 2007, "referenceCount": 16, "citationCount": 191, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145844737", "name": "James F. Allen"}, {"authorId": "1729918", "name": "Nathanael Chambers"}, {"authorId": "144436424", "name": "G. Ferguson"}, {"authorId": "1686309", "name": "Lucian Galescu"}, {"authorId": "35170241", "name": "Hyuckchul Jung"}, {"authorId": "2153684", "name": "Mary D. Swift"}, {"authorId": "2434425", "name": "William Taysom"}]}, {"paperId": "793e086cae5a0d5fa006d7fda4fcaeecbf8385f0", "url": "https://www.semanticscholar.org/paper/793e086cae5a0d5fa006d7fda4fcaeecbf8385f0", "title": "Identification of Three Rheumatoid Arthritis Disease Subtypes by Machine Learning Integration of Synovial Histologic Features and RNA Sequencing Data", "abstract": "In this study, we sought to refine histologic scoring of rheumatoid arthritis (RA) synovial tissue by training with gene expression data and machine learning.", "year": 2018, "referenceCount": 52, "citationCount": 110, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2806935", "name": "D. Orange"}, {"authorId": "3281341", "name": "P. Agius"}, {"authorId": "4908435", "name": "E. Dicarlo"}, {"authorId": "2687232", "name": "N. Robine"}, {"authorId": "144064361", "name": "Heather Geiger"}, {"authorId": "3954940", "name": "J. Szymonifka"}, {"authorId": "2083600", "name": "Michael McNamara"}, {"authorId": "47814248", "name": "Ryan Cummings"}, {"authorId": "21408531", "name": "K. Andersen"}, {"authorId": "38524003", "name": "S. Mirza"}, {"authorId": "7482104", "name": "M. Figgie"}, {"authorId": "5327048", "name": "L. Ivashkiv"}, {"authorId": "1966530", "name": "A. Pernis"}, {"authorId": "32811357", "name": "Caroline S. Jiang"}, {"authorId": "14709484", "name": "M. Frank"}, {"authorId": "5836529", "name": "R. Darnell"}, {"authorId": "35678861", "name": "Nithya Lingampali"}, {"authorId": "4667569", "name": "W. Robinson"}, {"authorId": "4241618", "name": "E. Gravallese"}, {"authorId": "6731582", "name": "V. Bykerk"}, {"authorId": "4633706", "name": "S. Goodman"}, {"authorId": "6166972", "name": "L. Donlin"}]}, {"paperId": "47dba082b66346de861b474f8dd8a626b4f96aa3", "url": "https://www.semanticscholar.org/paper/47dba082b66346de861b474f8dd8a626b4f96aa3", "title": "Using Twitter to Examine Smoking Behavior and Perceptions of Emerging Tobacco Products", "abstract": "Background Social media platforms such as Twitter are rapidly becoming key resources for public health surveillance applications, yet little is known about Twitter users’ levels of informedness and sentiment toward tobacco, especially with regard to the emerging tobacco control challenges posed by hookah and electronic cigarettes. Objective To develop a content and sentiment analysis of tobacco-related Twitter posts and build machine learning classifiers to detect tobacco-relevant posts and sentiment towards tobacco, with a particular focus on new and emerging products like hookah and electronic cigarettes. Methods We collected 7362 tobacco-related Twitter posts at 15-day intervals from December 2011 to July 2012. Each tweet was manually classified using a triaxial scheme, capturing genre, theme, and sentiment. Using the collected data, machine-learning classifiers were trained to detect tobacco-related vs irrelevant tweets as well as positive vs negative sentiment, using Naïve Bayes, k-nearest neighbors, and Support Vector Machine (SVM) algorithms. Finally, phi contingency coefficients were computed between each of the categories to discover emergent patterns. Results The most prevalent genres were first- and second-hand experience and opinion, and the most frequent themes were hookah, cessation, and pleasure. Sentiment toward tobacco was overall more positive (1939/4215, 46% of tweets) than negative (1349/4215, 32%) or neutral among tweets mentioning it, even excluding the 9% of tweets categorized as marketing. Three separate metrics converged to support an emergent distinction between, on one hand, hookah and electronic cigarettes corresponding to positive sentiment, and on the other hand, traditional tobacco products and more general references corresponding to negative sentiment. These metrics included correlations between categories in the annotation scheme (phihookah-positive=0.39; phie-cigs-positive=0.19); correlations between search keywords and sentiment (χ2 4=414.50, P<.001, Cramer’s V=0.36), and the most discriminating unigram features for positive and negative sentiment ranked by log odds ratio in the machine learning component of the study. In the automated classification tasks, SVMs using a relatively small number of unigram features (500) achieved best performance in discriminating tobacco-related from unrelated tweets (F score=0.85). Conclusions Novel insights available through Twitter for tobacco surveillance are attested through the high prevalence of positive sentiment. This positive sentiment is correlated in complex ways with social image, personal experience, and recently popular products such as hookah and electronic cigarettes. Several apparent perceptual disconnects between these products and their health effects suggest opportunities for tobacco control education. Finally, machine classification of tobacco-related posts shows a promising edge over strictly keyword-based approaches, yielding an improved signal-to-noise ratio in Twitter data and paving the way for automated tobacco surveillance applications.", "year": 2013, "referenceCount": 47, "citationCount": 299, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "2913436", "name": "Mark Myslín"}, {"authorId": "32010307", "name": "Shu-Hong Zhu"}, {"authorId": "2640115", "name": "W. Chapman"}, {"authorId": "144494734", "name": "Mike Conway"}]}, {"paperId": "67a09f2a68726f676b05a6f15635c566218db373", "url": "https://www.semanticscholar.org/paper/67a09f2a68726f676b05a6f15635c566218db373", "title": "Mining e-mail content for author identification forensics", "abstract": "We describe an investigation into e-mail content mining for author identification, or authorship attribution, for the purpose of forensic investigation. We focus our discussion on the ability to discriminate between authors for the case of both aggregated e-mail topics as well as across different e-mail topics. An extended set of e-mail document features including structural characteristics and linguistic patterns were derived and, together with a Support Vector Machine learning algorithm, were used for mining the e-mail content. Experiments using a number of e-mail documents generated by different authors on a set of topics gave promising results for both aggregated and multi-topic author categorisation.", "year": 2001, "referenceCount": 47, "citationCount": 594, "influentialCitationCount": 41, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1790642", "name": "O. Vel"}, {"authorId": "2082390228", "name": "Alison Anderson"}, {"authorId": "3218002", "name": "M. Corney"}, {"authorId": "3173519", "name": "G. Mohay"}]}, {"paperId": "f68aef458e0b67176c86e618048d6ee6ba163006", "url": "https://www.semanticscholar.org/paper/f68aef458e0b67176c86e618048d6ee6ba163006", "title": "Beam search algorithms for multilabel learning", "abstract": null, "year": 2013, "referenceCount": 54, "citationCount": 70, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109224633", "name": "Abhishek Kumar"}, {"authorId": "2823706", "name": "Shankar Vembu"}, {"authorId": "2844480", "name": "A. Menon"}, {"authorId": "1722831", "name": "C. Elkan"}]}, {"paperId": "e82b1355a597bd5795c387beafb961b12de73331", "url": "https://www.semanticscholar.org/paper/e82b1355a597bd5795c387beafb961b12de73331", "title": "Indoor Place Recognition using Online Independent Support Vector Machines", "abstract": "In the framework of indoor mobile robotics, place recognition is a challenging task, where it is crucial that self-localization be enforced precisely, notwithstanding the changing conditions of illumination, objects being shifted around and/or people affecting the appearance of the scene. In this scenario online learning seems the main way out, thanks to the possibility of adapting to changes in a smart and flexible way. Nevertheless, standard machine learning approaches usually suffer when confronted with massive amounts of data and when asked to work online. Online learning requires a high training and testing speed, all the more in place recognition, where a continuous flow of data comes from one or more cameras. In this paper we follow the Support Vector Machines-based approach of Pronobis et al., proposing an improvement that we call Online Independent Support Vector Machines. This technique exploits linear independence in the image feature space to incrementally keep the size of the learning machine remarkably small while retaining the accuracy of a standard machine. Since the training and testing time crucially depend on the size of the machine, this solves the above stated problems. Our experimental results prove the effectiveness of the approach.", "year": 2007, "referenceCount": 33, "citationCount": 37, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1721068", "name": "Francesco Orabona"}, {"authorId": "1743399", "name": "Claudio Castellini"}]}, {"paperId": "cef206029e2a925e0754d23651ab228d5904d481", "url": "https://www.semanticscholar.org/paper/cef206029e2a925e0754d23651ab228d5904d481", "title": "A tutorial on -support vector machines", "abstract": "We briefly describe the main ideas of statistical learning theory, support vector machines (SVMs), and kernel feature spaces. We place particular emphasis on a description of the so-called -SVM, in...", "year": 2005, "referenceCount": 38, "citationCount": 125, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "1897534699", "name": "ChenPai-Hsuen"}, {"authorId": "1643819532", "name": "LinChih-Jen"}, {"authorId": "1643791277", "name": "SchölkopfBernhard"}]}, {"paperId": "5460c1cde49a0d89575f9b4e59d51c06139f436b", "url": "https://www.semanticscholar.org/paper/5460c1cde49a0d89575f9b4e59d51c06139f436b", "title": "Jet-images — deep learning edition", "abstract": null, "year": 2015, "referenceCount": 50, "citationCount": 252, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics"], "authors": [{"authorId": "8972778", "name": "Luke de Oliveira"}, {"authorId": "11413078", "name": "M. Kagan"}, {"authorId": "143722101", "name": "Lester W. Mackey"}, {"authorId": "3085579", "name": "B. Nachman"}, {"authorId": "69907043", "name": "A. Schwartzman"}]}, {"paperId": "cb97106a2023da394c2ff1be0139258c042142ed", "url": "https://www.semanticscholar.org/paper/cb97106a2023da394c2ff1be0139258c042142ed", "title": "Tool condition monitoring using spectral subtraction and convolutional neural networks in milling process", "abstract": null, "year": 2018, "referenceCount": 39, "citationCount": 92, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46555313", "name": "F. Aghazadeh"}, {"authorId": "8244864", "name": "Antoine Tahan"}, {"authorId": "143758963", "name": "Marc Thomas"}]}, {"paperId": "244b8e2be78d613f40a783ea0073bbd9a8efd04d", "url": "https://www.semanticscholar.org/paper/244b8e2be78d613f40a783ea0073bbd9a8efd04d", "title": "Machine learning and clinical epigenetics: a review of challenges for diagnosis and classification", "abstract": null, "year": 2020, "referenceCount": 115, "citationCount": 51, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "9815061", "name": "S. Rauschert"}, {"authorId": "90930236", "name": "K. Raubenheimer"}, {"authorId": "5263203", "name": "P. Melton"}, {"authorId": "144102040", "name": "R. Huang"}]}, {"paperId": "440e73c3619a6f9403d7ac31a14718b7b567e83c", "url": "https://www.semanticscholar.org/paper/440e73c3619a6f9403d7ac31a14718b7b567e83c", "title": "FEMa: a finite element machine for fast learning", "abstract": null, "year": 2019, "referenceCount": 49, "citationCount": 93, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50811360", "name": "Danilo R. Pereira"}, {"authorId": "2093719714", "name": "M. A. Piteri"}, {"authorId": "144316283", "name": "A. Souza"}, {"authorId": "1759037", "name": "J. Papa"}, {"authorId": "1750050", "name": "H. Adeli"}]}, {"paperId": "487a65b5e4e1c0e2dc5e5de898891053d208017a", "url": "https://www.semanticscholar.org/paper/487a65b5e4e1c0e2dc5e5de898891053d208017a", "title": "Estimating Individualized Treatment Rules Using Outcome Weighted Learning", "abstract": "There is increasing interest in discovering individualized treatment rules (ITRs) for patients who have heterogeneous responses to treatment. In particular, one aims to find an optimal ITR that is a deterministic function of patient-specific characteristics maximizing expected clinical outcome. In this article, we first show that estimating such an optimal treatment rule is equivalent to a classification problem where each subject is weighted proportional to his or her clinical outcome. We then propose an outcome weighted learning approach based on the support vector machine framework. We show that the resulting estimator of the treatment rule is consistent. We further obtain a finite sample bound for the difference between the expected outcome using the estimated ITR and that of the optimal treatment rule. The performance of the proposed approach is demonstrated via simulation studies and an analysis of chronic depression data.", "year": 2012, "referenceCount": 50, "citationCount": 566, "influentialCitationCount": 92, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "88823233", "name": "Ying‐Qi Zhao"}, {"authorId": "145810704", "name": "D. Zeng"}, {"authorId": "2082382107", "name": "A. Rush"}, {"authorId": "2560724", "name": "M. Kosorok"}]}, {"paperId": "f2339cab222de05377f40858d549f53cfd34f804", "url": "https://www.semanticscholar.org/paper/f2339cab222de05377f40858d549f53cfd34f804", "title": "Machine learning in radiation oncology : theory and applications", "abstract": "Introduction: What is Machine Learning.- Computational Learning Theory.- Overview of Supervised Learning Methods.- Overview of Unsupervised Learning Methods.- Performance Evaluation.- Variety of Applications in Radiation Oncology.- Machine Learning for Quality Assurance: Quality Assurance as a Learning Problem.- Detection of Radiotherapy Errors Using Unsupervised Learning.- Prediction of Radiotherapy Errors Using Supervised Learning.- Machine Learning for Computer-Aided Detection: Detection of Cancer Lesions from Imaging.- Classification of Malignant and Benign Tumours.- Machine Learning for Treatment Planning and Delivery.- Image-guided Radiotherapy with Machine Learning: IMRT Optimization Using Machine Learning.- Treatment Assessment Tools.- Machine Learning for Motion Management: Prediction of Respiratory Motion.- Motion-Correction Using Learning Methods.- Machine Learning Application in 4D-CT.- Machine Learning Application in Dynamic Delivery.- Machine Learning for Outcomes Modeling: Bioinformatics of Treatment Response.- Modelling of Norma Tissue Complication Probabilities (NTCP).- Modelling of Tumour Control Probability (TCP).", "year": 2015, "referenceCount": 0, "citationCount": 33, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2571273", "name": "I. E. Naqa"}, {"authorId": "1736607", "name": "Ruijiang Li"}, {"authorId": "30436861", "name": "M. Murphy"}]}, {"paperId": "758311575a6385bb15d4f9af8c0e671cb98184b4", "url": "https://www.semanticscholar.org/paper/758311575a6385bb15d4f9af8c0e671cb98184b4", "title": "From Language to Goals: Inverse Reinforcement Learning for Vision-Based Instruction Following", "abstract": "Reinforcement learning is a promising framework for solving control problems, but its use in practical situations is hampered by the fact that reward functions are often difficult to engineer. Specifying goals and tasks for autonomous machines, such as robots, is a significant challenge: conventionally, reward functions and goal states have been used to communicate objectives. But people can communicate objectives to each other simply by describing or demonstrating them. How can we build learning algorithms that will allow us to tell machines what we want them to do? In this work, we investigate the problem of grounding language commands as reward functions using inverse reinforcement learning, and argue that language-conditioned rewards are more transferable than language-conditioned policies to new environments. We propose language-conditioned reward learning (LC-RL), which grounds language commands as a reward function represented by a deep neural network. We demonstrate that our model learns rewards that transfer to novel tasks and environments on realistic, high-dimensional visual environments with natural language commands, whereas directly learning a language-conditioned policy leads to poor performance.", "year": 2019, "referenceCount": 29, "citationCount": 81, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2550764", "name": "Justin Fu"}, {"authorId": "34786378", "name": "A. Balan"}, {"authorId": "1736651", "name": "S. Levine"}, {"authorId": "1687120", "name": "S. Guadarrama"}]}, {"paperId": "1d5dcccf1ffba91437a2381c55796e49d6166c7e", "url": "https://www.semanticscholar.org/paper/1d5dcccf1ffba91437a2381c55796e49d6166c7e", "title": "Is Extreme Learning Machine Feasible? A Theoretical Assessment (Part I)", "abstract": "An extreme learning machine (ELM) is a feedforward neural network (FNN) like learning system whose connections with output neurons are adjustable, while the connections with and within hidden neurons are randomly fixed. Numerous applications have demonstrated the feasibility and high efficiency of ELM-like systems. It has, however, been open if this is true for any general applications. In this two-part paper, we conduct a comprehensive feasibility analysis of ELM. In Part I, we provide an answer to the question by theoretically justifying the following: 1) for some suitable activation functions, such as polynomials, Nadaraya-Watson and sigmoid functions, the ELM-like systems can attain the theoretical generalization bound of the FNNs with all connections adjusted, i.e., they do not degrade the generalization capability of the FNNs even when the connections with and within hidden neurons are randomly fixed; 2) the number of hidden neurons needed for an ELM-like system to achieve the theoretical bound can be estimated; and 3) whenever the activation function is taken as polynomial, the deduced hidden layer output matrix is of full column-rank, therefore the generalized inverse technique can be efficiently applied to yield the solution of an ELM-like system, and, furthermore, for the nonpolynomial case, the Tikhonov regularization can be applied to guarantee the weak regularity while not sacrificing the generalization capability. In Part II, however, we reveal a different aspect of the feasibility of ELM: there also exists some activation functions, which makes the corresponding ELM degrade the generalization capability. The obtained results underlie the feasibility and efficiency of ELM-like systems, and yield various generalizations and improvements of the systems as well.", "year": 2015, "referenceCount": 57, "citationCount": 170, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2110880625", "name": "Xia Liu"}, {"authorId": "2432506", "name": "Shaobo Lin"}, {"authorId": "2115378715", "name": "Jian Fang"}, {"authorId": "98220533", "name": "Zongben Xu"}]}, {"paperId": "17f70b9d1fcf3b31948ffa578ac89399751fe73d", "url": "https://www.semanticscholar.org/paper/17f70b9d1fcf3b31948ffa578ac89399751fe73d", "title": "Petuum: A New Platform for Distributed Machine Learning on Big Data", "abstract": "What is a systematic way to efficiently apply a wide spectrum of advanced ML programs to industrial scale problems, using Big Models (up to 100 s of billions of parameters) on Big Data (up to terabytes or petabytes)? Modern parallelization strategies employ fine-grained operations and scheduling beyond the classic bulk-synchronous processing paradigm popularized by MapReduce, or even specialized graph-based execution that relies on graph representations of ML programs. The variety of approaches tends to pull systems and algorithms design in different directions, and it remains difficult to find a universal platform applicable to a wide range of ML programs at scale. We propose a general-purpose framework, Petuum, that systematically addresses data- and model-parallel challenges in large-scale ML, by observing that many ML programs are fundamentally optimization-centric and admit error-tolerant, iterative-convergent algorithmic solutions. This presents unique opportunities for an integrative system design, such as bounded-error network synchronization and dynamic scheduling based on ML program structure. We demonstrate the efficacy of these system designs versus well-known implementations of modern ML algorithms, showing that Petuum allows ML programs to run in much less time and at considerably larger model sizes, even on modestly-sized compute clusters.", "year": 2013, "referenceCount": 74, "citationCount": 468, "influentialCitationCount": 48, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143977260", "name": "E. Xing"}, {"authorId": "1707357", "name": "Qirong Ho"}, {"authorId": "143716171", "name": "Wei Dai"}, {"authorId": "2152674455", "name": "Jin Kyu Kim"}, {"authorId": "1766143", "name": "Jinliang Wei"}, {"authorId": "1739906504", "name": "Seunghak Lee"}, {"authorId": "2496226", "name": "Xun Zheng"}, {"authorId": "40526720", "name": "P. Xie"}, {"authorId": "1776255", "name": "Abhimanu Kumar"}, {"authorId": "40508553", "name": "Yaoliang Yu"}]}, {"paperId": "9906692b7590a724f0ab3ae6831567efe69586c6", "url": "https://www.semanticscholar.org/paper/9906692b7590a724f0ab3ae6831567efe69586c6", "title": "Pixel-Based Machine Learning in Medical Imaging", "abstract": "Machine learning (ML) plays an important role in the medical imaging field, including medical image analysis and computer-aided diagnosis, because objects such as lesions and organs may not be represented accurately by a simple equation; thus, medical pattern recognition essentially require “learning from examples.” One of the most popular uses of ML is classification of objects such as lesions into certain classes (e.g., abnormal or normal, or lesions or nonlesions) based on input features (e.g., contrast and circularity) obtained from segmented object candidates. Recently, pixel/voxel-based ML (PML) emerged in medical image processing/analysis, which use pixel/voxel values in images directly instead of features calculated from segmented objects as input information; thus, feature calculation or segmentation is not required. Because the PML can avoid errors caused by inaccurate feature calculation and segmentation which often occur for subtle or complex objects, the performance of the PML can potentially be higher for such objects than that of common classifiers (i.e., feature-based MLs). In this paper, PMLs are surveyed to make clear (a) classes of PMLs, (b) similarities and differences within (among) different PMLs and those between PMLs and feature-based MLs, (c) advantages and limitations of PMLs, and (d) their applications in medical imaging.", "year": 2012, "referenceCount": 119, "citationCount": 82, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2118855751", "name": "Kenji Suzuki"}]}, {"paperId": "43dd2df0a123fedb022d353892713cd2eec7a6b4", "url": "https://www.semanticscholar.org/paper/43dd2df0a123fedb022d353892713cd2eec7a6b4", "title": "Learning-based approach for online lane change intention prediction", "abstract": "Predicting driver behavior is a key component for Advanced Driver Assistance Systems (ADAS). In this paper, a novel approach based on Support Vector Machine and Bayesian filtering is proposed for online lane change intention prediction. The approach uses the multiclass probabilistic outputs of the Support Vector Machine as an input to the Bayesian filter, and the output of the Bayesian filter is used for the final prediction of lane changes. A lane tracker integrated in a passenger vehicle is used for real-world data collection for the purpose of training and testing. Data from different drivers on different highways were used to evaluate the robustness of the approach. The results demonstrate that the proposed approach is able to predict driver intention to change lanes on average 1.3 seconds in advance, with a maximum prediction horizon of 3.29 seconds.", "year": 2013, "referenceCount": 25, "citationCount": 271, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "2107908359", "name": "Puneet Kumar"}, {"authorId": "2009249", "name": "M. Perrollaz"}, {"authorId": "3161482", "name": "S. Lefèvre"}, {"authorId": "1727574", "name": "C. Laugier"}]}, {"paperId": "73b226ea356f14e6751f16871da2e357a7989990", "url": "https://www.semanticscholar.org/paper/73b226ea356f14e6751f16871da2e357a7989990", "title": "Learning To Simulate", "abstract": "Simulation is a useful tool in situations where training data for machine learning models is costly to annotate or even hard to acquire. In this work, we propose a reinforcement learning-based method for automatically adjusting the parameters of any (non-differentiable) simulator, thereby controlling the distribution of synthesized data in order to maximize the accuracy of a model trained on that data. In contrast to prior art that hand-crafts these simulation parameters or adjusts only parts of the available parameters, our approach fully controls the simulator with the actual underlying goal of maximizing accuracy, rather than mimicking the real data distribution or randomly generating a large volume of data. We find that our approach (i) quickly converges to the optimal simulation parameters in controlled experiments and (ii) can indeed discover good sets of parameters for an image rendering simulator in actual computer vision applications.", "year": 2018, "referenceCount": 28, "citationCount": 79, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "31601235", "name": "Nataniel Ruiz"}, {"authorId": "1790643", "name": "S. Schulter"}, {"authorId": "2099305", "name": "Manmohan Chandraker"}]}, {"paperId": "898a69a4d648eee8df0aafe33a39d9c96a0374a6", "url": "https://www.semanticscholar.org/paper/898a69a4d648eee8df0aafe33a39d9c96a0374a6", "title": "Learning Categories From Few Examples With Multi Model Knowledge Transfer", "abstract": "Learning a visual object category from few samples is a compelling and challenging problem. In several real-world applications collecting many annotated data is costly and not always possible. However, a small training set does not allow to cover the high intraclass variability typical of visual objects. In this condition, machine learning methods provide very few guarantees. This paper presents a discriminative model adaptation algorithm able to proficiently learn a target object with few examples by relying on other previously learned source categories. The proposed method autonomously chooses from where and how much to transfer information by solving a convex optimization problem which ensures to have the minimal leave-one-out error on the available training set. We analyze several properties of the described approach and perform an extensive experimental comparison with other existing transfer solutions, consistently showing the value of our algorithm.", "year": 2014, "referenceCount": 65, "citationCount": 156, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2087226", "name": "T. Tommasi"}, {"authorId": "1721068", "name": "Francesco Orabona"}, {"authorId": "3033284", "name": "B. Caputo"}]}, {"paperId": "e108baaa96b856314597979cb11c6dc8c030a52f", "url": "https://www.semanticscholar.org/paper/e108baaa96b856314597979cb11c6dc8c030a52f", "title": "Automated measurement of mouse social behaviors using depth sensing, video tracking, and machine learning", "abstract": "Significance Accurate, quantitative measurement of animal social behaviors is critical, not only for researchers in academic institutions studying social behavior and related mental disorders, but also for pharmaceutical companies developing drugs to treat disorders affecting social interactions, such as autism and schizophrenia. Here we describe an integrated hardware and software system that combines video tracking, depth-sensing technology, machine vision, and machine learning to automatically detect and score innate social behaviors, such as aggression, mating, and social investigation, between mice in a home-cage environment. This technology has the potential to have a transformative impact on the study of the neural mechanisms underlying social behavior and the development of new drug therapies for psychiatric disorders in humans. A lack of automated, quantitative, and accurate assessment of social behaviors in mammalian animal models has limited progress toward understanding mechanisms underlying social interactions and their disorders such as autism. Here we present a new integrated hardware and software system that combines video tracking, depth sensing, and machine learning for automatic detection and quantification of social behaviors involving close and dynamic interactions between two mice of different coat colors in their home cage. We designed a hardware setup that integrates traditional video cameras with a depth camera, developed computer vision tools to extract the body “pose” of individual animals in a social context, and used a supervised learning algorithm to classify several well-described social behaviors. We validated the robustness of the automated classifiers in various experimental settings and used them to examine how genetic background, such as that of Black and Tan Brachyury (BTBR) mice (a previously reported autism model), influences social behavior. Our integrated approach allows for rapid, automated measurement of social behaviors across diverse experimental designs and also affords the ability to develop new, objective behavioral metrics.", "year": 2015, "referenceCount": 53, "citationCount": 219, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Psychology"], "authors": [{"authorId": "48980999", "name": "Weizhe Hong"}, {"authorId": "143988562", "name": "A. Kennedy"}, {"authorId": "1403267733", "name": "X. Burgos-Artizzu"}, {"authorId": "4195968", "name": "Moriel Zelikowsky"}, {"authorId": "4986810", "name": "Santiago G Navonne"}, {"authorId": "1690922", "name": "P. Perona"}, {"authorId": "47965122", "name": "David J. Anderson"}]}, {"paperId": "da1be8602c735ae4d8875d7f3495de1ad1c7de7a", "url": "https://www.semanticscholar.org/paper/da1be8602c735ae4d8875d7f3495de1ad1c7de7a", "title": "A review of machine learning for automated planning", "abstract": "Abstract Recent discoveries in automated planning are broadening the scope of planners, from toy problems to real applications. However, applying automated planners to real-world problems is far from simple. On the one hand, the definition of accurate action models for planning is still a bottleneck. On the other hand, off-the-shelf planners fail to scale-up and to provide good solutions in many domains. In these problematic domains, planners can exploit domain-specific control knowledge to improve their performance in terms of both speed and quality of the solutions. However, manual definition of control knowledge is quite difficult. This paper reviews recent techniques in machine learning for the automatic definition of planning knowledge. It has been organized according to the target of the learning process: automatic definition of planning action models and automatic definition of planning control knowledge. In addition, the paper reviews the advances in the related field of reinforcement learning.", "year": 2012, "referenceCount": 153, "citationCount": 106, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1728891", "name": "Sergio Jiménez Celorrio"}, {"authorId": "1805731", "name": "T. D. L. Rosa"}, {"authorId": "79824244", "name": "S. Fernández"}, {"authorId": "143901279", "name": "F. Fernández"}, {"authorId": "1788554", "name": "D. Borrajo"}]}, {"paperId": "0132b27e3681ce910ae74643e33a53b74bd5f5c7", "url": "https://www.semanticscholar.org/paper/0132b27e3681ce910ae74643e33a53b74bd5f5c7", "title": "Learning Steady-States of Iterative Algorithms over Graphs", "abstract": "Many graph analytics problems can be solved via iterative algorithms where the solutions are often characterized by a set of steady-state conditions. Different algorithms respect to different set of fixed point constraints, so instead of using these traditional algorithms, can we learn an algorithm which can obtain the same steady-state solutions automatically from examples, in an effective and scalable way? How to represent the meta learner for such algorithm and how to carry out the learning? In this paper, we propose an embedding representation for iterative algorithms over graphs, and design a learning method which alternates between updating the embeddings and projecting them onto the steadystate constraints. We demonstrate the effectiveness of our framework using a few commonly used graph algorithms, and show that in some cases, the learned algorithm can handle graphs with more than 100,000,000 nodes in a single machine.", "year": 2018, "referenceCount": 25, "citationCount": 122, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2791430", "name": "H. Dai"}, {"authorId": "1714932", "name": "Zornitsa Kozareva"}, {"authorId": "144445933", "name": "Bo Dai"}, {"authorId": "46234526", "name": "Alex Smola"}, {"authorId": "1779453", "name": "Le Song"}]}, {"paperId": "b50eb80ef02d322ab4157253f3fea28770d32558", "url": "https://www.semanticscholar.org/paper/b50eb80ef02d322ab4157253f3fea28770d32558", "title": "Classification of ECG signals using machine learning techniques: A survey", "abstract": "Classification of electrocardiogram (ECG) signals plays an important role in diagnoses of heart diseases. An accurate ECG classification is a challenging problem. This paper presents a survey of ECG classification into arrhythmia types. Early and accurate detection of arrhythmia types is important in detecting heart diseases and choosing appropriate treatment for a patient. Different classifiers are available for ECG classification. Amongst all classifiers, artificial neural networks (ANNs) have become very popular and most widely used for ECG classification. This paper discusses the issues involved in ECG classification and presents a detailed survey of preprocessing techniques, ECG databases, feature extraction techniques, ANN based classifiers, and performance measures to address the mentioned issues. Furthermore, for each surveyed paper, our paper also presents detailed analysis of input beat selection and output of the classifiers.", "year": 2015, "referenceCount": 40, "citationCount": 171, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9373518", "name": "Shweta H. Jambukia"}, {"authorId": "1793052", "name": "V. Dabhi"}, {"authorId": "8283467", "name": "H. Prajapati"}]}, {"paperId": "9131b527b0e8269b3b1554aecd356bab060c9b86", "url": "https://www.semanticscholar.org/paper/9131b527b0e8269b3b1554aecd356bab060c9b86", "title": "Understanding Random Forests: From Theory to Practice", "abstract": "Data analysis and machine learning have become an integrative part of the modern scientific methodology, offering automated procedures for the prediction of a phenomenon based on past observations, unraveling underlying patterns in data and providing insights about the problem. Yet, caution should avoid using machine learning as a black-box tool, but rather consider it as a methodology, with a rational thought process that is entirely dependent on the problem under study. In particular, the use of algorithms should ideally require a reasonable understanding of their mechanisms, properties and limitations, in order to better apprehend and interpret their results. \nAccordingly, the goal of this thesis is to provide an in-depth analysis of random forests, consistently calling into question each and every part of the algorithm, in order to shed new light on its learning capabilities, inner workings and interpretability. The first part of this work studies the induction of decision trees and the construction of ensembles of randomized trees, motivating their design and purpose whenever possible. Our contributions follow with an original complexity analysis of random forests, showing their good computational performance and scalability, along with an in-depth discussion of their implementation details, as contributed within Scikit-Learn. \nIn the second part of this work, we analyse and discuss the interpretability of random forests in the eyes of variable importance measures. The core of our contributions rests in the theoretical characterization of the Mean Decrease of Impurity variable importance measure, from which we prove and derive some of its properties in the case of multiway totally randomized trees and in asymptotic conditions. In consequence of this work, our analysis demonstrates that variable importances [...].", "year": 2014, "referenceCount": 193, "citationCount": 521, "influentialCitationCount": 42, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1881041", "name": "Gilles Louppe"}]}, {"paperId": "af6c3effba8911f6ab891a17f4dd3bbc7952f4e9", "url": "https://www.semanticscholar.org/paper/af6c3effba8911f6ab891a17f4dd3bbc7952f4e9", "title": "Data Clustering: Algorithms and Applications", "abstract": "A g garw al • R ed d y Research on the problem of clustering tends to be fragmented across the pattern recognition, database, data mining, and machine learning communities. Addressing this problem in a unified way, Data Clustering: Algorithms and Applications provides complete coverage of the entire area of clustering, from basic methods to more refined and complex data clustering approaches. It pays special attention to recent issues in graphs, social networks, and other domains.", "year": 2014, "referenceCount": 258, "citationCount": 357, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1682418", "name": "C. Aggarwal"}, {"authorId": "144417522", "name": "C. Reddy"}]}, {"paperId": "b51477ba9f472624cd72116433781173eabdfae6", "url": "https://www.semanticscholar.org/paper/b51477ba9f472624cd72116433781173eabdfae6", "title": "Machine Learning Approach for Sentiment Analysis", "abstract": null, "year": 2016, "referenceCount": 138, "citationCount": 61, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "37333256", "name": "Basant Agarwal"}, {"authorId": "40204750", "name": "Namita Mittal"}]}, {"paperId": "b6fadc09bb76b5b6528f8e239a367bba466e79cf", "url": "https://www.semanticscholar.org/paper/b6fadc09bb76b5b6528f8e239a367bba466e79cf", "title": "Mechanistic models versus machine learning, a fight worth fighting for the biological community?", "abstract": "Ninety per cent of the world's data have been generated in the last 5 years (Machine learning: the power and promise of computers that learn by example. Report no. DES4702. Issued April 2017. Royal Society). A small fraction of these data is collected with the aim of validating specific hypotheses. These studies are led by the development of mechanistic models focused on the causality of input–output relationships. However, the vast majority is aimed at supporting statistical or correlation studies that bypass the need for causality and focus exclusively on prediction. Along these lines, there has been a vast increase in the use of machine learning models, in particular in the biomedical and clinical sciences, to try and keep pace with the rate of data generation. Recent successes now beg the question of whether mechanistic models are still relevant in this area. Said otherwise, why should we try to understand the mechanisms of disease progression when we can use machine learning tools to directly predict disease outcome?", "year": 2018, "referenceCount": 10, "citationCount": 141, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "35275545", "name": "R. Baker"}, {"authorId": "70048667", "name": "J. Peña"}, {"authorId": "6289334", "name": "J. Jayamohan"}, {"authorId": "2905461", "name": "A. Jérusalem"}]}, {"paperId": "bd53919b76f5eed0012429a8232eb1d5df300376", "url": "https://www.semanticscholar.org/paper/bd53919b76f5eed0012429a8232eb1d5df300376", "title": "NetVLAD: CNN Architecture for Weakly Supervised Place Recognition", "abstract": "We tackle the problem of large scale visual place recognition, where the task is to quickly and accurately recognize the location of a given query photograph. We present the following four principal contributions. First, we develop a convolutional neural network (CNN) architecture that is trainable in an end-to-end manner directly for the place recognition task. The main component of this architecture, NetVLAD, is a new generalized VLAD layer, inspired by the “Vector of Locally Aggregated Descriptors” image representation commonly used in image retrieval. The layer is readily pluggable into any CNN architecture and amenable to training via backpropagation. Second, we create a new weakly supervised ranking loss, which enables end-to-end learning of the architecture's parameters from images depicting the same places over time downloaded from Google Street View Time Machine. Third, we develop an efficient training procedure which can be applied on very large-scale weakly labelled tasks. Finally, we show that the proposed architecture and training procedure significantly outperform non-learnt image representations and off-the-shelf CNN descriptors on challenging place recognition and image retrieval benchmarks.", "year": 2015, "referenceCount": 110, "citationCount": 1555, "influentialCitationCount": 441, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2299479", "name": "R. Arandjelović"}, {"authorId": "3413968", "name": "Petr Gronát"}, {"authorId": "34395018", "name": "A. Torii"}, {"authorId": "1758039", "name": "T. Pajdla"}, {"authorId": "1782755", "name": "Josef Sivic"}]}, {"paperId": "761b69164d8b34398f010931faa534c031bdaad6", "url": "https://www.semanticscholar.org/paper/761b69164d8b34398f010931faa534c031bdaad6", "title": "Why Deep Learning Works: A Manifold Disentanglement Perspective", "abstract": "Deep hierarchical representations of the data have been found out to provide better informative features for several machine learning applications. In addition, multilayer neural networks surprisingly tend to achieve better performance when they are subject to an unsupervised pretraining. The booming of deep learning motivates researchers to identify the factors that contribute to its success. One possible reason identified is the flattening of manifold-shaped data in higher layers of neural networks. However, it is not clear how to measure the flattening of such manifold-shaped data and what amount of flattening a deep neural network can achieve. For the first time, this paper provides quantitative evidence to validate the flattening hypothesis. To achieve this, we propose a few quantities for measuring manifold entanglement under certain assumptions and conduct experiments with both synthetic and real-world data. Our experimental results validate the proposition and lead to new insights on deep learning.", "year": 2016, "referenceCount": 28, "citationCount": 121, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "143994572", "name": "P. Brahma"}, {"authorId": "144953170", "name": "Dapeng Oliver Wu"}, {"authorId": "34680388", "name": "Y. She"}]}, {"paperId": "9f93e2de4c24acd3ffb10efae1c849a63830148d", "url": "https://www.semanticscholar.org/paper/9f93e2de4c24acd3ffb10efae1c849a63830148d", "title": "Domain Generalization via Model-Agnostic Learning of Semantic Features", "abstract": "Generalization capability to unseen domains is crucial for machine learning models when deploying to real-world conditions. We investigate the challenging problem of domain generalization, i.e., training a model on multi-domain source data such that it can directly generalize to target domains with unknown statistics. We adopt a model-agnostic learning paradigm with gradient-based meta-train and meta-test procedures to expose the optimization to domain shift. Further, we introduce two complementary losses which explicitly regularize the semantic structure of the feature space. Globally, we align a derived soft confusion matrix to preserve general knowledge of inter-class relationships. Locally, we promote domain-independent class-specific cohesion and separation of sample features with a metric-learning component. The effectiveness of our method is demonstrated with new state-of-the-art results on two common object recognition benchmarks. Our method also shows consistent improvement on a medical image segmentation task.", "year": 2019, "referenceCount": 52, "citationCount": 346, "influentialCitationCount": 55, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35647880", "name": "Q. Dou"}, {"authorId": "39135119", "name": "Daniel Coelho de Castro"}, {"authorId": "3371321", "name": "K. Kamnitsas"}, {"authorId": "1381873274", "name": "B. Glocker"}]}, {"paperId": "708546fd943407b286e298df466259be8b84a0e3", "url": "https://www.semanticscholar.org/paper/708546fd943407b286e298df466259be8b84a0e3", "title": "Comparing machine learning classifiers for diagnosing glaucoma from standard automated perimetry.", "abstract": "PURPOSE\nTo determine which machine learning classifier learns best to interpret standard automated perimetry (SAP) and to compare the best of the machine classifiers with the global indices of STATPAC 2 and with experts in glaucoma.\n\n\nMETHODS\nMultilayer perceptrons (MLP), support vector machines (SVM), mixture of Gaussian (MoG), and mixture of generalized Gaussian (MGG) classifiers were trained and tested by cross validation on the numerical plot of absolute sensitivity plus age of 189 normal eyes and 156 glaucomatous eyes, designated as such by the appearance of the optic nerve. The authors compared performance of these classifiers with the global indices of STATPAC, using the area under the ROC curve. Two human experts were judged against the machine classifiers and the global indices by plotting their sensitivity-specificity pairs.\n\n\nRESULTS\nMoG had the greatest area under the ROC curve of the machine classifiers. Pattern SD (PSD) and corrected PSD (CPSD) had the largest areas under the curve of the global indices. MoG had significantly greater ROC area than PSD and CPSD. Human experts were not better at classifying visual fields than the machine classifiers or the global indices.\n\n\nCONCLUSIONS\nMoG, using the entire visual field and age for input, interpreted SAP better than the global indices of STATPAC. Machine classifiers may augment the global indices of STATPAC.", "year": 2002, "referenceCount": 62, "citationCount": 113, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "32618175", "name": "M. Goldbaum"}, {"authorId": "2175412", "name": "P. Sample"}, {"authorId": "9261843", "name": "K. Chan"}, {"authorId": "2109334422", "name": "Julia M. Williams"}, {"authorId": "103917250", "name": "Te-Won Lee"}, {"authorId": "6832982", "name": "E. Blumenthal"}, {"authorId": "2389101", "name": "C. Girkin"}, {"authorId": "2306091", "name": "L. Zangwill"}, {"authorId": "2375070", "name": "C. Bowd"}, {"authorId": "1714528", "name": "T. Sejnowski"}, {"authorId": "2418684", "name": "R. Weinreb"}]}, {"paperId": "eb4ec590c3f4beefa6b6fb4a37bcb38c605edbd6", "url": "https://www.semanticscholar.org/paper/eb4ec590c3f4beefa6b6fb4a37bcb38c605edbd6", "title": "Speech Emotion Classification Using Machine Learning Algorithms", "abstract": "The recognition of emotional states is a relatively new technique in the field of machine learning. The paper presents the study and the performance results of a system for emotion classification using the architecture of a distributed speech recognition system (DSR). The features used were extracted by the front-end ETSI Aurora eXtended of a mobile terminal in compliance with the ETSI ES 202-211 V1.1.1 standard. On the basis of the time trend of these parameters, over 3800 statistical parameters were extracted to characterize semantic units of varying length (sentences and words). Using the WEKA (Waikato Environment for Knowledge Analysis) software the most significant parameters for the classification of emotional states were selected and the results of various classification techniques were analysed. The results, obtained using both the Berlin Database of Emotional Speech (EMO-DB) and the Speech Under Simulated and Actual Stress (SUSAS) corpus, showed that the best performance is achieved using a support vector machine (SVM) trained with the sequential minimal optimization (SMO) algorithm, after normalizing and discretizing the input statistical parameters.", "year": 2008, "referenceCount": 13, "citationCount": 79, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1689121", "name": "S. Casale"}, {"authorId": "2053792569", "name": "A. Russo"}, {"authorId": "32396306", "name": "G. Scebba"}, {"authorId": "145439077", "name": "S. Serrano"}]}, {"paperId": "5dca0ec6d49dcee756b9b6ceb7a175a56e003e1c", "url": "https://www.semanticscholar.org/paper/5dca0ec6d49dcee756b9b6ceb7a175a56e003e1c", "title": "Results of the Active Learning Challenge", "abstract": "We organized a machine learning challenge on \\active learning\", addressing problems where labeling data is expensive, but large amounts of unlabeled data are available at low cost. Examples include handwriting and speech recognition, document classication, vision tasks, drug design using recombinant molecules and protein engineering. The algorithms may place a limited number of queries to get new sample labels. The design of the challenge and its results are summarized in this paper and the best contributions made by the participants are included in these proceedings. The website of the challenge remains open as a resource for students and researchers (http://clopinet.com/al).", "year": 2011, "referenceCount": 24, "citationCount": 86, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1743797", "name": "I. Guyon"}, {"authorId": "8974886", "name": "G. Cawley"}, {"authorId": "2088846", "name": "G. Dror"}, {"authorId": "145359583", "name": "V. Lemaire"}]}, {"paperId": "7451c068fe7d7fac73d7e6f8d97696c571a73e3d", "url": "https://www.semanticscholar.org/paper/7451c068fe7d7fac73d7e6f8d97696c571a73e3d", "title": "Global convergence of online limited memory BFGS", "abstract": "Global convergence of an online (stochastic) limited memory version of the Broyden-Fletcher-Goldfarb-Shanno (BFGS) quasi-Newton method for solving optimization problems with stochastic objectives that arise in large scale machine learning is established. Lower and upper bounds on the Hessian eigenvalues of the sample functions are shown to suffice to guarantee that the curvature approximation matrices have bounded determinants and traces, which, in turn, permits establishing convergence to optimal arguments with probability 1. Experimental evaluation on a search engine advertising problem showcase reductions in convergence time relative to stochastic gradient descent algorithms.", "year": 2014, "referenceCount": 36, "citationCount": 136, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2706423", "name": "Aryan Mokhtari"}, {"authorId": "144461639", "name": "Alejandro Ribeiro"}]}, {"paperId": "b52452e6d747f007c99d3e5db48742a48f94248f", "url": "https://www.semanticscholar.org/paper/b52452e6d747f007c99d3e5db48742a48f94248f", "title": "Artificial Intelligence and Generalized Qualitative‐Response Models: An Empirical Test on Two Audit Decision‐Making Domains", "abstract": "Machine learning methods are currently the object of considerable study by the artificial intelligence community. Research on machine learning carries implications for decision making in that it seeks computational methods that mimic input-output behaviors found in classes of decision-making examples. At the same time, research in statistics and econometrics has resulted in the development of qualitative-response models that can be applied to the same kind of problems addressed by machine-learning models—particularly those that involve a classification decision. This paper presents the theoretical structure of a generalized qualitative-response model and compares its performance to two seminal machine-learning models in two problem domains associated with audit decision making. The results suggest that the generalized qualitative-response model may be a useful alternative for certain problem domains.", "year": 1992, "referenceCount": 17, "citationCount": 77, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1766955", "name": "J. V. Hansen"}, {"authorId": "144469038", "name": "J. McDonald"}, {"authorId": "71567672", "name": "J. Stice"}]}, {"paperId": "90b0a4f5f5bc0170b587017f03414836a99a25e7", "url": "https://www.semanticscholar.org/paper/90b0a4f5f5bc0170b587017f03414836a99a25e7", "title": "Machine learning for network automation: overview, architecture, and applications [Invited Tutorial]", "abstract": "Networks are complex interacting systems involving cloud operations, core and metro transport, and mobile connectivity all the way to video streaming and similar user applications.With localized and highly engineered operational tools, it is typical of these networks to take days to weeks for any changes, upgrades, or service deployments to take effect. Machine learning, a sub-domain of artificial intelligence, is highly suitable for complex system representation. In this tutorial paper, we review several machine learning concepts tailored to the optical networking industry and discuss algorithm choices, data and model management strategies, and integration into existing network control and management tools. We then describe four networking case studies in detail, covering predictive maintenance, virtual network topology management, capacity optimization, and optical spectral analysis.", "year": 2018, "referenceCount": 45, "citationCount": 155, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2238521", "name": "D. Rafique"}, {"authorId": "145337032", "name": "L. Velasco"}]}, {"paperId": "696eeb999db4b419875c745910cb34088da0803d", "url": "https://www.semanticscholar.org/paper/696eeb999db4b419875c745910cb34088da0803d", "title": "Adversarial Malware Binaries: Evading Deep Learning for Malware Detection in Executables", "abstract": "Machine learning has already been exploited as a useful tool for detecting malicious executable files. Data retrieved from malware samples, such as header fields, instruction sequences, or even raw bytes, is leveraged to learn models that discriminate between benign and malicious software. However, it has also been shown that machine learning and deep neural networks can be fooled by evasion attacks (also known as adversarial examples), i.e., small changes to the input data that cause misclassification at test time. In this work, we investigate the vulnerability of malware detection methods that use deep networks to learn from raw bytes. We propose a gradient-based attack that is capable of evading a recently-proposed deep network suited to this purpose by only changing few specific bytes at the end of each mal ware sample, while preserving its intrusive functionality. Promising results show that our adversarial malware binaries evade the targeted network with high probability, even though less than 1 % of their bytes are modified.", "year": 2018, "referenceCount": 29, "citationCount": 204, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2582104", "name": "Bojan Kolosnjaji"}, {"authorId": "2272441", "name": "Ambra Demontis"}, {"authorId": "1684175", "name": "B. Biggio"}, {"authorId": "3248803", "name": "Davide Maiorca"}, {"authorId": "1779484", "name": "G. Giacinto"}, {"authorId": "49601001", "name": "C. Eckert"}, {"authorId": "1710171", "name": "F. Roli"}]}, {"paperId": "361f6799198c4a258c5dbb4c9863a521f290ff4c", "url": "https://www.semanticscholar.org/paper/361f6799198c4a258c5dbb4c9863a521f290ff4c", "title": "Visual Classifier Training for Text Document Retrieval", "abstract": "Performing exhaustive searches over a large number of text documents can be tedious, since it is very hard to formulate search queries or define filter criteria that capture an analyst's information need adequately. Classification through machine learning has the potential to improve search and filter tasks encompassing either complex or very specific information needs, individually. Unfortunately, analysts who are knowledgeable in their field are typically not machine learning specialists. Most classification methods, however, require a certain expertise regarding their parametrization to achieve good results. Supervised machine learning algorithms, in contrast, rely on labeled data, which can be provided by analysts. However, the effort for labeling can be very high, which shifts the problem from composing complex queries or defining accurate filters to another laborious task, in addition to the need for judging the trained classifier's quality. We therefore compare three approaches for interactive classifier training in a user study. All of the approaches are potential candidates for the integration into a larger retrieval system. They incorporate active learning to various degrees in order to reduce the labeling effort as well as to increase effectiveness. Two of them encompass interactive visualization for letting users explore the status of the classifier in context of the labeled documents, as well as for judging the quality of the classifier in iterative feedback loops. We see our work as a step towards introducing user controlled classification methods in addition to text search and filtering for increasing recall in analytics scenarios involving large corpora.", "year": 2012, "referenceCount": 50, "citationCount": 149, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2018838", "name": "Florian Heimerl"}, {"authorId": "34520778", "name": "Steffen Koch"}, {"authorId": "143807048", "name": "H. Bosch"}, {"authorId": "144784290", "name": "T. Ertl"}]}, {"paperId": "2ebb9f3ef1475e74600b5cfc0a4f3aba14fa5dbd", "url": "https://www.semanticscholar.org/paper/2ebb9f3ef1475e74600b5cfc0a4f3aba14fa5dbd", "title": "Improve Computer-Aided Diagnosis With Machine Learning Techniques Using Undiagnosed Samples", "abstract": "In computer-aided diagnosis (CAD), machine learning techniques have been widely applied to learn a hypothesis from diagnosed samples to assist the medical experts in making a diagnosis. To learn a well-performed hypothesis, a large amount of diagnosed samples are required. Although the samples can be easily collected from routine medical examinations, it is usually impossible for medical experts to make a diagnosis for each of the collected samples. If a hypothesis could be learned in the presence of a large amount of undiagnosed samples, the heavy burden on the medical experts could be released. In this paper, a new semisupervised learning algorithm named Co-Forest is proposed. It extends the co-training paradigm by using a well-known ensemble method named Random Forest, which enables Co-Forest to estimate the labeling confidence of undiagnosed samples and easily produce the final hypothesis. Experiments on benchmark data sets verify the effectiveness of the proposed algorithm. Case studies on three medical data sets and a successful application to microcalcification detection for breast cancer diagnosis show that undiagnosed samples are helpful in building CAD systems, and Co-Forest is able to enhance the performance of the hypothesis that is learned on only a small amount of diagnosed samples by utilizing the available undiagnosed samples.", "year": 2007, "referenceCount": 53, "citationCount": 338, "influentialCitationCount": 40, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40655383", "name": "Ming Li"}, {"authorId": "145624000", "name": "Zhi-Hua Zhou"}]}, {"paperId": "181407803dd9696c54baa624bef6e0f1acb28206", "url": "https://www.semanticscholar.org/paper/181407803dd9696c54baa624bef6e0f1acb28206", "title": "Machine learning methods for predictive proteomics", "abstract": "The search for predictive biomarkers of disease from high-throughput mass spectrometry (MS) data requires a complex analysis path. Preprocessing and machine-learning modules are pipelined, starting from raw spectra, to set up a predictive classifier based on a shortlist of candidate features. As a machine-learning problem, proteomic profiling on MS data needs caution like the microarray case. The risk of overfitting and of selection bias effects is pervasive: not only potential features easily outnumber samples by 10(3) times, but it is easy to neglect information-leakage effects during preprocessing from spectra to peaks. The aim of this review is to explain how to build a general purpose design analysis protocol (DAP) for predictive proteomic profiling: we show how to limit leakage due to parameter tuning and how to organize classification and ranking on large numbers of replicate versions of the original data to avoid selection bias. The DAP can be used with alternative components, i.e. with different preprocessing methods (peak clustering or wavelet based), classifiers e.g. Support Vector Machine (SVM) or feature ranking methods (recursive feature elimination or I-Relief). A procedure for assessing stability and predictive value of the resulting biomarkers' list is also provided. The approach is exemplified with experiments on synthetic datasets (from the Cromwell MS simulator) and with publicly available datasets from cancer studies.", "year": 2007, "referenceCount": 40, "citationCount": 75, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2592461", "name": "A. Barla"}, {"authorId": "1680819", "name": "Giuseppe Jurman"}, {"authorId": "1706884", "name": "S. Riccadonna"}, {"authorId": "49446819", "name": "S. Merler"}, {"authorId": "50502567", "name": "M. Chierici"}, {"authorId": "1687584", "name": "Cesare Furlanello"}]}, {"paperId": "0b04f080f56a99c97c9bfbc3fd7317742d161014", "url": "https://www.semanticscholar.org/paper/0b04f080f56a99c97c9bfbc3fd7317742d161014", "title": "Early Detection of Diabetic Retinopathy Using PCA-Firefly Based Deep Learning Model", "abstract": "Diabetic Retinopathy is a major cause of vision loss and blindness affecting millions of people across the globe. Although there are established screening methods - fluorescein angiography and optical coherence tomography for detection of the disease but in majority of the cases, the patients remain ignorant and fail to undertake such tests at an appropriate time. The early detection of the disease plays an extremely important role in preventing vision loss which is the consequence of diabetes mellitus remaining untreated among patients for a prolonged time period. Various machine learning and deep learning approaches have been implemented on diabetic retinopathy dataset for classification and prediction of the disease but majority of them have neglected the aspect of data pre-processing and dimensionality reduction, leading to biased results. The dataset used in the present study is a diabetes retinopathy dataset collected from the UCI machine learning repository. At its inceptions, the raw dataset is normalized using the Standardscalar technique and then Principal Component Analysis (PCA) is used to extract the most significant features in the dataset. Further, Firefly algorithm is implemented for dimensionality reduction. This reduced dataset is fed into a Deep Neural Network Model for classification. The results generated from the model is evaluated against the prevalent machine learning models and the results justify the superiority of the proposed model in terms of Accuracy, Precision, Recall, Sensitivity and Specificity.", "year": 2020, "referenceCount": 42, "citationCount": 151, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "11041265", "name": "T. Gadekallu"}, {"authorId": "2705556", "name": "Neelu Khare"}, {"authorId": "71424255", "name": "S. Bhattacharya"}, {"authorId": "144704227", "name": "Saurabh Singh"}, {"authorId": "29919430", "name": "P. Maddikunta"}, {"authorId": "40123895", "name": "In-ho Ra"}, {"authorId": "2474250", "name": "M. Alazab"}]}, {"paperId": "8008443f6a1994c3e3a472bf048002ffed836a02", "url": "https://www.semanticscholar.org/paper/8008443f6a1994c3e3a472bf048002ffed836a02", "title": "Discriminant analysis in correlation similarity measure space", "abstract": "Correlation is one of the most widely used similarity measures in machine learning like Euclidean and Mahalanobis distances. However, compared with proposed numerous discriminant learning algorithms in distance metric space, only a very little work has been conducted on this topic using correlation similarity measure. In this paper, we propose a novel discriminant learning algorithm in correlation measure space, Correlation Discriminant Analysis (CDA). In this framework, based on the definitions of within-class correlation and between-class correlation, the optimum transformation can be sought for to maximize the difference between them, which is in accordance with good classification performance empirically. Under different cases of the transformation, different implementations of the algorithm are given. Extensive empirical evaluations of CDA demonstrate its advantage over alternative methods.", "year": 2007, "referenceCount": 26, "citationCount": 92, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2115772096", "name": "Yong Ma"}, {"authorId": "1710195", "name": "S. Lao"}, {"authorId": "1758023", "name": "Erina Takikawa"}, {"authorId": "36064037", "name": "M. Kawade"}]}, {"paperId": "37453d54ee3d8f65f7b201215b264060456ede10", "url": "https://www.semanticscholar.org/paper/37453d54ee3d8f65f7b201215b264060456ede10", "title": "Machine Learning for Encrypted Malware Traffic Classification: Accounting for Noisy Labels and Non-Stationarity", "abstract": "The application of machine learning for the detection of malicious network traffic has been well researched over the past several decades; it is particularly appealing when the traffic is encrypted because traditional pattern-matching approaches cannot be used. Unfortunately, the promise of machine learning has been slow to materialize in the network security domain. In this paper, we highlight two primary reasons why this is the case: inaccurate ground truth and a highly non-stationary data distribution. To demonstrate and understand the effect that these pitfalls have on popular machine learning algorithms, we design and carry out experiments that show how six common algorithms perform when confronted with real network data. With our experimental results, we identify the situations in which certain classes of algorithms underperform on the task of encrypted malware traffic classification. We offer concrete recommendations for practitioners given the real-world constraints outlined. From an algorithmic perspective, we find that the random forest ensemble method outperformed competing methods. More importantly, feature engineering was decisive; we found that iterating on the initial feature set, and including features suggested by domain experts, had a much greater impact on the performance of the classification system. For example, linear regression using the more expressive feature set easily outperformed the random forest method using a standard network traffic representation on all criteria considered. Our analysis is based on millions of TLS encrypted sessions collected over 12 months from a commercial malware sandbox and two geographically distinct, large enterprise networks.", "year": 2017, "referenceCount": 41, "citationCount": 142, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2488315", "name": "Blake Anderson"}, {"authorId": "1863927", "name": "D. McGrew"}]}, {"paperId": "1640578f37726a3c269b807e681a1e6b09a8c346", "url": "https://www.semanticscholar.org/paper/1640578f37726a3c269b807e681a1e6b09a8c346", "title": "Deep learning with convolutional neural networks for EEG decoding and visualization", "abstract": "Deep learning with convolutional neural networks (deep ConvNets) has revolutionized computer vision through end‐to‐end learning, that is, learning from the raw data. There is increasing interest in using deep ConvNets for end‐to‐end EEG analysis, but a better understanding of how to design and train ConvNets for end‐to‐end EEG decoding and how to visualize the informative EEG features the ConvNets learn is still needed. Here, we studied deep ConvNets with a range of different architectures, designed for decoding imagined or executed tasks from raw EEG. Our results show that recent advances from the machine learning field, including batch normalization and exponential linear units, together with a cropped training strategy, boosted the deep ConvNets decoding performance, reaching at least as good performance as the widely used filter bank common spatial patterns (FBCSP) algorithm (mean decoding accuracies 82.1% FBCSP, 84.0% deep ConvNets). While FBCSP is designed to use spectral power modulations, the features used by ConvNets are not fixed a priori. Our novel methods for visualizing the learned features demonstrated that ConvNets indeed learned to use spectral power modulations in the alpha, beta, and high gamma frequencies, and proved useful for spatially mapping the learned features by revealing the topography of the causal contributions of features in different frequency bands to the decoding decision. Our study thus shows how to design and train ConvNets to decode task‐related information from the raw EEG without handcrafted features and highlights the potential of deep ConvNets combined with advanced visualization techniques for EEG‐based brain mapping. Hum Brain Mapp 38:5391–5420, 2017. © 2017 Wiley Periodicals, Inc.", "year": 2017, "referenceCount": 125, "citationCount": 1174, "influentialCitationCount": 195, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "9948572", "name": "R. Schirrmeister"}, {"authorId": "2060551", "name": "J. T. Springenberg"}, {"authorId": "1704186", "name": "L. Fiederer"}, {"authorId": "9936842", "name": "M. Glasstetter"}, {"authorId": "2607675", "name": "Katharina Eggensperger"}, {"authorId": "2345823", "name": "M. Tangermann"}, {"authorId": "144661829", "name": "F. Hutter"}, {"authorId": "1725973", "name": "W. Burgard"}, {"authorId": "145928182", "name": "T. Ball"}]}, {"paperId": "c42c29c793f3b8518a313d03fa101b1201a8ad14", "url": "https://www.semanticscholar.org/paper/c42c29c793f3b8518a313d03fa101b1201a8ad14", "title": "Network intrusion detection system: A systematic study of machine learning and deep learning approaches", "abstract": "The rapid advances in the internet and communication fields have resulted in a huge increase in the network size and the corresponding data. As a result, many novel attacks are being generated and have posed challenges for network security to accurately detect intrusions. Furthermore, the presence of the intruders with the aim to launch various attacks within the network cannot be ignored. An intrusion detection system (IDS) is one such tool that prevents the network from possible intrusions by inspecting the network traffic, to ensure its confidentiality, integrity, and availability. Despite enormous efforts by the researchers, IDS still faces challenges in improving detection accuracy while reducing false alarm rates and in detecting novel intrusions. Recently, machine learning (ML) and deep learning (DL)‐based IDS systems are being deployed as potential solutions to detect intrusions across the network in an efficient manner. This article first clarifies the concept of IDS and then provides the taxonomy based on the notable ML and DL techniques adopted in designing network‐based IDS (NIDS) systems. A comprehensive review of the recent NIDS‐based articles is provided by discussing the strengths and limitations of the proposed solutions. Then, recent trends and advancements of ML and DL‐based NIDS are provided in terms of the proposed methodology, evaluation metrics, and dataset selection. Using the shortcomings of the proposed methods, we highlighted various research challenges and provided the future scope for the research in improving ML and DL‐based NIDS.", "year": 2020, "referenceCount": 162, "citationCount": 142, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48583070", "name": "Zeeshan Ahmad"}, {"authorId": "39891028", "name": "A. Khan"}, {"authorId": "3078761", "name": "W. Cheah"}, {"authorId": "145580217", "name": "J. Abdullah"}, {"authorId": "143679712", "name": "Farhan Ahmad"}]}, {"paperId": "cf350b12c684a0328234346f222a2fb72d534865", "url": "https://www.semanticscholar.org/paper/cf350b12c684a0328234346f222a2fb72d534865", "title": "Machine Learning Out-of-Equilibrium Phases of Matter.", "abstract": "Neural-network-based machine learning is emerging as a powerful tool for obtaining phase diagrams when traditional regression schemes using local equilibrium order parameters are not available, as in many-body localized (MBL) or topological phases. Nevertheless, instances of machine learning offering new insights have been rare up to now. Here we show that a single feed-forward neural network can decode the defining structures of two distinct MBL phases and a thermalizing phase, using entanglement spectra obtained from individual eigenstates. For this, we introduce a simplicial geometry-based method for extracting multipartite phase boundaries. We find that this method outperforms conventional metrics for identifying MBL phase transitions, revealing a sharper phase boundary and shedding new insight on the topology of the phase diagram. Furthermore, the phase diagram we acquire from a single disorder configuration confirms that the machine-learning-based approach we establish here can enable speedy exploration of large phase spaces that can assist with the discovery of new MBL phases. To our knowledge, this Letter represents the first example of a standard machine learning approach revealing new information on phase transitions.", "year": 2017, "referenceCount": 55, "citationCount": 88, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "14051496", "name": "Jordan Venderley"}, {"authorId": "7457618", "name": "V. Khemani"}, {"authorId": "144302105", "name": "Eun-Ah Kim"}]}, {"paperId": "38f2e8cf9c0e257dbbacb5d20b2101103fb80f47", "url": "https://www.semanticscholar.org/paper/38f2e8cf9c0e257dbbacb5d20b2101103fb80f47", "title": "DDD: A New Ensemble Approach for Dealing with Concept Drift", "abstract": "Online learning algorithms often have to operate in the presence of concept drifts. A recent study revealed that different diversity levels in an ensemble of learning machines are required in order to maintain high generalization on both old and new concepts. Inspired by this study and based on a further study of diversity with different strategies to deal with drifts, we propose a new online ensemble learning approach called Diversity for Dealing with Drifts (DDD). DDD maintains ensembles with different diversity levels and is able to attain better accuracy than other approaches. Furthermore, it is very robust, outperforming other drift handling approaches in terms of accuracy when there are false positive drift detections. In all the experimental comparisons we have carried out, DDD always performed at least as well as other drift handling approaches under various conditions, with very few exceptions.", "year": 2012, "referenceCount": 44, "citationCount": 390, "influentialCitationCount": 31, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1805698", "name": "Leandro L. Minku"}, {"authorId": "143901532", "name": "X. Yao"}]}, {"paperId": "a703ee3fbf432b93e817e8042511e6469b172f2c", "url": "https://www.semanticscholar.org/paper/a703ee3fbf432b93e817e8042511e6469b172f2c", "title": "Multi-Scale Deep Reinforcement Learning for Real-Time 3D-Landmark Detection in CT Scans", "abstract": "Robust and fast detection of anatomical structures is a prerequisite for both diagnostic and interventional medical image analysis. Current solutions for anatomy detection are typically based on machine learning techniques that exploit large annotated image databases in order to learn the appearance of the captured anatomy. These solutions are subject to several limitations, including the use of suboptimal feature engineering techniques and most importantly the use of computationally suboptimal search-schemes for anatomy detection. To address these issues, we propose a method that follows a new paradigm by reformulating the detection problem as a behavior learning task for an artificial agent. We couple the modeling of the anatomy appearance and the object search in a unified behavioral framework, using the capabilities of deep reinforcement learning and multi-scale image analysis. In other words, an artificial agent is trained not only to distinguish the target anatomical object from the rest of the body but also how to find the object by learning and following an optimal navigation path to the target object in the imaged volumetric space. We evaluated our approach on 1487 3D-CT volumes from 532 patients, totaling over 500,000 image slices and show that it significantly outperforms state-of-the-art solutions on detecting several anatomical structures with no failed cases from a clinical acceptance perspective, while also achieving a 20-30 percent higher detection accuracy. Most importantly, we improve the detection-speed of the reference methods by 2-3 orders of magnitude, achieving unmatched real-time performance on large 3D-CT scans.", "year": 2019, "referenceCount": 68, "citationCount": 188, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2562046", "name": "Florin C. Ghesu"}, {"authorId": "1747498", "name": "B. Georgescu"}, {"authorId": "2110381386", "name": "Yefeng Zheng"}, {"authorId": "1764071", "name": "Sasa Grbic"}, {"authorId": "145051740", "name": "A. Maier"}, {"authorId": "1713907", "name": "J. Hornegger"}, {"authorId": "1685020", "name": "D. Comaniciu"}]}, {"paperId": "809039012b6dae79878048bf3eed2a82dc802e1f", "url": "https://www.semanticscholar.org/paper/809039012b6dae79878048bf3eed2a82dc802e1f", "title": "Feature Selection and the Class Imbalance Problem in Predicting Protein Function from Sequence", "abstract": null, "year": 2005, "referenceCount": 36, "citationCount": 118, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1405309123", "name": "A. Al-Shahib"}, {"authorId": "2661384", "name": "R. Breitling"}, {"authorId": "2502593", "name": "D. Gilbert"}]}, {"paperId": "5afcb16059b41553e19316269da0a894bb161304", "url": "https://www.semanticscholar.org/paper/5afcb16059b41553e19316269da0a894bb161304", "title": "Identification of Translationese: A Machine Learning Approach", "abstract": null, "year": 2010, "referenceCount": 24, "citationCount": 75, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2125732", "name": "Iustina Ilisei"}, {"authorId": "1697366", "name": "D. Inkpen"}, {"authorId": "1804994", "name": "G. C. Pastor"}, {"authorId": "1746371", "name": "R. Mitkov"}]}, {"paperId": "84e16a6543120a452d5ecb55b61609c361254a55", "url": "https://www.semanticscholar.org/paper/84e16a6543120a452d5ecb55b61609c361254a55", "title": "Perspective on machine learning for advancing fluid mechanics", "abstract": "A perspective is presented on how machine learning methods might advance fluid mechanics. Current limitations are discussed, though the potential impact is deemed high, so long as outcomes are held to the long-standing critical standards that should guide studies of flow physics.", "year": 2019, "referenceCount": 36, "citationCount": 124, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "36397553", "name": "M. Brenner"}, {"authorId": "35129457", "name": "J. Eldredge"}, {"authorId": "2862762", "name": "J. Freund"}]}, {"paperId": "fff45cbbb315fffb4c72d8459fcd9fe28a87519c", "url": "https://www.semanticscholar.org/paper/fff45cbbb315fffb4c72d8459fcd9fe28a87519c", "title": "Local Binary Patterns and Extreme Learning Machine for Hyperspectral Imagery Classification", "abstract": "It is of great interest in exploiting texture information for classification of hyperspectral imagery (HSI) at high spatial resolution. In this paper, a classification paradigm to exploit rich texture information of HSI is proposed. The proposed framework employs local binary patterns (LBPs) to extract local image features, such as edges, corners, and spots. Two levels of fusion (i.e., feature-level fusion and decision-level fusion) are applied to the extracted LBP features along with global Gabor features and original spectral features, where feature-level fusion involves concatenation of multiple features before the pattern classification process while decision-level fusion performs on probability outputs of each individual classification pipeline and soft-decision fusion rule is adopted to merge results from the classifier ensemble. Moreover, the efficient extreme learning machine with a very simple structure is employed as the classifier. Experimental results on several HSI data sets demonstrate that the proposed framework is superior to some traditional alternatives.", "year": 2015, "referenceCount": 50, "citationCount": 472, "influentialCitationCount": 53, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50135244", "name": "Wei Li"}, {"authorId": "40262099", "name": "C. Chen"}, {"authorId": "2243292", "name": "H. Su"}, {"authorId": "144486980", "name": "Q. Du"}]}, {"paperId": "1dd6502b8bad99f5dcc3ed962d09a53c77480b84", "url": "https://www.semanticscholar.org/paper/1dd6502b8bad99f5dcc3ed962d09a53c77480b84", "title": "Machine Learning for Catalysis Informatics: Recent Applications and Prospects", "abstract": "The discovery and development of catalysts and catalytic processes are essential components to maintaining an ecological balance in the future. Recent revolutions made in data science could have a ...", "year": 2020, "referenceCount": 204, "citationCount": 167, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "50636396", "name": "Takashi Toyao"}, {"authorId": "7850355", "name": "Z. Maeno"}, {"authorId": "9808467", "name": "S. Takakusagi"}, {"authorId": "3388368", "name": "T. Kamachi"}, {"authorId": "2400256", "name": "Ichigaku Takigawa"}, {"authorId": "145330457", "name": "K. Shimizu"}]}, {"paperId": "4a17a8ab29ecffde5e8280382dd858c75d5bb6b6", "url": "https://www.semanticscholar.org/paper/4a17a8ab29ecffde5e8280382dd858c75d5bb6b6", "title": "Teachable Machine: Approachable Web-Based Tool for Exploring Machine Learning Classification", "abstract": "Teachable Machine (teachablemachine.withgoogle.com) is a web-based GUI tool for creating custom machine learning classification models without specialized technical expertise. (Machine learning, or ML, lets systems learn to analyze data without being explicitly programmed.) We created it to help students, teachers, designers, and others learn about ML by creating and using their own classification models. Its broad uptake suggests it has empowered people to learn, teach, and explore ML concepts: People have created curriculum, tutorials, and other resources using Teachable Machine on topics like AI ethics at institutions including the Stanford d.school, NYU's Interactive Telecommunications Program, the MIT Media Lab, as well as creative experiments. Users in 201 countries have created over 125,000 classification models. Here we outline the project and its key contributions of (1) a flexible, approachable interface for ML classification models without ML or coding expertise, (2) a set of technical and design decisions that can inform future interactive machine learning tools, and (3) an example of how structured learning content surrounding the tool supports people accessing ML concepts.", "year": 2020, "referenceCount": 30, "citationCount": 70, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1664904153", "name": "Michelle Carney"}, {"authorId": "72500270", "name": "Barron Webster"}, {"authorId": "2062749837", "name": "Irene Alvarado"}, {"authorId": "2056288455", "name": "Kyle Phillips"}, {"authorId": "39707815", "name": "Noura Howell"}, {"authorId": "2055443643", "name": "Jordan Griffith"}, {"authorId": "153631211", "name": "Jonas Jongejan"}, {"authorId": "2156576", "name": "Amit Pitaru"}, {"authorId": "2116403860", "name": "Alexander Chen"}]}, {"paperId": "a40f97770296c7fca2e5361cbceba3f4aae399e0", "url": "https://www.semanticscholar.org/paper/a40f97770296c7fca2e5361cbceba3f4aae399e0", "title": "Dynamic Few-Shot Visual Learning Without Forgetting", "abstract": "The human visual system has the remarkably ability to be able to effortlessly learn novel concepts from only a few examples. Mimicking the same behavior on machine learning vision systems is an interesting and very challenging research problem with many practical advantages on real world vision applications. In this context, the goal of our work is to devise a few-shot visual learning system that during test time it will be able to efficiently learn novel categories from only a few training data while at the same time it will not forget the initial categories on which it was trained (here called base categories). To achieve that goal we propose (a) to extend an object recognition system with an attention based few-shot classification weight generator, and (b) to redesign the classifier of a ConvNet model as the cosine similarity function between feature representations and classification weight vectors. The latter, apart from unifying the recognition of both novel and base categories, it also leads to feature representations that generalize better on \"unseen\" categories. We extensively evaluate our approach on Mini-ImageNet where we manage to improve the prior state-of-the-art on few-shot recognition (i.e., we achieve 56.20% and 73.00% on the 1-shot and 5-shot settings respectively) while at the same time we do not sacrifice any accuracy on the base categories, which is a characteristic that most prior approaches lack. Finally, we apply our approach on the recently introduced few-shot benchmark of Bharath and Girshick [4] where we also achieve state-of-the-art results.", "year": 2018, "referenceCount": 32, "citationCount": 782, "influentialCitationCount": 114, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2475428", "name": "Spyros Gidaris"}, {"authorId": "2505902", "name": "N. Komodakis"}]}, {"paperId": "3e9a40a567c4a95b591530ff5771296b478a0f0c", "url": "https://www.semanticscholar.org/paper/3e9a40a567c4a95b591530ff5771296b478a0f0c", "title": "Machine Learning at the Network Edge: A Survey", "abstract": "Resource-constrained IoT devices, such as sensors and actuators, have become ubiquitous in recent years. This has led to the generation of large quantities of data in real-time, which is an appealing target for AI systems. However, deploying machine learning models on such end-devices is nearly impossible. A typical solution involves offloading data to external computing systems (such as cloud servers) for further processing but this worsens latency, leads to increased communication costs, and adds to privacy concerns. To address this issue, efforts have been made to place additional computing devices at the edge of the network, i.e., close to the IoT devices where the data is generated. Deploying machine learning systems on such edge computing devices alleviates the above issues by allowing computations to be performed close to the data sources. This survey describes major research efforts where machine learning systems have been deployed at the edge of computer networks, focusing on the operational aspects including compression techniques, tools, frameworks, and hardware used in successful applications of intelligent edge systems.", "year": 2019, "referenceCount": 183, "citationCount": 123, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144854067", "name": "M. G. Sarwar Murshed"}, {"authorId": "2064797442", "name": "Chris Murphy"}, {"authorId": "145588259", "name": "Daqing Hou"}, {"authorId": "2093292636", "name": "Nazar Khan"}, {"authorId": "2849491", "name": "G. Ananthanarayanan"}, {"authorId": "1725422928", "name": "Faraz Hussain"}]}, {"paperId": "adfb8b2e9e002c536d68eb4dbd0c5fbca2694a6a", "url": "https://www.semanticscholar.org/paper/adfb8b2e9e002c536d68eb4dbd0c5fbca2694a6a", "title": "Low-Power Neuromorphic Hardware for Signal Processing Applications: A review of architectural and system-level design approaches", "abstract": "Machine learning has emerged as the dominant tool for implementing complex cognitive tasks that require supervised, unsupervised, and reinforcement learning. While the resulting machines have demonstrated in some cases even superhuman performance, their energy consumption has often proved to be prohibitive in the absence of costly supercomputers. Most state-of-the-art machine-learning solutions are based on memoryless models of neurons. This is unlike the neurons in the human brain that encode and process information using temporal information in spike events. The different computing principles underlying biological neurons and how they combine together to efficiently process information is believed to be a key factor behind their superior efficiency compared to current machine-learning systems.", "year": 2019, "referenceCount": 41, "citationCount": 77, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9214677", "name": "B. Rajendran"}, {"authorId": "145428675", "name": "A. Sebastian"}, {"authorId": "2587435", "name": "M. Schmuker"}, {"authorId": "1753812", "name": "N. Srinivasa"}, {"authorId": "2977652", "name": "E. Eleftheriou"}]}, {"paperId": "eba67b2ce2ba3ea4f9a8978b8ffd8dc809befd1b", "url": "https://www.semanticscholar.org/paper/eba67b2ce2ba3ea4f9a8978b8ffd8dc809befd1b", "title": "Metabolite identification and molecular fingerprint prediction through machine learning", "abstract": "MOTIVATION\nMetabolite identification from tandem mass spectra is an important problem in metabolomics, underpinning subsequent metabolic modelling and network analysis. Yet, currently this task requires matching the observed spectrum against a database of reference spectra originating from similar equipment and closely matching operating parameters, a condition that is rarely satisfied in public repositories. Furthermore, the computational support for identification of molecules not present in reference databases is lacking. Recent efforts in assembling large public mass spectral databases such as MassBank have opened the door for the development of a new genre of metabolite identification methods.\n\n\nRESULTS\nWe introduce a novel framework for prediction of molecular characteristics and identification of metabolites from tandem mass spectra using machine learning with the support vector machine. Our approach is to first predict a large set of molecular properties of the unknown metabolite from salient tandem mass spectral signals, and in the second step to use the predicted properties for matching against large molecule databases, such as PubChem. We demonstrate that several molecular properties can be predicted to high accuracy and that they are useful in de novo metabolite identification, where the reference database does not contain any spectra of the same molecule.\n\n\nAVAILABILITY\nAn Matlab/Python package of the FingerID tool is freely available on the web at http://www.sourceforge.net/p/fingerid.\n\n\nCONTACT\nmarkus.heinonen@cs.helsinki.fi.", "year": 2012, "referenceCount": 26, "citationCount": 131, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "34066178", "name": "Markus Heinonen"}, {"authorId": "36230745", "name": "Huibin Shen"}, {"authorId": "2883800", "name": "Nicola Zamboni"}, {"authorId": "2768655", "name": "Juho Rousu"}]}, {"paperId": "39e34a729ed84a7430c4fed70de020156a916fcb", "url": "https://www.semanticscholar.org/paper/39e34a729ed84a7430c4fed70de020156a916fcb", "title": "Lessons for artificial intelligence from the study of natural stupidity", "abstract": null, "year": 2019, "referenceCount": 82, "citationCount": 31, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "32000531", "name": "Alexander S. Rich"}, {"authorId": "3013567", "name": "T. Gureckis"}]}, {"paperId": "2167f9ffd36af6c723d3527eab60c731e13d3a90", "url": "https://www.semanticscholar.org/paper/2167f9ffd36af6c723d3527eab60c731e13d3a90", "title": "Attention-Based Recurrent Neural Network Models for Joint Intent Detection and Slot Filling", "abstract": "Attention-based encoder-decoder neural network models have recently shown promising results in machine translation and speech recognition. In this work, we propose an attention-based neural network model for joint intent detection and slot filling, both of which are critical steps for many speech understanding and dialog systems. Unlike in machine translation and speech recognition, alignment is explicit in slot filling. We explore different strategies in incorporating this alignment information to the encoder-decoder framework. Learning from the attention mechanism in encoder-decoder model, we further propose introducing attention to the alignment-based RNN models. Such attentions provide additional information to the intent classification and slot label prediction. Our independent task models achieve state-of-the-art intent detection error rate and slot filling F1 score on the benchmark ATIS task. Our joint training model further obtains 0.56% absolute (23.8% relative) error reduction on intent detection and 0.23% absolute gain on slot filling over the independent task models.", "year": 2016, "referenceCount": 26, "citationCount": 521, "influentialCitationCount": 76, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143830417", "name": "Bing Liu"}, {"authorId": "1765892", "name": "I. Lane"}]}, {"paperId": "014dd7d0dba2f05684bc2d7b5e5bf48ad64b04ba", "url": "https://www.semanticscholar.org/paper/014dd7d0dba2f05684bc2d7b5e5bf48ad64b04ba", "title": "Data mining for hypertext: a tutorial survey", "abstract": "With over 800 million pages covering most areas of human endeavor, the World-wide Web is a fertile ground for data mining research to make a difference to the effectiveness of information search. Today, Web surfers access the Web through two dominant interfaces: clicking on hyperlinks and searching via keyword queries. This process is often tentative and unsatisfactory. Better support is needed for expressing one's information need and dealing with a search result in more structured ways than available now. Data mining and machine learning have significant roles to play towards this end.In this paper we will survey recent advances in learning and mining problems related to hypertext in general and the Web in particular. We will review the continuum of supervised to semi-supervised to unsupervised learning problems, highlight the specific challenges which distinguish data mining in the hypertext domain from data mining in the context of data warehouses, and summarize the key areas of recent and ongoing research.", "year": 2000, "referenceCount": 97, "citationCount": 342, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40941894", "name": "Soumen Chakrabarti"}]}, {"paperId": "bd898f483476e3dcacf83cd85efc64e6319da0e1", "url": "https://www.semanticscholar.org/paper/bd898f483476e3dcacf83cd85efc64e6319da0e1", "title": "Histopathological Image Analysis: A Review", "abstract": "Over the past decade, dramatic increases in computational power and improvement in image analysis algorithms have allowed the development of powerful computer-assisted analytical approaches to radiological data. With the recent advent of whole slide digital scanners, tissue histopathology slides can now be digitized and stored in digital image form. Consequently, digitized tissue histopathology has now become amenable to the application of computerized image analysis and machine learning techniques. Analogous to the role of computer-assisted diagnosis (CAD) algorithms in medical imaging to complement the opinion of a radiologist, CAD algorithms have begun to be developed for disease detection, diagnosis, and prognosis prediction to complement the opinion of the pathologist. In this paper, we review the recent state of the art CAD technology for digitized histopathology. This paper also briefly describes the development and application of novel image analysis technology for a few specific histopathology related problems being pursued in the United States and Europe.", "year": 2009, "referenceCount": 144, "citationCount": 1448, "influentialCitationCount": 53, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "5733445", "name": "M. Gurcan"}, {"authorId": "2034769", "name": "L. Boucheron"}, {"authorId": "145643855", "name": "A. Can"}, {"authorId": "1705442", "name": "A. Madabhushi"}, {"authorId": "2229652", "name": "N. Rajpoot"}, {"authorId": "153583705", "name": "B. Yener"}]}, {"paperId": "da2bd3d3d82ba6828dd90cb6777432099d1a1e02", "url": "https://www.semanticscholar.org/paper/da2bd3d3d82ba6828dd90cb6777432099d1a1e02", "title": "Federated Learning Over Wireless Fading Channels", "abstract": "We study federated machine learning at the wireless network edge, where limited power wireless devices, each with its own dataset, build a joint model with the help of a remote parameter server (PS). We consider a bandwidth-limited fading multiple access channel (MAC) from the wireless devices to the PS, and propose various techniques to implement distributed stochastic gradient descent (DSGD) over this shared noisy wireless channel. We first propose a digital DSGD (D-DSGD) scheme, in which one device is selected opportunistically for transmission at each iteration based on the channel conditions; the scheduled device quantizes its gradient estimate to a finite number of bits imposed by the channel condition, and transmits these bits to the PS in a reliable manner. Next, motivated by the additive nature of the wireless MAC, we propose a novel analog communication scheme, referred to as the compressed analog DSGD (CA-DSGD), where the devices first sparsify their gradient estimates while accumulating error from previous iterations, and project the resultant sparse vector into a low-dimensional vector for bandwidth reduction. We also design a power allocation scheme to align the received gradient vectors at the PS in an efficient manner. Numerical results show that D-DSGD outperforms other digital approaches in the literature; however, in general the proposed CA-DSGD algorithm converges faster than the D-DSGD scheme, and reaches a higher level of accuracy. We have observed that the gap between the analog and digital schemes increases when the datasets of devices are not independent and identically distributed (i.i.d.). Furthermore, the performance of the CA-DSGD scheme is shown to be robust against imperfect channel state information (CSI) at the devices. Overall these results show clear advantages for the proposed analog over-the-air DSGD scheme, which suggests that learning and communication algorithms should be designed jointly to achieve the best end-to-end performance in machine learning applications at the wireless edge.", "year": 2019, "referenceCount": 39, "citationCount": 274, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2240170", "name": "M. Amiri"}, {"authorId": "1727814", "name": "Deniz Gündüz"}]}, {"paperId": "8d7bc6a0af5c063c457a88561bcf8f895c9f7392", "url": "https://www.semanticscholar.org/paper/8d7bc6a0af5c063c457a88561bcf8f895c9f7392", "title": "AggNet: Deep Learning From Crowds for Mitosis Detection in Breast Cancer Histology Images", "abstract": "The lack of publicly available ground-truth data has been identified as the major challenge for transferring recent developments in deep learning to the biomedical imaging domain. Though crowdsourcing has enabled annotation of large scale databases for real world images, its application for biomedical purposes requires a deeper understanding and hence, more precise definition of the actual annotation task. The fact that expert tasks are being outsourced to non-expert users may lead to noisy annotations introducing disagreement between users. Despite being a valuable resource for learning annotation models from crowdsourcing, conventional machine-learning methods may have difficulties dealing with noisy annotations during training. In this manuscript, we present a new concept for learning from crowds that handle data aggregation directly as part of the learning process of the convolutional neural network (CNN) via additional crowdsourcing layer (AggNet). Besides, we present an experimental study on learning from crowds designed to answer the following questions. 1) Can deep CNN be trained with data collected from crowdsourcing? 2) How to adapt the CNN to train on multiple types of annotation datasets (ground truth and crowd-based)? 3) How does the choice of annotation and aggregation affect the accuracy? Our experimental setup involved Annot8, a self-implemented web-platform based on Crowdflower API realizing image annotation tasks for a publicly available biomedical image database. Our results give valuable insights into the functionality of deep CNN learning from crowd annotations and prove the necessity of data aggregation integration.", "year": 2016, "referenceCount": 37, "citationCount": 364, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3098247", "name": "Shadi Albarqouni"}, {"authorId": "1720766387", "name": "Christoph Baur"}, {"authorId": "3397880", "name": "F. Achilles"}, {"authorId": "1882784", "name": "Vasileios Belagiannis"}, {"authorId": "38931171", "name": "S. Demirci"}, {"authorId": "145587210", "name": "Nassir Navab"}]}, {"paperId": "a36835241b44cda9253d86ddaf67f84ffc1d9a89", "url": "https://www.semanticscholar.org/paper/a36835241b44cda9253d86ddaf67f84ffc1d9a89", "title": "Learning Hidden Markov Model Structure for Information Extraction", "abstract": "Statistical machine learning techniques, while well proven in fields such as speech recognition, are just beginning to be applied to the information extraction domain. We explore the use of hidden Markov models for information extraction tasks, specifically focusing on how to learn model structure from data and how to make the best use of labeled and unlabeled data. We show that a manually-constructed model that contains multiple states per extraction field outperforms a model with one state per field, and discuss strategies for learning the model structure automatically from data. We also demonstrate that the use of distantly-labeled data to set model parameters provides a significant improvement in extraction accuracy. Our models are applied to the task of extracting important fields from the headers of computer science research papers, and achieve an extraction accuracy of 92.9%.", "year": 1999, "referenceCount": 17, "citationCount": 480, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2544946", "name": "K. Seymore"}, {"authorId": "88507334", "name": "R. Rosenfeld"}]}, {"paperId": "c24b2cea903c9fc3d505bdea953ccd13a90b6c65", "url": "https://www.semanticscholar.org/paper/c24b2cea903c9fc3d505bdea953ccd13a90b6c65", "title": "Applying machine learning to semiconductor manufacturing", "abstract": "The generalized ID3 (GID3) algorithm, which takes a training set of experimental data and produces a decision tree that predicts the outcome of future experiments under various, more general conditions, is described. The tree can then be translated into a set of rules for an expert system. Two extensions to GID3MmRIST, and KARSM-that deal with the problems of noisy data and the limited availability of training data are discussed. The application of GID3 to reactive ion etching manufacturing process diagnosis and optimization and to knowledge acquisition for an expert system is described.<<ETX>>", "year": 1993, "referenceCount": 9, "citationCount": 85, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34849755", "name": "K. Irani"}, {"authorId": "2112427035", "name": "Jie Cheng"}, {"authorId": "1695784", "name": "U. Fayyad"}, {"authorId": "1979861", "name": "Zhaogang Qian"}]}, {"paperId": "f4c5d13a8e9e80edcd4f69f0eab0b4434364c6dd", "url": "https://www.semanticscholar.org/paper/f4c5d13a8e9e80edcd4f69f0eab0b4434364c6dd", "title": "Variational Autoencoder for Deep Learning of Images, Labels and Captions", "abstract": "A novel variational autoencoder is developed to model images, as well as associated labels or captions. The Deep Generative Deconvolutional Network (DGDN) is used as a decoder of the latent image features, and a deep Convolutional Neural Network (CNN) is used as an image encoder; the CNN is used to approximate a distribution for the latent DGDN features/code. The latent code is also linked to generative models for labels (Bayesian support vector machine) or captions (recurrent neural network). When predicting a label/caption for a new image at test, averaging is performed across the distribution of latent codes; this is computationally efficient as a consequence of the learned CNN-based encoder. Since the framework is capable of modeling the image in the presence/absence of associated labels/captions, a new semi-supervised setting is manifested for CNN learning with images; the framework even allows unsupervised CNN learning, based on images alone.", "year": 2016, "referenceCount": 37, "citationCount": 537, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2750075", "name": "Yunchen Pu"}, {"authorId": "144702900", "name": "Zhe Gan"}, {"authorId": "145153424", "name": "Ricardo Henao"}, {"authorId": "50242822", "name": "Xin Yuan"}, {"authorId": "2109737569", "name": "Chunyuan Li"}, {"authorId": "9074631", "name": "Andrew Stevens"}, {"authorId": "145006560", "name": "L. Carin"}]}, {"paperId": "ebbc6951ea54ecdc20452ce3d44020e23b87116f", "url": "https://www.semanticscholar.org/paper/ebbc6951ea54ecdc20452ce3d44020e23b87116f", "title": "A Path for Translation of Machine Learning Products into Healthcare Delivery", "abstract": "Despite enormous enthusiasm, machine learning models are rarely translated into clinical care and there is minimal evidence of clinical or economic impact. New conference venues and academic journals have emerged to promote the proliferating research; however, the translational path remains unclear. This review undertakes the first in-depth study to identify how machine learning models that ingest structured electronic health record data can be applied to clinical decision support tasks and translated into clinical practice. The authors complement their own work with the experience of 21 machine learning products that address problems across clinical domains and across geographic populations. Four phases of translation emerge: design and develop, evaluate and validate, diffuse and scale, and continuing monitoring and maintenance. The review highlights the varying approaches taken across each phase by teams building machine learning products and presents a discussion of challenges and opportunities. The translational path and associated findings are instructive to researchers and developers building machine learning products, policy makers regulating machine learning products, and health system leaders who are considering adopting a machine learning product.", "year": 2020, "referenceCount": 120, "citationCount": 52, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "47057856", "name": "M. Sendak"}, {"authorId": "1610930464", "name": "Joshua D'Arcy"}, {"authorId": "1752628613", "name": "S. Kashyap"}, {"authorId": "145866390", "name": "M. Gao"}, {"authorId": "48448064", "name": "M. Nichols"}, {"authorId": "145820969", "name": "Kristin M Corey"}, {"authorId": "2076928049", "name": "W. Ratliff"}, {"authorId": "12308037", "name": "S. Balu"}]}, {"paperId": "5a6b2b9bc3b51ff187826fc2dc21a967e04125ed", "url": "https://www.semanticscholar.org/paper/5a6b2b9bc3b51ff187826fc2dc21a967e04125ed", "title": "Model-based reinforcement learning: A survey", "abstract": "Reinforcement learning is an important branch of machine learning and artificial intelligence. Compared with traditional reinforcement learning, model-based reinforcement learning obtains the action of the next state by the model that has been learned, and then optimizes the policy, which greatly improves data efficiency. Based on the present status of research on model-based reinforcement learning at home and abroad, this paper comprehensively reviews the key techniques of model-based reinforcement learning, summarizes the characteristics, advantages and defects of each technology, and analyzes the application of model-based reinforcement learning in games, robotics and brain science.", "year": 2018, "referenceCount": 85, "citationCount": 135, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "97784972", "name": "Fengji Yi"}, {"authorId": "151480898", "name": "Wenlong Fu"}, {"authorId": "2108951911", "name": "Huan Liang"}]}, {"paperId": "82024003820d52ef344fb210d050f469f60ddf4b", "url": "https://www.semanticscholar.org/paper/82024003820d52ef344fb210d050f469f60ddf4b", "title": "Breaking Cryptographic Implementations Using Deep Learning Techniques", "abstract": null, "year": 2016, "referenceCount": 57, "citationCount": 331, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "2726537", "name": "Houssem Maghrebi"}, {"authorId": "3474230", "name": "Thibault Portigliatti"}, {"authorId": "1726631", "name": "E. Prouff"}]}, {"paperId": "c5f50e2975401dfc59aa3ddf3cf8ec6058c0ba13", "url": "https://www.semanticscholar.org/paper/c5f50e2975401dfc59aa3ddf3cf8ec6058c0ba13", "title": "Semi-supervised learning using label mean", "abstract": "Semi-Supervised Support Vector Machines (S3VMs) typically directly estimate the label assignments for the unlabeled instances. This is often inefficient even with recent advances in the efficient training of the (supervised) SVM. In this paper, we show that S3VMs, with knowledge of the means of the class labels of the unlabeled data, is closely related to the supervised SVM with known labels on all the unlabeled data. This motivates us to first estimate the label means of the unlabeled data. Two versions of the meanS3VM, which work by maximizing the margin between the label means, are proposed. The first one is based on multiple kernel learning, while the second one is based on alternating optimization. Experiments show that both of the proposed algorithms achieve highly competitive and sometimes even the best performance as compared to the state-of-the-art semi-supervised learners. Moreover, they are more efficient than existing S3VMs.", "year": 2009, "referenceCount": 21, "citationCount": 97, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2110463675", "name": "Yu-Feng Li"}, {"authorId": "145193332", "name": "J. Kwok"}, {"authorId": "145624000", "name": "Zhi-Hua Zhou"}]}, {"paperId": "01a27d77257c47a24daaa969f258ea844b9cbff8", "url": "https://www.semanticscholar.org/paper/01a27d77257c47a24daaa969f258ea844b9cbff8", "title": "Balancing exploration and exploitation: a new algorithm for active machine learning", "abstract": "Active machine learning algorithms are used when large numbers of unlabeled examples are available and getting labels for them is costly (e.g. requiring consulting a human expert). Many conventional active learning algorithms focus on refining the decision boundary, at the expense of exploring new regions that the current hypothesis misclassifies. We propose a new active learning algorithm that balances such exploration with refining of the decision boundary by dynamically adjusting the probability to explore at each step. Our experimental results demonstrate improved performance on data sets that require extensive exploration while remaining competitive on data sets that do not. Our algorithm also shows significant tolerance of noise.", "year": 2005, "referenceCount": 22, "citationCount": 137, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31621435", "name": "T. T. Osugi"}, {"authorId": "2068921800", "name": "Kun Deng"}, {"authorId": "93847855", "name": "S. Scott"}]}, {"paperId": "0645c8792d5095f0de45e95c5fd9de5238f426e6", "url": "https://www.semanticscholar.org/paper/0645c8792d5095f0de45e95c5fd9de5238f426e6", "title": "Learning motor primitives for robotics", "abstract": "The acquisition and self-improvement of novel motor skills is among the most important problems in robotics. Motor primitives offer one of the most promising frameworks for the application of machine learning techniques in this context. Employing an improved form of the dynamic systems motor primitives originally introduced by Ijspeert et al. [2], we show how both discrete and rhythmic tasks can be learned using a concerted approach of both imitation and reinforcement learning. For doing so, we present both learning algorithms and representations targeted for the practical application in robotics. Furthermore, we show that it is possible to include a start-up phase in rhythmic primitives. We show that two new motor skills, i.e., Ball-in-a-Cup and Ball-Paddling, can be learned on a real Barrett WAM robot arm at a pace similar to human learning while achieving a significantly more reliable final performance.", "year": 2009, "referenceCount": 29, "citationCount": 229, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145739642", "name": "J. Kober"}, {"authorId": "145197867", "name": "Jan Peters"}]}, {"paperId": "d745cf8c51032996b5fee6b19e1b5321c14797eb", "url": "https://www.semanticscholar.org/paper/d745cf8c51032996b5fee6b19e1b5321c14797eb", "title": "Viewpoint Invariant Pedestrian Recognition with an Ensemble of Localized Features", "abstract": null, "year": 2008, "referenceCount": 26, "citationCount": 1419, "influentialCitationCount": 270, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "144944479", "name": "D. Gray"}, {"authorId": "145492205", "name": "Hai Tao"}]}, {"paperId": "0fa2828f40259e7faa3878a74d403df4f9e8cf8e", "url": "https://www.semanticscholar.org/paper/0fa2828f40259e7faa3878a74d403df4f9e8cf8e", "title": "Productivity and Selection of Human Capital with Machine Learning", "abstract": "Economists have become increasingly interested in studying the nature of production functions in social policy applications, with the goal of improving productivity. Traditionally models have assumed workers are homogenous inputs. However, in practice, substantial variability in productivity means the marginal productivity of labor depends substantially on which new workers are hired--which requires not an estimate of a causal effect, but rather a prediction. We demonstrate that there can be large social welfare gains from using machine learning tools to predict worker productivity, using data from two important applications - police hiring and teacher tenure decisions.", "year": 2016, "referenceCount": 32, "citationCount": 129, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "69466219", "name": "Aaron Chalfin"}, {"authorId": "52544059", "name": "Oren Danieli"}, {"authorId": "122036781", "name": "A. Hillis"}, {"authorId": "1866984", "name": "Zubin Jelveh"}, {"authorId": "2342599", "name": "Michael Luca"}, {"authorId": "50197963", "name": "J. Ludwig"}, {"authorId": "2062143", "name": "S. Mullainathan"}]}]}