{"total": 5120627, "offset": 4000, "next": 4100, "data": [{"paperId": "c603c4b406b846541950d62495ac2910788c0669", "url": "https://www.semanticscholar.org/paper/c603c4b406b846541950d62495ac2910788c0669", "title": "A comparative study of machine learning methods for time-to-event survival data for radiomics risk modelling", "abstract": null, "year": 2017, "referenceCount": 42, "citationCount": 139, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "47381059", "name": "S. Leger"}, {"authorId": "6894503", "name": "A. Zwanenburg"}, {"authorId": "35024445", "name": "K. Pilz"}, {"authorId": "12558422", "name": "F. Lohaus"}, {"authorId": "7285475", "name": "A. Linge"}, {"authorId": "2922388", "name": "K. Zöphel"}, {"authorId": "3205319", "name": "J. Kotzerke"}, {"authorId": "47614337", "name": "A. Schreiber"}, {"authorId": "50123462", "name": "I. Tinhofer"}, {"authorId": "78864846", "name": "V. Budach"}, {"authorId": "144206434", "name": "A. Sak"}, {"authorId": "76999719", "name": "M. Stuschke"}, {"authorId": "4545017", "name": "P. Balermpas"}, {"authorId": "46530648", "name": "C. Rödel"}, {"authorId": "5541025", "name": "U. Ganswindt"}, {"authorId": "87801872", "name": "C. Belka"}, {"authorId": "6681673", "name": "S. Pigorsch"}, {"authorId": "144359719", "name": "S. Combs"}, {"authorId": "6904313", "name": "D. Mönnich"}, {"authorId": "2838825", "name": "D. Zips"}, {"authorId": "145415677", "name": "M. Krause"}, {"authorId": "144564734", "name": "M. Baumann"}, {"authorId": "145626495", "name": "E. Troost"}, {"authorId": "6284311", "name": "S. Löck"}, {"authorId": "46293464", "name": "C. Richter"}]}, {"paperId": "5ed4617d39833a8dd8e931282ca2fcee136db634", "url": "https://www.semanticscholar.org/paper/5ed4617d39833a8dd8e931282ca2fcee136db634", "title": "Unsupervised Generative Modeling Using Matrix Product States", "abstract": "Generative modeling, which learns joint probability distribution from data and generates samples according to it, is an important task in machine learning and artificial intelligence. Inspired by probabilistic interpretation of quantum physics, we propose a generative model using matrix product states, which is a tensor network originally proposed for describing (particularly one-dimensional) entangled quantum states. Our model enjoys efficient learning analogous to the density matrix renormalization group method, which allows dynamically adjusting dimensions of the tensors and offers an efficient direct sampling approach for generative tasks. We apply our method to generative modeling of several standard datasets including the Bars and Stripes, random binary patterns and the MNIST handwritten digits to illustrate the abilities, features and drawbacks of our model over popular generative models such as Hopfield model, Boltzmann machines and generative adversarial networks. Our work sheds light on many interesting directions of future exploration on the development of quantum-inspired algorithms for unsupervised machine learning, which are promisingly possible to be realized on quantum devices.", "year": 2017, "referenceCount": 74, "citationCount": 178, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "114687692", "name": "Zhaoyu Han"}, {"authorId": "2152809604", "name": "Jun Wang"}, {"authorId": "143911167", "name": "H. Fan"}, {"authorId": "2152508799", "name": "Lei Wang"}, {"authorId": "1410544411", "name": "Pan Zhang"}]}, {"paperId": "1f11be4b6dd9e8cda1733651fd914c50cf760bb9", "url": "https://www.semanticscholar.org/paper/1f11be4b6dd9e8cda1733651fd914c50cf760bb9", "title": "A comparative evaluation of the generalised predictive ability of eight machine learning algorithms across ten clinical metabolomics data sets for binary classification", "abstract": null, "year": 2019, "referenceCount": 93, "citationCount": 65, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "83201140", "name": "Kevin M. Mendez"}, {"authorId": "4114666", "name": "S. Reinke"}, {"authorId": "49934155", "name": "D. Broadhurst"}]}, {"paperId": "ae7b9345e8182859f131916b2618d879c3df668b", "url": "https://www.semanticscholar.org/paper/ae7b9345e8182859f131916b2618d879c3df668b", "title": "Machine Learning for Health Services Researchers.", "abstract": null, "year": 2019, "referenceCount": 35, "citationCount": 97, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "7504840", "name": "P. Doupe"}, {"authorId": "1986735", "name": "James H. Faghmous"}, {"authorId": "152168277", "name": "S. Basu"}]}, {"paperId": "a70f958ea5ac770978377b9d6d9c715ae7af52bd", "url": "https://www.semanticscholar.org/paper/a70f958ea5ac770978377b9d6d9c715ae7af52bd", "title": "Morphological and molecular breast cancer profiling through explainable machine learning", "abstract": null, "year": 2021, "referenceCount": 40, "citationCount": 50, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Biology"], "authors": [{"authorId": "2063967997", "name": "A. Binder"}, {"authorId": "2482827", "name": "M. Bockmayr"}, {"authorId": "21810423", "name": "M. Hägele"}, {"authorId": "2348573", "name": "S. Wienert"}, {"authorId": "39271054", "name": "D. Heim"}, {"authorId": "46238642", "name": "Katharina Hellweg"}, {"authorId": "145298825", "name": "M. Ishii"}, {"authorId": "4487059", "name": "A. Stenzinger"}, {"authorId": "4884986", "name": "A. Hocke"}, {"authorId": "2135439", "name": "C. Denkert"}, {"authorId": "145034054", "name": "K. Müller"}, {"authorId": "3245416", "name": "F. Klauschen"}]}, {"paperId": "fb48b584ed52284db257ca438c2a3a40e6550c44", "url": "https://www.semanticscholar.org/paper/fb48b584ed52284db257ca438c2a3a40e6550c44", "title": "Machine learning in heart failure: ready for prime time", "abstract": "Purpose of review The aim of this review is to present an up-to-date overview of the application of machine learning methods in heart failure including diagnosis, classification, readmissions and medication adherence. Recent findings Recent studies have shown that the application of machine learning techniques may have the potential to improve heart failure outcomes and management, including cost savings by improving existing diagnostic and treatment support systems. Recently developed deep learning methods are expected to yield even better performance than traditional machine learning techniques in performing complex tasks by learning the intricate patterns hidden in big medical data. Summary The review summarizes the recent developments in the application of machine and deep learning methods in heart failure management.", "year": 2017, "referenceCount": 30, "citationCount": 51, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "32299082", "name": "S. Awan"}, {"authorId": "2470423", "name": "Ferdous Sohel"}, {"authorId": "39242730", "name": "F. Sanfilippo"}, {"authorId": "1698675", "name": "Bennamoun"}, {"authorId": "144084518", "name": "G. Dwivedi"}]}, {"paperId": "ad0b891162d47f9bc4538c48d9153d42078c3d70", "url": "https://www.semanticscholar.org/paper/ad0b891162d47f9bc4538c48d9153d42078c3d70", "title": "Empirical assessment of machine learning-based malware detectors for Android", "abstract": null, "year": 2016, "referenceCount": 39, "citationCount": 115, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1790388", "name": "Kevin Allix"}, {"authorId": "3023999", "name": "Tegawendé F. Bissyandé"}, {"authorId": "7330140", "name": "Quentin Jérôme"}, {"authorId": "2445617", "name": "Jacques Klein"}, {"authorId": "1757227", "name": "R. State"}, {"authorId": "47681863", "name": "Yves Le Traon"}]}, {"paperId": "d4893f7b4d0adbbfd2b3025df3502ab7e902dd79", "url": "https://www.semanticscholar.org/paper/d4893f7b4d0adbbfd2b3025df3502ab7e902dd79", "title": "Random Feature Expansions for Deep Gaussian Processes", "abstract": "The composition of multiple Gaussian Processes as a Deep Gaussian Process (DGP) enables a deep probabilistic nonparametric approach to flexibly tackle complex machine learning problems with sound quantification of uncertainty. Existing inference approaches for DGP models have limited scalability and are notoriously cumbersome to construct. In this work we introduce a novel formulation of DGPs based on random feature expansions that we train using stochastic variational inference. This yields a practical learning framework which significantly advances the state-of-the-art in inference for DGPs, and enables accurate quantification of uncertainty. We extensively showcase the scalability and performance of our proposal on several datasets with up to 8 million observations, and various DGP architectures with up to 30 hidden layers.", "year": 2016, "referenceCount": 47, "citationCount": 115, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3428811", "name": "Kurt Cutajar"}, {"authorId": "30561807", "name": "Edwin V. Bonilla"}, {"authorId": "143822502", "name": "P. Michiardi"}, {"authorId": "3138895", "name": "M. Filippone"}]}, {"paperId": "f7f3c904cfa555bc55d65b4cf40e4a73c09190a7", "url": "https://www.semanticscholar.org/paper/f7f3c904cfa555bc55d65b4cf40e4a73c09190a7", "title": "Active Task Selection for Lifelong Machine Learning", "abstract": "\n \n In a lifelong learning framework, an agent acquires knowledge incrementally over consecutive learning tasks, continually building upon its experience. Recent lifelong learning algorithms have achieved nearly identical performance to batch multi-task learning methods while reducing learning time by three orders of magnitude. In this paper, we further improve the scalability of lifelong learning by developing curriculum selection methods that enable an agent to actively select the next task to learn in order to maximize performance on future learning tasks. We demonstrate that active task selection is highly reliable and effective, allowing an agent to learn high performance models using up to 50% fewer tasks than when the agent has no control over the task order. We also explore a variant of transfer learning in the lifelong learning setting in which the agent can focus knowledge acquisition toward a particular target task.\n \n", "year": 2013, "referenceCount": 20, "citationCount": 62, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "12114845", "name": "P. Ruvolo"}, {"authorId": "144020269", "name": "Eric Eaton"}]}, {"paperId": "2748bf26635e1d3a1918fb9316ff9cee06e20ded", "url": "https://www.semanticscholar.org/paper/2748bf26635e1d3a1918fb9316ff9cee06e20ded", "title": "Machine learning for tracking illegal wildlife trade on social media", "abstract": null, "year": 2018, "referenceCount": 5, "citationCount": 119, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Business", "Medicine"], "authors": [{"authorId": "7852704", "name": "E. Di Minin"}, {"authorId": "39402485", "name": "Christoph Fink"}, {"authorId": "46406399", "name": "H. Tenkanen"}, {"authorId": "3294817", "name": "Tuomo Hiippala"}]}, {"paperId": "56e88615d5c26a8261d1f14b5af769b973efb93b", "url": "https://www.semanticscholar.org/paper/56e88615d5c26a8261d1f14b5af769b973efb93b", "title": "Using habituation in machine learning", "abstract": null, "year": 2009, "referenceCount": 34, "citationCount": 30, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "2112255", "name": "S. Marsland"}]}, {"paperId": "771479c18b586eafae21baf262a220aaa7b2eef6", "url": "https://www.semanticscholar.org/paper/771479c18b586eafae21baf262a220aaa7b2eef6", "title": "Learning Rotation-Invariant Convolutional Neural Networks for Object Detection in VHR Optical Remote Sensing Images", "abstract": "Object detection in very high resolution optical remote sensing images is a fundamental problem faced for remote sensing image analysis. Due to the advances of powerful feature representations, machine-learning-based object detection is receiving increasing attention. Although numerous feature representations exist, most of them are handcrafted or shallow-learning-based features. As the object detection task becomes more challenging, their description capability becomes limited or even impoverished. More recently, deep learning algorithms, especially convolutional neural networks (CNNs), have shown their much stronger feature representation power in computer vision. Despite the progress made in nature scene images, it is problematic to directly use the CNN feature for object detection in optical remote sensing images because it is difficult to effectively deal with the problem of object rotation variations. To address this problem, this paper proposes a novel and effective approach to learn a rotation-invariant CNN (RICNN) model for advancing the performance of object detection, which is achieved by introducing and learning a new rotation-invariant layer on the basis of the existing CNN architectures. However, different from the training of traditional CNN models that only optimizes the multinomial logistic regression objective, our RICNN model is trained by optimizing a new objective function via imposing a regularization constraint, which explicitly enforces the feature representations of the training samples before and after rotating to be mapped close to each other, hence achieving rotation invariance. To facilitate training, we first train the rotation-invariant layer and then domain-specifically fine-tune the whole RICNN network to further boost the performance. Comprehensive evaluations on a publicly available ten-class object detection data set demonstrate the effectiveness of the proposed method.", "year": 2016, "referenceCount": 51, "citationCount": 1085, "influentialCitationCount": 91, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2152127024", "name": "Gong Cheng"}, {"authorId": "2895041", "name": "P. Zhou"}, {"authorId": "7181955", "name": "Junwei Han"}]}, {"paperId": "ceb2386daea9d831e89ea0328bb6b89054c26dea", "url": "https://www.semanticscholar.org/paper/ceb2386daea9d831e89ea0328bb6b89054c26dea", "title": "Machine Learning Configuration Interaction.", "abstract": "We propose the concept of machine learning configuration interaction (MLCI) whereby an artificial neural network is trained on-the-fly to predict important new configurations in an iterative selected configuration interaction procedure. We demonstrate that the neural network can discriminate between important and unimportant configurations, that it has not been trained on, much better than by chance. MLCI is then used to find compact wave functions for carbon monoxide at both stretched and equilibrium geometries. We also consider the multireference problem of the water molecule with elongated bonds. Results are contrasted with those from other ways of selecting configurations: first-order perturbation, random selection, and Monte Carlo configuration interaction. Compared with these other serial calculations, this prototype MLCI is competitive in its accuracy, converges in significantly fewer iterations than the stochastic approaches, and requires less time for the higher-accuracy computations.", "year": 2018, "referenceCount": 52, "citationCount": 44, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Physics"], "authors": [{"authorId": "33524193", "name": "J. P. Coe"}]}, {"paperId": "2b4f69447df8ee8f44e53ba254734bfd570c7450", "url": "https://www.semanticscholar.org/paper/2b4f69447df8ee8f44e53ba254734bfd570c7450", "title": "Machine Learning Prediction of Cancer Cell Sensitivity to Drugs Based on Genomic and Chemical Properties", "abstract": "Predicting the response of a specific cancer to a therapy is a major goal in modern oncology that should ultimately lead to a personalised treatment. High-throughput screenings of potentially active compounds against a panel of genomically heterogeneous cancer cell lines have unveiled multiple relationships between genomic alterations and drug responses. Various computational approaches have been proposed to predict sensitivity based on genomic features, while others have used the chemical properties of the drugs to ascertain their effect. In an effort to integrate these complementary approaches, we developed machine learning models to predict the response of cancer cell lines to drug treatment, quantified through IC50 values, based on both the genomic features of the cell lines and the chemical properties of the considered drugs. Models predicted IC50 values in a 8-fold cross-validation and an independent blind test with coefficient of determination R2 of 0.72 and 0.64 respectively. Furthermore, models were able to predict with comparable accuracy (R2 of 0.61) IC50s of cell lines from a tissue not used in the training stage. Our in silico models can be used to optimise the experimental design of drug-cell screenings by estimating a large proportion of missing IC50 values rather than experimentally measuring them. The implications of our results go beyond virtual drug screening design: potentially thousands of drugs could be probed in silico to systematically test their potential efficacy as anti-tumour agents based on their structure, thus providing a computational framework to identify new drug repositioning opportunities as well as ultimately be useful for personalized medicine by linking the genomic traits of patients to drug sensitivity.", "year": 2012, "referenceCount": 46, "citationCount": 361, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Biology", "Medicine"], "authors": [{"authorId": "143817725", "name": "M. Menden"}, {"authorId": "1841722", "name": "Francesco Iorio"}, {"authorId": "145959971", "name": "M. Garnett"}, {"authorId": "2321694", "name": "U. McDermott"}, {"authorId": "1714039", "name": "C. Benes"}, {"authorId": "9998035", "name": "P. Ballester"}, {"authorId": "1389786323", "name": "J. Sáez-Rodríguez"}]}, {"paperId": "22588ac839cd1a8d0c1021b2a5172dc531f13416", "url": "https://www.semanticscholar.org/paper/22588ac839cd1a8d0c1021b2a5172dc531f13416", "title": "Artificial Intelligence for Games", "abstract": "AI and Games Introduction What Is AI? Model of Game AI Algorithms, Data Structures, and Representations On the Website Layout of the Book Game AI The Complexity Fallacy The Kind of AI in Games Speed and Memory The AI Engine Techniques Movement The Basics of Movement Algorithms Kinematic Movement Algorithms Steering Behaviors Combining Steering Behaviors Predicting Physics Jumping Coordinated Movement Motor Control Movement in the Third Dimension Pathfinding The Pathfinding Graph Dijkstra A* World Representations Improving on A* Hierarchical Pathfinding Other Ideas in Pathfinding Continuous Time Pathfinding Movement Planning Decision Making Overview of Decision Making Decision Trees State Machines Behavior Trees Fuzzy Logic Markov Systems Goal-Oriented Behavior Rule-Based Systems Blackboard Architectures Scripting Action Execution Tactical and Strategic AI Waypoint Tactics Tactical Analyses Tactical Pathfinding Coordinated Action Learning Learning Basics Parameter Modification Action Prediction Decision Learning Naive Bayes Classifiers Decision Tree Learning Reinforcement Learning Artificial Neural Networks Board Games Game Theory Minimaxing Transposition Tables and Memory Memory-Enhanced Test Algorithms Opening Books and Other Set Plays Further Optimizations Turn-Based Strategy Games Supporting Technologies Execution Management Scheduling Anytime Algorithms Level of Detail World Interfacing Communication Getting Knowledge Efficiently Event Managers Polling Stations Sense Management Tools and Content Creation Knowledge for Pathfinding and Waypoint Tactics Knowledge for Movement Knowledge for Decision Making The Toolchain Designing Game AI Designing Game AI The Design Shooters Driving Real-Time Strategy Sports Turn-Based Strategy Games AI-Based Game Genres Teaching Characters Flocking and Herding Games Appendix Books, Periodicals, and Papers Games", "year": 2006, "referenceCount": 73, "citationCount": 504, "influentialCitationCount": 43, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2909681", "name": "I. Millington"}]}, {"paperId": "e7b677c6a4595514f41f317484150793b5f75a89", "url": "https://www.semanticscholar.org/paper/e7b677c6a4595514f41f317484150793b5f75a89", "title": "Archetypal analysis for machine learning and data mining", "abstract": null, "year": 2012, "referenceCount": 28, "citationCount": 167, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "3416561", "name": "M. Mørup"}, {"authorId": "145579972", "name": "L. K. Hansen"}]}, {"paperId": "796e801efefdd87f4484ee74a1f7240fab80fb1e", "url": "https://www.semanticscholar.org/paper/796e801efefdd87f4484ee74a1f7240fab80fb1e", "title": "Machine Learning for Hardware Security: Opportunities and Risks", "abstract": null, "year": 2018, "referenceCount": 90, "citationCount": 38, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9297383", "name": "Rana Elnaggar"}, {"authorId": "143631962", "name": "K. Chakrabarty"}]}, {"paperId": "247b527f0a071eed4e5c43dda90b52fb01cd3eef", "url": "https://www.semanticscholar.org/paper/247b527f0a071eed4e5c43dda90b52fb01cd3eef", "title": "A review of multi-instance learning assumptions", "abstract": "Abstract Multi-instance (MI) learning is a variant of inductive machine learning, where each learning example contains a bag of instances instead of a single feature vector. The term commonly refers to the supervised setting, where each bag is associated with a label. This type of representation is a natural fit for a number of real-world learning scenarios, including drug activity prediction and image classification, hence many MI learning algorithms have been proposed. Any MI learning method must relate instances to bag-level class labels, but many types of relationships between instances and class labels are possible. Although all early work in MI learning assumes a specific MI concept class known to be appropriate for a drug activity prediction domain; this ‘standard MI assumption’ is not guaranteed to hold in other domains. Much of the recent work in MI learning has concentrated on a relaxed view of the MI problem, where the standard MI assumption is dropped, and alternative assumptions are considered instead. However, often it is not clearly stated what particular assumption is used and how it relates to other assumptions that have been proposed. In this paper, we aim to clarify the use of alternative MI assumptions by reviewing the work done in this area.", "year": 2010, "referenceCount": 58, "citationCount": 315, "influentialCitationCount": 33, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40289577", "name": "James R. Foulds"}, {"authorId": "143713826", "name": "Eibe Frank"}]}, {"paperId": "2dae631935d29f75bab8ca122d324b93574b28de", "url": "https://www.semanticscholar.org/paper/2dae631935d29f75bab8ca122d324b93574b28de", "title": "Geophysical inversion versus machine learning in inverse problems", "abstract": "Geophysical inversion and machine learning both provide solutions for inverse problems in which we estimate model parameters from observations. Geophysical inversions such as impedance inversion, amplitude-variation-with-offset inversion, and traveltime tomography are commonly used in the industry to yield physical properties from measured seismic data. Machine learning, a data-driven approach, has become popular during the past decades and is useful for solving such inverse problems. An advantage of machine learning methods is that they can be implemented without knowledge of physical equations or theories. The challenges of machine learning lie in acquiring enough training data and selecting relevant parameters, which are essential in obtaining a good quality model. In this study, we compare geophysical inversion and machine learning approaches in solving inverse problems and show similarities and differences of these approaches in a mathematical form and numerical tests. Both methods aid in solving ill-posed and nonlinear problems and use similar optimization techniques. We take reflectivity inversion as an example of the inverse problem. We apply geophysical inversion based on the least-squares method and artificial neural networks as a machine learning approach to solve reflectivity inversion using 2D synthetic data sets and 3D field data sets. A neural network with multiple hidden layers successfully generates the nonlinear mapping function to predict reflectivity. For this inverse problem, we test different L1 regularizers for both approaches. L1 regularization alleviates effects of noise in seismic traces and enhances sparsity, especially in the least-squares method. The 2D synthetic wedge model and field data examples show that neural networks yield high spatial resolution.", "year": 2018, "referenceCount": 26, "citationCount": 68, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2107910408", "name": "Yuji Kim"}, {"authorId": "97944579", "name": "N. Nakata"}]}, {"paperId": "dd02246d76d9dfe9d40b5d7974f0c6eb1b3485ce", "url": "https://www.semanticscholar.org/paper/dd02246d76d9dfe9d40b5d7974f0c6eb1b3485ce", "title": "FedHealth: A Federated Transfer Learning Framework for Wearable Healthcare", "abstract": "With the rapid development of computing technology, wearable devices make it easy to get access to people's health information. Smart healthcare achieves great success by training machine learning models on a large quantity of user personal data. However, there are two critical challenges. First, user data often exist in the form of isolated islands, making it difficult to perform aggregation without compromising privacy security. Second, the models trained on the cloud fail on personalization. In this article, we propose FedHealth, the first federated transfer learning framework for wearable healthcare to tackle these challenges. FedHealth performs data aggregation through federated learning, and then builds relatively personalized models by transfer learning. Wearable activity recognition experiments and real Parkinson's disease auxiliary diagnosis application have evaluated that FedHealth is able to achieve accurate and personalized healthcare without compromising privacy and security. FedHealth is general and extensible in many healthcare applications.", "year": 2019, "referenceCount": 62, "citationCount": 251, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109360525", "name": "Yiqiang Chen"}, {"authorId": "1519290245", "name": "Jindong Wang"}, {"authorId": "1786336", "name": "Chaohui Yu"}, {"authorId": "101001846", "name": "Wen Gao"}, {"authorId": "2106593912", "name": "Xin Qin"}]}, {"paperId": "4731023f7fe031afd5cce991d7157197a5cceb06", "url": "https://www.semanticscholar.org/paper/4731023f7fe031afd5cce991d7157197a5cceb06", "title": "Applicability of statistical learning algorithms in groundwater quality modeling", "abstract": "Four algorithms are outlined, each of which has interesting features for predicting contaminant levels in groundwater. Artificial neural networks (ANN), support vector machines (SVM), locally weighted projection regression (LWPR), and relevance vector machines (RVM) are utilized as surrogates for a relatively complex and time‐consuming mathematical model to simulate nitrate concentration in groundwater at specified receptors. Nitrates in the application reported in this paper are due to on‐ground nitrogen loadings from fertilizers and manures. The practicability of the four learning machines in this work is demonstrated for an agriculture‐dominated watershed where nitrate contamination of groundwater resources exceeds the maximum allowable contaminant level at many locations. Cross‐validation and bootstrapping techniques are used for both training and performance evaluation. Prediction results of the four learning machines are rigorously assessed using different efficiency measures to ensure their generalization ability. Prediction results show the ability of learning machines to build accurate models with strong predictive capabilities and hence constitute a valuable means for saving effort in groundwater contamination modeling and improving model performance.", "year": 2005, "referenceCount": 102, "citationCount": 128, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Engineering", "Geology"], "authors": [{"authorId": "145768793", "name": "A. Khalil"}, {"authorId": "2208935", "name": "M. Almasri"}, {"authorId": "38543517", "name": "M. McKee"}, {"authorId": "145034068", "name": "J. Kaluarachchi"}]}, {"paperId": "86bf4e4eb3087fff0dcaf9d0c0bc00c36fd2d11b", "url": "https://www.semanticscholar.org/paper/86bf4e4eb3087fff0dcaf9d0c0bc00c36fd2d11b", "title": "Towards human-guided machine learning", "abstract": "Automated Machine Learning (AutoML) systems are emerging that automatically search for possible solutions from a large space of possible kinds of models. Although fully automated machine learning is appropriate for many applications, users often have knowledge that supplements and constraints the available data and solutions. This paper proposes human-guided machine learning (HGML) as a hybrid approach where a user interacts with an AutoML system and tasks it to explore different problem settings that reflect the user's knowledge about the data available. We present: 1) a task analysis of HGML that shows the tasks that a user would want to carry out, 2) a characterization of two scientific publications, one in neuroscience and one in political science, in terms of how the authors would search for solutions using an AutoML system, 3) requirements for HGML based on those characterizations, and 4) an assessment of existing AutoML systems in terms of those requirements.", "year": 2019, "referenceCount": 44, "citationCount": 50, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145526918", "name": "Y. Gil"}, {"authorId": "143755437", "name": "James Honaker"}, {"authorId": "2118928002", "name": "Shikhar Gupta"}, {"authorId": "2146277142", "name": "Yibo Ma"}, {"authorId": "1405498945", "name": "Vito D'Orazio"}, {"authorId": "1398926410", "name": "D. Garijo"}, {"authorId": "2066310557", "name": "Shruti Gadewar"}, {"authorId": "50513690", "name": "Qifan Yang"}, {"authorId": "1721831", "name": "N. Jahanshad"}]}, {"paperId": "e3eaf3c461114bc34675b0aa33e48ac0be003451", "url": "https://www.semanticscholar.org/paper/e3eaf3c461114bc34675b0aa33e48ac0be003451", "title": "The random forest algorithm for statistical learning", "abstract": "Random forests (Breiman, 2001, Machine Learning 45: 5–32) is a statistical- or machine-learning algorithm for prediction. In this article, we introduce a corresponding new command, rforest. We overview the random forest algorithm and illustrate its use with two examples: The first example is a classification problem that predicts whether a credit card holder will default on his or her debt. The second example is a regression problem that predicts the logscaled number of shares of online news articles. We conclude with a discussion that summarizes key points demonstrated in the examples.", "year": 2020, "referenceCount": 10, "citationCount": 108, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1815604", "name": "M. Schonlau"}, {"authorId": "151197773", "name": "Rosie Yuyan Zou"}]}, {"paperId": "771c14df5fbe14ace4b7f68c2fdc5d3526e4b4ca", "url": "https://www.semanticscholar.org/paper/771c14df5fbe14ace4b7f68c2fdc5d3526e4b4ca", "title": "Memristive Boltzmann machine: A hardware accelerator for combinatorial optimization and deep learning", "abstract": "The Boltzmann machine is a massively parallel computational model capable of solving a broad class of combinatorial optimization problems. In recent years, it has been successfully applied to training deep machine learning models on massive datasets. High performance implementations of the Boltzmann machine using GPUs, MPI-based HPC clusters, and FPGAs have been proposed in the literature. Regrettably, the required all-to-all communication among the processing units limits the performance of these efforts. This paper examines a new class of hardware accelerators for large-scale combinatorial optimization and deep learning based on memristive Boltzmann machines. A massively parallel, memory-centric hardware accelerator is proposed based on recently developed resistive RAM (RRAM) technology. The proposed accelerator exploits the electrical properties of RRAm to realize in situ, fine-grained parallel computation within memory arrays, thereby eliminating the need for exchanging data between the memory cells and the computational units. Two classical optimization problems, graph partitioning and boolean satisfiability, and a deep belief network application are mapped onto the proposed hardware. As compared to a multicore system, the proposed accelerator achieves 57x higher performance and 25x lower energy with virtually no loss in the quality of the solution to the optimization problems. The memristive accelerator is also compared against an RRAM based processing-in-memory (PIM) system, with respective performance and energy improvements of 6.89x and 5.2x.", "year": 2016, "referenceCount": 92, "citationCount": 171, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1797114", "name": "M. N. Bojnordi"}, {"authorId": "1787439", "name": "Engin Ipek"}]}, {"paperId": "0cf494b6c250f72763bea8031ee82441fc51b1d4", "url": "https://www.semanticscholar.org/paper/0cf494b6c250f72763bea8031ee82441fc51b1d4", "title": "When Machine Learning Meets Privacy", "abstract": "The newly emerged machine learning (e.g., deep learning) methods have become a strong driving force to revolutionize a wide range of industries, such as smart healthcare, financial technology, and surveillance systems. Meanwhile, privacy has emerged as a big concern in this machine learning-based artificial intelligence era. It is important to note that the problem of privacy preservation in the context of machine learning is quite different from that in traditional data privacy protection, as machine learning can act as both friend and foe. Currently, the work on the preservation of privacy and machine learning are still in an infancy stage, as most existing solutions only focus on privacy problems during the machine learning process. Therefore, a comprehensive study on the privacy preservation problems and machine learning is required. This article surveys the state of the art in privacy issues and solutions for machine learning. The survey covers three categories of interactions between privacy and machine learning: (i) private machine learning, (ii) machine learning-aided privacy protection, and (iii) machine learning-based privacy attack and corresponding protection schemes. The current research progress in each category is reviewed and the key challenges are identified. Finally, based on our in-depth analysis of the area of privacy and machine learning, we point out future research directions in this field.", "year": 2021, "referenceCount": 180, "citationCount": 33, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2155440032", "name": "Bo Liu"}, {"authorId": "145633124", "name": "Ming Ding"}, {"authorId": "40221713", "name": "Sina Shaham"}, {"authorId": "145492472", "name": "W. Rahayu"}, {"authorId": "1803792", "name": "F. Farokhi"}, {"authorId": "1740858", "name": "Zihuai Lin"}]}, {"paperId": "69212cb4c6ea3e770152a82e60b7b52997278787", "url": "https://www.semanticscholar.org/paper/69212cb4c6ea3e770152a82e60b7b52997278787", "title": "Soft Architecture Machines", "abstract": "This book is an offspring of Negroponte's \"The Architecture Machine, \" published by The MIT Press in 1970. As is usually the case where computer systems are involved, the new generation is several orders of magnitude more powerful than even its remarkably mind-extending parent. The last few years have represented a \"passing from an idiom to a reality, following (not necessarily consciously) notions set down in \"The Architecture Machine\" with an uncanny precision. The prognostications of hardware enumerated in wanton fantasy have been achieved and even superseded in the actual Architecture Machine of 1972.\"The general assumption of this new book is that the architect is an unnecessary and even detrimental middleman between individual, continuously changing needs and the continuous incorporation of those needs into the built environment. The book proposes a new kind of architecture without architects, and even without surrogate architects.The first chapter sets forth generally what is involved in learning to understand both the makings of intelligence and the making of architecture. It reveals polarities in attitudes toward thinking about thinking, and it appraises techniques--real and potential--that lead to meaningful thought about the process.A more direct analysis of architectural design activities is presented in the second chapter. Its goal is to achieve a closer coupling between man and machine, and it proposes sidestepping the traditional division of labor in which man and machine are assigned tasks that they are supposed to be respectively better at. Instead, a joint venture model is suggested: man and machine are treated as equal partners, even as candid good friends.The third chapter moves beyond the architect--beyond the need for an outside designer's intervention between our needs and their fulfillment. It asserts that each individual can be the best architect for his own needs and does not require a paternalistic human or mechanical architect to dictate his final decisions.The last chapter--furthest out of all--looks toward a distant future not only beyond the architect but beyond architecture as we know it. Here architecture machines are not simply used as aids in the design of buildings--they serve as buildings in themselves. Man will live in living, intelligent machines or cognitive physical environments that can immediately respond to his needs or wishes or whims. The possibilities are unlimited and a challenge to any imagination.", "year": 1976, "referenceCount": 0, "citationCount": 292, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "2687459", "name": "N. Negroponte"}]}, {"paperId": "46f87a8bae08e872e3200987e3ba9d01237b46c2", "url": "https://www.semanticscholar.org/paper/46f87a8bae08e872e3200987e3ba9d01237b46c2", "title": "A Quality Control Model with Learning Effects", "abstract": "Abstract We present a model that extends a variant of the classic quality control/machine maintenance model by adding the concept of quality-based learning. The extension captures the idea that operators of a production process may be able to discover and eliminate defects in the system if, during an inspection, they find the process to be “out of control”. Thus, the distinguishing feature of the model is that one inspects the process not only for the purpose of riring the machine, but also in the hope that the machine will be caught in the act of producing defective output, so that a source of problems is uncovered and eliminated. The paper provides a characterization of optimal inspection policies and suggest the managerial implications: Ignoring the learning benefits of inspection and quality control activities may lead to underinvestment in quality improvement activities, which, in turn, may hinder both cost and quality competitiveness.", "year": 1988, "referenceCount": 17, "citationCount": 113, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2405534", "name": "Charles H. Fine"}]}, {"paperId": "68544f3f58f06ada5d3ac34ec2ea4decfc39b131", "url": "https://www.semanticscholar.org/paper/68544f3f58f06ada5d3ac34ec2ea4decfc39b131", "title": "High-dimensional regression adjustments in randomized experiments", "abstract": "Significance As datasets get larger and more complex, there is a growing interest in using machine-learning methods to enhance scientific analysis. In many settings, considerable work is required to make standard machine-learning methods useful for specific scientific applications. We find, however, that in the case of treatment effect estimation with randomized experiments, regression adjustments via machine-learning methods designed to minimize test set error directly induce efficient estimates of the average treatment effect. Thus, machine-learning methods can be used out of the box for this task, without any special-case adjustments. We study the problem of treatment effect estimation in randomized experiments with high-dimensional covariate information and show that essentially any risk-consistent regression adjustment can be used to obtain efficient estimates of the average treatment effect. Our results considerably extend the range of settings where high-dimensional regression adjustments are guaranteed to provide valid inference about the population average treatment effect. We then propose cross-estimation, a simple method for obtaining finite-sample–unbiased treatment effect estimates that leverages high-dimensional regression adjustments. Our method can be used when the regression model is estimated using the lasso, the elastic net, subset selection, etc. Finally, we extend our analysis to allow for adaptive specification search via cross-validation and flexible nonparametric regression adjustments with machine-learning methods such as random forests or neural networks.", "year": 2016, "referenceCount": 65, "citationCount": 84, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "3160667", "name": "Stefan Wager"}, {"authorId": "24091672", "name": "Wenfei Du"}, {"authorId": "2110315433", "name": "Jonathan E. Taylor"}, {"authorId": "1761784", "name": "R. Tibshirani"}]}, {"paperId": "25ad1c0a40278dd2fcb0d31d4f16d4a58a24528f", "url": "https://www.semanticscholar.org/paper/25ad1c0a40278dd2fcb0d31d4f16d4a58a24528f", "title": "An Overview of Genetic Algorithms", "abstract": "Presents an overview of the field of genetic algorithms, pioneered in the field of natural adaptive systems and simulated in software. They are shown as representing a novel optimization strategy which is receiving much attention. In machine learning they are a component of classifier systems which are able to extract rules from data. The algorithms discussed are based on the principles of population genetics and biology.", "year": 1992, "referenceCount": 1, "citationCount": 333, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2947941", "name": "J. Galletly"}]}, {"paperId": "a8c6c4bfb8d60355f699b05cae0e0c27cc5b38f7", "url": "https://www.semanticscholar.org/paper/a8c6c4bfb8d60355f699b05cae0e0c27cc5b38f7", "title": "Progress In Incremental Machine Learning", "abstract": "We will describe recent developments in a system for machine learning that we’ve been working on for some time (Sol 86, Sol 89). It is meant to be a \\Scientist’s Assistant\" of great power and versatility in many areas of science and mathematics. It difiers from other ambitious work in this area in that we are not so much interested in knowledge itself, as we are in how it is acquired - how machines may learn. To start ofi, the system will learn to solve two very general kinds of problems. Most, but perhaps not all problems in science and engineering are of these two kinds. The flrst kind is Function Inversion. These are the P and NP problems of computational complexity theory. They include theorem proving, solution of equations, symbolic integration, etc. The second kind of problem is Time Limited Optimization. Inductive inference of all kinds, surface reconstruction, and image restoration are a few examples of this kind of problem. Designing an automobile in 6 months satisfying certain speciflcations and having minimal cost, is another. In the following discussion, we will be using the term \\Probability\" in a special sense: i.e. the estimate given by the best probabilistic model for the available data that we can flnd in the available time. Our system starts out with a small set of Problem Solving Techniques (PSTs) and a simple General Conditional Probability Distribution (GCPD). When the system is given a problem, the description of this problem is the \\Condition\" for the GCPD. Its output is a probability distribution on PSTs - the likelihood that each of them will solve the problem by time t. It uses these PSTs and their associated probability distributions to solve the flrst problem. Next, it executes its Update Algorithm: The PSTs are modifled, new ones may be added, some may be deleted. The GCPD is modifled. These", "year": 2003, "referenceCount": 13, "citationCount": 55, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "1727567", "name": "R. Solomonoff"}]}, {"paperId": "2e5afed6eb2ef1e360618b7b1d545b7616d750b8", "url": "https://www.semanticscholar.org/paper/2e5afed6eb2ef1e360618b7b1d545b7616d750b8", "title": "Evaluating Predictive Uncertainty Challenge", "abstract": null, "year": 2005, "referenceCount": 12, "citationCount": 120, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3177568", "name": "J. Q. Candela"}, {"authorId": "3472959", "name": "C. Rasmussen"}, {"authorId": "50095217", "name": "Fabian H Sinz"}, {"authorId": "1698617", "name": "O. Bousquet"}, {"authorId": "1707625", "name": "B. Schölkopf"}]}, {"paperId": "97a3726b3f9395c8919c6271540d87d1c44e10ac", "url": "https://www.semanticscholar.org/paper/97a3726b3f9395c8919c6271540d87d1c44e10ac", "title": "Deep feature synthesis: Towards automating data science endeavors", "abstract": "In this paper, we develop the Data Science Machine, which is able to derive predictive models from raw data automatically. To achieve this automation, we first propose and develop the Deep Feature Synthesis algorithm for automatically generating features for relational datasets. The algorithm follows relationships in the data to a base field, and then sequentially applies mathematical functions along that path to create the final feature. Second, we implement a generalizable machine learning pipeline and tune it using a novel Gaussian Copula process based approach. We entered the Data Science Machine in 3 data science competitions that featured 906 other data science teams. Our approach beats 615 teams in these data science competitions. In 2 of the 3 competitions we beat a majority of competitors, and in the third, we achieved 94% of the best competitor's score. In the best case, with an ongoing competition, we beat 85.6% of the teams and achieved 95.7% of the top submissions score.", "year": 2015, "referenceCount": 19, "citationCount": 256, "influentialCitationCount": 32, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1398945328", "name": "James Max Kanter"}, {"authorId": "1803567", "name": "K. Veeramachaneni"}]}, {"paperId": "fbc5486a1ffb9039dbb5046b84f0eb32e4ce8eea", "url": "https://www.semanticscholar.org/paper/fbc5486a1ffb9039dbb5046b84f0eb32e4ce8eea", "title": "A Review on Generative Adversarial Networks: Algorithms, Theory, and Applications", "abstract": "Generative adversarial networks (GANs) are a hot research topic recently. GANs have been widely studied since 2014, and a large number of algorithms have been proposed. However, there is few comprehensive study explaining the connections among different GANs variants, and how they have evolved. In this paper, we attempt to provide a review on various GANs methods from the perspectives of algorithms, theory, and applications. Firstly, the motivations, mathematical representations, and structure of most GANs algorithms are introduced in details. Furthermore, GANs have been combined with other machine learning algorithms for specific applications, such as semi-supervised learning, transfer learning, and reinforcement learning. This paper compares the commonalities and differences of these GANs methods. Secondly, theoretical issues related to GANs are investigated. Thirdly, typical applications of GANs in image processing and computer vision, natural language processing, music, speech and audio, medical field, and data science are illustrated. Finally, the future open research problems for GANs are pointed out.", "year": 2020, "referenceCount": 465, "citationCount": 252, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "143987790", "name": "Jie Gui"}, {"authorId": "1757186", "name": "Zhenan Sun"}, {"authorId": "145868454", "name": "Yonggang Wen"}, {"authorId": "143719920", "name": "D. Tao"}, {"authorId": "2778556", "name": "Jieping Ye"}]}, {"paperId": "46d47481a8fb29b058b8d7c9939a9df91694784f", "url": "https://www.semanticscholar.org/paper/46d47481a8fb29b058b8d7c9939a9df91694784f", "title": "SVM multiregression for nonlinear channel estimation in multiple-input multiple-output systems", "abstract": "This paper addresses the problem of multiple-input multiple-output (MIMO) frequency nonselective channel estimation. We develop a new method for multiple variable regression estimation based on Support Vector Machines (SVMs): a state-of-the-art technique within the machine learning community for regression estimation. We show how this new method, which we call M-SVR, can be efficiently applied. The proposed regression method is evaluated in a MIMO system under a channel estimation scenario, showing its benefits in comparison to previous proposals when nonlinearities are present in either the transmitter or the receiver sides of the MIMO system.", "year": 2004, "referenceCount": 42, "citationCount": 230, "influentialCitationCount": 28, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "50509649", "name": "M. S. Fernández"}, {"authorId": "1400677573", "name": "M. Prado-Cumplido"}, {"authorId": "1385756446", "name": "J. Arenas-García"}, {"authorId": "1388508441", "name": "F. Pérez-Cruz"}]}, {"paperId": "86da6a1bf62ce8c94252c7772246f20106d8caf2", "url": "https://www.semanticscholar.org/paper/86da6a1bf62ce8c94252c7772246f20106d8caf2", "title": "Predicting Multiple Metrics for Queries: Better Decisions Enabled by Machine Learning", "abstract": "One of the most challenging aspects of managing a very large data warehouse is identifying how queries will behave before they start executing. Yet knowing their performance characteristics --- their runtimes and resource usage --- can solve two important problems. First, every database vendor struggles with managing unexpectedly long-running queries. When these long-running queries can be identified before they start, they can be rejected or scheduled when they will not cause extreme resource contention for the other queries in the system. Second, deciding whether a system can complete a given workload in a given time period (or a bigger system is necessary) depends on knowing the resource requirements of the queries in that workload. We have developed a system that uses machine learning to accurately predict the performance metrics of database queries whose execution times range from milliseconds to hours. For training and testing our system, we used both real customer queries and queries generated from an extended set of TPC-DS templates. The extensions mimic queries that caused customer problems. We used these queries to compare how accurately different techniques predict metrics such as elapsed time, records used, disk I/Os, and message bytes. The most promising technique was not only the most accurate, but also predicted these metrics simultaneously and using only information available prior to query execution. We validated the accuracy of this machine learning technique on a number of HP Neoview configurations. We were able to predict individual query elapsed time within 20% of its actual time for 85% of the test queries. Most importantly, we were able to correctly identify both the short and long-running (up to two hour) queries to inform workload management and capacity planning.", "year": 2009, "referenceCount": 23, "citationCount": 314, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1701816", "name": "A. Ganapathi"}, {"authorId": "2121201", "name": "H. Kuno"}, {"authorId": "1725067", "name": "U. Dayal"}, {"authorId": "1766403", "name": "J. Wiener"}, {"authorId": "143608596", "name": "A. Fox"}, {"authorId": "1694621", "name": "Michael I. Jordan"}, {"authorId": "1701130", "name": "D. Patterson"}]}, {"paperId": "7da1bb2a14bf043753469aa740a41478d04ec83e", "url": "https://www.semanticscholar.org/paper/7da1bb2a14bf043753469aa740a41478d04ec83e", "title": "Biostatistics", "abstract": "Bayesian modeling and inference, high-dimensional data analysis, statistical genetics and genomics, bioinformatics, informatics, statistical and machine learning, spatial and spatio-temporal modeling, time series analysis, survival data analysis, longitudinal data analysis, network analysis, causal inference, comparative effectiveness studies, model selection, epidemic modeling, and syndromic surveillance.", "year": 2005, "referenceCount": 5, "citationCount": 235, "influentialCitationCount": 24, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "2036256", "name": "J. Cavanaugh"}]}, {"paperId": "80949267f588ac406e2169b3b98ece573ed17da8", "url": "https://www.semanticscholar.org/paper/80949267f588ac406e2169b3b98ece573ed17da8", "title": "A feature agnostic approach for glaucoma detection in OCT volumes", "abstract": "Optical coherence tomography (OCT) based measurements of retinal layer thickness, such as the retinal nerve fibre layer (RNFL) and the ganglion cell with inner plexiform layer (GCIPL) are commonly employed for the diagnosis and monitoring of glaucoma. Previously, machine learning techniques have relied on segmentation-based imaging features such as the peripapillary RNFL thickness and the cup-to-disc ratio. Here, we propose a deep learning technique that classifies eyes as healthy or glaucomatous directly from raw, unsegmented OCT volumes of the optic nerve head (ONH) using a 3D Convolutional Neural Network (CNN). We compared the accuracy of this technique with various feature-based machine learning algorithms and demonstrated the superiority of the proposed deep learning based method. Logistic regression was found to be the best performing classical machine learning technique with an AUC of 0.89. In direct comparison, the deep learning approach achieved a substantially higher AUC of 0.94 with the additional advantage of providing insight into which regions of an OCT volume are important for glaucoma detection. Computing Class Activation Maps (CAM), we found that the CNN identified neuroretinal rim and optic disc cupping as well as the lamina cribrosa (LC) and its surrounding areas as the regions significantly associated with the glaucoma classification. These regions anatomically correspond to the well established and commonly used clinical markers for glaucoma diagnosis such as increased cup volume, cup diameter, and neuroretinal rim thinning at the superior and inferior segments.", "year": 2018, "referenceCount": 42, "citationCount": 109, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "2428309", "name": "S. Maetschke"}, {"authorId": "1992686", "name": "B. Antony"}, {"authorId": "66193516", "name": "H. Ishikawa"}, {"authorId": "31452828", "name": "Rahil Garvani"}]}, {"paperId": "dd456b62e4961a832d9020e7d546c6efedbe4de3", "url": "https://www.semanticscholar.org/paper/dd456b62e4961a832d9020e7d546c6efedbe4de3", "title": "Machine learning for many-body physics: The case of the Anderson impurity model", "abstract": "Machine learning methods are applied to finding the Green's function of the Anderson impurity model, a basic model system of quantum many-body condensed-matter physics. Different methods of parametrizing the Green's function are investigated; a representation in terms of Legendre polynomials is found to be superior due to its limited number of coefficients and its applicability to state of the art methods of solution. The dependence of the errors on the size of the training set is determined. The results indicate that a machine learning approach to dynamical mean-field theory may be feasible.", "year": 2014, "referenceCount": 35, "citationCount": 98, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics"], "authors": [{"authorId": "93638590", "name": "L. Arsenault"}, {"authorId": "1398945311", "name": "A. Lopez-Bezanilla"}, {"authorId": "11615881", "name": "O. A. V. Lilienfeld"}, {"authorId": "5796209", "name": "A. Millis"}]}, {"paperId": "031548b9beb9e9411da1da0dfdff0ed4ffa447d2", "url": "https://www.semanticscholar.org/paper/031548b9beb9e9411da1da0dfdff0ed4ffa447d2", "title": "Neural Decoder for Topological Codes.", "abstract": "We present an algorithm for error correction in topological codes that exploits modern machine learning techniques. Our decoder is constructed from a stochastic neural network called a Boltzmann machine, of the type extensively used in deep learning. We provide a general prescription for the training of the network and a decoding strategy that is applicable to a wide variety of stabilizer codes with very little specialization. We demonstrate the neural decoder numerically on the well-known two-dimensional toric code with phase-flip errors.", "year": 2016, "referenceCount": 21, "citationCount": 126, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine", "Computer Science"], "authors": [{"authorId": "3422999", "name": "G. Torlai"}, {"authorId": "3422513", "name": "R. Melko"}]}, {"paperId": "5b5cc77898a71a1386734584ceef4070263b8d03", "url": "https://www.semanticscholar.org/paper/5b5cc77898a71a1386734584ceef4070263b8d03", "title": "ParlAI: A Dialog Research Software Platform", "abstract": "We introduce ParlAI (pronounced “par-lay”), an open-source software platform for dialog research implemented in Python, available at http://parl.ai. Its goal is to provide a unified framework for sharing, training and testing dialog models; integration of Amazon Mechanical Turk for data collection, human evaluation, and online/reinforcement learning; and a repository of machine learning models for comparing with others’ models, and improving upon existing architectures. Over 20 tasks are supported in the first release, including popular datasets such as SQuAD, bAbI tasks, MCTest, WikiQA, QACNN, QADailyMail, CBT, bAbI Dialog, Ubuntu, OpenSubtitles and VQA. Several models are integrated, including neural models such as memory networks, seq2seq and attentive LSTMs.", "year": 2017, "referenceCount": 25, "citationCount": 256, "influentialCitationCount": 38, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143622869", "name": "Alexander H. Miller"}, {"authorId": "11636339", "name": "Will Feng"}, {"authorId": "1746610", "name": "Dhruv Batra"}, {"authorId": "1713934", "name": "Antoine Bordes"}, {"authorId": "2064150446", "name": "Adam Fisch"}, {"authorId": "8553015", "name": "Jiasen Lu"}, {"authorId": "153432684", "name": "Devi Parikh"}, {"authorId": "145183709", "name": "J. Weston"}]}, {"paperId": "2bccd2ed38f10bec8a228548dbdcf9a2b317c62a", "url": "https://www.semanticscholar.org/paper/2bccd2ed38f10bec8a228548dbdcf9a2b317c62a", "title": "Learning Robot Behaviour and Skills Based on Human Demonstration and Advice: The Machine Learning Paradigm", "abstract": null, "year": 2000, "referenceCount": 82, "citationCount": 147, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144427136", "name": "R. Dillmann"}, {"authorId": "2433006", "name": "O. Rogalla"}, {"authorId": "2104754", "name": "M. Ehrenmann"}, {"authorId": "113420109", "name": "R. Zöliner"}, {"authorId": "3305880", "name": "M. Bordegoni"}]}, {"paperId": "51bb0b430daf33779c6c1b21ce9f888ea11f2c67", "url": "https://www.semanticscholar.org/paper/51bb0b430daf33779c6c1b21ce9f888ea11f2c67", "title": "Machine learning for autonomous crystal structure identification.", "abstract": "We present a machine learning technique to discover and distinguish relevant ordered structures from molecular simulation snapshots or particle tracking data. Unlike other popular methods for structural identification, our technique requires no a priori description of the target structures. Instead, we use nonlinear manifold learning to infer structural relationships between particles according to the topology of their local environment. This graph-based approach yields unbiased structural information which allows us to quantify the crystalline character of particles near defects, grain boundaries, and interfaces. We demonstrate the method by classifying particles in a simulation of colloidal crystallization, and show that our method identifies structural features that are missed by standard techniques.", "year": 2017, "referenceCount": 58, "citationCount": 71, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3757323", "name": "Wesley F. Reinhart"}, {"authorId": "1773729", "name": "Andrew W. Long"}, {"authorId": "15035314", "name": "Michael P. Howard"}, {"authorId": "2424441", "name": "Andrew L. Ferguson"}, {"authorId": "2318633", "name": "A. Panagiotopoulos"}]}, {"paperId": "076f59364df347c72e42b8de21c3976c8818622f", "url": "https://www.semanticscholar.org/paper/076f59364df347c72e42b8de21c3976c8818622f", "title": "Comment on “Predicting reaction performance in C–N cross-coupling using machine learning”", "abstract": "Ahneman et al. (Reports, 13 April 2018) applied machine learning models to predict C–N cross-coupling reaction yields. The models use atomic, electronic, and vibrational descriptors as input features. However, the experimental design is insufficient to distinguish models trained on chemical features from those trained solely on random-valued features in retrospective and prospective test scenarios, thus failing classical controls in machine learning.", "year": 2018, "referenceCount": 13, "citationCount": 66, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "7935819", "name": "Kangway V Chuang"}, {"authorId": "2780351", "name": "Michael J. Keiser"}]}, {"paperId": "97230c259ce3a6dc1ff1b83371aa2815793f8d4c", "url": "https://www.semanticscholar.org/paper/97230c259ce3a6dc1ff1b83371aa2815793f8d4c", "title": "Biomimetic Hybrid Feedback Feedforward Neural-Network Learning Control", "abstract": "This brief presents a biomimetic hybrid feedback feedforward neural-network learning control (NNLC) strategy inspired by the human motor learning control mechanism for a class of uncertain nonlinear systems. The control structure includes a proportional-derivative controller acting as a feedback servo machine and a radial-basis-function (RBF) NN acting as a feedforward predictive machine. Under the sufficient constraints on control parameters, the closed-loop system achieves semiglobal practical exponential stability, such that an accurate NN approximation is guaranteed in a local region along recurrent reference trajectories. Compared with the existing NNLC methods, the novelties of the proposed method include: 1) the implementation of an adaptive NN control to guarantee plant states being recurrent is not needed, since recurrent reference signals rather than plant states are utilized as NN inputs, which greatly simplifies the analysis and synthesis of the NNLC and 2) the domain of NN approximation can be determined a priori by the given reference signals, which leads to an easy construction of the RBF-NNs. Simulation results have verified the effectiveness of this approach.", "year": 2017, "referenceCount": 36, "citationCount": 107, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1714827", "name": "Yongping Pan"}, {"authorId": "1741040", "name": "Haoyong Yu"}]}, {"paperId": "354c0453f0db9cceea954cc0aa787e3093bcb920", "url": "https://www.semanticscholar.org/paper/354c0453f0db9cceea954cc0aa787e3093bcb920", "title": "Collaborative Machine Learning with Incentive-Aware Model Rewards", "abstract": "Collaborative machine learning (ML) is an appealing paradigm to build high-quality ML models by training on the aggregated data from many parties. However, these parties are only willing to share their data when given enough incentives, such as a guaranteed fair reward based on their contributions. This motivates the need for measuring a party's contribution and designing an incentive-aware reward scheme accordingly. This paper proposes to value a party's reward based on Shapley value and information gain on model parameters given its data. Subsequently, we give each party a model as a reward. To formally incentivize the collaboration, we define some desirable properties (e.g., fairness and stability) which are inspired by cooperative game theory but adapted for our model reward that is uniquely freely replicable. Then, we propose a novel model reward scheme to satisfy fairness and trade off between the desirable properties via an adjustable parameter. The value of each party's model reward determined by our scheme is attained by injecting Gaussian noise to the aggregated training data with an optimized noise variance. We empirically demonstrate interesting properties of our scheme and evaluate its performance using synthetic and real-world datasets.", "year": 2020, "referenceCount": 27, "citationCount": 44, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2003246244", "name": "Rachael Hwee Ling Sim"}, {"authorId": "72095066", "name": "Yehong Zhang"}, {"authorId": "1682291", "name": "M. Chan"}, {"authorId": "2003246280", "name": "Bryan Kian"}, {"authorId": "2003246325", "name": "Hsiang Low"}]}, {"paperId": "c08338d1f19187d3c0b8edcce3beb9d9d61aa886", "url": "https://www.semanticscholar.org/paper/c08338d1f19187d3c0b8edcce3beb9d9d61aa886", "title": "Driver Distraction Detection Using Semi-Supervised Machine Learning", "abstract": "Real-time driver distraction detection is the core to many distraction countermeasures and fundamental for constructing a driver-centered driver assistance system. While data-driven methods demonstrate promising detection performance, a particular challenge is how to reduce the considerable cost for collecting labeled data. This paper explored semi-supervised methods for driver distraction detection in real driving conditions to alleviate the cost of labeling training data. Laplacian support vector machine and semi-supervised extreme learning machine were evaluated using eye and head movements to classify two driver states: attentive and cognitively distracted. With the additional unlabeled data, the semi-supervised learning methods improved the detection performance (G-mean) by 0.0245, on average, over all subjects, as compared with the traditional supervised methods. As unlabeled training data can be collected from drivers' naturalistic driving records with little extra resource, semi-supervised methods, which utilize both labeled and unlabeled data, can enhance the efficiency of model development in terms of time and cost.", "year": 2016, "referenceCount": 56, "citationCount": 129, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1776911", "name": "Tianchi Liu"}, {"authorId": "2108850466", "name": "Yan Yang"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "2210504", "name": "Yong Kiang Yeo"}, {"authorId": "145558868", "name": "Zhiping Lin"}]}, {"paperId": "4e7a77326bc8fcf64943aab06c658c27ec28ec55", "url": "https://www.semanticscholar.org/paper/4e7a77326bc8fcf64943aab06c658c27ec28ec55", "title": "A Quasi-Newton Approach to Nonsmooth Convex Optimization Problems in Machine Learning", "abstract": "We extend the well-known BFGS quasi-Newton method and its memory-limited variant LBFGS to the optimization of nonsmooth convex objectives. This is done in a rigorous fashion by generalizing three components of BFGS to subdifferentials: the local quadratic model, the identification of a descent direction, and the Wolfe line search conditions. We prove that under some technical conditions, the resulting subBFGS algorithm is globally convergent in objective function value. We apply its memory-limited variant (subLBFGS) to L2-regularized risk minimization with the binary hinge loss. To extend our algorithm to the multiclass and multilabel settings, we develop a new, efficient, exact line search algorithm. We prove its worst-case time complexity bounds, and show that our line search can also be used to extend a recently developed bundle method to the multiclass and multilabel settings. We also apply the direction-finding component of our algorithm to L1-regularized risk minimization with logistic loss. In all these contexts our methods perform comparable to or better than specialized state-of-the-art solvers on a number of publicly available data sets. An open source implementation of our algorithms is freely available.", "year": 2008, "referenceCount": 49, "citationCount": 110, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "40565216", "name": "Jin Yu"}, {"authorId": "145713876", "name": "S. Vishwanathan"}, {"authorId": "2105506680", "name": "Simon Günter"}, {"authorId": "1739396", "name": "N. Schraudolph"}]}, {"paperId": "fc8b3a7622ddf5ab88fe06de260898202cf06233", "url": "https://www.semanticscholar.org/paper/fc8b3a7622ddf5ab88fe06de260898202cf06233", "title": "Similarity-based machine learning methods for predicting drug-target interactions: a brief review", "abstract": "Computationally predicting drug-target interactions is useful to select possible drug (or target) candidates for further biochemical verification. We focus on machine learning-based approaches, particularly similarity-based methods that use drug and target similarities, which show relationships among drugs and those among targets, respectively. These two similarities represent two emerging concepts, the chemical space and the genomic space. Typically, the methods combine these two types of similarities to generate models for predicting new drug-target interactions. This process is also closely related to a lot of work in pharmacogenomics or chemical biology that attempt to understand the relationships between the chemical and genomic spaces. This background makes the similarity-based approaches attractive and promising. This article reviews the similarity-based machine learning methods for predicting drug-target interactions, which are state-of-the-art and have aroused great interest in bioinformatics. We describe each of these methods briefly, and empirically compare these methods under a uniform experimental setting to explore their advantages and limitations.", "year": 2014, "referenceCount": 70, "citationCount": 301, "influentialCitationCount": 23, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2113454271", "name": "Hao Ding"}, {"authorId": "2400256", "name": "Ichigaku Takigawa"}, {"authorId": "1686589", "name": "Hiroshi Mamitsuka"}, {"authorId": "7472263", "name": "Shanfeng Zhu"}]}, {"paperId": "b305c18d17fd6a17e8e52a21bcd680220d322cc3", "url": "https://www.semanticscholar.org/paper/b305c18d17fd6a17e8e52a21bcd680220d322cc3", "title": "Neural Networks: Tricks of the Trade", "abstract": null, "year": 2012, "referenceCount": 112, "citationCount": 655, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1388546388", "name": "Grgoire Montavon"}, {"authorId": "1382473772", "name": "Genevive Orr"}, {"authorId": "2068918803", "name": "Klaus-Robert Mller"}]}, {"paperId": "cfcf66e4b22dc7671a5941e94e9d4afae75ba2f8", "url": "https://www.semanticscholar.org/paper/cfcf66e4b22dc7671a5941e94e9d4afae75ba2f8", "title": "The Cramer Distance as a Solution to Biased Wasserstein Gradients", "abstract": "The Wasserstein probability metric has received much attention from the machine learning community. Unlike the Kullback-Leibler divergence, which strictly measures change in probability, the Wasserstein metric reflects the underlying geometry between outcomes. The value of being sensitive to this geometry has been demonstrated, among others, in ordinal regression and generative modelling, and most recently in reinforcement learning. In this paper we describe three natural properties of probability divergences that we believe reflect requirements from machine learning: sum invariance, scale sensitivity, and unbiased sample gradients. The Wasserstein metric possesses the first two properties but, unlike the Kullback-Leibler divergence, does not possess the third. We provide empirical evidence suggesting this is a serious issue in practice. Leveraging insights from probabilistic forecasting we propose an alternative to the Wasserstein metric, the Cramer distance. We show that the Cramer distance possesses all three desired properties, combining the best of the Wasserstein and Kullback-Leibler divergences. We give empirical results on a number of domains comparing these three divergences. To illustrate the practical relevance of the Cramer distance we design a new algorithm, the Cramer Generative Adversarial Network (GAN), and show that it has a number of desirable properties over the related Wasserstein GAN.", "year": 2017, "referenceCount": 38, "citationCount": 268, "influentialCitationCount": 48, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1792298", "name": "Marc G. Bellemare"}, {"authorId": "1841008", "name": "Ivo Danihelka"}, {"authorId": "2605877", "name": "Will Dabney"}, {"authorId": "14594344", "name": "S. Mohamed"}, {"authorId": "40627523", "name": "Balaji Lakshminarayanan"}, {"authorId": "7018631", "name": "Stephan Hoyer"}, {"authorId": "1708654", "name": "R. Munos"}]}, {"paperId": "24e250cb8a94742eed51dc2035fb41bddea2ceb9", "url": "https://www.semanticscholar.org/paper/24e250cb8a94742eed51dc2035fb41bddea2ceb9", "title": "Applying reinforcement learning towards automating resource allocation and application scalability in the cloud", "abstract": "Public Infrastructure as a Service (IaaS) clouds such as Amazon, GoGrid and Rackspace deliver computational resources by means of virtualisation technologies. These technologies allow multiple independent virtual machines to reside in apparent isolation on the same physical host. Dynamically scaling applications running on IaaS clouds can lead to varied and unpredictable results because of the performance interference effects associated with co‐located virtual machines. Determining appropriate scaling policies in a dynamic non‐stationary environment is non‐trivial. One principle advantage exhibited by IaaS clouds over their traditional hosting counterparts is the ability to scale resources on‐demand. However, a problem arises concerning resource allocation as to which resources should be added and removed when the underlying performance of the resource is in a constant state of flux. Decision theoretic frameworks such as Markov Decision Processes are particularly suited to decision making under uncertainty. By applying a temporal difference, reinforcement learning algorithm known as Q‐learning, optimal scaling policies can be determined. Additionally, reinforcement learning techniques typically suffer from curse of dimensionality problems, where the state space grows exponentially with each additional state variable. To address this challenge, we also present a novel parallel Q‐learning approach aimed at reducing the time taken to determine optimal policies whilst learning online. Copyright © 2012 John Wiley & Sons, Ltd.", "year": 2013, "referenceCount": 38, "citationCount": 202, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47862122", "name": "E. Barrett"}, {"authorId": "48313838", "name": "E. Howley"}, {"authorId": "2462471", "name": "J. Duggan"}]}, {"paperId": "1eb7b1cafe1891712a4f764c78399a53182cdcd1", "url": "https://www.semanticscholar.org/paper/1eb7b1cafe1891712a4f764c78399a53182cdcd1", "title": "Rényi Fair Inference", "abstract": "Machine learning algorithms have been increasingly deployed in critical automated decision-making systems that directly affect human lives. When these algorithms are solely trained to minimize the training/test error, they could suffer from systematic discrimination against individuals based on their sensitive attributes, such as gender or race. Recently, there has been a surge in machine learning society to develop algorithms for fair machine learning. In particular, several adversarial learning procedures have been proposed to impose fairness. Unfortunately, these algorithms either can only impose fairness up to linear dependence between the variables, or they lack computational convergence guarantees. In this paper, we use Renyi correlation as a measure of fairness of machine learning models and develop a general training framework to impose fairness. In particular, we propose a min-max formulation which balances the accuracy and fairness when solved to optimality. For the case of discrete sensitive attributes, we suggest an iterative algorithm with theoretical convergence guarantee for solving the proposed min-max problem. Our algorithm and analysis are then specialized to fair classification and fair clustering problems. To demonstrate the performance of the proposed Renyi fair inference framework in practice, we compare it with well-known existing methods on several benchmark datasets. Experiments indicate that the proposed method has favorable empirical performance against state-of-the-art approaches.", "year": 2020, "referenceCount": 61, "citationCount": 40, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "148009027", "name": "Sina Baharlouei"}, {"authorId": "23638986", "name": "Maher Nouiehed"}, {"authorId": "1800298", "name": "Meisam Razaviyayn"}]}, {"paperId": "be4faf0555f8610d6c813dc591bee21376f67a09", "url": "https://www.semanticscholar.org/paper/be4faf0555f8610d6c813dc591bee21376f67a09", "title": "Retrospective on a decade of machine learning for chemical discovery", "abstract": null, "year": 2020, "referenceCount": 34, "citationCount": 63, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Physics"], "authors": [{"authorId": "7847508", "name": "O. A. von Lilienfeld"}, {"authorId": "2544144", "name": "K. Burke"}]}, {"paperId": "b7b77aa45142184a09449083bd2b6e09b58ddd0b", "url": "https://www.semanticscholar.org/paper/b7b77aa45142184a09449083bd2b6e09b58ddd0b", "title": "The Implicit Fairness Criterion of Unconstrained Learning", "abstract": "We clarify what fairness guarantees we can and cannot expect to follow from unconstrained machine learning. Specifically, we characterize when unconstrained learning on its own implies group calibration, that is, the outcome variable is conditionally independent of group membership given the score. We show that under reasonable conditions, the deviation from satisfying group calibration is upper bounded by the excess risk of the learned score relative to the Bayes optimal score function. A lower bound confirms the optimality of our upper bound. Moreover, we prove that as the excess risk of the learned score decreases, it strongly violates separation and independence, two other standard fairness criteria. \nOur results show that group calibration is the fairness criterion that unconstrained learning implicitly favors. On the one hand, this means that calibration is often satisfied on its own without the need for active intervention, albeit at the cost of violating other criteria that are at odds with calibration. On the other hand, it suggests that we should be satisfied with calibration as a fairness criterion only if we are at ease with the use of unconstrained machine learning in a given application.", "year": 2018, "referenceCount": 42, "citationCount": 59, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1748108610", "name": "Lydia T. Liu"}, {"authorId": "3385674", "name": "Max Simchowitz"}, {"authorId": "1775622", "name": "Moritz Hardt"}]}, {"paperId": "3a2e75b97eae168a790732bd7662911e4e10bdd6", "url": "https://www.semanticscholar.org/paper/3a2e75b97eae168a790732bd7662911e4e10bdd6", "title": "Joint Feature Selection and Subspace Learning", "abstract": "Dimensionality reduction is a very important topic in machine learning. It can be generally classified into two categories: feature selection and subspace learning. In the past decades, many methods have been proposed for dimensionality reduction. However, most of these works study feature selection and subspace learning independently. In this paper, we present a framework for joint feature selection and subspace learning. We reformulate the subspace learning problem and use L2,1-norm on the projection matrix to achieve row-sparsity, which leads to selecting relevant features and learning transformation simultaneously. We discuss two situations of the proposed framework, and present their optimization algorithms. Experiments on benchmark face recognition data sets illustrate that the proposed framework outperforms the state of the art methods overwhelmingly.", "year": 2011, "referenceCount": 38, "citationCount": 194, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9937103", "name": "Quanquan Gu"}, {"authorId": "2109640666", "name": "Z. Li"}, {"authorId": "145325584", "name": "Jiawei Han"}]}, {"paperId": "6d8db61577a021981ccf58d0c5ced167674b389c", "url": "https://www.semanticscholar.org/paper/6d8db61577a021981ccf58d0c5ced167674b389c", "title": "On-Device Machine Learning: An Algorithms and Learning Theory Perspective", "abstract": "The predominant paradigm for using machine learning models on a device is to train a model in the cloud and perform inference using the trained model on the device. However, with increasing number of smart devices and improved hardware, there is interest in performing model training on the device. Given this surge in interest, a comprehensive survey of the field from a device-agnostic perspective sets the stage for both understanding the state-of-the-art and for identifying open challenges and future avenues of research. However, on-device learning is an expansive field with connections to a large number of related topics in AI and machine learning (including online learning, model adaptation, one/few-shot learning, etc.). Hence, covering such a large number of topics in a single survey is impractical. This survey finds a middle ground by reformulating the problem of on-device learning as resource constrained learning where the resources are compute and memory. This reformulation allows tools, techniques, and algorithms from a wide variety of research areas to be compared equitably. In addition to summarizing the state-of-the-art, the survey also identifies a number of challenges and next steps for both the algorithmic and theoretical aspects of on-device learning.", "year": 2019, "referenceCount": 210, "citationCount": 60, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3314219", "name": "Sauptik Dhar"}, {"authorId": "3245791", "name": "Junyao Guo"}, {"authorId": "48211043", "name": "Jiayi Liu"}, {"authorId": "2347331", "name": "S. Tripathi"}, {"authorId": "2820048", "name": "Unmesh Kurup"}, {"authorId": "40225085", "name": "Mohak Shah"}]}, {"paperId": "1d4b4f1ca1e7492820411fd668f09984fefe8c3e", "url": "https://www.semanticscholar.org/paper/1d4b4f1ca1e7492820411fd668f09984fefe8c3e", "title": "Visual Analytics for Explainable Deep Learning", "abstract": "Recently, deep learning has been advancing the state of the art in artificial intelligence to a new level, and humans rely on artificial intelligence techniques more than ever. However, even with such unprecedented advancements, the lack of explanation regarding the decisions made by deep learning models and absence of control over their internal processes act as major drawbacks in critical decision-making processes, such as precision medicine and law enforcement. In response, efforts are being made to make deep learning interpretable and controllable by humans. This article reviews visual analytics, information visualization, and machine learning perspectives relevant to this aim, and discusses potential challenges and future research directions.", "year": 2018, "referenceCount": 18, "citationCount": 158, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "1795455", "name": "J. Choo"}, {"authorId": "48641970", "name": "Shixia Liu"}]}, {"paperId": "cfa2646776405d50533055ceb1b7f050e9014dcb", "url": "https://www.semanticscholar.org/paper/cfa2646776405d50533055ceb1b7f050e9014dcb", "title": "Semi-Supervised Recursive Autoencoders for Predicting Sentiment Distributions", "abstract": "We introduce a novel machine learning framework based on recursive autoencoders for sentence-level prediction of sentiment label distributions. Our method learns vector space representations for multi-word phrases. In sentiment prediction tasks these representations outperform other state-of-the-art approaches on commonly used datasets, such as movie reviews, without using any pre-defined sentiment lexica or polarity shifting rules. We also evaluate the model's ability to predict sentiment distributions on a new dataset based on confessions from the experience project. The dataset consists of personal user stories annotated with multiple labels which, when aggregated, form a multinomial distribution that captures emotional reactions. Our algorithm can more accurately predict distributions over such labels compared to several competitive baselines.", "year": 2011, "referenceCount": 38, "citationCount": 1288, "influentialCitationCount": 135, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2166511", "name": "R. Socher"}, {"authorId": "143845796", "name": "Jeffrey Pennington"}, {"authorId": "40150953", "name": "E. Huang"}, {"authorId": "34699434", "name": "A. Ng"}, {"authorId": "144783904", "name": "Christopher D. Manning"}]}, {"paperId": "5913cbd4d209311df06c7fdab7ba34b082098853", "url": "https://www.semanticscholar.org/paper/5913cbd4d209311df06c7fdab7ba34b082098853", "title": "A Comparative Study on Machine Learning Algorithms for Smart Manufacturing: Tool Wear Prediction Using Random Forests", "abstract": "Manufacturers have faced an increasing need for the development of predictive models that predict mechanical failures and the remaining useful life (RUL) of manufacturing systems or components. Classical model-based or physics-based prognostics often require an in-depth physical understanding of the system of interest to develop closedform mathematical models. However, prior knowledge of system behavior is not always available, especially for complex manufacturing systems and processes. To complement model-based prognostics, data-driven methods have been increasingly applied to machinery prognostics and maintenance management, transforming legacy manufacturing systems into smart manufacturing systems with artificial intelligence. While previous research has demonstrated the effectiveness of data-driven methods, most of these prognostic methods are based on classical machine learning techniques, such as artificial neural networks (ANNs) and support vector regression (SVR). With the rapid advancement in artificial intelligence, various machine learning algorithms have been developed and widely applied in many engineering fields. The objective of this research is to introduce a random forests (RFs)-based prognostic method for tool wear prediction as well as compare the performance of RFs with feed-forward back propagation (FFBP) ANNs and SVR. Specifically, the performance of FFBP ANNs, SVR, and RFs are compared using an experimental data collected from 315 milling tests. Experimental results have shown that RFs can generate more accurate predictions than FFBP ANNs with a single hidden layer and SVR. [DOI: 10.1115/1.4036350]", "year": 2017, "referenceCount": 50, "citationCount": 294, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "48198404", "name": "Dazhong Wu"}, {"authorId": "26999030", "name": "Connor Jennings"}, {"authorId": "2939300", "name": "J. Terpenny"}, {"authorId": "1700762", "name": "R. Gao"}, {"authorId": "1749112", "name": "S. Kumara"}]}, {"paperId": "660ff427b97bda39a007687b777a3e1fae56be9d", "url": "https://www.semanticscholar.org/paper/660ff427b97bda39a007687b777a3e1fae56be9d", "title": "The production of prediction: What does machine learning want?", "abstract": "Retail, media, finance, science, industry, security and government increasingly depend on predictions produced through techniques such as machine learning. How is it that machine learning can promise to predict with great specificity what differences matter or what people want in many different settings? We need, I suggest, an account of its generalization if we are to understand the contemporary production of prediction. This article maps the principal forms of material action, narrative and problematization that run across algorithmic modelling techniques such as logistic regression, decision trees and Naive Bayes classifiers. It highlights several interlinked modes of generalization that engender increasingly vast data infrastructures and platforms, and intensified mathematical and statistical treatments of differences. Such an account also points to some key sites of instability or problematization inherent to the process of generalization. If movement through data is becoming a principal intersection of power relations, economic value and valid knowledge, an account of the production of prediction might also help us begin to ask how its generalization potentially gives rise to new forms of agency, experience or individuations.", "year": 2015, "referenceCount": 34, "citationCount": 122, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39822261", "name": "A. Mackenzie"}]}, {"paperId": "bb414c09ace7083c41c1164f5de4a901ddd8f146", "url": "https://www.semanticscholar.org/paper/bb414c09ace7083c41c1164f5de4a901ddd8f146", "title": "Using Machine Learning To Predict Suitable Conditions for Organic Reactions", "abstract": "Reaction condition recommendation is an essential element for the realization of computer-assisted synthetic planning. Accurate suggestions of reaction conditions are required for experimental validation and can have a significant effect on the success or failure of an attempted transformation. However, de novo condition recommendation remains a challenging and under-explored problem and relies heavily on chemists’ knowledge and experience. In this work, we develop a neural-network model to predict the chemical context (catalyst(s), solvent(s), reagent(s)), as well as the temperature most suitable for any particular organic reaction. Trained on ∼10 million examples from Reaxys, the model is able to propose conditions where a close match to the recorded catalyst, solvent, and reagent is found within the top-10 predictions 69.6% of the time, with top-10 accuracies for individual species reaching 80–90%. Temperature is accurately predicted within ±20 °C from the recorded temperature in 60–70% of test cases, with higher accuracy for cases with correct chemical context predictions. The utility of the model is illustrated through several examples spanning a range of common reaction classes. We also demonstrate that the model implicitly learns a continuous numerical embedding of solvent and reagent species that captures their functional similarity.", "year": 2018, "referenceCount": 48, "citationCount": 156, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "30996158", "name": "Hanyu Gao"}, {"authorId": "12514946", "name": "Thomas J. Struble"}, {"authorId": "13027820", "name": "Connor W. Coley"}, {"authorId": "2107935841", "name": "Yuran Wang"}, {"authorId": "143964245", "name": "W. Green"}, {"authorId": "144050039", "name": "K. Jensen"}]}, {"paperId": "c972d4a2f786f7537a2f0cc89a8b073983849756", "url": "https://www.semanticscholar.org/paper/c972d4a2f786f7537a2f0cc89a8b073983849756", "title": "Active Machine Learning for Consideration Heuristics", "abstract": "We develop and test an active-machine-learning method to select questions adaptively when consumers use heuristic decision rules. The method tailors priors to each consumer based on a “configurator.” Subsequent questions maximize information about the decision heuristics (minimize expected posterior entropy). To update posteriors after each question, we approximate the posterior with a variational distribution and use belief propagation (iterative loops of Bayes updating). The method runs sufficiently fast to select new queries in under a second and provides significantly and substantially more information per question than existing methods based on random, market-based, or orthogonal-design questions. \n \nSynthetic data experiments demonstrate that adaptive questions provide close-to-optimal information and outperform existing methods even when there are response errors or “bad” priors. The basic algorithm focuses on conjunctive or disjunctive rules, but we demonstrate generalizations to more complex heuristics and to the use of previous-respondent data to improve consumer-specific priors. We illustrate the algorithm empirically in a Web-based survey conducted by an American automotive manufacturer to study vehicle consideration (872 respondents, 53 feature levels). Adaptive questions outperform market-based questions when estimating heuristic decision rules. Heuristic decision rules predict validation decisions better than compensatory rules.", "year": 2011, "referenceCount": 66, "citationCount": 75, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2530415", "name": "Daria Dzyabura"}, {"authorId": "2344635", "name": "J. Hauser"}]}, {"paperId": "ae5eb09b64347f1ac0531d5c1bd873b2357b8838", "url": "https://www.semanticscholar.org/paper/ae5eb09b64347f1ac0531d5c1bd873b2357b8838", "title": "StormDroid: A Streaminglized Machine Learning-Based System for Detecting Android Malware", "abstract": "Mobile devices are especially vulnerable nowadays to malware attacks, thanks to the current trend of increased app downloads. Despite the significant security and privacy concerns it received, effective malware detection (MD) remains a significant challenge. This paper tackles this challenge by introducing a streaminglized machine learning-based MD framework, StormDroid: (i) The core of StormDroid is based on machine learning, enhanced with a novel combination of contributed features that we observed over a fairly large collection of data set; and (ii) we streaminglize the whole MD process to support large-scale analysis, yielding an efficient and scalable MD technique that observes app behaviors statically and dynamically. Evaluated on roughly 8,000 applications, our combination of contributed features improves MD accuracy by almost 10% compared with state-of-the-art antivirus systems; in parallel our streaminglized process, StormDroid, further improves efficiency rate by approximately three times than a single thread.", "year": 2016, "referenceCount": 42, "citationCount": 143, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48847695", "name": "Sen Chen"}, {"authorId": "2837434", "name": "Minhui Xue"}, {"authorId": "3305706", "name": "Zhushou Tang"}, {"authorId": "46265379", "name": "Lihua Xu"}, {"authorId": "1741879", "name": "Haojin Zhu"}]}, {"paperId": "90ba5eb1021fdf05edbbcb1424c477d86dd3a216", "url": "https://www.semanticscholar.org/paper/90ba5eb1021fdf05edbbcb1424c477d86dd3a216", "title": "A Theory of Learning with Corrupted Labels", "abstract": "It is usual in machine learning theory to assume that the training and testing sets comprise of draws from the same distribution. This is rarely, if ever, true and one must admit the presence of corruption. There are many different types of corruption that can arise and as of yet there is no general means to compare the relative ease of learning in these settings. Such results are necessary if we are to make informed economic decisions regarding the acquisition of data. Here we begin to develop an abstract framework for tackling these problems. We present a generic method for learning from a fixed, known, reconstructible corruption, along with an analyses of its statistical properties. We demonstrate the utility of our framework via concrete novel results in solving supervised learning problems wherein the labels are corrupted, such as learning with noisy labels, semi-supervised learning and learning with partial labels.", "year": 2017, "referenceCount": 56, "citationCount": 57, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2719890", "name": "Brendan van Rooyen"}, {"authorId": "143957317", "name": "R. C. Williamson"}]}, {"paperId": "0ed05d947a194a9b4dc69f372eab21a87bed4e13", "url": "https://www.semanticscholar.org/paper/0ed05d947a194a9b4dc69f372eab21a87bed4e13", "title": "Projection-based model reduction: Formulations for physics-based machine learning", "abstract": null, "year": 2019, "referenceCount": 90, "citationCount": 172, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "72030212", "name": "Renee C. Swischuk"}, {"authorId": "2953031", "name": "L. Mainini"}, {"authorId": "2863679", "name": "Benjamin Peherstorfer"}, {"authorId": "143606925", "name": "K. Willcox"}]}, {"paperId": "fc53977508ecb94c7fc543484b1171c4fd0e2192", "url": "https://www.semanticscholar.org/paper/fc53977508ecb94c7fc543484b1171c4fd0e2192", "title": "Network Learning on the Connection Machine", "abstract": "Connectionist networks are powerful techniques, inspired by the parallel architecture of the brain, for discovering intrinsic structures in data. However, they are not well suited for implementation on serial computers. In this paper, we discuss the first implementation of a connectionist learning algorithm, error back-propagation, on a fine-grained parallel computer, the Connection Machine. As an example of how the system can be used, we present a parallel implementation of NETtalk, a connectionist network that learns the mapping from English text to the pronunciation of that text. Currently, networks containing up to 16 million links can be simulated on the Connection Machine at speeds nearly twice that of the Cray-2. We found the major impediment to further speed-up to be the communications between processors, and not processor speed per se. We believe that the advantage for parallel computers will become even clearer as developments in parallel computing continue.", "year": 1987, "referenceCount": 16, "citationCount": 82, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1717462", "name": "G. Blelloch"}, {"authorId": "3140752", "name": "Charles R. Rosenberg"}]}, {"paperId": "677abf4f5c523fe93ee2d5848c1321430defff09", "url": "https://www.semanticscholar.org/paper/677abf4f5c523fe93ee2d5848c1321430defff09", "title": "Recent trends in deep learning based personality detection", "abstract": null, "year": 2019, "referenceCount": 128, "citationCount": 138, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Psychology"], "authors": [{"authorId": "48826430", "name": "Yash Mehta"}, {"authorId": "35122767", "name": "Navonil Majumder"}, {"authorId": "1747784", "name": "Alexander Gelbukh"}, {"authorId": "49943757", "name": "E. Cambria"}]}, {"paperId": "5037f4a5976c91ecc55ac033611bab673520fa6a", "url": "https://www.semanticscholar.org/paper/5037f4a5976c91ecc55ac033611bab673520fa6a", "title": "Machine Learned Sentence Selection Strategies for Query-Biased Summarization", "abstract": "It has become standard for search engines to augment result lists with document summaries. Each document summary consists of a title, abstract, and a URL. In this work, we focus on the task of selecting relevant sentences for inclusion in the abstract. In particular, we investigate how machine learning-based approaches can effectively be applied to the problem. We analyze and evaluate several learning to rank approaches, such as ranking support vector machines (SVMs), support vector regression (SVR), and gradient boosted decision trees (GBDTs). Our work is the first to evaluate SVR and GBDTs for the sentence selection task. Using standard TREC test collections, we rigorously evaluate various aspects of the sentence selection problem. Our results show that the effectiveness of the machine learning approaches varies across collections with different characteristics. Furthermore, the results show that GBDTs provide a robust and powerful framework for the sentence selection task and significantly outperform SVR and ranking SVMs on several data sets.", "year": 2008, "referenceCount": 31, "citationCount": 93, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1680617", "name": "Donald Metzler"}, {"authorId": "143626870", "name": "T. Kanungo"}]}, {"paperId": "d3a439ee786f7c8747635306c075420a9bd2aa5b", "url": "https://www.semanticscholar.org/paper/d3a439ee786f7c8747635306c075420a9bd2aa5b", "title": "Predictor correlation impacts machine learning algorithms: implications for genomic studies", "abstract": "MOTIVATION\nThe advent of high-throughput genomics has produced studies with large numbers of predictors (e.g. genome-wide association, microarray studies). Machine learning algorithms (MLAs) are a computationally efficient way to identify phenotype-associated variables in high-dimensional data. There are important results from mathematical theory and numerous practical results documenting their value. One attractive feature of MLAs is that many operate in a fully multivariate environment, allowing for small-importance variables to be included when they act cooperatively. However, certain properties of MLAs under conditions common in genomic-related data have not been well-studied--in particular, correlations among predictors pose a problem.\n\n\nRESULTS\nUsing extensive simulation, we showed considering correlation within predictors is crucial in making valid inferences using variable importance measures (VIMs) from three MLAs: random forest (RF), conditional inference forest (CIF) and Monte Carlo logic regression (MCLR). Using a case-control illustration, we showed that the RF VIMs--even permutation-based--were less able to detect association than other algorithms at effect sizes encountered in complex disease studies. This reduction occurred when 'causal' predictors were correlated with other predictors, and was sharpest when RF tree building used the Gini index. Indeed, RF Gini VIMs are biased under correlation, dependent on predictor correlation strength/number and over-trained to random fluctuations in data when tree terminal node size was small. Permutation-based VIM distributions were less variable for correlated predictors and are unbiased, thus may be preferred when predictors are correlated. MLAs are a powerful tool for high-dimensional data analysis, but well-considered use of algorithms is necessary to draw valid conclusions.\n\n\nSUPPLEMENTARY INFORMATION\nSupplementary data are available at Bioinformatics online.", "year": 2009, "referenceCount": 27, "citationCount": 132, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Medicine", "Computer Science"], "authors": [{"authorId": "144031984", "name": "K. Nicodemus"}, {"authorId": "1753856", "name": "J. Malley"}]}, {"paperId": "8d904d49cb178def9a15fbea955d427d85cad2f5", "url": "https://www.semanticscholar.org/paper/8d904d49cb178def9a15fbea955d427d85cad2f5", "title": "Manifold: A Model-Agnostic Framework for Interpretation and Diagnosis of Machine Learning Models", "abstract": "Interpretation and diagnosis of machine learning models have gained renewed interest in recent years with breakthroughs in new approaches. We present Manifold, a framework that utilizes visual analysis techniques to support interpretation, debugging, and comparison of machine learning models in a more transparent and interactive manner. Conventional techniques usually focus on visualizing the internal logic of a specific model type (i.e., deep neural networks), lacking the ability to extend to a more complex scenario where different model types are integrated. To this end, Manifold is designed as a generic framework that does not rely on or access the internal logic of the model and solely observes the input (i.e., instances or features) and the output (i.e., the predicted result and probability distribution). We describe the workflow of Manifold as an iterative process consisting of three major phases that are commonly involved in the model development and diagnosis process: inspection (hypothesis), explanation (reasoning), and refinement (verification). The visual components supporting these tasks include a scatterplot-based visual summary that overviews the models' outcome and a customizable tabular view that reveals feature discrimination. We demonstrate current applications of the framework on the classification and regression tasks and discuss other potential machine learning use scenarios where Manifold can be applied.", "year": 2018, "referenceCount": 44, "citationCount": 131, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Mathematics"], "authors": [{"authorId": "47540407", "name": "Jiawei Zhang"}, {"authorId": "2153676199", "name": "Yang Wang"}, {"authorId": "34890911", "name": "Piero Molino"}, {"authorId": "2151534400", "name": "Lezhi Li"}, {"authorId": "33449182", "name": "D. Ebert"}]}, {"paperId": "ed6f35fd8de79b1b4d9abdadf4e0d23eb1bf6049", "url": "https://www.semanticscholar.org/paper/ed6f35fd8de79b1b4d9abdadf4e0d23eb1bf6049", "title": "Use of machine learning to analyse routinely collected intensive care unit data: a systematic review", "abstract": null, "year": 2019, "referenceCount": 55, "citationCount": 81, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1395900469", "name": "Duncan Shillan"}, {"authorId": "145481919", "name": "J. Sterne"}, {"authorId": "2718658", "name": "A. Champneys"}, {"authorId": "3504179", "name": "B. Gibbison"}]}, {"paperId": "562c09c112df56c5696c010d90a815d6018a86c8", "url": "https://www.semanticscholar.org/paper/562c09c112df56c5696c010d90a815d6018a86c8", "title": "Word Translation Without Parallel Data", "abstract": "State-of-the-art methods for learning cross-lingual word embeddings have relied on bilingual dictionaries or parallel corpora. Recent studies showed that the need for parallel data supervision can be alleviated with character-level information. While these methods showed encouraging results, they are not on par with their supervised counterparts and are limited to pairs of languages sharing a common alphabet. In this work, we show that we can build a bilingual dictionary between two languages without using any parallel corpora, by aligning monolingual word embedding spaces in an unsupervised way. Without using any character information, our model even outperforms existing supervised methods on cross-lingual tasks for some language pairs. Our experiments demonstrate that our method works very well also for distant language pairs, like English-Russian or English-Chinese. We finally describe experiments on the English-Esperanto low-resource language pair, on which there only exists a limited amount of parallel data, to show the potential impact of our method in fully unsupervised machine translation. Our code, embeddings and dictionaries are publicly available.", "year": 2017, "referenceCount": 52, "citationCount": 1237, "influentialCitationCount": 350, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2480903", "name": "Alexis Conneau"}, {"authorId": "1830914", "name": "Guillaume Lample"}, {"authorId": "1706809", "name": "Marc'Aurelio Ranzato"}, {"authorId": "8905591", "name": "Ludovic Denoyer"}, {"authorId": "2065248680", "name": "Herv'e J'egou"}]}, {"paperId": "26eb706ce9ece8fdff8707e6b558362fbec69895", "url": "https://www.semanticscholar.org/paper/26eb706ce9ece8fdff8707e6b558362fbec69895", "title": "FAIRVIS: Visual Analytics for Discovering Intersectional Bias in Machine Learning", "abstract": "The growing capability and accessibility of machine learning has led to its application to many real-world domains and data about people. Despite the benefits algorithmic systems may bring, models can reflect, inject, or exacerbate implicit and explicit societal biases into their outputs, disadvantaging certain demographic subgroups. Discovering which biases a machine learning model has introduced is a great challenge, due to the numerous definitions of fairness and the large number of potentially impacted subgroups. We present FAIRVIS, a mixed-initiative visual analytics system that integrates a novel subgroup discovery technique for users to audit the fairness of machine learning models. Through FAIRVIS, users can apply domain knowledge to generate and investigate known subgroups, and explore suggested and similar subgroups. FAIRVIS's coordinated views enable users to explore a high-level overview of subgroup performance and subsequently drill down into detailed investigation of specific subgroups. We show how FAIRVIS helps to discover biases in two real datasets used in predicting income and recidivism. As a visual analytics system devoted to discovering bias in machine learning, FAIRVIS demonstrates how interactive visualization may help data scientists and the general public understand and create more equitable algorithmic systems.", "year": 2019, "referenceCount": 36, "citationCount": 83, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "102477227", "name": "Ángel Alexander Cabrera"}, {"authorId": "103260170", "name": "Will Epperson"}, {"authorId": "10735510", "name": "Fred Hohman"}, {"authorId": "1768057", "name": "Minsuk Kahng"}, {"authorId": "144848816", "name": "Jamie H. Morgenstern"}, {"authorId": "1793506", "name": "Duen Horng Chau"}]}, {"paperId": "6e46d8aa63db3285417c8ebb65340b5045ca106f", "url": "https://www.semanticscholar.org/paper/6e46d8aa63db3285417c8ebb65340b5045ca106f", "title": "Accelerating Machine Learning Inference with Probabilistic Predicates", "abstract": "Classic query optimization techniques, including predicate pushdown, are of limited use for machine learning inference queries, because the user-defined functions (UDFs) which extract relational columns from unstructured inputs are often very expensive; query predicates will remain stuck behind these UDFs if they happen to require relational columns that are generated by the UDFs. In this work, we demonstrate constructing and applying probabilistic predicates to filter data blobs that do not satisfy the query predicate; such filtering is parametrized to different target accuracies. Furthermore, to support complex predicates and to avoid per-query training, we augment a cost-based query optimizer to choose plans with appropriate combinations of simpler probabilistic predicates. Experiments with several machine learning workloads on a big-data cluster show that query processing improves by as much as 10x.", "year": 2018, "referenceCount": 55, "citationCount": 68, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2143370657", "name": "Yao Lu"}, {"authorId": "2841893", "name": "Aakanksha Chowdhery"}, {"authorId": "1741860", "name": "Srikanth Kandula"}, {"authorId": "145647476", "name": "S. Chaudhuri"}]}, {"paperId": "13f542da0ca3aeb06873b495893f63b21662ef18", "url": "https://www.semanticscholar.org/paper/13f542da0ca3aeb06873b495893f63b21662ef18", "title": "Elastic Machine Learning Algorithms in Amazon SageMaker", "abstract": "There is a large body of research on scalable machine learning (ML). Nevertheless, training ML models on large, continuously evolving datasets is still a difficult and costly undertaking for many companies and institutions. We discuss such challenges and derive requirements for an industrial-scale ML platform. Next, we describe the computational model behind Amazon SageMaker, which is designed to meet such challenges. SageMaker is an ML platform provided as part of Amazon Web Services (AWS), and supports incremental training, resumable and elastic learning as well as automatic hyperparameter optimization. We detail how to adapt several popular ML algorithms to its computational model. Finally, we present an experimental evaluation on large datasets, comparing SageMaker to several scalable, JVM-based implementations of ML algorithms, which we significantly outperform with regard to computation time and cost.", "year": 2020, "referenceCount": 73, "citationCount": 72, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2941680", "name": "Edo Liberty"}, {"authorId": "3386660", "name": "Zohar S. Karnin"}, {"authorId": "144028698", "name": "Bing Xiang"}, {"authorId": "1726063598", "name": "Laurence Rouesnel"}, {"authorId": "3172811", "name": "B. Coskun"}, {"authorId": "1701451", "name": "Ramesh Nallapati"}, {"authorId": "2065033430", "name": "Julio Delgado"}, {"authorId": "94237600", "name": "Amir Sadoughi"}, {"authorId": "1726057031", "name": "Yury Astashonok"}, {"authorId": "2792763", "name": "Piali Das"}, {"authorId": "1726054029", "name": "Can Balioglu"}, {"authorId": "31950623", "name": "Saswata Chakravarty"}, {"authorId": "16700909", "name": "Madhav Jha"}, {"authorId": "145021445", "name": "P. Gautier"}, {"authorId": "38704631", "name": "D. Arpin"}, {"authorId": "2166235", "name": "Tim Januschowski"}, {"authorId": "2067154581", "name": "Valentin Flunkert"}, {"authorId": "49416149", "name": "Bernie Wang"}, {"authorId": "2113062", "name": "Jan Gasthaus"}, {"authorId": "2066263165", "name": "Lorenzo Stella"}, {"authorId": "26320653", "name": "Syama Sundar Rangapuram"}, {"authorId": "144607961", "name": "David Salinas"}, {"authorId": "2180399", "name": "Sebastian Schelter"}, {"authorId": "46234526", "name": "Alex Smola"}]}, {"paperId": "3dbb621f1c35c659f3ce6efadad7aa16308fae13", "url": "https://www.semanticscholar.org/paper/3dbb621f1c35c659f3ce6efadad7aa16308fae13", "title": "Breast cancer histopathological image classification using Convolutional Neural Networks", "abstract": "The performance of most conventional classification systems relies on appropriate data representation and much of the efforts are dedicated to feature engineering, a difficult and time-consuming process that uses prior expert domain knowledge of the data to create useful features. On the other hand, deep learning can extract and organize the discriminative information from the data, not requiring the design of feature extractors by a domain expert. Convolutional Neural Networks (CNNs) are a particular type of deep, feedforward network that have gained attention from research community and industry, achieving empirical successes in tasks such as speech recognition, signal processing, object recognition, natural language processing and transfer learning. In this paper, we conduct some preliminary experiments using the deep learning approach to classify breast cancer histopathological images from BreaKHis, a publicly dataset available at http://web.inf.ufpr.br/vri/breast-cancer-database. We propose a method based on the extraction of image patches for training the CNN and the combination of these patches for final classification. This method aims to allow using the high-resolution histopathological images from BreaKHis as input to existing CNN, avoiding adaptations of the model that can lead to a more complex and computationally costly architecture. The CNN performance is better when compared to previously reported results obtained by other machine learning models trained with hand-crafted textural descriptors. Finally, we also investigate the combination of different CNNs using simple fusion rules, achieving some improvement in recognition rates.", "year": 2016, "referenceCount": 33, "citationCount": 559, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "32786132", "name": "F. Spanhol"}, {"authorId": "144925520", "name": "Luiz Oliveira"}, {"authorId": "144518944", "name": "C. Petitjean"}, {"authorId": "1804638", "name": "L. Heutte"}]}, {"paperId": "7044a87c6987554186471c2f9116aa53c1392be7", "url": "https://www.semanticscholar.org/paper/7044a87c6987554186471c2f9116aa53c1392be7", "title": "Arabic Named Entity Recognition using Optimized Feature Sets", "abstract": "The Named Entity Recognition (NER) task has been garnering significant attention in NLP as it helps improve the performance of many natural language processing applications. In this paper, we investigate the impact of using different sets of features in two discriminative machine learning frameworks, namely, Support Vector Machines and Conditional Random Fields using Arabic data. We explore lexical, contextual and morphological features on eight standardized data-sets of different genres. We measure the impact of the different features in isolation, rank them according to their impact for each named entity class and incrementally combine them in order to infer the optimal machine learning approach and feature set. Our system yields a performance of Fβ=1-measure=83.5 on ACE 2003 Broadcast News data.", "year": 2008, "referenceCount": 19, "citationCount": 133, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1788883", "name": "Yassine Benajiba"}, {"authorId": "1700007", "name": "Mona T. Diab"}, {"authorId": "143752702", "name": "Paolo Rosso"}]}, {"paperId": "734ced62e917742a0e7df7a132edcea67cb883ef", "url": "https://www.semanticscholar.org/paper/734ced62e917742a0e7df7a132edcea67cb883ef", "title": "Machine learning in electronic-quantum-matter imaging experiments", "abstract": null, "year": 2018, "referenceCount": 53, "citationCount": 117, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Physics"], "authors": [{"authorId": "49889859", "name": "Yi Zhang"}, {"authorId": "51108178", "name": "A. Mesaros"}, {"authorId": "50138324", "name": "K. Fujita"}, {"authorId": "7148911", "name": "S. Edkins"}, {"authorId": "49546756", "name": "M. Hamidian"}, {"authorId": "1411979208", "name": "K. Ch'ng"}, {"authorId": "2234460", "name": "H. Eisaki"}, {"authorId": "114697458", "name": "S. Uchida"}, {"authorId": "2158110161", "name": "J. C. Davis"}, {"authorId": "2203253", "name": "E. Khatami"}, {"authorId": "144302105", "name": "Eun-Ah Kim"}]}, {"paperId": "b34c6081aac87d4d9f659c8f342c05ce7b835bba", "url": "https://www.semanticscholar.org/paper/b34c6081aac87d4d9f659c8f342c05ce7b835bba", "title": "Continuous Prediction of Spontaneous Affect from Multiple Cues and Modalities in Valence-Arousal Space", "abstract": "Past research in analysis of human affect has focused on recognition of prototypic expressions of six basic emotions based on posed data acquired in laboratory settings. Recently, there has been a shift toward subtle, continuous, and context-specific interpretations of affective displays recorded in naturalistic and real-world settings, and toward multimodal analysis and recognition of human affect. Converging with this shift, this paper presents, to the best of our knowledge, the first approach in the literature that: 1) fuses facial expression, shoulder gesture, and audio cues for dimensional and continuous prediction of emotions in valence and arousal space, 2) compares the performance of two state-of-the-art machine learning techniques applied to the target problem, the bidirectional Long Short-Term Memory neural networks (BLSTM-NNs), and Support Vector Machines for Regression (SVR), and 3) proposes an output-associative fusion framework that incorporates correlations and covariances between the emotion dimensions. Evaluation of the proposed approach has been done using the spontaneous SAL data from four subjects and subject-dependent leave-one-sequence-out cross validation. The experimental results obtained show that: 1) on average, BLSTM-NNs outperform SVR due to their ability to learn past and future context, 2) the proposed output-associative fusion framework outperforms feature-level and model-level fusion by modeling and learning correlations and patterns between the valence and arousal dimensions, and 3) the proposed system is well able to reproduce the valence and arousal ground truth obtained from human coders.", "year": 2011, "referenceCount": 72, "citationCount": 443, "influentialCitationCount": 33, "isOpenAccess": true, "fieldsOfStudy": ["Psychology", "Computer Science"], "authors": [{"authorId": "1752913", "name": "M. Nicolaou"}, {"authorId": "1781916", "name": "H. Gunes"}, {"authorId": "145387780", "name": "M. Pantic"}]}, {"paperId": "d5eef7e4f0b2a4ddf90330f5a0b71e70f164b6cf", "url": "https://www.semanticscholar.org/paper/d5eef7e4f0b2a4ddf90330f5a0b71e70f164b6cf", "title": "The support vector decomposition machine", "abstract": "In machine learning problems with tens of thousands of features and only dozens or hundreds of independent training examples, dimensionality reduction is essential for good learning performance. In previous work, many researchers have treated the learning problem in two separate phases: first use an algorithm such as singular value decomposition to reduce the dimensionality of the data set, and then use a classification algorithm such as naïve Bayes or support vector machines to learn a classifier. We demonstrate that it is possible to combine the two goals of dimensionality reduction and classification into a single learning objective, and present a novel and efficient algorithm which optimizes this objective directly. We present experimental results in fMRI analysis which show that we can achieve better learning performance and lower-dimensional representations than two-phase approaches can.", "year": 2006, "referenceCount": 15, "citationCount": 58, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "144637670", "name": "Francisco Pereira"}, {"authorId": "21889436", "name": "Geoffrey J. Gordon"}]}, {"paperId": "026c36675346b15dbc0c3807057fb9d7e742475f", "url": "https://www.semanticscholar.org/paper/026c36675346b15dbc0c3807057fb9d7e742475f", "title": "Evolutionary Extreme Learning Machine - Based on Particle Swarm Optimization", "abstract": null, "year": 2006, "referenceCount": 10, "citationCount": 119, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9289485", "name": "You-wu Xu"}, {"authorId": "2066476643", "name": "Y. Shu"}]}, {"paperId": "1d2f8358da1a37594ab9459ad124c7b4a2b9d728", "url": "https://www.semanticscholar.org/paper/1d2f8358da1a37594ab9459ad124c7b4a2b9d728", "title": "Prediction of hot spot residues at protein-protein interfaces by combining machine learning and energy-based methods", "abstract": null, "year": 2009, "referenceCount": 51, "citationCount": 103, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Chemistry", "Medicine", "Computer Science"], "authors": [{"authorId": "2397328", "name": "S. Lise"}, {"authorId": "2824663", "name": "C. Archambeau"}, {"authorId": "1704699", "name": "M. Pontil"}, {"authorId": "152898526", "name": "David T. Jones"}]}, {"paperId": "3ae21b55af86937d56e60ca1181d3f330e4f5881", "url": "https://www.semanticscholar.org/paper/3ae21b55af86937d56e60ca1181d3f330e4f5881", "title": "Predicting structured objects with support vector machines", "abstract": "Machine Learning today offers a broad repertoire of methods for classification and regression. But what if we need to predict complex objects like trees, orderings, or alignments? Such problems arise naturally in natural language processing, search engines, and bioinformatics. The following explores a generalization of Support Vector Machines (SVMs) for such complex prediction problems.", "year": 2009, "referenceCount": 44, "citationCount": 109, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1680188", "name": "T. Joachims"}, {"authorId": "143936663", "name": "Thomas Hofmann"}, {"authorId": "1740159", "name": "Yisong Yue"}, {"authorId": "3166569", "name": "C. Yu"}]}, {"paperId": "49051605a56a9c82a2401f96c3471312d00552d9", "url": "https://www.semanticscholar.org/paper/49051605a56a9c82a2401f96c3471312d00552d9", "title": "A Novel PCA-Firefly Based XGBoost Classification Model for Intrusion Detection in Networks Using GPU", "abstract": "The enormous popularity of the internet across all spheres of human life has introduced various risks of malicious attacks in the network. The activities performed over the network could be effortlessly proliferated, which has led to the emergence of intrusion detection systems. The patterns of the attacks are also dynamic, which necessitates efficient classification and prediction of cyber attacks. In this paper we propose a hybrid principal component analysis (PCA)-firefly based machine learning model to classify intrusion detection system (IDS) datasets. The dataset used in the study is collected from Kaggle. The model first performs One-Hot encoding for the transformation of the IDS datasets. The hybrid PCA-firefly algorithm is then used for dimensionality reduction. The XGBoost algorithm is implemented on the reduced dataset for classification. A comprehensive evaluation of the model is conducted with the state of the art machine learning approaches to justify the superiority of our proposed approach. The experimental results confirm the fact that the proposed model performs better than the existing machine learning models.", "year": 2020, "referenceCount": 32, "citationCount": 168, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "71424255", "name": "S. Bhattacharya"}, {"authorId": "2127823435", "name": "S. S"}, {"authorId": "29919430", "name": "P. Maddikunta"}, {"authorId": "46234199", "name": "Rajesh Kaluri"}, {"authorId": "144704227", "name": "Saurabh Singh"}, {"authorId": "11041265", "name": "T. Gadekallu"}, {"authorId": "2474250", "name": "M. Alazab"}, {"authorId": "51230514", "name": "U. Tariq"}]}, {"paperId": "18939eadc9c4460c8385e0591cde214a1ead067b", "url": "https://www.semanticscholar.org/paper/18939eadc9c4460c8385e0591cde214a1ead067b", "title": "Reliable evaluation of adversarial robustness with an ensemble of diverse parameter-free attacks", "abstract": "The field of defense strategies against adversarial attacks has significantly grown over the last years, but progress is hampered as the evaluation of adversarial defenses is often insufficient and thus gives a wrong impression of robustness. Many promising defenses could be broken later on, making it difficult to identify the state-of-the-art. Frequent pitfalls in the evaluation are improper tuning of hyperparameters of the attacks, gradient obfuscation or masking. In this paper we first propose two extensions of the PGD-attack overcoming failures due to suboptimal step size and problems of the objective function. We then combine our novel attacks with two complementary existing ones to form a parameter-free, computationally affordable and user-independent ensemble of attacks to test adversarial robustness. We apply our ensemble to over 50 models from papers published at recent top machine learning and computer vision venues. In all except one of the cases we achieve lower robust test accuracy than reported in these papers, often by more than $10\\%$, identifying several broken defenses.", "year": 2020, "referenceCount": 58, "citationCount": 653, "influentialCitationCount": 225, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "39171784", "name": "Francesco Croce"}, {"authorId": "143610806", "name": "Matthias Hein"}]}, {"paperId": "cff7b1b98da6de583bf2d5ffd496c2e6d70a794c", "url": "https://www.semanticscholar.org/paper/cff7b1b98da6de583bf2d5ffd496c2e6d70a794c", "title": "From DFT to machine learning: recent approaches to materials science–a review", "abstract": "Recent advances in experimental and computational methods are increasing the quantity and complexity of generated data. This massive amount of raw data needs to be stored and interpreted in order to advance the materials science field. Identifying correlations and patterns from large amounts of complex data is being performed by machine learning algorithms for decades. Recently, the materials science community started to invest in these methodologies to extract knowledge and insights from the accumulated data. This review follows a logical sequence starting from density functional theory as the representative instance of electronic structure methods, to the subsequent high-throughput approach, used to generate large amounts of data. Ultimately, data-driven strategies which include data mining, screening, and machine learning techniques, employ the data generated. We show how these approaches to modern computational materials science are being used to uncover complexities and design novel materials with enhanced properties. Finally, we point to the present research problems, challenges, and potential future perspectives of this new exciting field.", "year": 2019, "referenceCount": 587, "citationCount": 294, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "11898127", "name": "G. R. Schleder"}, {"authorId": "93993846", "name": "A. C. M. Padilha"}, {"authorId": "152541090", "name": "C. M. Acosta"}, {"authorId": "144194651", "name": "M. Costa"}, {"authorId": "145385217", "name": "A. Fazzio"}]}, {"paperId": "fceddfc62c6104a205f8553588f16ca6e0ea0b3c", "url": "https://www.semanticscholar.org/paper/fceddfc62c6104a205f8553588f16ca6e0ea0b3c", "title": "Education 4.0 — Fostering student's performance with machine learning methods", "abstract": "Educational activity is increasingly moving online and course contents are becoming available in digital format. This enables data collection and the use of data for analyzing learning process. For the 4th Revolution in Education, an active and interactive presence of students contributes to a higher learning quality. Machine Learning techniques recently have shown impressive development steps of the use of data analysis and predictions. However, it has been far less used for assessing the learning quality. For this paper we conducted analysis based on neural networks, support vector machine, decision trees and cluster analysis to estimate student's performance at examination and shape the next generation's talent for Industry 4.0 skills.", "year": 2017, "referenceCount": 18, "citationCount": 68, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "30710053", "name": "M. Ciolacu"}, {"authorId": "3242843", "name": "A. Tehrani"}, {"authorId": "47377858", "name": "Rick Beer"}, {"authorId": "2085317493", "name": "Heribert Popp"}]}, {"paperId": "d2d79513f32c4d09b6255b18514d7ad07ebf43fe", "url": "https://www.semanticscholar.org/paper/d2d79513f32c4d09b6255b18514d7ad07ebf43fe", "title": "Explainable artificial intelligence: A survey", "abstract": "In the last decade, with availability of large datasets and more computing power, machine learning systems have achieved (super)human performance in a wide variety of tasks. Examples of this rapid development can be seen in image recognition, speech analysis, strategic game planning and many more. The problem with many state-of-the-art models is a lack of transparency and interpretability. The lack of thereof is a major drawback in many applications, e.g. healthcare and finance, where rationale for model's decision is a requirement for trust. In the light of these issues, explainable artificial intelligence (XAI) has become an area of interest in research community. This paper summarizes recent developments in XAI in supervised learning, starts a discussion on its connection with artificial general intelligence, and gives proposals for further research directions.", "year": 2018, "referenceCount": 28, "citationCount": 478, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1395592010", "name": "Filip Karlo Dosilovic"}, {"authorId": "35167635", "name": "Mario Brčič"}, {"authorId": "1791663", "name": "N. Hlupic"}]}, {"paperId": "79c43724a1f7c9071ba75e0aedd86f907590e0d0", "url": "https://www.semanticscholar.org/paper/79c43724a1f7c9071ba75e0aedd86f907590e0d0", "title": "A tutorial on variational Bayesian inference", "abstract": null, "year": 2012, "referenceCount": 4, "citationCount": 231, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47641288", "name": "C. Fox"}, {"authorId": "145029236", "name": "S. Roberts"}]}, {"paperId": "2a7bc26b61e3c6c796bba85ce08e371601ec6764", "url": "https://www.semanticscholar.org/paper/2a7bc26b61e3c6c796bba85ce08e371601ec6764", "title": "A new approach and system for attentive mobile learning based on seamless migration", "abstract": null, "year": 2010, "referenceCount": 66, "citationCount": 165, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143697858", "name": "De-gan Zhang"}]}, {"paperId": "c14173c062c455af4e8bcc9c31969039aa972fed", "url": "https://www.semanticscholar.org/paper/c14173c062c455af4e8bcc9c31969039aa972fed", "title": "Machine learning: New tool in the box", "abstract": null, "year": 2017, "referenceCount": 6, "citationCount": 67, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "2546601", "name": "L. Zdeborová"}]}, {"paperId": "76f58b0c51a42b77c7f0d619abdc54abc4b4a39c", "url": "https://www.semanticscholar.org/paper/76f58b0c51a42b77c7f0d619abdc54abc4b4a39c", "title": "VizRank: Data Visualization Guided by Machine Learning", "abstract": null, "year": 2006, "referenceCount": 40, "citationCount": 87, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1770649", "name": "Gregor Leban"}, {"authorId": "1775384", "name": "B. Zupan"}, {"authorId": "2240344", "name": "G. Vidmar"}, {"authorId": "1725040", "name": "I. Bratko"}]}, {"paperId": "16f05470e01a0c6fd7e925f77d48302bbf872189", "url": "https://www.semanticscholar.org/paper/16f05470e01a0c6fd7e925f77d48302bbf872189", "title": "Online Algorithms for Rent-Or-Buy with Expert Advice", "abstract": "We study the use of predictions by multiple experts (such as machine learning algorithms) to improve the performance of online algorithms. In particular, we consider the classical rent-or-buy problem (also called ski rental), and obtain algorithms that provably improve their performance over the adversarial scenario by using these predictions. We also prove matching lower bounds to show that our algorithms are the best possible, and perform experiments to empirically validate their performance in practice.", "year": 2019, "referenceCount": 20, "citationCount": 86, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144979147", "name": "Sreenivas Gollapudi"}, {"authorId": "1715972", "name": "Debmalya Panigrahi"}]}, {"paperId": "c45d0d50c44af507f694cb3ae0debd76c560e364", "url": "https://www.semanticscholar.org/paper/c45d0d50c44af507f694cb3ae0debd76c560e364", "title": "Understanding from Machine Learning Models", "abstract": "Simple idealized models seem to provide more understanding than opaque, complex, and hyper-realistic models. However, an increasing number of scientists are going in the opposite direction by utilizing opaque machine learning models to make predictions and draw inferences, suggesting that scientists are opting for models that have less potential for understanding. Are scientists trading understanding for some other epistemic or pragmatic good when they choose a machine learning model? Or are the assumptions behind why minimal models provide understanding misguided? In this article, using the case of deep neural networks, I argue that it is not the complexity or black box nature of a model that limits how much understanding the model provides. Instead, it is a lack of scientific and empirical evidence supporting the link that connects a model to the target phenomenon that primarily prohibits understanding.", "year": 2020, "referenceCount": 81, "citationCount": 50, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49503692", "name": "E. Sullivan"}]}, {"paperId": "784b018c87c7dcbbe772374e45d5191bae9938ee", "url": "https://www.semanticscholar.org/paper/784b018c87c7dcbbe772374e45d5191bae9938ee", "title": "Hyperbolic Graph Neural Networks", "abstract": "Learning from graph-structured data is an important task in machine learning and artificial intelligence, for which Graph Neural Networks (GNNs) have shown great promise. Motivated by recent advances in geometric representation learning, we propose a novel GNN architecture for learning representations on Riemannian manifolds with differentiable exponential and logarithmic maps. We develop a scalable algorithm for modeling the structural properties of graphs, comparing Euclidean and hyperbolic geometry. In our experiments, we show that hyperbolic GNNs can lead to substantial improvements on various benchmark datasets.", "year": 2019, "referenceCount": 52, "citationCount": 156, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2144831836", "name": "Qi Liu"}, {"authorId": "1729762", "name": "Maximilian Nickel"}, {"authorId": "1743722", "name": "Douwe Kiela"}]}, {"paperId": "193532f7dab6481d4feaef9350e4fd6c434920e7", "url": "https://www.semanticscholar.org/paper/193532f7dab6481d4feaef9350e4fd6c434920e7", "title": "Deep Learning in Medical Image Analysis.", "abstract": null, "year": 2017, "referenceCount": 65, "citationCount": 136, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "1905897", "name": "H. Chan"}, {"authorId": "3423854", "name": "Ravi K. Samala"}, {"authorId": "2591670", "name": "L. Hadjiiski"}, {"authorId": "1643124213", "name": "Chuan Zhou"}]}, {"paperId": "1517ffecc0014a0bb569a85821403ecf5bf08ad0", "url": "https://www.semanticscholar.org/paper/1517ffecc0014a0bb569a85821403ecf5bf08ad0", "title": "Learning register automata: from languages to program structures", "abstract": null, "year": 2014, "referenceCount": 60, "citationCount": 66, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2394200", "name": "M. Isberner"}, {"authorId": "1802871", "name": "Falk Howar"}, {"authorId": "2113938930", "name": "B. Steffen"}]}, {"paperId": "bd0cb6f62619649616316ca3c1348f568c63a852", "url": "https://www.semanticscholar.org/paper/bd0cb6f62619649616316ca3c1348f568c63a852", "title": "A survey on measuring indirect discrimination in machine learning", "abstract": "Nowadays, many decisions are made using predictive models built on historical data.Predictive models may systematically discriminate groups of people even if the computing process is fair and well-intentioned. Discrimination-aware data mining studies how to make predictive models free from discrimination, when historical data, on which they are built, may be biased, incomplete, or even contain past discriminatory decisions. Discrimination refers to disadvantageous treatment of a person based on belonging to a category rather than on individual merit. In this survey we review and organize various discrimination measures that have been used for measuring discrimination in data, as well as in evaluating performance of discrimination-aware predictive models. We also discuss related measures from other disciplines, which have not been used for measuring discrimination, but potentially could be suitable for this purpose. We computationally analyze properties of selected measures. We also review and discuss measuring procedures, and present recommendations for practitioners. The primary target audience is data mining, machine learning, pattern recognition, statistical modeling researchers developing new methods for non-discriminatory predictive modeling. In addition, practitioners and policy makers would use the survey for diagnosing potential discrimination by predictive models.", "year": 2015, "referenceCount": 44, "citationCount": 128, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1740809", "name": "I. Žliobaitė"}]}, {"paperId": "34c062e2b8a3f6421b9f4ff22f115a36d4aba823", "url": "https://www.semanticscholar.org/paper/34c062e2b8a3f6421b9f4ff22f115a36d4aba823", "title": "A Dataset and a Technique for Generalized Nuclear Segmentation for Computational Pathology", "abstract": "Nuclear segmentation in digital microscopic tissue images can enable extraction of high-quality features for nuclear morphometrics and other analysis in computational pathology. Conventional image processing techniques, such as Otsu thresholding and watershed segmentation, do not work effectively on challenging cases, such as chromatin-sparse and crowded nuclei. In contrast, machine learning-based segmentation can generalize across various nuclear appearances. However, training machine learning algorithms requires data sets of images, in which a vast number of nuclei have been annotated. Publicly accessible and annotated data sets, along with widely agreed upon metrics to compare techniques, have catalyzed tremendous innovation and progress on other image classification problems, particularly in object recognition. Inspired by their success, we introduce a large publicly accessible data set of hematoxylin and eosin (H&E)-stained tissue images with more than 21000 painstakingly annotated nuclear boundaries, whose quality was validated by a medical doctor. Because our data set is taken from multiple hospitals and includes a diversity of nuclear appearances from several patients, disease states, and organs, techniques trained on it are likely to generalize well and work right out-of-the-box on other H&E-stained images. We also propose a new metric to evaluate nuclear segmentation results that penalizes object- and pixel-level errors in a unified manner, unlike previous metrics that penalize only one type of error. We also propose a segmentation technique based on deep learning that lays a special emphasis on identifying the nuclear boundaries, including those between the touching or overlapping nuclei, and works well on a diverse set of test images.", "year": 2017, "referenceCount": 51, "citationCount": 469, "influentialCitationCount": 107, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2119734444", "name": "Neeraj Kumar"}, {"authorId": "3200813", "name": "R. Verma"}, {"authorId": "2109948052", "name": "Sanuj Sharma"}, {"authorId": "2061041305", "name": "S. Bhargava"}, {"authorId": "1927113", "name": "Abhishek Vahadane"}, {"authorId": "2049437", "name": "A. Sethi"}]}, {"paperId": "053f4d6715a4dba6f8103456fc1bb5fd6a5266c4", "url": "https://www.semanticscholar.org/paper/053f4d6715a4dba6f8103456fc1bb5fd6a5266c4", "title": "Ensemble Distillation for Robust Model Fusion in Federated Learning", "abstract": "Federated Learning (FL) is a machine learning setting where many devices collaboratively train a machine learning model while keeping the training data decentralized. In most of the current training schemes the central model is refined by averaging the parameters of the server model and the updated parameters from the client side. However, directly averaging model parameters is only possible if all models have the same structure and size, which could be a restrictive constraint in many scenarios. \nIn this work we investigate more powerful and more flexible aggregation schemes for FL. Specifically, we propose ensemble distillation for model fusion, i.e. training the central classifier through unlabeled data on the outputs of the models from the clients. This knowledge distillation technique mitigates privacy risk and cost to the same extent as the baseline FL algorithms, but allows flexible aggregation over heterogeneous client models that can differ e.g. in size, numerical precision or structure. We show in extensive empirical experiments on various CV/NLP datasets (CIFAR-10/100, ImageNet, AG News, SST2) and settings (heterogeneous models/data) that the server model can be trained much faster, requiring fewer communication rounds than any existing FL technique so far.", "year": 2020, "referenceCount": 86, "citationCount": 250, "influentialCitationCount": 52, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145724662", "name": "Tao Lin"}, {"authorId": "2069275317", "name": "Lingjing Kong"}, {"authorId": "2127057", "name": "Sebastian U. Stich"}, {"authorId": "2456863", "name": "Martin Jaggi"}]}]}