{"total": 5120627, "offset": 4200, "next": 4300, "data": [{"paperId": "f58e403e8eaa8ffebf6b691a59f1dee434cb2262", "url": "https://www.semanticscholar.org/paper/f58e403e8eaa8ffebf6b691a59f1dee434cb2262", "title": "Extensions of the Informative Vector Machine", "abstract": null, "year": 2004, "referenceCount": 29, "citationCount": 57, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145306271", "name": "Neil D. Lawrence"}, {"authorId": "144189092", "name": "John C. Platt"}, {"authorId": "1694621", "name": "Michael I. Jordan"}]}, {"paperId": "e2145add1318af0654a4901fe92080bc8168a9f4", "url": "https://www.semanticscholar.org/paper/e2145add1318af0654a4901fe92080bc8168a9f4", "title": "Classification of musical genre: a machine learning approach", "abstract": "In this paper, we investigate the impact of machine learning algorithms in the development of automatic music classification models aiming to capture genres distinctions. The study of genres as bodies of musical items aggregated according to subjective and local criteria requires corresponding inductive models of such a notion. This process can be thus modeled as an example-driven learning task. We investigated the impact of different musical features on the inductive accuracy by first creating a medium-sized collection of examples for widely recognized genres and then evaluating the performances of different learning algorithms. In this work, features are derived from the MIDI transcriptions of the song collection.", "year": 2004, "referenceCount": 15, "citationCount": 82, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144654543", "name": "Roberto Basili"}, {"authorId": "28868488", "name": "Alfredo Serafini"}, {"authorId": "1763333", "name": "A. Stellato"}]}, {"paperId": "e837b79de602c69395498c1fbbe39bbb4e6f75ad", "url": "https://www.semanticscholar.org/paper/e837b79de602c69395498c1fbbe39bbb4e6f75ad", "title": "Learning to Transduce with Unbounded Memory", "abstract": "Recently, strong results have been demonstrated by Deep Recurrent Neural Networks on natural language transduction problems. In this paper we explore the representational power of these models using synthetic grammars designed to exhibit phenomena similar to those found in real transduction problems such as machine translation. These experiments lead us to propose new memory-based recurrent networks that implement continuously differentiable analogues of traditional data structures such as Stacks, Queues, and DeQues. We show that these architectures exhibit superior generalisation performance to Deep RNNs and are often able to learn the underlying generating algorithms in our transduction experiments.", "year": 2015, "referenceCount": 22, "citationCount": 270, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1864353", "name": "Edward Grefenstette"}, {"authorId": "2910877", "name": "K. Hermann"}, {"authorId": "2573615", "name": "Mustafa Suleyman"}, {"authorId": "1685771", "name": "P. Blunsom"}]}, {"paperId": "c5491cc42ec80a59e843790393e2b6117efd78a1", "url": "https://www.semanticscholar.org/paper/c5491cc42ec80a59e843790393e2b6117efd78a1", "title": "Feature Subset Selection: A Correlation Based Filter Approach", "abstract": "Recent work has shown that feature subset selection can have a positive affect on the performance of machine learning algorithms. Some algorithms can be slowed or their performance irrelevant or redundant to the learning task. Feature subset selection, then, is a method for enhancing the performance of learning algorithms, reducing the hypothesis search space, and, in some cases, reducing the storage requirement. This paper describes a feature subset selector that uses a correlation based evaluates its effectiveness with three common ML algorithms: a decision tree inducer (C4.5), a naive Bayes classifier, and an instance based learner (IB1). Experiments using a number of standard data sets drawn from real and artificial domains are presented. Feature subset selection gave significant improvement for all three algorithms; C4.5 generated smaller decision trees.", "year": 1997, "referenceCount": 6, "citationCount": 303, "influentialCitationCount": 34, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "118860642", "name": "M. Hall"}, {"authorId": "2107559941", "name": "L. A. Smith"}]}, {"paperId": "ff304304fddfb4de368b45894c20f44fdab817d5", "url": "https://www.semanticscholar.org/paper/ff304304fddfb4de368b45894c20f44fdab817d5", "title": "Evaluating machine learning for information extraction", "abstract": "Comparative evaluation of Machine Learning (ML) systems used for Information Extraction (IE) has suffered from various inconsistencies in experimental procedures. This paper reports on the results of the Pascal Challenge on Evaluating Machine Learning for Information Extraction, which provides a standardised corpus, set of tasks, and evaluation methodology. The challenge is described and the systems submitted by the ten participants are briefly introduced and their performance is analysed.", "year": 2005, "referenceCount": 6, "citationCount": 64, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2668441", "name": "N. Ireson"}, {"authorId": "1758555", "name": "F. Ciravegna"}, {"authorId": "1967815", "name": "Mary Elaine Califf"}, {"authorId": "1758106", "name": "D. Freitag"}, {"authorId": "8551365", "name": "N. Kushmerick"}, {"authorId": "2192424", "name": "A. Lavelli"}]}, {"paperId": "6b44ed0ea3163f9c3f6930b71f5390177584edcf", "url": "https://www.semanticscholar.org/paper/6b44ed0ea3163f9c3f6930b71f5390177584edcf", "title": "An Overview on Application of Machine Learning Techniques in Optical Networks", "abstract": "Today’s telecommunication networks have become sources of enormous amounts of widely heterogeneous data. This information can be retrieved from network traffic traces, network alarms, signal quality indicators, users’ behavioral data, etc. Advanced mathematical tools are required to extract meaningful information from these data and take decisions pertaining to the proper functioning of the networks from the network-generated data. Among these mathematical tools, machine learning (ML) is regarded as one of the most promising methodological approaches to perform network-data analysis and enable automated network self-configuration and fault management. The adoption of ML techniques in the field of optical communication networks is motivated by the unprecedented growth of network complexity faced by optical networks in the last few years. Such complexity increase is due to the introduction of a huge number of adjustable and interdependent system parameters (e.g., routing configurations, modulation format, symbol rate, coding schemes, etc.) that are enabled by the usage of coherent transmission/reception technologies, advanced digital signal processing, and compensation of nonlinear effects in optical fiber propagation. In this paper we provide an overview of the application of ML to optical communications and networking. We classify and survey relevant literature dealing with the topic, and we also provide an introductory tutorial on ML for researchers and practitioners interested in this field. Although a good number of research papers have recently appeared, the application of ML to optical networks is still in its infancy: to stimulate further work in this area, we conclude this paper proposing new possible research directions.", "year": 2018, "referenceCount": 127, "citationCount": 317, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "48419853", "name": "F. Musumeci"}, {"authorId": "2370043", "name": "C. Rottondi"}, {"authorId": "2499946", "name": "A. Nag"}, {"authorId": "2129842", "name": "I. Macaluso"}, {"authorId": "2735803", "name": "D. Zibar"}, {"authorId": "2987837", "name": "M. Ruffini"}, {"authorId": "1759410", "name": "M. Tornatore"}]}, {"paperId": "8dc871b80e50135c9d99de9f8eb8c64b63ee924f", "url": "https://www.semanticscholar.org/paper/8dc871b80e50135c9d99de9f8eb8c64b63ee924f", "title": "Understanding Self-Training for Gradual Domain Adaptation", "abstract": "Machine learning systems must adapt to data distributions that evolve over time, in applications ranging from sensor networks and self-driving car perception modules to brain-machine interfaces. We consider gradual domain adaptation, where the goal is to adapt an initial classifier trained on a source domain given only unlabeled data that shifts gradually in distribution towards a target domain. We prove the first non-vacuous upper bound on the error of self-training with gradual shifts, under settings where directly adapting to the target domain can result in unbounded error. The theoretical analysis leads to algorithmic insights, highlighting that regularization and label sharpening are essential even when we have infinite data, and suggesting that self-training works particularly well for shifts with small Wasserstein-infinity distance. Leveraging the gradual shift structure leads to higher accuracies on a rotating MNIST dataset and a realistic Portraits dataset.", "year": 2020, "referenceCount": 50, "citationCount": 98, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "32423266", "name": "Ananya Kumar"}, {"authorId": "1901958", "name": "Tengyu Ma"}, {"authorId": "145419642", "name": "Percy Liang"}]}, {"paperId": "5c63fc87400a4d3afea63ab8a068a47249f815c2", "url": "https://www.semanticscholar.org/paper/5c63fc87400a4d3afea63ab8a068a47249f815c2", "title": "Noise or Signal: The Role of Image Backgrounds in Object Recognition", "abstract": "We assess the tendency of state-of-the-art object recognition models to depend on signals from image backgrounds. We create a toolkit for disentangling foreground and background signal on ImageNet images, and find that (a) models can achieve non-trivial accuracy by relying on the background alone, (b) models often misclassify images even in the presence of correctly classified foregrounds--up to 87.5% of the time with adversarially chosen backgrounds, and (c) more accurate models tend to depend on backgrounds less. Our analysis of backgrounds brings us closer to understanding which correlations machine learning models use, and how they determine models' out of distribution performance.", "year": 2020, "referenceCount": 28, "citationCount": 155, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2066515966", "name": "Kai Y. Xiao"}, {"authorId": "39468283", "name": "Logan Engstrom"}, {"authorId": "34562927", "name": "Andrew Ilyas"}, {"authorId": "143826246", "name": "A. Madry"}]}, {"paperId": "d44efe577671bde0fd09105d9b1e2fdca047da94", "url": "https://www.semanticscholar.org/paper/d44efe577671bde0fd09105d9b1e2fdca047da94", "title": "Prediction of cryptocurrency returns using machine learning", "abstract": null, "year": 2020, "referenceCount": 67, "citationCount": 58, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "121374362", "name": "Erdinç Akyıldırım"}, {"authorId": "2580138", "name": "Ahmet Göncü"}, {"authorId": "51056368", "name": "A. Sensoy"}]}, {"paperId": "a09f13a31ff1f9f7fe06ac37b2ebddb5e6630995", "url": "https://www.semanticscholar.org/paper/a09f13a31ff1f9f7fe06ac37b2ebddb5e6630995", "title": "Predicting Multiprocessor Memory Access Patterns with Learning Models", "abstract": "Machine learning techniques are applicable to computer system optimization. We show that shared memory multiprocessors can successfully utilize machine learning algorithms for memory access pattern prediction. In particular three different on-line machine learning prediction techniques were tested to learn and predict repetitive memory access patterns for three typical parallel processing applications, the 2-D relaxation algorithm, matrix multiply and Fast Fourier Transform on a shared memory multiprocessor. The predictions were then used by a routing control algorithm to reduce control latency in the interconnection network by configuring the interconnection network to provide needed memory access paths before they were requested. Three trainable prediction techniques were used and tested: 1). a Markov predictor, 2). a linear predictor and 3). a time delay neural network (TDNN) predictor. Different predictors performed best on different applications, but the TDNN produced uniformly good results.", "year": 1997, "referenceCount": 21, "citationCount": 35, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145470743", "name": "M. Sakr"}, {"authorId": "1687100", "name": "S. Levitan"}, {"authorId": "1757442", "name": "D. M. Chiarulli"}, {"authorId": "35216199", "name": "B. Horne"}, {"authorId": "145157784", "name": "C. Lee Giles"}]}, {"paperId": "b1b800aacf850a18e6504c693b4c5d33b8b3ac32", "url": "https://www.semanticscholar.org/paper/b1b800aacf850a18e6504c693b4c5d33b8b3ac32", "title": "State of the Art—A Survey of Partially Observable Markov Decision Processes: Theory, Models, and Algorithms", "abstract": "This paper surveys models and algorithms dealing with partially observable Markov decision processes. A partially observable Markov decision process (POMDP) is a generalization of a Markov decision process which permits uncertainty regarding the state of a Markov process and allows for state information acquisition. A general framework for finite state and action POMDP's is presented. Next, there is a brief discussion of the development of POMDP's and their relationship with other decision processes. A wide range of models in such areas as quality control, machine maintenance, internal auditing, learning, and optimal stopping are discussed within the POMDP-framework. Lastly, algorithms for computing optimal solutions to POMDP's are presented.", "year": 1982, "referenceCount": 0, "citationCount": 620, "influentialCitationCount": 44, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "3254214", "name": "G. Monahan"}]}, {"paperId": "9a0ef2e00a28623c49b695ec6088ea1d965db257", "url": "https://www.semanticscholar.org/paper/9a0ef2e00a28623c49b695ec6088ea1d965db257", "title": "Classification of brain tumor type and grade using MRI texture and shape in a machine learning scheme", "abstract": "The objective of this study is to investigate the use of pattern classification methods for distinguishing different types of brain tumors, such as primary gliomas from metastases, and also for grading of gliomas. The availability of an automated computer analysis tool that is more objective than human readers can potentially lead to more reliable and reproducible brain tumor diagnostic procedures. A computer‐assisted classification method combining conventional MRI and perfusion MRI is developed and used for differential diagnosis. The proposed scheme consists of several steps including region‐of‐interest definition, feature extraction, feature selection, and classification. The extracted features include tumor shape and intensity characteristics, as well as rotation invariant texture features. Feature subset selection is performed using support vector machines with recursive feature elimination. The method was applied on a population of 102 brain tumors histologically diagnosed as metastasis ( 24 ), meningiomas ( 4 ), gliomas World Health Organization grade II ( 22 ), gliomas World Health Organization grade III ( 18 ), and glioblastomas ( 34 ). The binary support vector machine classification accuracy, sensitivity, and specificity, assessed by leave‐one‐out cross‐validation, were, respectively, 85%, 87%, and 79% for discrimination of metastases from gliomas and 88%, 85%, and 96% for discrimination of high‐grade (grades III and IV) from low‐grade (grade II) neoplasms. Multiclass classification was also performed via a one‐vs‐all voting scheme. Magn Reson Med, 2009. © 2009 Wiley‐Liss, Inc.", "year": 2009, "referenceCount": 48, "citationCount": 630, "influentialCitationCount": 34, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1784303", "name": "E. Zacharaki"}, {"authorId": "40658597", "name": "Sumei Wang"}, {"authorId": "143990587", "name": "S. Chawla"}, {"authorId": "9012366", "name": "Dong Soo Yoo"}, {"authorId": "48750802", "name": "R. Wolf"}, {"authorId": "1771697", "name": "E. Melhem"}, {"authorId": "1740714", "name": "C. Davatzikos"}]}, {"paperId": "922838dd98d599d1d229cc73896d55e7a769aa7c", "url": "https://www.semanticscholar.org/paper/922838dd98d599d1d229cc73896d55e7a769aa7c", "title": "Learning hierarchical representations for face verification with convolutional deep belief networks", "abstract": "Most modern face recognition systems rely on a feature representation given by a hand-crafted image descriptor, such as Local Binary Patterns (LBP), and achieve improved performance by combining several such representations. In this paper, we propose deep learning as a natural source for obtaining additional, complementary representations. To learn features in high-resolution images, we make use of convolutional deep belief networks. Moreover, to take advantage of global structure in an object class, we develop local convolutional restricted Boltzmann machines, a novel convolutional learning model that exploits the global structure by not assuming stationarity of features across the image, while maintaining scalability and robustness to small misalignments. We also present a novel application of deep learning to descriptors other than pixel intensity values, such as LBP. In addition, we compare performance of networks trained using unsupervised learning against networks with random filters, and empirically show that learning weights not only is necessary for obtaining good multilayer representations, but also provides robustness to the choice of the network architecture parameters. Finally, we show that a recognition system using only representations obtained from deep learning can achieve comparable accuracy with a system using a combination of hand-crafted image descriptors. Moreover, by combining these representations, we achieve state-of-the-art results on a real-world face verification database.", "year": 2012, "referenceCount": 45, "citationCount": 401, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3219900", "name": "Gary B. Huang"}, {"authorId": "1697141", "name": "Honglak Lee"}, {"authorId": "1389846455", "name": "E. Learned-Miller"}]}, {"paperId": "23f425d6cb57938ceaa98fce8133a6924c2f953b", "url": "https://www.semanticscholar.org/paper/23f425d6cb57938ceaa98fce8133a6924c2f953b", "title": "Three scenarios for continual learning", "abstract": "Standard artificial neural networks suffer from the well-known issue of catastrophic forgetting, making continual or lifelong learning difficult for machine learning. In recent years, numerous methods have been proposed for continual learning, but due to differences in evaluation protocols it is difficult to directly compare their performance. To enable more structured comparisons, we describe three continual learning scenarios based on whether at test time task identity is provided and--in case it is not--whether it must be inferred. Any sequence of well-defined tasks can be performed according to each scenario. Using the split and permuted MNIST task protocols, for each scenario we carry out an extensive comparison of recently proposed continual learning methods. We demonstrate substantial differences between the three scenarios in terms of difficulty and in terms of how efficient different methods are. In particular, when task identity must be inferred (i.e., class incremental learning), we find that regularization-based approaches (e.g., elastic weight consolidation) fail and that replaying representations of previous experiences seems required for solving this scenario.", "year": 2019, "referenceCount": 36, "citationCount": 348, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "118439707", "name": "Gido M. van de Ven"}, {"authorId": "1739838", "name": "A. Tolias"}]}, {"paperId": "e1bb329621de73d08c47beae9b5439a1c244eb1a", "url": "https://www.semanticscholar.org/paper/e1bb329621de73d08c47beae9b5439a1c244eb1a", "title": "CSI: Novelty Detection via Contrastive Learning on Distributionally Shifted Instances", "abstract": "Novelty detection, i.e., identifying whether a given sample is drawn from outside the training distribution, is essential for reliable machine learning. To this end, there have been many attempts at learning a representation well-suited for novelty detection and designing a score based on such representation. In this paper, we propose a simple, yet effective method named contrasting shifted instances (CSI), inspired by the recent success on contrastive learning of visual representations. Specifically, in addition to contrasting a given sample with other instances as in conventional contrastive learning methods, our training scheme contrasts the sample with distributionally-shifted augmentations of itself. Based on this, we propose a new detection score that is specific to the proposed training scheme. Our experiments demonstrate the superiority of our method under various novelty detection scenarios, including unlabeled one-class, unlabeled multi-class and labeled multi-class settings, with various image benchmark datasets.", "year": 2020, "referenceCount": 87, "citationCount": 231, "influentialCitationCount": 65, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1750599181", "name": "Jihoon Tack"}, {"authorId": "9962692", "name": "Sangwoo Mo"}, {"authorId": "83125078", "name": "Jongheon Jeong"}, {"authorId": "143720148", "name": "Jinwoo Shin"}]}, {"paperId": "5055701269d43e6434d76cbe0f177d8afe1e4634", "url": "https://www.semanticscholar.org/paper/5055701269d43e6434d76cbe0f177d8afe1e4634", "title": "Earthquake magnitude prediction in Hindukush region using machine learning techniques", "abstract": null, "year": 2016, "referenceCount": 52, "citationCount": 111, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "2543824", "name": "K. M. Asim"}, {"authorId": "1397728402", "name": "F. Martínez-Álvarez"}, {"authorId": "46430042", "name": "A. Basit"}, {"authorId": "9562857", "name": "T. Iqbal"}]}, {"paperId": "8f984259d156a223d01349b366e6943d8ddc20b6", "url": "https://www.semanticscholar.org/paper/8f984259d156a223d01349b366e6943d8ddc20b6", "title": "Semantic similarity and machine learning with ontologies", "abstract": "Abstract Ontologies have long been employed in the life sciences to formally represent and reason over domain knowledge and they are employed in almost every major biological database. Recently, ontologies are increasingly being used to provide background knowledge in similarity-based analysis and machine learning models. The methods employed to combine ontologies and machine learning are still novel and actively being developed. We provide an overview over the methods that use ontologies to compute similarity and incorporate them in machine learning methods; in particular, we outline how semantic similarity measures and ontology embeddings can exploit the background knowledge in ontologies and how ontologies can provide constraints that improve machine learning models. The methods and experiments we describe are available as a set of executable notebooks, and we also provide a set of slides and additional resources at https://github.com/bio-ontology-research-group/machine-learning-with-ontologies.", "year": 2020, "referenceCount": 151, "citationCount": 46, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "8351299", "name": "Maxat Kulmanov"}, {"authorId": "14823788", "name": "F. Z. Smaili"}, {"authorId": "143703146", "name": "Xin Gao"}, {"authorId": "1798963", "name": "R. Hoehndorf"}]}, {"paperId": "8b3183a2051f50520f074d92d15037fb0cde5f27", "url": "https://www.semanticscholar.org/paper/8b3183a2051f50520f074d92d15037fb0cde5f27", "title": "Hitting and commute times in large random neighborhood graphs", "abstract": "In machine learning, a popular tool to analyze the structure of graphs is the hitting time and the commute distance (resistance distance). For two vertices u and v, the hitting time Huv is the expected time it takes a random walk to travel from u to v. The commute distance is its symmetrized version Cuv = Huv +Hvu. In our paper we study the behavior of hitting times and commute distances when the number n of vertices in the graph tends to infinity. We focus on random geometric graphs (e-graphs, kNN graphs and Gaussian similarity graphs), but our results also extend to graphs with a given expected degree distribution or Erdos-Renyi graphs with planted partitions. We prove that in these graph families, the suitably rescaled hitting time Huv converges to 1/dv and the rescaled commute time to 1/du+1=dv where du and dv denote the degrees of vertices u and v. In these cases, hitting and commute times do not provide information about the structure of the graph, and their use is discouraged in many machine learning applications.", "year": 2014, "referenceCount": 74, "citationCount": 99, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1728654", "name": "U. V. Luxburg"}, {"authorId": "47187712", "name": "Agnes Radl"}, {"authorId": "143610806", "name": "Matthias Hein"}]}, {"paperId": "e80d63e35f35179287ef0a94dc2ef7f538c4b41f", "url": "https://www.semanticscholar.org/paper/e80d63e35f35179287ef0a94dc2ef7f538c4b41f", "title": "Genetic algorithms for fuzzy control.1. Offline system development and application", "abstract": "Although fuzzy logic controllers and expert systems have been successfully applied in many complex industrial processes, they experience a deficiency in knowledge acquisition and rely to a great extent on empirical and heuristic knowledge which, in many cases, cannot be objectively elicited. Among the problems to be resolved in fuzzy controller design are the determination of the linguistic state space, definition of the membership functions of each linguistic term and the derivation of the control rules. Some of these problems can be solved by application of machine learning. First, it is desirable to simplify and automate the specification of linguistic rules. Secondly, it is also desirable that modification of control rules is possible in order to cope with previously unknown or changes in process dynamics. Machine learning methods have, in recent years, emerged from the use of learning algorithms modelled on natural and biological systems. These methods attempt to abstract the advanced mechanisms of learning exhibited by such systems, which can consequently be applied to intelligent control. One of these new algorithms is the genetic algorithm which is modelled on the processes of natural evolution. The paper develops the application of genetic algorithm techniques for fuzzy controller design. Genetic algorithms are used to automate and introduce objective criteria in defining fuzzy controller parameters.", "year": 1995, "referenceCount": 0, "citationCount": 199, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "20513909", "name": "D. Linkens"}, {"authorId": "1903882", "name": "H. Nyongesa"}]}, {"paperId": "37a59e8953e62fe61cb9723e1dcc2382bb427767", "url": "https://www.semanticscholar.org/paper/37a59e8953e62fe61cb9723e1dcc2382bb427767", "title": "Survey on machine learning-based QoE-QoS correlation models", "abstract": "The machine learning provides a theoretical and methodological framework to quantify the relationship between user OoE (Quality of Experience) and network QoS (Quality of Service). This paper presents an overview of QoE-QoS correlation models based on machine learning techniques. According to the learning type, we propose a categorization of correlation models. For each category, we review the main existing works by citing deployed learning methods and model parameters (QoE measurement, QoS parameters and service type). Moreover, the survey will provide researchers with the latest trends and findings in this field.", "year": 2014, "referenceCount": 32, "citationCount": 63, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3024857", "name": "Sana Aroussi"}, {"authorId": "1692655", "name": "A. Mellouk"}]}, {"paperId": "13ba3b487ed129afe749cf5a12bb7759341ca776", "url": "https://www.semanticscholar.org/paper/13ba3b487ed129afe749cf5a12bb7759341ca776", "title": "Learning for Safety-Critical Control with Control Barrier Functions", "abstract": "Modern nonlinear control theory seeks to endow systems with properties of stability and safety, and have been deployed successfully in multiple domains. Despite this success, model uncertainty remains a significant challenge in synthesizing safe controllers, leading to degradation in the properties provided by the controllers. This paper develops a machine learning framework utilizing Control Barrier Functions (CBFs) to reduce model uncertainty as it impact the safe behavior of a system. This approach iteratively collects data and updates a controller, ultimately achieving safe behavior. We validate this method in simulation and experimentally on a Segway platform.", "year": 2019, "referenceCount": 47, "citationCount": 101, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "2110342359", "name": "Andrew J. Taylor"}, {"authorId": "152614574", "name": "Andrew W. Singletary"}, {"authorId": "1740159", "name": "Yisong Yue"}, {"authorId": "37952580", "name": "A. Ames"}]}, {"paperId": "6207a5933d5f7971486ce73323a37567c70aeb0f", "url": "https://www.semanticscholar.org/paper/6207a5933d5f7971486ce73323a37567c70aeb0f", "title": "Did you hear that? Adversarial Examples Against Automatic Speech Recognition", "abstract": "Speech is a common and effective way of communication between humans, and modern consumer devices such as smartphones and home hubs are equipped with deep learning based accurate automatic speech recognition to enable natural interaction between humans and machines. Recently, researchers have demonstrated powerful attacks against machine learning models that can fool them to produceincorrect results. However, nearly all previous research in adversarial attacks has focused on image recognition and object detection models. In this short paper, we present a first of its kind demonstration of adversarial attacks against speech classification model. Our algorithm performs targeted attacks with 87% success by adding small background noise without having to know the underlying model parameter and architecture. Our attack only changes the least significant bits of a subset of audio clip samples, and the noise does not change 89% the human listener's perception of the audio clip as evaluated in our human study.", "year": 2018, "referenceCount": 13, "citationCount": 190, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3030212", "name": "M. Alzantot"}, {"authorId": "144019834", "name": "Bharathan Balaji"}, {"authorId": "1702254", "name": "M. Srivastava"}]}, {"paperId": "e1c13fe8de68ec9fa8b7dbf0807a7621e1311839", "url": "https://www.semanticscholar.org/paper/e1c13fe8de68ec9fa8b7dbf0807a7621e1311839", "title": "Machine Learning for motor skills in robotics", "abstract": "Autonomous robots that can adapt to novel situations has been a long standing vision of robotics, artificial intelligence, and the cognitive sciences. Early approaches to this goal during the heydays of artificial intelligence research in the late 1980s, however, made it clear that an approach purely based on reasoning or human insights would not be able to model all the perceptuomotor tasks of future robots. Instead, new hope was put in the growing wake of machine learning that promised fully adaptive control algorithms which learn both by observation and trial-and-error. However, to date, learning techniques have yet to fulfill this promise as only few methods manage to scale into the high-dimensional domains of manipulator and humanoid robotics and usually scaling was only achieved in precisely pre-structured domains. We have investigated the ingredients for a general approach to motor skill learning in order to get one step closer towards human-like performance. For doing so, we study two major components for such an approach, i.e., firstly, a theoretically well-founded general approach to representing the required control structures for task representation and execution and, secondly, appropriate learning algorithms which can be applied in this setting.", "year": 2008, "referenceCount": 217, "citationCount": 68, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145197867", "name": "Jan Peters"}]}, {"paperId": "06f7087ee1a796eeb65ef30c10427b313af05743", "url": "https://www.semanticscholar.org/paper/06f7087ee1a796eeb65ef30c10427b313af05743", "title": "Manifold regularization and semi-supervised learning: some theoretical analyses", "abstract": "Manifold regularization (Belkin et al., 2006) is a geometrically motivated framework for machine learning within which several semi-supervised algorithms have been constructed. Here we try to provide some theoretical understanding of this approach. Our main result is to expose the natural structure of a class of problems on which manifold regularization methods are helpful. We show that for such problems, no supervised learner can learn effectively. On the other hand, a manifold based learner (that knows the manifold or \"learns\" it from unlabeled examples) can learn with relatively few labeled examples. Our analysis follows a minimax style with an emphasis on finite sample results (in terms of n: the number of labeled examples). These results allow us to properly interpret manifold regularization and related spectral and geometric algorithms in terms of their potential use in semi-supervised learning.", "year": 2013, "referenceCount": 32, "citationCount": 101, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1770745", "name": "P. Niyogi"}]}, {"paperId": "fc3fb8de45d2376df82e8d43d2f4119942609d7d", "url": "https://www.semanticscholar.org/paper/fc3fb8de45d2376df82e8d43d2f4119942609d7d", "title": "Machine Learning Techniques for Cooperative Spectrum Sensing in Cognitive Radio Networks", "abstract": "We propose novel cooperative spectrum sensing (CSS) algorithms for cognitive radio (CR) networks based on machine learning techniques which are used for pattern classification. In this regard, unsupervised (e.g., K-means clustering and Gaussian mixture model (GMM)) and supervised (e.g., support vector machine (SVM) and weighted K-nearest-neighbor (KNN)) learning-based classification techniques are implemented for CSS. For a radio channel, the vector of the energy levels estimated at CR devices is treated as a feature vector and fed into a classifier to decide whether the channel is available or not. The classifier categorizes each feature vector into either of the two classes, namely, the \"channel available class\" and the \"channel unavailable class\". Prior to the online classification, the classifier needs to go through a training phase. For classification, the K-means clustering algorithm partitions the training feature vectors into K clusters, where each cluster corresponds to a combined state of primary users (PUs) and then the classifier determines the class the test energy vector belongs to. The GMM obtains a mixture of Gaussian density functions that well describes the training feature vectors. In the case of the SVM, the support vectors (i.e., a subset of training vectors which fully specify the decision function) are obtained by maximizing the margin between the separating hyperplane and the training feature vectors. Furthermore, the weighted KNN classification technique is proposed for CSS for which the weight of each feature vector is calculated by evaluating the area under the receiver operating characteristic (ROC) curve of that feature vector. The performance of each classification technique is quantified in terms of the average training time, the sample classification delay, and the ROC curve. Our comparative results clearly reveal that the proposed algorithms outperform the existing state-of-the-art CSS techniques.", "year": 2013, "referenceCount": 23, "citationCount": 292, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1757321", "name": "K. Thilina"}, {"authorId": "34647273", "name": "K. Choi"}, {"authorId": "1706468", "name": "N. Saquib"}, {"authorId": "144158811", "name": "E. Hossain"}]}, {"paperId": "4876f8df26b3eb92b8169c3811fb772d8c8f6fd2", "url": "https://www.semanticscholar.org/paper/4876f8df26b3eb92b8169c3811fb772d8c8f6fd2", "title": "Modulation Classification Based on Signal Constellation Diagrams and Deep Learning", "abstract": "Deep learning (DL) is a new machine learning (ML) methodology that has found successful implementations in many application domains. However, its usage in communications systems has not been well explored. This paper investigates the use of the DL in modulation classification, which is a major task in many communications systems. The DL relies on a massive amount of data and, for research and applications, this can be easily available in communications systems. Furthermore, unlike the ML, the DL has the advantage of not requiring manual feature selections, which significantly reduces the task complexity in modulation classification. In this paper, we use two convolutional neural network (CNN)-based DL models, AlexNet and GoogLeNet. Specifically, we develop several methods to represent modulated signals in data formats with gridlike topologies for the CNN. The impacts of representation on classification performance are also analyzed. In addition, comparisons with traditional cumulant and ML-based algorithms are presented. Experimental results demonstrate the significant performance advantage and application feasibility of the DL-based approach for modulation classification.", "year": 2019, "referenceCount": 24, "citationCount": 217, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2233748", "name": "Shengliang Peng"}, {"authorId": "145337201", "name": "Hanyu Jiang"}, {"authorId": "1825155", "name": "Huaxia Wang"}, {"authorId": "11013929", "name": "H. Alwageed"}, {"authorId": "2110633627", "name": "Yu Zhou"}, {"authorId": "51134994", "name": "Marjan Mazrouei Sebdani"}, {"authorId": "145259429", "name": "Yu-dong Yao"}]}, {"paperId": "3f624144a3c7d99d2e9a1063ba861fd56646bc1a", "url": "https://www.semanticscholar.org/paper/3f624144a3c7d99d2e9a1063ba861fd56646bc1a", "title": "Application of machine learning to construction injury prediction", "abstract": null, "year": 2016, "referenceCount": 87, "citationCount": 160, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "123722986", "name": "A. Tixier"}, {"authorId": "3911801", "name": "Matthew R. Hallowell"}, {"authorId": "2889848", "name": "B. Rajagopalan"}, {"authorId": "36404093", "name": "Dean Bowman"}]}, {"paperId": "ca5642f522cd2cd44948c7e9f337c91e5f26fdcf", "url": "https://www.semanticscholar.org/paper/ca5642f522cd2cd44948c7e9f337c91e5f26fdcf", "title": "Adversarial Attacks and Defences Competition", "abstract": null, "year": 2018, "referenceCount": 44, "citationCount": 215, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145714153", "name": "A. Kurakin"}, {"authorId": "153440022", "name": "Ian J. Goodfellow"}, {"authorId": "1751569", "name": "Samy Bengio"}, {"authorId": "3431029", "name": "Yinpeng Dong"}, {"authorId": "37906910", "name": "Fangzhou Liao"}, {"authorId": "2054800974", "name": "Ming Liang"}, {"authorId": "19201674", "name": "Tianyu Pang"}, {"authorId": "145254043", "name": "Jun Zhu"}, {"authorId": "2109753669", "name": "Xiaolin Hu"}, {"authorId": "3011497", "name": "Cihang Xie"}, {"authorId": null, "name": "Jianyu Wang"}, {"authorId": "2852303", "name": "Zhishuai Zhang"}, {"authorId": "145888238", "name": "Zhou Ren"}, {"authorId": "145081362", "name": "A. Yuille"}, {"authorId": "39421868", "name": "Sangxia Huang"}, {"authorId": "2143397594", "name": "Yao Zhao"}, {"authorId": "2109960970", "name": "Yuzhe Zhao"}, {"authorId": "2113963336", "name": "Zhonglin Han"}, {"authorId": "2117316803", "name": "Junjiajia Long"}, {"authorId": "41021078", "name": "Yerkebulan Berdibekov"}, {"authorId": "2859858", "name": "Takuya Akiba"}, {"authorId": "3117618", "name": "Seiya Tokui"}, {"authorId": "2070123779", "name": "Motoki Abe"}]}, {"paperId": "3b7ae5c745ed5ab496b60ec5dc57db26712c177e", "url": "https://www.semanticscholar.org/paper/3b7ae5c745ed5ab496b60ec5dc57db26712c177e", "title": "Machine learning in individual claims reserving", "abstract": "Abstract Machine learning techniques make it feasible to calculate claims reserves on individual claims data. This paper illustrates how these techniques can be used by providing an explicit example in individual claims reserving.", "year": 2018, "referenceCount": 21, "citationCount": 66, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Business", "Mathematics"], "authors": [{"authorId": "3254367", "name": "M. Wüthrich"}]}, {"paperId": "c82982f7c4504910ab40bc9b6ad86d92d11f43e4", "url": "https://www.semanticscholar.org/paper/c82982f7c4504910ab40bc9b6ad86d92d11f43e4", "title": "Machine learning in agricultural and applied economics", "abstract": "This review presents machine learning (ML) approaches from an applied economist’s perspective. We first introduce the key ML methods drawing connections to econometric practice. We then identify current limitations of the econometric and simulation model toolbox in applied economics and explore potential solutions afforded by ML. We dive into cases such as inflexible functional forms, unstructured data sources and large numbers of explanatory variables in both prediction and causal analysis, and highlight the challenges of complex simulation models. Finally, we argue that economists have a vital role in addressing the shortcomings of ML when used for quantitative economic analysis.", "year": 2019, "referenceCount": 195, "citationCount": 68, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "25700449", "name": "Hugo Storm"}, {"authorId": "38692135", "name": "K. Baylis"}, {"authorId": "2516120", "name": "T. Heckelei"}]}, {"paperId": "41d6ef9101d70ac1dc0bc6d514a5e1b1d32ebf8f", "url": "https://www.semanticscholar.org/paper/41d6ef9101d70ac1dc0bc6d514a5e1b1d32ebf8f", "title": "The UCI KDD archive of large data sets for data mining research and experimentation", "abstract": "Advances in data collection and storage have allowed organizations to create massive, complex and heterogeneous databases, which have stymied traditional methods of data analysis. This has led to the development of new analytical tools that often combine techniques from a variety of elds such as statistics, computer science, and mathematics to extract meaningful knowledge from the data. To support research in this area, UC Irvine has created the UCI Knowledge Discovery in Databases (KDD) Archive (http://kdd.ics.uci.edu)which is a new online archive of large and complex data sets that encompasses a wide variety of data types, analysis tasks, and application areas. This article describes the objectives and philosophy of the UCI KDD Archive. We draw parallels with the development of the UCI Machine Learning Repository and its a ect on the Machine Learning community.", "year": 2000, "referenceCount": 10, "citationCount": 184, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2305700", "name": "Stephen D. Bay"}, {"authorId": "2787844", "name": "D. Kibler"}, {"authorId": "1694780", "name": "M. Pazzani"}, {"authorId": "50860274", "name": "Padhraic Smyth"}]}, {"paperId": "10d21ca7728cb3dd15731accedda9ea711d8a0f4", "url": "https://www.semanticscholar.org/paper/10d21ca7728cb3dd15731accedda9ea711d8a0f4", "title": "An End-to-End Discriminative Approach to Machine Translation", "abstract": "We present a perceptron-style discriminative approach to machine translation in which large feature sets can be exploited. Unlike discriminative reranking approaches, our system can take advantage of learned features in all stages of decoding. We first discuss several challenges to error-driven discriminative approaches. In particular, we explore different ways of updating parameters given a training example. We find that making frequent but smaller updates is preferable to making fewer but larger updates. Then, we discuss an array of features and show both how they quantitatively increase BLEU score and how they qualitatively interact on specific examples. One particular feature we investigate is a novel way to introduce learning into the initial phrase extraction process, which has previously been entirely heuristic.", "year": 2006, "referenceCount": 25, "citationCount": 318, "influentialCitationCount": 49, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2075292388", "name": "P. Liang"}, {"authorId": "1398531195", "name": "A. Bouchard-Côté"}, {"authorId": "38666915", "name": "D. Klein"}, {"authorId": "1685978", "name": "B. Taskar"}]}, {"paperId": "5260df181b79a5c91622d4c2da6d2c618852d6ff", "url": "https://www.semanticscholar.org/paper/5260df181b79a5c91622d4c2da6d2c618852d6ff", "title": "Kernel Fisher Discriminants", "abstract": "In this thesis we consider statistical learning problems and machines. A statistical learning machine tries to infer rules from a given set of examples such that it is able to make correct predictions on unseen examples. These predictions can for example be a classification or a regression. We consider the class of kernel based learning techniques. The main contributions of this work can be summarized as follows. Building upon the theory of reproducing kernels we propose a number of new learning algorithms based on the maximization of a Rayleigh coefficient in a kernel feature space. We exemplify this for oriented (kernel) PCA, and especially for Fisher’s discriminant, yielding kernel Fisher discriminants (KFD). Furthermore, we show that KFD is intimately related to quadratic and linear optimization. Building upon this connection we propose several ways to deal with the optimization problems arising in kernel based methods and especially for KFD. This mathematical programming formulation is the starting point to derive several important and interesting variants of KFD, namely robust KFD, sparse KFD and linear KFD. Several algorithms to solve the resulting optimization problems are discussed. As a last consequence of the mathematical programming formulation we are able to relate KFD to other techniques like support vector machines, relevance vector machines and Arc-GV. Through a structural comparison of the underlying optimization problems we illustrate that many modern learning techniques, including KFD, are highly similar. In a separate chapter we present first results dealing with learning guarantees for eigenvalues and eigenvectors estimated from covariance matrices. We show that under some mild assumptions empirical eigenvalues are with high probability close to the expected eigenvalues when training on a specific, finite sample size. For eigenvectors we show that also with high probability an empirical eigenvector will be close to an eigenvector of the underlying distribution. In a large collection of experiments we demonstrate that KFD and its variants proposed here are capable of producing state of the art results. We compare KFD to techniques like AdaBoost and support vector machines, carefully discussing its advantages and also its difficulties.", "year": 2003, "referenceCount": 165, "citationCount": 156, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2459012", "name": "S. Mika"}]}, {"paperId": "13755563644c43f4d0d2378338c61cbf89d3d2f8", "url": "https://www.semanticscholar.org/paper/13755563644c43f4d0d2378338c61cbf89d3d2f8", "title": "Machine‐learning scoring functions for structure‐based drug lead optimization", "abstract": "Molecular docking can be used to predict how strongly small‐molecule binders and their chemical derivatives bind to a macromolecular target using its available three‐dimensional structures. Scoring functions (SFs) are employed to rank these molecules by their predicted binding affinity (potency). A classical SF assumes a predetermined theory‐inspired functional form for the relationship between the features characterizing the structure of the protein–ligand complex and its predicted binding affinity (this relationship is almost always assumed to be linear). Recent years have seen the prosperity of machine‐learning SFs, which are fast regression models built instead with contemporary supervised learning algorithms. In this review, we analyzed machine‐learning SFs for drug lead optimization in the 2015–2019 period. The performance gap between classical and machine‐learning SFs was large and has now broadened owing to methodological improvements and the availability of more training data. Against the expectations of many experts, SFs employing deep learning techniques were not always more predictive than those based on more established machine learning techniques and, when they were, the performance gain was small. More codes and webservers are available and ready to be applied to prospective structure‐based drug lead optimization studies. These have exhibited excellent predictive accuracy in compelling retrospective tests, outperforming in some cases much more computationally demanding molecular simulation‐based methods. A discussion of future work completes this review.", "year": 2020, "referenceCount": 116, "citationCount": 66, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1704421", "name": "Hongjian Li"}, {"authorId": "1581615496", "name": "Kam-Heung Sze"}, {"authorId": "2114181414", "name": "Gang Lu"}, {"authorId": "9998035", "name": "P. Ballester"}]}, {"paperId": "2444be7584d1f5a7e2aa9f65078de09154f14ea1", "url": "https://www.semanticscholar.org/paper/2444be7584d1f5a7e2aa9f65078de09154f14ea1", "title": "Born Again Neural Networks", "abstract": "Knowledge distillation (KD) consists of transferring knowledge from one machine learning model (the teacher}) to another (the student). Commonly, the teacher is a high-capacity model with formidable performance, while the student is more compact. By transferring knowledge, one hopes to benefit from the student's compactness. %we desire a compact model with performance close to the teacher's. We study KD from a new perspective: rather than compressing models, we train students parameterized identically to their teachers. Surprisingly, these {Born-Again Networks (BANs), outperform their teachers significantly, both on computer vision and language modeling tasks. Our experiments with BANs based on DenseNets demonstrate state-of-the-art performance on the CIFAR-10 (3.5%) and CIFAR-100 (15.5%) datasets, by validation error. Additional experiments explore two distillation objectives: (i) Confidence-Weighted by Teacher Max (CWTM) and (ii) Dark Knowledge with Permuted Predictions (DKPP). Both methods elucidate the essential components of KD, demonstrating a role of the teacher outputs on both predicted and non-predicted classes. We present experiments with students of various capacities, focusing on the under-explored case where students overpower teachers. Our experiments show significant advantages from transferring knowledge between DenseNets and ResNets in either direction.", "year": 2018, "referenceCount": 55, "citationCount": 606, "influentialCitationCount": 75, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2067208583", "name": "Tommaso Furlanello"}, {"authorId": "32219137", "name": "Zachary Chase Lipton"}, {"authorId": "143902495", "name": "M. Tschannen"}, {"authorId": "7326223", "name": "L. Itti"}, {"authorId": "2047844", "name": "Anima Anandkumar"}]}, {"paperId": "b2eadf142091cea03bfcc333d78f9edde025f7b8", "url": "https://www.semanticscholar.org/paper/b2eadf142091cea03bfcc333d78f9edde025f7b8", "title": "How does Machine Learning Change Software Development Practices?", "abstract": "Adding an ability for a system to learn inherently adds uncertainty into the system. Given the rising popularity of incorporating machine learning into systems, we wondered how the addition alters software development practices. We performed a mixture of qualitative and quantitative studies with 14 interviewees and 342 survey respondents from 26 countries across four continents to elicit significant differences between the development of machine learning systems and the development of non-machine-learning systems. Our study uncovers significant differences in various aspects of software engineering (e.g., requirements, design, testing, and process) and work characteristics (e.g., skill variety, problem solving and task identity). Based on our findings, we highlight future research directions and provide recommendations for practitioners.", "year": 2021, "referenceCount": 45, "citationCount": 74, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3453740", "name": "Zhiyuan Wan"}, {"authorId": "144558659", "name": "Xin Xia"}, {"authorId": "143960552", "name": "David Lo"}, {"authorId": "1739674", "name": "G. Murphy"}]}, {"paperId": "575dfd56906f35540d3190a9bb9899f182949d19", "url": "https://www.semanticscholar.org/paper/575dfd56906f35540d3190a9bb9899f182949d19", "title": "Hello World Deep Learning in Medical Imaging", "abstract": null, "year": 2018, "referenceCount": 20, "citationCount": 79, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144102963", "name": "P. Lakhani"}, {"authorId": "2064547815", "name": "Daniel L. Gray"}, {"authorId": "41154838", "name": "Carl R. Pett"}, {"authorId": "31512040", "name": "P. Nagy"}, {"authorId": "70061531", "name": "G. Shih"}]}, {"paperId": "ddb451cb57f2ed71004fdc218e0b23cc90b8233c", "url": "https://www.semanticscholar.org/paper/ddb451cb57f2ed71004fdc218e0b23cc90b8233c", "title": "Artificial Intelligence and Black-Box Medical Decisions: Accuracy versus Explainability.", "abstract": "Although decision-making algorithms are not new to medicine, the availability of vast stores of medical data, gains in computing power, and breakthroughs in machine learning are accelerating the pace of their development, expanding the range of questions they can address, and increasing their predictive power. In many cases, however, the most powerful machine learning techniques purchase diagnostic or predictive accuracy at the expense of our ability to access \"the knowledge within the machine.\" Without an explanation in terms of reasons or a rationale for particular decisions in individual cases, some commentators regard ceding medical decision-making to black box systems as contravening the profound moral responsibilities of clinicians. I argue, however, that opaque decisions are more common in medicine than critics realize. Moreover, as Aristotle noted over two millennia ago, when our knowledge of causal systems is incomplete and precarious-as it often is in medicine-the ability to explain how results are produced can be less important than the ability to produce such results and empirically verify their accuracy.", "year": 2019, "referenceCount": 34, "citationCount": 238, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2329084", "name": "A. London"}]}, {"paperId": "15d24d32bafe9edfc453108601a3fee41ab2a31c", "url": "https://www.semanticscholar.org/paper/15d24d32bafe9edfc453108601a3fee41ab2a31c", "title": "The Machine Learning Algorithm as Creative Musical Tool", "abstract": "Machine learning is the capacity of a computational system to learn structures from datasets in order to make prediction in front of newly seen datasets. Such approach offers a significant advantage in music scenarios in which musicians can teach the system to learn an idiosyncratic style, or can break the rules to explore the system capacity in unexpected ways. In this chapter we draw on music, machine learning, and human-computer interaction to elucidate an understanding of machine learning algorithms as creative tools for music and the sonic arts. We motivate a new understanding of learning algorithms as human-computer interfaces. We show that, like other interfaces, learning algorithms can be characterised by the ways their affordances intersect with goals of human users. We also argue that the nature of interaction between users and algorithms impacts the usability and usefulness of those algorithms in profound ways. This human-centred view of machine learning motivates our concluding discussion of what it means to employ machine learning as a creative tool.", "year": 2016, "referenceCount": 68, "citationCount": 53, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1745615", "name": "R. Fiebrink"}, {"authorId": "2046048", "name": "Baptiste Caramiaux"}]}, {"paperId": "3185fd6ca0664a06ad0db58ea92142f0e97cb89e", "url": "https://www.semanticscholar.org/paper/3185fd6ca0664a06ad0db58ea92142f0e97cb89e", "title": "Weakly Supervised Disentanglement with Guarantees", "abstract": "Learning disentangled representations that correspond to factors of variation in real-world data is critical to interpretable and human-controllable machine learning. Recently, concerns about the viability of learning disentangled representations in a purely unsupervised manner has spurred a shift toward the incorporation of weak supervision. However, there is currently no formalism that identifies when and how weak supervision will guarantee disentanglement. To address this issue, we provide a theoretical framework to assist in analyzing the disentanglement guarantees (or lack thereof) conferred by weak supervision when coupled with learning algorithms based on distribution matching. We empirically verify the guarantees and limitations of several weak supervision methods (restricted labeling, match-pairing, and rank-pairing), demonstrating the predictive power and usefulness of our theoretical framework.", "year": 2019, "referenceCount": 37, "citationCount": 82, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1978777", "name": "Rui Shu"}, {"authorId": "2145262885", "name": "Yining Chen"}, {"authorId": "50333123", "name": "Abhishek Kumar"}, {"authorId": "2490652", "name": "S. Ermon"}, {"authorId": "16443937", "name": "Ben Poole"}]}, {"paperId": "945e79a95288ed4f711e2b519ce875d905ba0083", "url": "https://www.semanticscholar.org/paper/945e79a95288ed4f711e2b519ce875d905ba0083", "title": "Machine learning and systems genomics approaches for multi-omics data", "abstract": null, "year": 2017, "referenceCount": 82, "citationCount": 117, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "2256941", "name": "E. Lin"}, {"authorId": "32129782", "name": "H. Lane"}]}, {"paperId": "7dee074784445dcc6a5f8df752753c5dec0ae37f", "url": "https://www.semanticscholar.org/paper/7dee074784445dcc6a5f8df752753c5dec0ae37f", "title": "Learning at the Knowledge Level", "abstract": null, "year": 1986, "referenceCount": 84, "citationCount": 32, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144299726", "name": "Thomas G. Dietterich"}]}, {"paperId": "9b92f0febb2d7cc6beda32b8ab2401ce3a36a672", "url": "https://www.semanticscholar.org/paper/9b92f0febb2d7cc6beda32b8ab2401ce3a36a672", "title": "Knowledge Acquisition and Machine Learning: Theory, Methods, and Applications", "abstract": "The Knowledge Acquisition Framework. The Knowledge Representation Environment. The Inference Im-2. The Sort Taxonomy. The Predicate Structure. Model-Driven Rule Discovery. Knowledge Revision. Concept Formation. Practical Experiences. Bibliography. Author Index. Name Index. Subject Index.", "year": 1993, "referenceCount": 0, "citationCount": 145, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1752599", "name": "K. Morik"}, {"authorId": "145057418", "name": "S. Wrobel"}, {"authorId": "2563970", "name": "J. Kietz"}, {"authorId": "2651875", "name": "W. Emde"}]}, {"paperId": "f50dfcc143bc1cc8ded1d88d31a59140b0a0ebd8", "url": "https://www.semanticscholar.org/paper/f50dfcc143bc1cc8ded1d88d31a59140b0a0ebd8", "title": "Deep Mixtures of Factor Analysers", "abstract": "An efficient way to learn deep density models that have many layers of latent variables is to learn one layer at a time using a model that has only one layer of latent variables. After learning each layer, samples from the posterior distributions for that layer are used as training data for learning the next layer. This approach is commonly used with Restricted Boltzmann Machines, which are undirected graphical models with a single hidden layer, but it can also be used with Mixtures of Factor Analysers (MFAs) which are directed graphical models. In this paper, we present a greedy layer-wise learning algorithm for Deep Mixtures of Factor Analysers (DMFAs). Even though a DMFA can be converted to an equivalent shallow MFA by multiplying together the factor loading matrices at different levels, learning and inference are much more efficient in a DMFA and the sharing of each lower-level factor loading matrix by many different higher level MFAs prevents overfitting. We demonstrate empirically that DMFAs learn better density models than both MFAs and two types of Restricted Boltzmann Machine on a wide variety of datasets.", "year": 2012, "referenceCount": 15, "citationCount": 66, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "34312504", "name": "Yichuan Tang"}, {"authorId": "145124475", "name": "R. Salakhutdinov"}, {"authorId": "1695689", "name": "Geoffrey E. Hinton"}]}, {"paperId": "c7ba786c84c9c5161604e021551a23f098028eba", "url": "https://www.semanticscholar.org/paper/c7ba786c84c9c5161604e021551a23f098028eba", "title": "EBImage—an R package for image processing with applications to cellular phenotypes", "abstract": "Summary: EBImage provides general purpose functionality for reading, writing, processing and analysis of images. Furthermore, in the context of microscopy-based cellular assays, EBImage offers tools to segment cells and extract quantitative cellular descriptors. This allows the automation of such tasks using the R programming language and use of existing tools in the R environment for signal processing, statistical modeling, machine learning and data visualization. Availability: EBImage is free and open source, released under the LGPL license and available from the Bioconductor project (http://www.bioconductor.org/packages/release/bioc/html/EBImage.html). Contact: gregoire.pau@ebi.ac.uk", "year": 2010, "referenceCount": 8, "citationCount": 527, "influentialCitationCount": 31, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "47965474", "name": "Grégoire Pau"}, {"authorId": "49349098", "name": "Florian Fuchs"}, {"authorId": "46655534", "name": "O. Sklyar"}, {"authorId": "144016011", "name": "M. Boutros"}, {"authorId": "144493753", "name": "W. Huber"}]}, {"paperId": "7f61b4446ec2fe12eaf6613d9425c0451c1f95db", "url": "https://www.semanticscholar.org/paper/7f61b4446ec2fe12eaf6613d9425c0451c1f95db", "title": "Simultaneous Prediction of Mulriple Chemical Parameters of River Water Quality with TILDE", "abstract": null, "year": 1999, "referenceCount": 25, "citationCount": 82, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1755851", "name": "H. Blockeel"}, {"authorId": "1693549", "name": "S. Džeroski"}, {"authorId": "2011219", "name": "J. Grbovic"}]}, {"paperId": "55ae79ca10937e3921003b4f1172467ae0be9065", "url": "https://www.semanticscholar.org/paper/55ae79ca10937e3921003b4f1172467ae0be9065", "title": "Very Deep Convolutional Neural Networks for Complex Land Cover Mapping Using Multispectral Remote Sensing Imagery", "abstract": "Despite recent advances of deep Convolutional Neural Networks (CNNs) in various computer vision tasks, their potential for classification of multispectral remote sensing images has not been thoroughly explored. In particular, the applications of deep CNNs using optical remote sensing data have focused on the classification of very high-resolution aerial and satellite data, owing to the similarity of these data to the large datasets in computer vision. Accordingly, this study presents a detailed investigation of state-of-the-art deep learning tools for classification of complex wetland classes using multispectral RapidEye optical imagery. Specifically, we examine the capacity of seven well-known deep convnets, namely DenseNet121, InceptionV3, VGG16, VGG19, Xception, ResNet50, and InceptionResNetV2, for wetland mapping in Canada. In addition, the classification results obtained from deep CNNs are compared with those based on conventional machine learning tools, including Random Forest and Support Vector Machine, to further evaluate the efficiency of the former to classify wetlands. The results illustrate that the full-training of convnets using five spectral bands outperforms the other strategies for all convnets. InceptionResNetV2, ResNet50, and Xception are distinguished as the top three convnets, providing state-of-the-art classification accuracies of 96.17%, 94.81%, and 93.57%, respectively. The classification accuracies obtained using Support Vector Machine (SVM) and Random Forest (RF) are 74.89% and 76.08%, respectively, considerably inferior relative to CNNs. Importantly, InceptionResNetV2 is consistently found to be superior compared to all other convnets, suggesting the integration of Inception and ResNet modules is an efficient architecture for classifying complex remote sensing scenes such as wetlands.", "year": 2018, "referenceCount": 50, "citationCount": 248, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Geology"], "authors": [{"authorId": "1961067", "name": "M. Mahdianpari"}, {"authorId": "35204649", "name": "B. Salehi"}, {"authorId": "143745699", "name": "M. Rezaee"}, {"authorId": "31244965", "name": "F. Mohammadimanesh"}, {"authorId": "2122995911", "name": "Yun Zhang"}]}, {"paperId": "f3d78e1c503bb8ac8e0ff50d26d4c89aa3691b98", "url": "https://www.semanticscholar.org/paper/f3d78e1c503bb8ac8e0ff50d26d4c89aa3691b98", "title": "Data Poisoning Attacks on Federated Machine Learning", "abstract": "Federated machine learning which enables resource-constrained node devices (e.g., Internet of Things (IoT) devices and smartphones) to establish a knowledge-shared model while keeping the raw data local, could provide privacy preservation, and economic benefit by designing an effective communication protocol. However, this communication protocol can be adopted by attackers to launch data poisoning attacks for different nodes, which has been shown as a big threat to most machine learning models. Therefore, we in this article intend to study the model vulnerability of federated machine learning, and even on IoT systems. To be specific, we here attempt to attacking a popular federated multitask learning framework, which uses a general multitask learning framework to handle statistical challenges in the federated learning setting. The problem of calculating optimal poisoning attacks on federated multitask learning is formulated as a bilevel program, which is adaptive to the arbitrary selection of target nodes and source attacking nodes. We then propose a novel systems-aware optimization method, called as attack on federated learning (AT2FL), to efficiently derive the implicit gradients for poisoned data, and further attain optimal attack strategies in the federated machine learning. This is an earlier work, to our knowledge, that explores attacking federated machine learning via data poisoning. Finally, experiments on several real-world data sets demonstrate that when the attackers directly poison the target nodes or indirectly poison the related nodes via using the communication protocol, the federated multitask learning model is sensitive to both poisoning attacks.", "year": 2020, "referenceCount": 21, "citationCount": 46, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "7332901", "name": "Gan Sun"}, {"authorId": "145702758", "name": "Yang Cong"}, {"authorId": "46436215", "name": "Jiahua Dong"}, {"authorId": "2153018830", "name": "Qiang Wang"}, {"authorId": "40478933", "name": "Ji Liu"}]}, {"paperId": "c3aecf64262314649008555b577a8e4b07d8046d", "url": "https://www.semanticscholar.org/paper/c3aecf64262314649008555b577a8e4b07d8046d", "title": "Machine learning and statistics: the interface", "abstract": "Statistical Properties of Tree-Based Approaches to Classification The Decision Tree Algorithm CAL5 Based on a Statistical Approach to its Splitting Algorithm Probabilistic Symbolic Classifiers: An Empirical Comparison from a Statistical Perspective A Multistrategy Approach to Learning Multiple Dependent Concepts Quality of Decision Rules - Definition and Classification Schemes for Multiple Rules DIPOL - A Hybrid Piecewise Linear Classifier Combining Classification Procedures Distance-based Decision Trees Learning Fuzzy Controllers from Examples Some Developments in Statistical Credit Scoring Combination of Statistical and Other Learning Methods to Predict Financial Time Series.", "year": 1996, "referenceCount": 0, "citationCount": 77, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2444638", "name": "G. Nakhaeizadeh"}, {"authorId": "7248918", "name": "C. Taylor"}]}, {"paperId": "62312d957c63d85e9ba446bdbfa4143e8fbd13d3", "url": "https://www.semanticscholar.org/paper/62312d957c63d85e9ba446bdbfa4143e8fbd13d3", "title": "Simple and Scalable Response Prediction for Display Advertising", "abstract": "Clickthrough and conversation rates estimation are two core predictions tasks in display advertising. We present in this article a machine learning framework based on logistic regression that is specifically designed to tackle the specifics of display advertising. The resulting system has the following characteristics: It is easy to implement and deploy, it is highly scalable (we have trained it on terabytes of data), and it provides models with state-of-the-art accuracy.", "year": 2014, "referenceCount": 76, "citationCount": 301, "influentialCitationCount": 27, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1730609", "name": "O. Chapelle"}, {"authorId": "2690730", "name": "Eren Manavoglu"}, {"authorId": "144956884", "name": "Rómer Rosales"}]}, {"paperId": "33c3f816bde8ee63ee9f2e60d4387b9390696371", "url": "https://www.semanticscholar.org/paper/33c3f816bde8ee63ee9f2e60d4387b9390696371", "title": "Beyond Inferring Class Representatives: User-Level Privacy Leakage From Federated Learning", "abstract": "Federated learning, i.e., a mobile edge computing framework for deep learning, is a recent advance in privacy-preserving machine learning, where the model is trained in a decentralized manner by the clients, i.e., data curators, preventing the server from directly accessing those private data from the clients. This learning mechanism significantly challenges the attack from the server side. Although the state-of-the-art attacking techniques that incorporated the advance of Generative adversarial networks (GANs) could construct class representatives of the global data distribution among all clients, it is still challenging to distinguishably attack a specific client (i.e., user-level privacy leakage), which is a stronger privacy threat to precisely recover the private data from a specific client. This paper gives the first attempt to explore user-level privacy leakage against the federated learning by the attack from a malicious server. We propose a framework incorporating GAN with a multi-task discriminator, which simultaneously discriminates category, reality, and client identity of input samples. The novel discrimination on client identity enables the generator to recover user specified private data. Unlike existing works that tend to interfere the training process of the federated learning, the proposed method works “invisibly” on the server side. The experimental results demonstrate the effectiveness of the proposed attacking approach and the superior to the state-of-the-art.", "year": 2018, "referenceCount": 28, "citationCount": 363, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3623271", "name": "Zhibo Wang"}, {"authorId": "51114861", "name": "Mengkai Song"}, {"authorId": "1786391", "name": "Zhifei Zhang"}, {"authorId": "144404428", "name": "Yang Song"}, {"authorId": "2183687338", "name": "Qian Wang"}, {"authorId": "1698645", "name": "H. Qi"}]}, {"paperId": "dff87a341b365d654edd640ae1f962b0b7736cd2", "url": "https://www.semanticscholar.org/paper/dff87a341b365d654edd640ae1f962b0b7736cd2", "title": "Design of the 2015 ChaLearn AutoML challenge", "abstract": "ChaLearn is organizing the Automatic Machine Learning (AutoML) contest for IJCNN 2015, which challenges participants to solve classification and regression problems without any human intervention. Participants' code is automatically run on the contest servers to train and test learning machines. However, there is no obligation to submit code; half of the prizes can be won by submitting prediction results only. Datasets of progressively increasing difficulty are introduced throughout the six rounds of the challenge. (Participants can enter the competition in any round.) The rounds alternate phases in which learners are tested on datasets participants have not seen, and phases in which participants have limited time to tweak their algorithms on those datasets to improve performance. This challenge will push the state of the art in fully automatic machine learning on a wide range of real-world problems. The platform will remain available beyond the termination of the challenge.", "year": 2015, "referenceCount": 74, "citationCount": 97, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1743797", "name": "I. Guyon"}, {"authorId": "2065549778", "name": "Kristin P. Bennett"}, {"authorId": "8974886", "name": "G. Cawley"}, {"authorId": "1742688", "name": "H. Escalante"}, {"authorId": "7855312", "name": "Sergio Escalera"}, {"authorId": "1795578", "name": "T. Ho"}, {"authorId": "2179558", "name": "Núria Macià"}, {"authorId": "1723198", "name": "Bisakha Ray"}, {"authorId": "144102090", "name": "M. Saeed"}, {"authorId": "1702228", "name": "A. Statnikov"}, {"authorId": "2832706", "name": "E. Viegas"}]}, {"paperId": "edbc873a248768a626ef2bc57b3d1eff30de0e11", "url": "https://www.semanticscholar.org/paper/edbc873a248768a626ef2bc57b3d1eff30de0e11", "title": "Learning Graphical State Transitions", "abstract": "Graph-structured data is important in modeling relationships between multiple entities, and can be used to represent states of the world as well as many data structures. Li et al. (2016) describe a model known as a Gated Graph Sequence Neural Network (GGS-NN) that produces sequences from graph-structured input. In this work I introduce the Gated Graph Transformer Neural Network (GGTNN), an extension of GGS-NNs that uses graph-structured data as an intermediate representation. The model can learn to construct and modify graphs in sophisticated ways based on textual input, and also to use the graphs to produce a variety of outputs. For example, the model successfully learns to solve almost all of the bAbI tasks (Weston et al., 2016), and also discovers the rules governing graphical formulations of a simple cellular automaton and a family of Turing machines.", "year": 2016, "referenceCount": 23, "citationCount": 87, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2150444707", "name": "Daniel D. Johnson"}]}, {"paperId": "8454aef70de13fc8d75d2f6a8fd31f4d53886dab", "url": "https://www.semanticscholar.org/paper/8454aef70de13fc8d75d2f6a8fd31f4d53886dab", "title": "How accurately can sitting and the intensity of walking and cycling be classified using an accelerometer on the waist for the purpose of the “Global recommendations on physical activity for health”?", "abstract": "The society has become more sedentary and has developed a lack of physical activity, therefore increasing health risks. Feedback is needed to change these behaviours. For this feedback, first accurate monitoring is needed: sedentary behaviour must be classified as well as the intensity of physical activity. \nIn this report a State of the Art analysis is performed to compare different classification techniques and finally two methods, both using an accelerometer on the waist, are worked out. These methods are Integral of the Modulus of the Accelerometer (IMA) classification and a machine learning technique (MLT): support vector machine (SVM). These methods are then applied in a laboratory experiment to study their quality. A measurement setup is made to create a dataset of the following activities: standing, sitting, lying, walking (2.4 - 7.5 km/h) and cycling (10.1-19 km/h). This dataset (n=15) is analysed and classified using Matlab for both methods. \nThe IMA method was unable to monitor sedentary behaviour, but could classify the physical activity (PA) intensity with an accuracy of 66%. The SVM method within subjects was able to monitor sedentary behaviour with an accuracy of 91±20% and the classification of the PA intensity has an accuracy of 94±5%. For between subjects the accuracies decrease to 71±13% for PA intensity accuracy and 45±35% for the sedentary behaviour classification. \nIMA was implemented in the old feedback system, monitoring the overall daily amount of physical activity, but can significantly be outperformed by replacing it with the current SVM implementation. At this moment however, SVM can only be used to improve the old system, it cannot yet be used to create new additions to the feedback system, such as the implementation of the feedback of the sedentary behaviour and specific physical activity intensities. New methods and properties of the current SVM system have been found that might increase the accuracies of the between subject analysis and therefore might enable SVM to become applicable for the extra feedback options.", "year": 2015, "referenceCount": 12, "citationCount": 2706, "influentialCitationCount": 138, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "1581793152", "name": "D. V. D. Valk"}]}, {"paperId": "320d2c1d484e97f0e97edbcaa706abe5288319cd", "url": "https://www.semanticscholar.org/paper/320d2c1d484e97f0e97edbcaa706abe5288319cd", "title": "Almost optimal estimates for approximation and learning by radial basis function networks", "abstract": null, "year": 2014, "referenceCount": 49, "citationCount": 28, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2432506", "name": "Shaobo Lin"}, {"authorId": "2110880625", "name": "Xia Liu"}, {"authorId": "2266470", "name": "Yuanhua Rong"}, {"authorId": "98220533", "name": "Zongben Xu"}]}, {"paperId": "df137487e20ba7c6e1e2b9a1e749f2a578b5ad99", "url": "https://www.semanticscholar.org/paper/df137487e20ba7c6e1e2b9a1e749f2a578b5ad99", "title": "Scheduled Sampling for Sequence Prediction with Recurrent Neural Networks", "abstract": "Recurrent Neural Networks can be trained to produce sequences of tokens given some input, as exemplified by recent results in machine translation and image captioning. The current approach to training them consists of maximizing the likelihood of each token in the sequence given the current (recurrent) state and the previous token. At inference, the unknown previous token is then replaced by a token generated by the model itself. This discrepancy between training and inference can yield errors that can accumulate quickly along the generated sequence. We propose a curriculum learning strategy to gently change the training process from a fully guided scheme using the true previous token, towards a less guided scheme which mostly uses the generated token instead. Experiments on several sequence prediction tasks show that this approach yields significant improvements. Moreover, it was used succesfully in our winning entry to the MSCOCO image captioning challenge, 2015.", "year": 2015, "referenceCount": 26, "citationCount": 1536, "influentialCitationCount": 174, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1751569", "name": "Samy Bengio"}, {"authorId": "1689108", "name": "Oriol Vinyals"}, {"authorId": "3111912", "name": "N. Jaitly"}, {"authorId": "1846258", "name": "Noam M. Shazeer"}]}, {"paperId": "f60b025bc86740f60f6fa7b227cf7897426dc776", "url": "https://www.semanticscholar.org/paper/f60b025bc86740f60f6fa7b227cf7897426dc776", "title": "Domain Invariant Transfer Kernel Learning", "abstract": "Domain transfer learning generalizes a learning model across training data and testing data with different distributions. A general principle to tackle this problem is reducing the distribution difference between training data and testing data such that the generalization error can be bounded. Current methods typically model the sample distributions in input feature space, which depends on nonlinear feature mapping to embody the distribution discrepancy. However, this nonlinear feature space may not be optimal for the kernel-based learning machines. To this end, we propose a transfer kernel learning (TKL) approach to learn a domain-invariant kernel by directly matching source and target distributions in the reproducing kernel Hilbert space (RKHS). Specifically, we design a family of spectral kernels by extrapolating target eigensystem on source samples with Mercer's theorem. The spectral kernel minimizing the approximation error to the ground truth kernel is selected to construct domain-invariant kernel machines. Comprehensive experimental evidence on a large number of text categorization, image classification, and video event recognition datasets verifies the effectiveness and efficiency of the proposed TKL approach over several state-of-the-art methods.", "year": 2015, "referenceCount": 49, "citationCount": 166, "influentialCitationCount": 29, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35776445", "name": "Mingsheng Long"}, {"authorId": "2144499343", "name": "Jianmin Wang"}, {"authorId": "2109517420", "name": "Jiaguang Sun"}, {"authorId": "144019071", "name": "Philip S. Yu"}]}, {"paperId": "d9665992ee36699b8ae4a2e2294552cd4be9003a", "url": "https://www.semanticscholar.org/paper/d9665992ee36699b8ae4a2e2294552cd4be9003a", "title": "Statistical fraud detection: A review", "abstract": "Fraud is increasing dramatically with the expansion of modem technology and the global superhighways of communication, resulting in the loss of billions of dollars worldwide each year. Although prevention technologies are the best way to reduce fraud, fraudsters are adaptive and, given time, will usually find ways to circumvent such measures. Methodologies for the detection of fraud are essential if we are to catch fraudsters once fraud prevention has failed. Statistics and machine learning provide effective technologies for fraud detection and have been applied successfully to detect activities such as money laundering, e-commerce credit card fraud, telecommunications fraud and computer intrusion, to name but a few. We describe the tools available for statistical fraud detection and the areas in which fraud detection technologies are most used.", "year": 2002, "referenceCount": 126, "citationCount": 1193, "influentialCitationCount": 60, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Engineering"], "authors": [{"authorId": "3002426", "name": "R. J. Bolton"}, {"authorId": "1781982", "name": "D. Hand"}]}, {"paperId": "35c70cb330fe44dffe926289fb467962b1f64b0e", "url": "https://www.semanticscholar.org/paper/35c70cb330fe44dffe926289fb467962b1f64b0e", "title": "OTL: A Framework of Online Transfer Learning", "abstract": "In this paper, we investigate a new machine learning framework called Online Transfer Learning (OTL) that aims to transfer knowledge from some source domain to an online learning task on a target domain. We do not assume the target data follows the same class or generative distribution as the source data, and our key motivation is to improve a supervised online learning task in a target domain by exploiting the knowledge that had been learned from large amount of training data in source domains. OTL is in general challenging since data in both domains not only can be different in their class distributions but can be also different in their feature representations. As a first attempt to this problem, we propose techniques to address two kinds of OTL tasks: one is to perform OTL in a homogeneous domain, and the other is to perform OTL across heterogeneous domains. We show the mistake bounds of the proposed OTL algorithms, and empirically examine their performance on several challenging OTL tasks. Encouraging results validate the efficacy of our techniques.", "year": 2010, "referenceCount": 14, "citationCount": 111, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144259957", "name": "P. Zhao"}, {"authorId": "1741126", "name": "S. Hoi"}]}, {"paperId": "c1075602e28f5b61ec0320a64937398f23e3fc70", "url": "https://www.semanticscholar.org/paper/c1075602e28f5b61ec0320a64937398f23e3fc70", "title": "Predicting cloud resource provisioning using machine learning techniques", "abstract": "In order to meet Service Level Agreement (SLA) requirements, Virtual Machine (VM) resources must be provisioned few minutes ahead due to the VM boot-up time. One way to do this is by predicting future resource demands. In this research, we have developed and evaluated cloud client prediction models for TPCW benchmark web application using three machine learning techniques: Support Vector Machine (SVM), Neural Networks (NN) and Linear Regression (LR). We included the SLA metrics for Response Time and Throughput to the prediction model with the aim of providing the client with a more robust scaling decision choice. Our results show that Support Vector Machine provides the best prediction model.", "year": 2013, "referenceCount": 24, "citationCount": 68, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31495507", "name": "A. A. Bankole"}, {"authorId": "145428138", "name": "S. Ajila"}]}, {"paperId": "60a67687d892d39c6aeac3ca3e2758fb947c0791", "url": "https://www.semanticscholar.org/paper/60a67687d892d39c6aeac3ca3e2758fb947c0791", "title": "Genetic algorithms in controller design and tuning", "abstract": "A three-phased framework for learning dynamic system control is presented. A genetic algorithm is employed to derive control rules encoded as decision tables. Next, the rules are automatically transformed into comprehensible form by means of inductive machine learning. Finally, a genetic algorithm is applied again to optimize the numerical parameters of the induced rules. The approach is experimentally verified on a benchmark problem of inverted pendulum control, with special emphasis on robustness and reliability. It is also shown that the proposed framework enables exploiting available domain knowledge. In this case, genetic algorithm makes qualitative control rules operational by providing interpretation of symbols in terms of numerical values. >", "year": 1993, "referenceCount": 10, "citationCount": 239, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1931927", "name": "A. Varsek"}, {"authorId": "2654837", "name": "T. Urbancic"}, {"authorId": "1691028", "name": "B. Filipič"}]}, {"paperId": "6b67847dbd87a80ac23a06767357f43bd19086a0", "url": "https://www.semanticscholar.org/paper/6b67847dbd87a80ac23a06767357f43bd19086a0", "title": "Learning low-rank kernel matrices", "abstract": "Kernel learning plays an important role in many machine learning tasks. However, algorithms for learning a kernel matrix often scale poorly, with running times that are cubic in the number of data points. In this paper, we propose efficient algorithms for learning low-rank kernel matrices; our algorithms scale linearly in the number of data points and quadratically in the rank of the kernel. We introduce and employ Bregman matrix divergences for rank-deficient matrices---these divergences are natural for our problem since they preserve the rank as well as positive semi-definiteness of the kernel matrix. Special cases of our framework yield faster algorithms for various existing kernel learning problems. Experimental results demonstrate the effectiveness of our algorithms in learning both low-rank and full-rank kernels.", "year": 2006, "referenceCount": 14, "citationCount": 185, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1692670", "name": "B. Kulis"}, {"authorId": "2190189", "name": "Mátyás A. Sustik"}, {"authorId": "1783667", "name": "I. Dhillon"}]}, {"paperId": "39e2e0ca2a3c1116fa26568eb58ef344ce4e042e", "url": "https://www.semanticscholar.org/paper/39e2e0ca2a3c1116fa26568eb58ef344ce4e042e", "title": "An introduction to artificial neural networks in bioinformatics - application to complex microarray and mass spectrometry datasets in cancer studies", "abstract": "Applications of genomic and proteomic technologies have seen a major increase, resulting in an explosion in the amount of highly dimensional and complex data being generated. Subsequently this has increased the effort by the bioinformatics community to develop novel computational approaches that allow for meaningful information to be extracted. This information must be of biological relevance and thus correlate to disease phenotypes of interest. Artificial neural networks are a form of machine learning from the field of artificial intelligence with proven pattern recognition capabilities and have been utilized in many areas of bioinformatics. This is due to their ability to cope with highly dimensional complex datasets such as those developed by protein mass spectrometry and DNA microarray experiments. As such, neural networks have been applied to problems such as disease classification and identification of biomarkers. This review introduces and describes the concepts related to neural networks, the advantages and caveats to their use, examples of their applications in mass spectrometry and microarray research (with a particular focus on cancer studies), and illustrations from recent literature showing where neural networks have performed well in comparison to other machine learning methods. This should form the necessary background knowledge and information enabling researchers with an interest in these methodologies, but not necessarily from a machine learning background, to apply the concepts to their own datasets, thus maximizing the information gain from these complex biological systems.", "year": 2008, "referenceCount": 115, "citationCount": 162, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Biology", "Medicine"], "authors": [{"authorId": "2873684", "name": "L. Lancashire"}, {"authorId": "3331820", "name": "C. Lemetre"}, {"authorId": "144313587", "name": "G. Ball"}]}, {"paperId": "da8a949f9c9f1df3a38f12c2cac97b789c705465", "url": "https://www.semanticscholar.org/paper/da8a949f9c9f1df3a38f12c2cac97b789c705465", "title": "A Survey of Machine and Deep Learning Methods for Internet of Things (IoT) Security", "abstract": "The Internet of Things (IoT) integrates billions of smart devices that can communicate with one another with minimal human intervention. IoT is one of the fastest developing fields in the history of computing, with an estimated 50 billion devices by the end of 2020. However, the crosscutting nature of IoT systems and the multidisciplinary components involved in the deployment of such systems have introduced new security challenges. Implementing security measures, such as encryption, authentication, access control, network and application security for IoT devices and their inherent vulnerabilities is ineffective. Therefore, existing security methods should be enhanced to effectively secure the IoT ecosystem. Machine learning and deep learning (ML/DL) have advanced considerably over the last few years, and machine intelligence has transitioned from laboratory novelty to practical machinery in several important applications. Consequently, ML/DL methods are important in transforming the security of IoT systems from merely facilitating secure communication between devices to security-based intelligence systems. The goal of this work is to provide a comprehensive survey of ML methods and recent advances in DL methods that can be used to develop enhanced security methods for IoT systems. IoT security threats that are related to inherent or newly introduced threats are presented, and various potential IoT system attack surfaces and the possible threats related to each surface are discussed. We then thoroughly review ML/DL methods for IoT security and present the opportunities, advantages and shortcomings of each method. We discuss the opportunities and challenges involved in applying ML/DL to IoT security. These opportunities and challenges can serve as potential future research directions.", "year": 2018, "referenceCount": 303, "citationCount": 366, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1403206186", "name": "M. Al-garadi"}, {"authorId": "143634114", "name": "Amr M. Mohamed"}, {"authorId": "1403346505", "name": "A. Al-Ali"}, {"authorId": "144335971", "name": "Xiaojiang Du"}, {"authorId": "2096342291", "name": "Ihsan Ali"}, {"authorId": "145837053", "name": "M. Guizani"}]}, {"paperId": "be813b90620b2627226864eaf5e0f3eec9d50e85", "url": "https://www.semanticscholar.org/paper/be813b90620b2627226864eaf5e0f3eec9d50e85", "title": "A Review and Tutorial of Machine Learning Methods for Microbiome Host Trait Prediction", "abstract": "With the growing importance of microbiome research, there is increasing evidence that host variation in microbial communities is associated with overall host health. Advancement in genetic sequencing methods for microbiomes has coincided with improvements in machine learning, with important implications for disease risk prediction in humans. One aspect specific to microbiome prediction is the use of taxonomy-informed feature selection. In this review for non-experts, we explore the most commonly used machine learning methods, and evaluate their prediction accuracy as applied to microbiome host trait prediction. Methods are described at an introductory level, and R/Python code for the analyses is provided.", "year": 2019, "referenceCount": 77, "citationCount": 92, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "34661060", "name": "Yi‐Hui Zhou"}, {"authorId": "5822509", "name": "P. Gallins"}]}, {"paperId": "dbea1bba0dd798bfc8463480083b8fc3d2eab3ad", "url": "https://www.semanticscholar.org/paper/dbea1bba0dd798bfc8463480083b8fc3d2eab3ad", "title": "Realistic Atomistic Structure of Amorphous Silicon from Machine-Learning-Driven Molecular Dynamics.", "abstract": "Amorphous silicon ( a-Si) is a widely studied noncrystalline material, and yet the subtle details of its atomistic structure are still unclear. Here, we show that accurate structural models of a-Si can be obtained using a machine-learning-based interatomic potential. Our best a-Si network is obtained by simulated cooling from the melt at a rate of 1011 K/s (that is, on the 10 ns time scale), contains less than 2% defects, and agrees with experiments regarding excess energies, diffraction data, and 29Si NMR chemical shifts. We show that this level of quality is impossible to achieve with faster quench simulations. We then generate a 4096-atom system that correctly reproduces the magnitude of the first sharp diffraction peak (FSDP) in the structure factor, achieving the closest agreement with experiments to date. Our study demonstrates the broader impact of machine-learning potentials for elucidating structures and properties of technologically important amorphous materials.", "year": 2018, "referenceCount": 67, "citationCount": 139, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine", "Materials Science"], "authors": [{"authorId": "2432235", "name": "Volker L. Deringer"}, {"authorId": "2105796", "name": "N. Bernstein"}, {"authorId": "3938091", "name": "A. Bartók"}, {"authorId": "2323690", "name": "M. Cliffe"}, {"authorId": "1875111", "name": "R. Kerber"}, {"authorId": "11666716", "name": "L. Marbella"}, {"authorId": "2470773", "name": "C. Grey"}, {"authorId": "2169428271", "name": "S. Elliott"}, {"authorId": "2559761", "name": "Gábor Csányi"}]}, {"paperId": "c4f0fb51c63cd9652815d20ddfbd65dcda01e8b6", "url": "https://www.semanticscholar.org/paper/c4f0fb51c63cd9652815d20ddfbd65dcda01e8b6", "title": "Active Learning for Probability Estimation Using Jensen-Shannon Divergence", "abstract": null, "year": 2005, "referenceCount": 20, "citationCount": 70, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2780489", "name": "Prem Melville"}, {"authorId": "2835725", "name": "Stewart M. Yang"}, {"authorId": "1388405043", "name": "M. Saar-Tsechansky"}, {"authorId": "1797655", "name": "R. Mooney"}]}, {"paperId": "93d53bd1c7e8f887d85be2c83a0f5f8c061b4c2f", "url": "https://www.semanticscholar.org/paper/93d53bd1c7e8f887d85be2c83a0f5f8c061b4c2f", "title": "Semi-Supervised Learning Using Semi-Definite Programming", "abstract": "We discuss the problem of support vector machine (SVM) transduction, which is a combinatorial problem with exponential computational complexity in the number of unlabeled samples. Different approaches to such combinatorial problems exist, among which are exact integer programming approaches (only feasible for very small sample sizes, e.g. [1]) and local search heuristics starting from a suitably chosen start value such as the approach explained in Chapter 5, Transductive Support Vector Machines , and introduced in [2] (scalable to large problem sizes, but sensitive to local optima). In this chapter, we discuss an alternative approach introduced in [3], which is based on a convex relaxation of the optimization problem associated to support vector machine transduction. The result is a semi-definite programming (SDP) problem which can be optimized in polynomial time, the solution of which is an approximation of the optimal labeling as well as a bound on the true optimum of the original transduction objective function. To further decrease the computational complexity, we propose an approximation that allows to solve transduction problems of up to 1000 unlabeled samples. Lastly, we extend the formulation to more general settings of semi-supervised learning, where equivalence and inequivalence constraints are given on labels of some of the samples.", "year": 2006, "referenceCount": 9, "citationCount": 55, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "51204489", "name": "T. D. Bie"}, {"authorId": "1685083", "name": "N. Cristianini"}]}, {"paperId": "14014c024674991149f3ecf9314c93f7e029ef1a", "url": "https://www.semanticscholar.org/paper/14014c024674991149f3ecf9314c93f7e029ef1a", "title": "Geometric Deep Learning: Grids, Groups, Graphs, Geodesics, and Gauges", "abstract": "The last decade has witnessed an experimental revolution in data science and machine learning, epitomised by deep learning methods. Indeed, many high-dimensional learning tasks previously thought to be beyond reach -- such as computer vision, playing Go, or protein folding -- are in fact feasible with appropriate computational scale. Remarkably, the essence of deep learning is built from two simple algorithmic principles: first, the notion of representation or feature learning, whereby adapted, often hierarchical, features capture the appropriate notion of regularity for each task, and second, learning by local gradient-descent type methods, typically implemented as backpropagation. While learning generic functions in high dimensions is a cursed estimation problem, most tasks of interest are not generic, and come with essential pre-defined regularities arising from the underlying low-dimensionality and structure of the physical world. This text is concerned with exposing these regularities through unified geometric principles that can be applied throughout a wide spectrum of applications. Such a 'geometric unification' endeavour, in the spirit of Felix Klein's Erlangen Program, serves a dual purpose: on one hand, it provides a common mathematical framework to study the most successful neural network architectures, such as CNNs, RNNs, GNNs, and Transformers. On the other hand, it gives a constructive procedure to incorporate prior physical knowledge into neural architectures and provide principled way to build future architectures yet to be invented.", "year": 2021, "referenceCount": 0, "citationCount": 318, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1732570", "name": "M. Bronstein"}, {"authorId": "143627859", "name": "Joan Bruna"}, {"authorId": "2056266", "name": "Taco Cohen"}, {"authorId": "1742197495", "name": "Petar Velivckovi'c"}]}, {"paperId": "0186028b4aaf265d8590dcb0890f900ee4095b0a", "url": "https://www.semanticscholar.org/paper/0186028b4aaf265d8590dcb0890f900ee4095b0a", "title": "A Granular Computing Approach to Machine Learning", "abstract": "The key to granular computing is to make use of granules in problem solving. Classification is one of the well studied problems in machine learning and data mining as it involves of discovery knowledge from large databases. We presents a granular computing view to classification problems and propose a granular computing approach to classification in this paper. The ID3 [8] and PRISM [2] algorithma are studied and extended to granular computing algorithm.", "year": 2002, "referenceCount": 23, "citationCount": 67, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3251154", "name": "Jingtao Yao"}, {"authorId": "1698696", "name": "Yiyu Yao"}]}, {"paperId": "994ddbea26882f70131ca01cc1bd474dabf0ace3", "url": "https://www.semanticscholar.org/paper/994ddbea26882f70131ca01cc1bd474dabf0ace3", "title": "Learning based digital matting", "abstract": "We cast some new insights into solving the digital matting problem by treating it as a semi-supervised learning task in machine learning. A local learning based approach and a global learning based approach are then produced, to fit better the scribble based matting and the trimap based matting, respectively. Our approaches are easy to implement because only some simple matrix operations are needed. They are also extremely accurate because they can efficiently handle the nonlinear local color distributions by incorporating the kernel trick, that are beyond the ability of many previous works. Our approaches can outperform many recent matting methods, as shown by the theoretical analysis and comprehensive experiments. The new insights may also inspire several more works.", "year": 2009, "referenceCount": 23, "citationCount": 183, "influentialCitationCount": 36, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1746086", "name": "Yuanjie Zheng"}, {"authorId": "1708413", "name": "C. Kambhamettu"}]}, {"paperId": "8fcf38e6a758a32140a74cffce0a8044dc81ac23", "url": "https://www.semanticscholar.org/paper/8fcf38e6a758a32140a74cffce0a8044dc81ac23", "title": "Regularized Machine Learning in the Genetic Prediction of Complex Traits", "abstract": "Supervised machine learning aims at constructing a genotype–phenotype model by learning such genetic patterns from a labeled set of training examples that will also provide accurate phenotypic predictions in new cases with similar genetic background. Such predictive models are increasingly being applied to the mining of panels of genetic variants, environmental, or other nongenetic factors in the prediction of various complex traits and disease phenotypes [1]–[8]. These studies are providing increasing evidence in support of the idea that machine learning provides a complementary view into the analysis of high-dimensional genetic datasets as compared to standard statistical association testing approaches. In contrast to identifying variants explaining most of the phenotypic variation at the population level, supervised machine learning models aim to maximize the predictive (or generalization) power at the level of individuals, hence providing exciting opportunities for e.g., individualized risk prediction based on personal genetic profiles [9]–[11]. Machine learning models can also deal with genetic interactions, which are known to play an important role in the development and treatment of many complex diseases [12]–[16], but are often missed by single-locus association tests [17]. Even in the absence of significant single-loci marginal effects, multilocus panels from distinct molecular pathways may provide synergistic contribution to the prediction power, thereby revealing part of such hidden heritability component that has remained missing because of too small marginal effects to pass the stringent genome-wide significance filters [18]. Multivariate modeling approaches have already been shown to provide improved insights into genetic mechanisms and the interaction networks behind many complex traits, including atherosclerosis, coronary heart disease, and lipid levels, which would have gone undetected using the standard univariate modeling [2], [19]–[22]. However, machine learning models also come with inherent pitfalls, such as increased computational complexity and the risk for model overfitting, which must be understood in order to avoid reporting unrealistic prediction models or over-optimistic prediction results. \n \nWe argue here that many medical applications of machine learning models in genetic disease risk prediction rely essentially on two factors: effective model regularization and rigorous model validation. We demonstrate the effects of these factors using representative examples from the literature as well as illustrative case examples. This review is not meant to be a comprehensive survey of all predictive modeling approaches, but we focus on regularized machine learning models, which enforces constraints on the complexity of the learned models so that they would ignore irrelevant patterns in the training examples. Simple risk allele counting or other multilocus risk models that do not incorporate any model parameters to be learned are outside the scope of this review; in fact, such simplistic models that assume independent variants may lead to suboptimal prediction performance in the presence of either direct or indirect interactions through epistasis effects or linkage disequilibrium, respectively [23], [24]. Perhaps the simplest models considered here as learning approaches are those based on weighted risk allele summaries [23], [25]. However, even with such basic risk models intended for predictive purposes, it is important to learn the model parameters (e.g., select the variants and determine their weights) based on training data only; otherwise there is a severe risk of model overfitting, i.e., models not being capable of generalizing to new samples [5]. Representative examples of how model learning and regularization approaches address the overfitting problem are briefly summarized in Box 1, while those readers interested in their implementation details are referred to the accompanying Text S1. We specifically promote here the use of such regularized machine learning models that are scalable to the entire genome-wide scale, often based on linear models, which are easy to interpret and also enable straightforward variable selection. Genome-scale approaches avoid the need of relying on two-stage approaches [26], which apply standard statistical procedures to reduce the number of variants, since such prefiltering may miss predictive interactions across loci and therefore lead to reduced predictive performance [8], [24], [25], [27], [28]. \n \n \nBox 1. Synthesis of Learning Models for Genetic Risk Prediction \nThe aim of risk models is to capture in a mathematical form the patterns in the genetic and non-genetic data most important for the prediction of disease susceptibility. The first step in model building involves choosing the functional form of the model (e.g., linear or nonlinear), and then making use of a given training data to determine the adjustable parameters of the model (e.g., a subset of variants, their weights, and other model parameters). While it is often sufficient for a statistical model to enable high enough explanatory power in the discovery material, without being overly complicated, a predictive model is also required to generalize to unseen cases. \n \nOne consideration in the model construction is how to encode the genotypic measurements using genotype models, such as the dominant, recessive, multiplicative, or additive model, each implying different assumptions about the genetic effects in the data [79]. Categorical variables 0, 1, and 2 are typically used for treating genetic predictor variables (e.g., minor allele dosage), while numeric values are required for continuous risk factors (e.g., blood pressure). Expected posterior probabilities of the genotypes can also be used, especially for imputed genotypes. Transforming the genotype categories into three binary features is an alternative way to deal with missing values without imputation (used in the T1D example; see Text S1 for details). \n \n \nStatistical or machine learning models identify statistical or predictive interactions, respectively, rather than biological interactions between or within variants [12], [80]. While nonlinear models may better capture complex genetic interactions [7], [81], linear models are easier to interpret and provide a scalable option for performing supervised selection of multilocus variant panels at the genome-wide scale [3]. In linear models, genetic interactions are modeled implicitly by selecting such variant combinations that together are predictive of the phenotype, rather than considering pairwise gene–gene relationships explicitly. Formally, trait yi to be predicted for an individual i is modeled as a linear combination of the individual's predictor variables xij: \n \n \n \n \n(1) \n \n \nHere, the weights wj are assumed constant across the n individuals, w 0 is the bias offset term and p indicates the number of predictors discovered in the training data. In its basic form, Eq. 1 can be used for modeling continuous traits y (linear regression). For case-control classification, the binary dependent variable y is often transformed using a logistic loss function, which models the probability of a case class given a genotype profile and other risk factor covariates x (logistic regression). It has been shown that the logistic regression and naive Bayes risk models are mathematically very closely related in the context of genetic risk prediction [81].", "year": 2014, "referenceCount": 124, "citationCount": 114, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "2013961", "name": "S. Okser"}, {"authorId": "1731090", "name": "T. Pahikkala"}, {"authorId": "1735715", "name": "A. Airola"}, {"authorId": "1680811", "name": "T. Salakoski"}, {"authorId": "2407947", "name": "S. Ripatti"}, {"authorId": "1728404", "name": "T. Aittokallio"}]}, {"paperId": "84c760b4fd083b76495bd98ce7eeef466331b8e1", "url": "https://www.semanticscholar.org/paper/84c760b4fd083b76495bd98ce7eeef466331b8e1", "title": "Recent applications of deep learning and machine intelligence on in silico drug discovery: methods, tools and databases", "abstract": "Abstract The identification of interactions between drugs/compounds and their targets is crucial for the development of new drugs. In vitro screening experiments (i.e. bioassays) are frequently used for this purpose; however, experimental approaches are insufficient to explore novel drug-target interactions, mainly because of feasibility problems, as they are labour intensive, costly and time consuming. A computational field known as ‘virtual screening’ (VS) has emerged in the past decades to aid experimental drug discovery studies by statistically estimating unknown bio-interactions between compounds and biological targets. These methods use the physico-chemical and structural properties of compounds and/or target proteins along with the experimentally verified bio-interaction information to generate predictive models. Lately, sophisticated machine learning techniques are applied in VS to elevate the predictive performance. The objective of this study is to examine and discuss the recent applications of machine learning techniques in VS, including deep learning, which became highly popular after giving rise to epochal developments in the fields of computer vision and natural language processing. The past 3 years have witnessed an unprecedented amount of research studies considering the application of deep learning in biomedicine, including computational drug discovery. In this review, we first describe the main instruments of VS methods, including compound and protein features (i.e. representations and descriptors), frequently used libraries and toolkits for VS, bioactivity databases and gold-standard data sets for system training and benchmarking. We subsequently review recent VS studies with a strong emphasis on deep learning applications. Finally, we discuss the present state of the field, including the current challenges and suggest future directions. We believe that this survey will provide insight to the researchers working in the field of computational drug discovery in terms of comprehending and developing novel bio-prediction methods.", "year": 2018, "referenceCount": 261, "citationCount": 219, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "12373665", "name": "A. Rifaioglu"}, {"authorId": "50646671", "name": "Heval Atas"}, {"authorId": "46502933", "name": "M. Martin"}, {"authorId": "101903368", "name": "R. Cetin-Atalay"}, {"authorId": "1737543", "name": "V. Atalay"}, {"authorId": "2407842", "name": "Tunca Dogan"}]}, {"paperId": "7c6b6b9f39917227f4c445c3e9303e9fc6896604", "url": "https://www.semanticscholar.org/paper/7c6b6b9f39917227f4c445c3e9303e9fc6896604", "title": "Support Vector Machines for predicting protein structural class", "abstract": null, "year": 2001, "referenceCount": 53, "citationCount": 169, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "48693823", "name": "Yu-Dong Cai"}, {"authorId": "2110961849", "name": "Xiao-Jun Liu"}, {"authorId": "2745822", "name": "Xue-biao Xu"}, {"authorId": "66775433", "name": "Guo-Ping Zhou"}]}, {"paperId": "b1c9e25cf2d0400e373bf1c13264ba0e88e5e934", "url": "https://www.semanticscholar.org/paper/b1c9e25cf2d0400e373bf1c13264ba0e88e5e934", "title": "Affective-Cognitive Learning and Decision Making: A Motivational Reward Framework for Affective Agents", "abstract": null, "year": 2005, "referenceCount": 14, "citationCount": 84, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2259303", "name": "Hyung-il Ahn"}, {"authorId": "1719389", "name": "Rosalind W. Picard"}]}, {"paperId": "545ce673b236ec4413a64df42204ab9c79ed6e15", "url": "https://www.semanticscholar.org/paper/545ce673b236ec4413a64df42204ab9c79ed6e15", "title": "Machine Audition: Principles, Algorithms and Systems", "abstract": "Machine audition is the study of algorithms and systems for the automatic analysis and understanding of sound by machine. It has recently attracted increasing interest within several research communities, such as signal processing, machine learning, auditory modeling, perception and cognition, psychology, pattern recognition, and artificial intelligence. However, the developments made so far are fragmented within these disciplines, lacking connections and incurring potentially overlapping research activities in this subject area. Machine Audition: Principles, Algorithms and Systems contains advances in algorithmic developments, theoretical frameworks, and experimental research findings. This book is useful for professionals who want an improved understanding about how to design algorithms for performing automatic analysis of audio signals, construct a computing system for understanding sound, and learn how to build advanced human-computer interactive systems.", "year": 2010, "referenceCount": 311, "citationCount": 169, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2134821831", "name": "Wenwu Wang"}]}, {"paperId": "505bee3f5e750c4affa49023585a513210d35a60", "url": "https://www.semanticscholar.org/paper/505bee3f5e750c4affa49023585a513210d35a60", "title": "Feasibility of Supervised Machine Learning for Cloud Security", "abstract": "Cloud computing is gaining significant attention, however, security is the biggest hurdle in its wide acceptance. Users of cloud services are under constant fear of data loss, security threats and availability issues. Recently, learning-based methods for security applications are gaining popularity in the literature with the advents in machine learning techniques. However, the major challenge in these methods is obtaining real-time and unbiased datasets. Many datasets are internal and cannot be shared due to privacy issues or may lack certain statistical characteristics. As a result of this, researchers prefer to generate datasets for training and testing purpose in the simulated or closed experimental environments which may lack comprehensiveness. Machine learning models trained with such a single dataset generally result in a semantic gap between results and their application. There is a dearth of research work which demonstrates the effectiveness of these models across multiple datasets obtained in different environments. We argue that it is necessary to test the robustness of the machine learning models, especially in diversified operating conditions, which are prevalent in cloud scenarios. In this work, we use the UNSW dataset to train the supervised machine learning models. We then test these models with ISOT dataset. We present our results and argue that more research in the field of machine learning is still required for its applicability to the cloud security.", "year": 2016, "referenceCount": 31, "citationCount": 57, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3116378", "name": "D. Bhamare"}, {"authorId": "1935864", "name": "Tara Salman"}, {"authorId": "1932846", "name": "M. Samaka"}, {"authorId": "2884607", "name": "A. Erbad"}, {"authorId": "145889709", "name": "R. Jain"}]}, {"paperId": "294c01931402eb5973866ae01c4ed972a5e067c2", "url": "https://www.semanticscholar.org/paper/294c01931402eb5973866ae01c4ed972a5e067c2", "title": "Deep Learning, Sparse Coding, and SVM for Melanoma Recognition in Dermoscopy Images", "abstract": null, "year": 2015, "referenceCount": 22, "citationCount": 284, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40589056", "name": "N. Codella"}, {"authorId": "2143481273", "name": "Junjie Cai"}, {"authorId": "145130701", "name": "M. Abedini"}, {"authorId": "3039336", "name": "R. Garnavi"}, {"authorId": "39170848", "name": "A. Halpern"}, {"authorId": "2118965263", "name": "John R. Smith"}]}, {"paperId": "217c3e37092bb094bf226b58f44357db5c284a60", "url": "https://www.semanticscholar.org/paper/217c3e37092bb094bf226b58f44357db5c284a60", "title": "Learning to Resolve Bridging References", "abstract": "We use machine learning techniques to find the best combination of local focus and lexical distance features for identifying the anchor of mereological bridging references. We find that using first mention, utterance distance, and lexical distance computed using either Google or WordNet results in an accuracy significantly higher than obtained in previous experiments.", "year": 2004, "referenceCount": 43, "citationCount": 113, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1678591", "name": "Massimo Poesio"}, {"authorId": "2067925708", "name": "Rahul Mehta"}, {"authorId": "2470445", "name": "Axel Maroudas"}, {"authorId": "2165202", "name": "J. Hitzeman"}]}, {"paperId": "237cc12f539dd42c9b91b4337d5cdb35af6fb9ac", "url": "https://www.semanticscholar.org/paper/237cc12f539dd42c9b91b4337d5cdb35af6fb9ac", "title": "Random forest classifier combined with feature selection for breast cancer diagnosis and prognostic", "abstract": "As \nthe incidence of this disease has increased significantly in the recent \nyears, expert systems and machine learning techniques to this problem have \nalso taken a great attention from many scholars. This study aims at diagnosing \nand prognosticating breast cancer with a machine learning method based on random \nforest classifier and feature selection technique. By weighting, keeping useful \nfeatures and removing redundant features in datasets, the method was obtained \nto solve diagnosis problems via classifying Wisconsin Breast Cancer Diagnosis \nDataset and to solve prognosis problem via classifying Wisconsin Breast Cancer \nPrognostic Dataset. On these datasets we obtained classification accuracy of \n100% in the best case and of around 99.8% on average. This is very promising \ncompared to the previously reported results. This result is for Wisconsin \nBreast Cancer Dataset but it states that this method can be used confidently \nfor other breast cancer diagnosis problems, too.", "year": 2013, "referenceCount": 28, "citationCount": 180, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2061207187", "name": "Cuong Nguyen"}, {"authorId": "2153953256", "name": "Yong Wang"}, {"authorId": "153609601", "name": "Ha-Nam Nguyen"}]}, {"paperId": "60e3c4d57c82a3b0d25a454e7e7d31a59154f21c", "url": "https://www.semanticscholar.org/paper/60e3c4d57c82a3b0d25a454e7e7d31a59154f21c", "title": "Machine Learning Methods for Computer Security (Dagstuhl Perspectives Workshop 12371)", "abstract": "The study of learning in adversarial environments is an emerging discipline at the juncture between machine learning and computer security that raises new questions within both fields. \n \nThe interest in learning-based methods for security and system design applications comes from the high degree of complexity of phenomena underlying the security and reliability of computer systems. As it becomes increasingly difficult to reach the desired properties by design alone, learning methods are being used to obtain a better understanding of various data collected from these complex systems. \n \nHowever, learning approaches can be co-opted or evaded by adversaries, who change to counter them. To-date, there has been limited research into learning techniques that are resilient to attacks with provable robustness guarantees making the task of designing secure learning-based systems a lucrative open \nresearch area with many challenges. \n \nThe Perspectives Workshop, ``Machine Learning Methods for Computer Security'' was convened to bring together interested researchers from both the computer security and machine learning communities to discuss techniques, challenges, and future research directions for secure learning and learning-based security applications. \n \nThis workshop featured twenty-two invited talks from leading researchers within the secure learning community covering topics in adversarial learning, game-theoretic learning, collective classification, privacy-preserving learning, security evaluation metrics, digital forensics, authorship identification, adversarial advertisement detection, learning for offensive security, and data sanitization. The workshop also featured workgroup sessions \norganized into three topic: machine learning for computer security, secure learning, and future applications of secure learning.", "year": 2012, "referenceCount": 0, "citationCount": 47, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1687701", "name": "A. Joseph"}, {"authorId": "1754215", "name": "P. Laskov"}, {"authorId": "1710171", "name": "F. Roli"}, {"authorId": "1787610", "name": "J. Tygar"}, {"authorId": "39743720", "name": "Blaine Nelson"}]}, {"paperId": "ec570b827cf0cd132da7ebd37537df4f0bb7f877", "url": "https://www.semanticscholar.org/paper/ec570b827cf0cd132da7ebd37537df4f0bb7f877", "title": "Learning De-biased Representations with Biased Representations", "abstract": "Many machine learning algorithms are trained and evaluated by splitting data from a single source into training and test sets. While such focus on in-distribution learning scenarios has led to interesting advancement, it has not been able to tell if models are relying on dataset biases as shortcuts for successful prediction (e.g., using snow cues for recognising snowmobiles), resulting in biased models that fail to generalise when the bias shifts to a different class. The cross-bias generalisation problem has been addressed by de-biasing training data through augmentation or re-sampling, which are often prohibitive due to the data collection cost (e.g., collecting images of a snowmobile on a desert) and the difficulty of quantifying or expressing biases in the first place. In this work, we propose a novel framework to train a de-biased representation by encouraging it to be different from a set of representations that are biased by design. This tactic is feasible in many scenarios where it is much easier to define a set of biased representations than to define and quantify bias. We demonstrate the efficacy of our method across a variety of synthetic and real-world biases; our experiments show that the method discourages models from taking bias shortcuts, resulting in improved generalisation. Source code is available at this https URL.", "year": 2019, "referenceCount": 55, "citationCount": 112, "influentialCitationCount": 27, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "41019737", "name": "Hyojin Bahng"}, {"authorId": "2647582", "name": "Sanghyuk Chun"}, {"authorId": "2151587", "name": "Sangdoo Yun"}, {"authorId": "1795455", "name": "J. Choo"}, {"authorId": "2390510", "name": "Seong Joon Oh"}]}, {"paperId": "66e70d7d6af0c51b9b907d9c4a8de0dfca70b1a7", "url": "https://www.semanticscholar.org/paper/66e70d7d6af0c51b9b907d9c4a8de0dfca70b1a7", "title": "Will machine learning end the viability of radiology as a thriving medical specialty?", "abstract": "There have been tremendous advances in artificial intelligence (AI) and machine learning (ML) within the past decade, especially in the application of deep learning to various challenges. These include advanced competitive games (such as Chess and Go), self-driving cars, speech recognition, and intelligent personal assistants. Rapid advances in computer vision for recognition of objects in pictures have led some individuals, including computer science experts and health care system experts in machine learning, to make predictions that ML algorithms will soon lead to the replacement of the radiologist. However, there are complex technological, regulatory, and medicolegal obstacles facing the implementation of machine learning in radiology that will definitely preclude replacement of the radiologist by these algorithms within the next two decades and beyond. While not a comprehensive review of machine learning, this article is intended to highlight specific features of machine learning which face significant technological and health care systems challenges. Rather than replacing radiologists, machine learning will provide quantitative tools that will increase the value of diagnostic imaging as a biomarker, increase image quality with decreased acquisition times, and improve workflow, communication, and patient safety. In the foreseeable future, we predict that today's generation of radiologists will be replaced not by ML algorithms, but by a new breed of data science-savvy radiologists who have embraced and harnessed the incredible potential that machine learning has to advance our ability to care for our patients. In this way, radiology will remain a viable medical specialty for years to come.", "year": 2019, "referenceCount": 112, "citationCount": 46, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Medicine"], "authors": [{"authorId": "2107300376", "name": "Stephen Chan"}, {"authorId": "1691257", "name": "E. Siegel"}]}, {"paperId": "44aac57800bc8090338153f421682282a90da922", "url": "https://www.semanticscholar.org/paper/44aac57800bc8090338153f421682282a90da922", "title": "Machine learning and modeling: Data, validation, communication challenges", "abstract": "With the era of big data, the utilization of machine learning algorithms in radiation oncology is rapidly growing with applications including: treatment response modeling, treatment planning, contouring, organ segmentation, image-guidance, motion tracking, quality assurance, and more. Despite this interest, practical clinical implementation of machine learning as part of the day-to-day clinical operations is still lagging. The aim of this white paper is to further promote progress in this new field of machine learning in radiation oncology by highlighting its untapped advantages and potentials for clinical advancement, while also presenting current challenges and open questions for future research. The targeted audience of this paper includes newcomers as well as practitioners in the field of medical physics/radiation oncology. The paper also provides general recommendations to avoid common pitfalls when applying these powerful data analytic tools to medical physics and radiation oncology problems and suggests some guidelines for transparent and informative reporting of machine learning results.", "year": 2018, "referenceCount": 86, "citationCount": 55, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "65739579", "name": "I. El Naqa"}, {"authorId": "143903039", "name": "D. Ruan"}, {"authorId": "145295389", "name": "G. Valdes"}, {"authorId": "48742163", "name": "A. Dekker"}, {"authorId": "2176030", "name": "T. McNutt"}, {"authorId": "37007400", "name": "Y. Ge"}, {"authorId": "2167223315", "name": "Q. Wu"}, {"authorId": "1743648", "name": "J. Oh"}, {"authorId": "1787832", "name": "M. Thor"}, {"authorId": "3467448", "name": "W. Smith"}, {"authorId": "1849484", "name": "A. Rao"}, {"authorId": "2863660", "name": "C. Fuller"}, {"authorId": "143927628", "name": "Ying Xiao"}, {"authorId": "1781787", "name": "F. Manion"}, {"authorId": "3746794", "name": "M. Schipper"}, {"authorId": "34839615", "name": "C. Mayo"}, {"authorId": "48227976", "name": "J. Moran"}, {"authorId": "115533597", "name": "R. T. Ten Haken"}]}, {"paperId": "ec129af4c59e7813ea1e60a5a098b569afcdf4de", "url": "https://www.semanticscholar.org/paper/ec129af4c59e7813ea1e60a5a098b569afcdf4de", "title": "The Kernel-Adatron : A fast and simple learning procedure for support vector machines", "abstract": "The present invention is directed to non-hygroscopic, water-soluble sugar compositions which are prepared by grinding together in a dry, solid state, a white sugar component and a \"pulverizing aid\" in the form of a water-soluble maltodextrin having a measurable dextrose equivalent value not substantially above 20, said \"pulverizing aid\" being employed in amounts ranging from about 5 to about 20% by weight of said total composition, the resulting product having an average particle size such that 95% by weight of the composition passes through a 325 mesh, said composition being further characterized as having a ratio of weight average particle size to number average particle size of less than 2. The compositions are free-flowing powders useful in preparing icings, buttercreams and fudges.", "year": 1998, "referenceCount": 0, "citationCount": 115, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34999823", "name": "T. Frieß"}, {"authorId": "1685083", "name": "N. Cristianini"}, {"authorId": "153410082", "name": "I. Campbell"}]}, {"paperId": "feb272d9bdeff301d267ece37b5387c61203c609", "url": "https://www.semanticscholar.org/paper/feb272d9bdeff301d267ece37b5387c61203c609", "title": "Machine Learning Approaches for Thermoelectric Materials Research", "abstract": "Thermoelectric (TE) materials provide a solid‐state solution in waste heat recovery and refrigeration. During the past few decades, considerable effort has been devoted towards improving the performance of TE materials, which requires the optimization of multiple interrelated properties. A fundamental understanding of the interaction processes between the various energy carriers, such as electrons and phonons, is critical for advances in the development of TE materials. However, this understanding remains challenging primarily due to the inaccessibility of time scales using standard atomistic simulations. Machine learning methods, well known for their data‐analysis capability, have been successfully applied in research on TE materials in recent years. Here, an overview of the machine learning methods used in thermoelectric studies is provided, with the role that each machine learning method plays being systematically discussed. Furthermore, to date, the scale of thermoelectric‐related databases is much smaller than those in other fields, such as e‐commerce, image identification, and speech recognition. To overcome this limitation, possible strategies to utilize small databases in promoting materials science are also discussed. Finally, a brief conclusion and outlook are presented.", "year": 2019, "referenceCount": 78, "citationCount": 67, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "152987957", "name": "T. Wang"}, {"authorId": "50445724", "name": "Cheng Zhang"}, {"authorId": "2103629", "name": "H. Snoussi"}, {"authorId": "145448010", "name": "Gang Zhang"}]}, {"paperId": "c489ced6b820e8609eec130a7484477ff27cfff4", "url": "https://www.semanticscholar.org/paper/c489ced6b820e8609eec130a7484477ff27cfff4", "title": "DP-ADMM: ADMM-Based Distributed Learning With Differential Privacy", "abstract": "Alternating direction method of multipliers (ADMM) is a widely used tool for machine learning in distri-buted settings where a machine learning model is trained over distributed data sources through an interactive process of local computation and message passing. Such an iterative process could cause privacy concerns of data owners. The goal of this paper is to provide differential privacy for ADMM-based distributed machine learning. Prior approaches on differentially private ADMM exhibit low utility under high privacy guarantee and assume the objective functions of the learning problems to be smooth and strongly convex. To address these concerns, we propose a novel differentially private ADMM-based distributed learning algorithm called DP-ADMM, which combines an approximate augmented Lagrangian function with time-varying Gaussian noise addition in the iterative process to achieve higher utility for general objective functions under the same differential privacy guarantee. We also apply the moments accountant method to analyze the end-to-end privacy loss. The theoretical analysis shows that the DP-ADMM can be applied to a wider class of distributed learning problems, is provably convergent, and offers an explicit utility-privacy tradeoff. To our knowledge, this is the first paper to provide explicit convergence and utility properties for differentially private ADMM-based distributed learning algorithms. The evaluation results demonstrate that our approach can achieve good convergence and model accuracy under high end-to-end differential privacy guarantee.", "year": 2018, "referenceCount": 53, "citationCount": 96, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1388738367", "name": "Zonghao Huang"}, {"authorId": "1471616367", "name": "Rui Hu"}, {"authorId": "1795475", "name": "Yuanxiong Guo"}, {"authorId": "1400755941", "name": "E. Chan-Tin"}, {"authorId": "144010840", "name": "Yanmin Gong"}]}, {"paperId": "2b2ae20ced8cb2ad9dffc69d2bdcb908a7910f6d", "url": "https://www.semanticscholar.org/paper/2b2ae20ced8cb2ad9dffc69d2bdcb908a7910f6d", "title": "Boosting support vector machines for imbalanced data sets", "abstract": null, "year": 2008, "referenceCount": 52, "citationCount": 326, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2115280154", "name": "Benjamin X. Wang"}, {"authorId": "1743642", "name": "N. Japkowicz"}]}, {"paperId": "3440ebeda19d658b91c51206be3519343663b9c1", "url": "https://www.semanticscholar.org/paper/3440ebeda19d658b91c51206be3519343663b9c1", "title": "Personalized Multitask Learning for Predicting Tomorrow's Mood, Stress, and Health", "abstract": "While accurately predicting mood and wellbeing could have a number of important clinical benefits, traditional machine learning (ML) methods frequently yield low performance in this domain. We posit that this is because a one-size-fits-all machine learning model is inherently ill-suited to predicting outcomes like mood and stress, which vary greatly due to individual differences. Therefore, we employ Multitask Learning (MTL) techniques to train personalized ML models which are customized to the needs of each individual, but still leverage data from across the population. Three formulations of MTL are compared: i) MTL deep neural networks, which share several hidden layers but have final layers unique to each task; ii) Multi-task Multi-Kernel learning, which feeds information across tasks through kernel weights on feature types; and iii) a Hierarchical Bayesian model in which tasks share a common Dirichlet Process prior. We offer the code for this work in open source. These techniques are investigated in the context of predicting future mood, stress, and health using data collected from surveys, wearable sensors, smartphone logs, and the weather. Empirical results demonstrate that using MTL to account for individual differences provides large performance improvements over traditional machine learning methods and provides personalized, actionable insights.", "year": 2020, "referenceCount": 61, "citationCount": 111, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144996285", "name": "Sara Taylor"}, {"authorId": "3106683", "name": "Natasha Jaques"}, {"authorId": "9259311", "name": "Ehimwenma Nosakhare"}, {"authorId": "2804453", "name": "A. Sano"}, {"authorId": "1719389", "name": "Rosalind W. Picard"}]}, {"paperId": "bbd0e204f48a45735e1065c8b90b298077b73192", "url": "https://www.semanticscholar.org/paper/bbd0e204f48a45735e1065c8b90b298077b73192", "title": "One-shot Learning with Memory-Augmented Neural Networks", "abstract": "Despite recent breakthroughs in the applications of deep neural networks, one setting that presents a persistent challenge is that of “one-shot learning.” Traditional gradient-based networks require a lot of data to learn, often through extensive iterative training. When new data is encountered, the models must inefficiently relearn their parameters to adequately incorporate the new information without catastrophic interference. Architectures with augmented memory capacities, such as Neural Turing Machines (NTMs), offer the ability to quickly encode and retrieve new information, and hence can potentially obviate the downsides of conventional models. Here, we demonstrate the ability of a memory-augmented neural network to rapidly assimilate new data, and leverage this data to make accurate predictions after only a few samples. We also introduce a new method for accessing an external memory that focuses on memory content, unlike previous methods that additionally use memory locationbased focusing mechanisms.", "year": 2016, "referenceCount": 21, "citationCount": 478, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35030998", "name": "Adam Santoro"}, {"authorId": "2258504", "name": "Sergey Bartunov"}, {"authorId": "46378362", "name": "M. Botvinick"}, {"authorId": "1688276", "name": "Daan Wierstra"}, {"authorId": "2542999", "name": "T. Lillicrap"}]}, {"paperId": "4d3fb523b7892e0b7a7990366e02fae46d63dcb4", "url": "https://www.semanticscholar.org/paper/4d3fb523b7892e0b7a7990366e02fae46d63dcb4", "title": "Fast Image Tagging", "abstract": "Automatic image annotation is a difficult and highly relevant machine learning task. Recent advances have significantly improved the state-of-the-art in retrieval accuracy with algorithms based on nearest neighbor classification in carefully learned metric spaces. But this comes at a price of increased computational complexity during training and testing. We propose FastTag, a novel algorithm that achieves comparable results with two simple linear mappings that are co-regularized in a joint convex loss function. The loss function can be efficiently optimized in closed form updates, which allows us to incorporate a large number of image descriptors cheaply. On several standard real-world benchmark data sets, we demonstrate that FastTag matches the current state-of-the-art in tagging quality, yet reduces the training and testing times by several orders of magnitude and has lower asymptotic complexity.", "year": 2013, "referenceCount": 28, "citationCount": 213, "influentialCitationCount": 47, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1743082", "name": "Minmin Chen"}, {"authorId": "3001424", "name": "A. Zheng"}, {"authorId": "7446832", "name": "Kilian Q. Weinberger"}]}, {"paperId": "2ef26af206f7ebbbd90a7d68d77a7639c8dfc6b6", "url": "https://www.semanticscholar.org/paper/2ef26af206f7ebbbd90a7d68d77a7639c8dfc6b6", "title": "Comparing machines and humans on a visual categorization test", "abstract": "Automated scene interpretation has benefited from advances in machine learning, and restricted tasks, such as face detection, have been solved with sufficient accuracy for restricted settings. However, the performance of machines in providing rich semantic descriptions of natural scenes from digital images remains highly limited and hugely inferior to that of humans. Here we quantify this “semantic gap” in a particular setting: We compare the efficiency of human and machine learning in assigning an image to one of two categories determined by the spatial arrangement of constituent parts. The images are not real, but the category-defining rules reflect the compositional structure of real images and the type of “reasoning” that appears to be necessary for semantic parsing. Experiments demonstrate that human subjects grasp the separating principles from a handful of examples, whereas the error rates of computer programs fluctuate wildly and remain far behind that of humans even after exposure to thousands of examples. These observations lend support to current trends in computer vision such as integrating machine learning with parts-based modeling.", "year": 2011, "referenceCount": 32, "citationCount": 112, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2721983", "name": "F. Fleuret"}, {"authorId": "2118549112", "name": "Ting Li"}, {"authorId": "1720207", "name": "Charles Dubout"}, {"authorId": "6403684", "name": "E. Wampler"}, {"authorId": "2054882", "name": "S. Yantis"}, {"authorId": "1707642", "name": "D. Geman"}]}, {"paperId": "846981890b81ae5d9ff5cedfcdbd99150a8bde13", "url": "https://www.semanticscholar.org/paper/846981890b81ae5d9ff5cedfcdbd99150a8bde13", "title": "Uma Introdução às Support Vector Machines", "abstract": "This paper presents an introduction to the Support Vector Machines (SVMs), a Machine Learning technique that has received increasing attention in the last years. The SVMs have been applied to several pattern recognition tasks, obtaining results superior to those of other learning techniques in various applications.", "year": 2007, "referenceCount": 42, "citationCount": 72, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145268980", "name": "Ana Carolina Lorena"}, {"authorId": "133574843", "name": "A. C. P. L. F. D. Carvalho"}]}, {"paperId": "8aabf5ba342d37edc1ebd89ba898c70b0a4ca121", "url": "https://www.semanticscholar.org/paper/8aabf5ba342d37edc1ebd89ba898c70b0a4ca121", "title": "On the Convergence of the Concave-Convex Procedure", "abstract": "The concave-convex procedure (CCCP) is a majorization-minimization algorithm that solves d.c. (difference of convex functions) programs as a sequence of convex programs. In machine learning, CCCP is extensively used in many learning algorithms like sparse support vector machines (SVMs), transductive SVMs, sparse principal component analysis, etc. Though widely used in many applications, the convergence behavior of CCCP has not gotten a lot of specific attention. Yuille and Rangarajan analyzed its convergence in their original paper, however, we believe the analysis is not complete. Although the convergence of CCCP can be derived from the convergence of the d.c. algorithm (DCA), its proof is more specialized and technical than actually required for the specific case of CCCP. In this paper, we follow a different reasoning and show how Zangwill's global convergence theory of iterative algorithms provides a natural framework to prove the convergence of CCCP, allowing a more elegant and simple proof. This underlines Zangwill's theory as a powerful and general framework to deal with the convergence issues of iterative algorithms, after also being used to prove the convergence of algorithms like expectation-maximization, generalized alternating minimization, etc. In this paper, we provide a rigorous analysis of the convergence of CCCP by addressing these questions: (i) When does CCCP find a local minimum or a stationary point of the d.c. program under consideration? (ii) When does the sequence generated by CCCP converge? We also present an open problem on the issue of local convergence of CCCP.", "year": 2009, "referenceCount": 36, "citationCount": 418, "influentialCitationCount": 42, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3313411", "name": "Bharath K. Sriperumbudur"}, {"authorId": "1725533", "name": "G. Lanckriet"}]}, {"paperId": "a8639fae55b0bbb58c7dee826ccd42a611814cb4", "url": "https://www.semanticscholar.org/paper/a8639fae55b0bbb58c7dee826ccd42a611814cb4", "title": "Current Research in Learning Design", "abstract": "A 'learning design' is defined as the description of the teaching-learning process that takes place in a unit of learning (eg, a course, a lesson or any other designed learning event). The key principle in learning design is that it represents the learning activities and the support activities that are performed by different persons (learners, teachers) in the context of a unit of learning. The IMS Learning Design specification aims to represent the learning design of units of learning in a semantic, formal and machine interpretable way. Since its release in 2003 various parties have been active to develop tools, to experiment with Learning Design in practice, or to do research on the further advancement of the specification. The aim of this special issue is to provide an overview of current work in the area. This papers introduces Learning Design, analyses the different papers and provides an overview of current research in Learning Design. The major research issues are at the moment: a) the use of ontologies and semantic web principles & tools related to Learning Design; b) the use of learning design patterns; c) the development of learrning design authoring and content management systems, and d) the development of learning design players, including the issues how to use the integrated set of learning design tools in a variety of settings.", "year": 2006, "referenceCount": 46, "citationCount": 227, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1747579", "name": "R. Koper"}]}, {"paperId": "0b97e343364adf2409a666aaf35133b4b4b82740", "url": "https://www.semanticscholar.org/paper/0b97e343364adf2409a666aaf35133b4b4b82740", "title": "A geometric framework for machine learning", "abstract": "Due to advances in the sciences, the ability of mankind to collect data has increased enormously in recent years. In many different areas, the research bottleneck is no longer in data collection, but rather in data interpretation. Often, the underlying processes described by the data are very complex, compounding the problem. In response, much research in computer analysis of large datasets is under way. Machine learning is one of the fields responding to the challenge of this problem. \nThis thesis considers the interpretation of machine learning problems and techniques under a geometric model. Geometry is a useful for several reasons. It aids in visualization, allowing for alternative ways of thinking. It provides a rigorous framework for analyzing learning problems and methods. It suggests modifications to methods which can increase their usefulness and efficiency. \nIn this thesis, geometric analysis is used to formulate and analyze two theoretical machine learning problems and to improve an existing machine learning method. A form of best-case analysis is presented which can be used to generate bounds on the number of examples needed for learning. A formal trade-off between available memory and speed of learning is established. In addition, geometry is used to generalize the decision tree method of machine learning. An algorithm for learning based on this generalization is presented, and its usefulness is demonstrated on a variety of artificial and real-world databases.", "year": 1993, "referenceCount": 0, "citationCount": 49, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2059696865", "name": "David G. Heath"}]}, {"paperId": "18000ef9b6e02308ae299c4e1e2b3a32e951a508", "url": "https://www.semanticscholar.org/paper/18000ef9b6e02308ae299c4e1e2b3a32e951a508", "title": "Prediction of premature all-cause mortality: A prospective general population cohort study comparing machine-learning and standard epidemiological approaches", "abstract": "Background Prognostic modelling using standard methods is well-established, particularly for predicting risk of single diseases. Machine-learning may offer potential to explore outcomes of even greater complexity, such as premature death. This study aimed to develop novel prediction algorithms using machine-learning, in addition to standard survival modelling, to predict premature all-cause mortality. Methods A prospective population cohort of 502,628 participants aged 40–69 years were recruited to the UK Biobank from 2006–2010 and followed-up until 2016. Participants were assessed on a range of demographic, biometric, clinical and lifestyle factors. Mortality data by ICD-10 were obtained from linkage to Office of National Statistics. Models were developed using deep learning, random forest and Cox regression. Calibration was assessed by comparing observed to predicted risks; and discrimination by area under the ‘receiver operating curve’ (AUC). Findings 14,418 deaths (2.9%) occurred over a total follow-up time of 3,508,454 person-years. A simple age and gender Cox model was the least predictive (AUC 0.689, 95% CI 0.681–0.699). A multivariate Cox regression model significantly improved discrimination by 6.2% (AUC 0.751, 95% CI 0.748–0.767). The application of machine-learning algorithms further improved discrimination by 3.2% using random forest (AUC 0.783, 95% CI 0.776–0.791) and 3.9% using deep learning (AUC 0.790, 95% CI 0.783–0.797). These ML algorithms improved discrimination by 9.4% and 10.1% respectively from a simple age and gender Cox regression model. Random forest and deep learning achieved similar levels of discrimination with no significant difference. Machine-learning algorithms were well-calibrated, while Cox regression models consistently over-predicted risk. Conclusions Machine-learning significantly improved accuracy of prediction of premature all-cause mortality in this middle-aged population, compared to standard methods. This study illustrates the value of machine-learning for risk prediction within a traditional epidemiological study design, and how this approach might be reported to assist scientific verification.", "year": 2019, "referenceCount": 38, "citationCount": 58, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "8955394", "name": "S. Weng"}, {"authorId": "145513333", "name": "L. Vaz"}, {"authorId": "4757323", "name": "N. Qureshi"}, {"authorId": "3428487", "name": "J. Kai"}]}, {"paperId": "df51e3aa05047aec4646b9810236f01840f911bc", "url": "https://www.semanticscholar.org/paper/df51e3aa05047aec4646b9810236f01840f911bc", "title": "Predicting outcomes of case based legal arguments", "abstract": "In this paper, we introduce IBP, an algorithm that combines reasoning with an abstract domain model and case-based reasoning techniques to predict the outcome of case-based legal arguments. Unlike the predictions generated by statistical or machine-learning techniques, IBP's predictions are accompanied by explanations.We describe an empirical evaluation of IBP, in which we compare our algorithm to prediction based on Hypo's and CATO's relevance criteria, and to a number of widely used machine learning algorithms. IBP reaches higher accuracy than all competitors, and hypothesis testing shows that the observed differences are statistically significant. An ablation study indicates that both sources of knowledge in IBP contribute to the accuracy of its predictions.", "year": 2003, "referenceCount": 25, "citationCount": 117, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2001479", "name": "Stefanie Brüninghaus"}, {"authorId": "1770311", "name": "Kevin D. Ashley"}]}, {"paperId": "e3b74d8b51cf67e07d754718d040c51c580f7db6", "url": "https://www.semanticscholar.org/paper/e3b74d8b51cf67e07d754718d040c51c580f7db6", "title": "Machine learning for the solution of the Schrödinger equation", "abstract": "Machine learning (ML) methods have recently been increasingly widely used in quantum chemistry. While ML methods are now accepted as high accuracy approaches to construct interatomic potentials for applications, the use of ML to solve the Schrödinger equation, either vibrational or electronic, while not new, is only now making significant headway towards applications. We survey recent uses of ML techniques to solve the Schrödinger equation, including the vibrational Schrödinger equation, the electronic Schrödinger equation and the related problems of constructing functionals for density functional theory (DFT) as well as potentials which enter semi-empirical approximations to DFT. We highlight similarities and differences and specific difficulties that ML faces in these applications and possibilities for cross-fertilization of ideas.", "year": 2020, "referenceCount": 161, "citationCount": 41, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "2971347", "name": "S. Manzhos"}]}, {"paperId": "08211e51290e1ec1c508745feb9d97dc48814581", "url": "https://www.semanticscholar.org/paper/08211e51290e1ec1c508745feb9d97dc48814581", "title": "A machine learning framework for sport result prediction", "abstract": null, "year": 2019, "referenceCount": 44, "citationCount": 158, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8227255", "name": "Rory Bunker"}, {"authorId": "1692763", "name": "F. Thabtah"}]}]}