{"total": 5120627, "offset": 4300, "next": 4400, "data": [{"paperId": "9dae109dd5c94f4aa7d9a62db9ac472e9395403d", "url": "https://www.semanticscholar.org/paper/9dae109dd5c94f4aa7d9a62db9ac472e9395403d", "title": "Smart fog: Fog computing framework for unsupervised clustering analytics in wearable Internet of Things", "abstract": "The increasing use of wearables in smart telehealth system led to the generation of large medical big data. Cloud and fog services leverage these data for assisting clinical procedures. IoT Healthcare has been benefited from this large pool of generated data. This paper suggests the use of low-resource machine learning on Fog devices kept close to wearables for smart telehealth. For traditional telecare systems, the signal processing and machine learning modules are deployed in the cloud that processes physiological data. This paper presents a Fog architecture that relied on unsupervised machine learning big data analysis for discovering patterns in physiological data. We developed a prototype using Intel Edison and Raspberry Pi that was tested on real-world pathological speech data from telemonitoring of patients with Parkinson's disease (PD). Proposed architecture employed machine learning for analysis of pathological speech data obtained from smart watches worn by the patients with PD. Results show that proposed architecture is promising for low-resource machine learning. It could be useful for other applications within wearable IoT for smart telehealth scenarios by translating machine learning approaches from the cloud backend to edge computing devices such as Fog.", "year": 2017, "referenceCount": 23, "citationCount": 63, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "19206955", "name": "Debanjan Borthakur"}, {"authorId": "1732944", "name": "Harishchandra Dubey"}, {"authorId": "2163090", "name": "Nicholas Constant"}, {"authorId": "39541546", "name": "L. Mahler"}, {"authorId": "1690308", "name": "K. Mankodiya"}]}, {"paperId": "6f1b66645aa127c88afa83578c8f865d49f10280", "url": "https://www.semanticscholar.org/paper/6f1b66645aa127c88afa83578c8f865d49f10280", "title": "Multi-level hybrid support vector machine and extreme learning machine based on modified K-means for intrusion detection system", "abstract": null, "year": 2017, "referenceCount": 38, "citationCount": 297, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1398865616", "name": "Wathiq Laftah Al-Yaseen"}, {"authorId": "2070207", "name": "Z. Othman"}, {"authorId": "3417676", "name": "M. Nazri"}]}, {"paperId": "df51e3aa05047aec4646b9810236f01840f911bc", "url": "https://www.semanticscholar.org/paper/df51e3aa05047aec4646b9810236f01840f911bc", "title": "Predicting outcomes of case based legal arguments", "abstract": "In this paper, we introduce IBP, an algorithm that combines reasoning with an abstract domain model and case-based reasoning techniques to predict the outcome of case-based legal arguments. Unlike the predictions generated by statistical or machine-learning techniques, IBP's predictions are accompanied by explanations.We describe an empirical evaluation of IBP, in which we compare our algorithm to prediction based on Hypo's and CATO's relevance criteria, and to a number of widely used machine learning algorithms. IBP reaches higher accuracy than all competitors, and hypothesis testing shows that the observed differences are statistically significant. An ablation study indicates that both sources of knowledge in IBP contribute to the accuracy of its predictions.", "year": 2003, "referenceCount": 25, "citationCount": 117, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2001479", "name": "Stefanie Brüninghaus"}, {"authorId": "1770311", "name": "Kevin D. Ashley"}]}, {"paperId": "60e3c4d57c82a3b0d25a454e7e7d31a59154f21c", "url": "https://www.semanticscholar.org/paper/60e3c4d57c82a3b0d25a454e7e7d31a59154f21c", "title": "Machine Learning Methods for Computer Security (Dagstuhl Perspectives Workshop 12371)", "abstract": "The study of learning in adversarial environments is an emerging discipline at the juncture between machine learning and computer security that raises new questions within both fields. \n \nThe interest in learning-based methods for security and system design applications comes from the high degree of complexity of phenomena underlying the security and reliability of computer systems. As it becomes increasingly difficult to reach the desired properties by design alone, learning methods are being used to obtain a better understanding of various data collected from these complex systems. \n \nHowever, learning approaches can be co-opted or evaded by adversaries, who change to counter them. To-date, there has been limited research into learning techniques that are resilient to attacks with provable robustness guarantees making the task of designing secure learning-based systems a lucrative open \nresearch area with many challenges. \n \nThe Perspectives Workshop, ``Machine Learning Methods for Computer Security'' was convened to bring together interested researchers from both the computer security and machine learning communities to discuss techniques, challenges, and future research directions for secure learning and learning-based security applications. \n \nThis workshop featured twenty-two invited talks from leading researchers within the secure learning community covering topics in adversarial learning, game-theoretic learning, collective classification, privacy-preserving learning, security evaluation metrics, digital forensics, authorship identification, adversarial advertisement detection, learning for offensive security, and data sanitization. The workshop also featured workgroup sessions \norganized into three topic: machine learning for computer security, secure learning, and future applications of secure learning.", "year": 2012, "referenceCount": 0, "citationCount": 47, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1687701", "name": "A. Joseph"}, {"authorId": "1754215", "name": "P. Laskov"}, {"authorId": "1710171", "name": "F. Roli"}, {"authorId": "1787610", "name": "J. Tygar"}, {"authorId": "39743720", "name": "Blaine Nelson"}]}, {"paperId": "3f9a004654095a2e23699869ed517662d4b42f93", "url": "https://www.semanticscholar.org/paper/3f9a004654095a2e23699869ed517662d4b42f93", "title": "A Machine Learning Approach for Feature-Sensitive Motion Planning", "abstract": null, "year": 2004, "referenceCount": 30, "citationCount": 113, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143675341", "name": "M. Morales"}, {"authorId": "144922292", "name": "Lydia Tapia"}, {"authorId": "2157171", "name": "R. Pearce"}, {"authorId": "145954385", "name": "S. Rodríguez"}, {"authorId": "1678972", "name": "N. Amato"}]}, {"paperId": "f57554fa3537b3b2d14a1c50b85cd88045803592", "url": "https://www.semanticscholar.org/paper/f57554fa3537b3b2d14a1c50b85cd88045803592", "title": "Improving refugee integration through data-driven algorithmic assignment", "abstract": "Data-driven refugee assignment The continuing refugee crisis has made it necessary for governments to find ways to resettle individuals and families in host communities. Bansak et al. used a machine learning approach to develop an algorithm for geographically placing refugees to optimize their overall employment rate. The authors developed and tested the algorithm on segments of registry data from the United States and Switzerland. The algorithm improved the employment prospects of refugees in the United States by ∼40% and in Switzerland by ∼75%. Science, this issue p. 325 A machine learning–based algorithm for assigning refugees can improve their employment prospects over current approaches. Developed democracies are settling an increased number of refugees, many of whom face challenges integrating into host societies. We developed a flexible data-driven algorithm that assigns refugees across resettlement locations to improve integration outcomes. The algorithm uses a combination of supervised machine learning and optimal matching to discover and leverage synergies between refugee characteristics and resettlement sites. The algorithm was tested on historical registry data from two countries with different assignment regimes and refugee populations, the United States and Switzerland. Our approach led to gains of roughly 40 to 70%, on average, in refugees’ employment outcomes relative to current assignment practices. This approach can provide governments with a practical and cost-efficient policy tool that can be immediately implemented within existing institutional structures.", "year": 2018, "referenceCount": 38, "citationCount": 161, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "8074481", "name": "Kirk Bansak"}, {"authorId": "35299236", "name": "Jeremy Ferwerda"}, {"authorId": "4600197", "name": "Jens Hainmueller"}, {"authorId": "50033874", "name": "Andrea Dillon"}, {"authorId": "4026563", "name": "Dominik Hangartner"}, {"authorId": "39523274", "name": "Duncan Lawrence"}, {"authorId": "2223030", "name": "J. Weinstein"}]}, {"paperId": "8aabf5ba342d37edc1ebd89ba898c70b0a4ca121", "url": "https://www.semanticscholar.org/paper/8aabf5ba342d37edc1ebd89ba898c70b0a4ca121", "title": "On the Convergence of the Concave-Convex Procedure", "abstract": "The concave-convex procedure (CCCP) is a majorization-minimization algorithm that solves d.c. (difference of convex functions) programs as a sequence of convex programs. In machine learning, CCCP is extensively used in many learning algorithms like sparse support vector machines (SVMs), transductive SVMs, sparse principal component analysis, etc. Though widely used in many applications, the convergence behavior of CCCP has not gotten a lot of specific attention. Yuille and Rangarajan analyzed its convergence in their original paper, however, we believe the analysis is not complete. Although the convergence of CCCP can be derived from the convergence of the d.c. algorithm (DCA), its proof is more specialized and technical than actually required for the specific case of CCCP. In this paper, we follow a different reasoning and show how Zangwill's global convergence theory of iterative algorithms provides a natural framework to prove the convergence of CCCP, allowing a more elegant and simple proof. This underlines Zangwill's theory as a powerful and general framework to deal with the convergence issues of iterative algorithms, after also being used to prove the convergence of algorithms like expectation-maximization, generalized alternating minimization, etc. In this paper, we provide a rigorous analysis of the convergence of CCCP by addressing these questions: (i) When does CCCP find a local minimum or a stationary point of the d.c. program under consideration? (ii) When does the sequence generated by CCCP converge? We also present an open problem on the issue of local convergence of CCCP.", "year": 2009, "referenceCount": 36, "citationCount": 418, "influentialCitationCount": 42, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3313411", "name": "Bharath K. Sriperumbudur"}, {"authorId": "1725533", "name": "G. Lanckriet"}]}, {"paperId": "91f19b43cedec7ba5c3796a6bc16018455c7a531", "url": "https://www.semanticscholar.org/paper/91f19b43cedec7ba5c3796a6bc16018455c7a531", "title": "A study of the effect of different types of noise on the precision of supervised learning techniques", "abstract": null, "year": 2010, "referenceCount": 31, "citationCount": 337, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35102478", "name": "D. Nettleton"}, {"authorId": "1398964794", "name": "Albert Orriols-Puig"}, {"authorId": "3013172", "name": "A. Fornells"}]}, {"paperId": "e08f14111728901945f8c3b384b2f75746935e0d", "url": "https://www.semanticscholar.org/paper/e08f14111728901945f8c3b384b2f75746935e0d", "title": "Making Gradient Descent Optimal for Strongly Convex Stochastic Optimization", "abstract": "Stochastic gradient descent (SGD) is a simple and popular method to solve stochastic optimization problems which arise in machine learning. For strongly convex problems, its convergence rate was known to be O(log(T)/T), by running SGD for T iterations and returning the average point. However, recent results showed that using a different algorithm, one can get an optimal O(1/T) rate. This might lead one to believe that standard SGD is suboptimal, and maybe should even be replaced as a method of choice. In this paper, we investigate the optimality of SGD in a stochastic setting. We show that for smooth problems, the algorithm attains the optimal O(1/T) rate. However, for non-smooth problems, the convergence rate with averaging might really be Ω(log(T)/T), and this is not just an artifact of the analysis. On the flip side, we show that a simple modification of the averaging step suffices to recover the O(1/T) rate, and no other change of the algorithm is necessary. We also present experimental results which support our findings, and point out open problems.", "year": 2011, "referenceCount": 17, "citationCount": 597, "influentialCitationCount": 73, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1680046", "name": "A. Rakhlin"}, {"authorId": "1768909", "name": "O. Shamir"}, {"authorId": "37564609", "name": "Karthik Sridharan"}]}, {"paperId": "994ddbea26882f70131ca01cc1bd474dabf0ace3", "url": "https://www.semanticscholar.org/paper/994ddbea26882f70131ca01cc1bd474dabf0ace3", "title": "Learning based digital matting", "abstract": "We cast some new insights into solving the digital matting problem by treating it as a semi-supervised learning task in machine learning. A local learning based approach and a global learning based approach are then produced, to fit better the scribble based matting and the trimap based matting, respectively. Our approaches are easy to implement because only some simple matrix operations are needed. They are also extremely accurate because they can efficiently handle the nonlinear local color distributions by incorporating the kernel trick, that are beyond the ability of many previous works. Our approaches can outperform many recent matting methods, as shown by the theoretical analysis and comprehensive experiments. The new insights may also inspire several more works.", "year": 2009, "referenceCount": 23, "citationCount": 183, "influentialCitationCount": 36, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1746086", "name": "Yuanjie Zheng"}, {"authorId": "1708413", "name": "C. Kambhamettu"}]}, {"paperId": "9802a3a31e12485aa4447ec33e6ae4b9800edc0c", "url": "https://www.semanticscholar.org/paper/9802a3a31e12485aa4447ec33e6ae4b9800edc0c", "title": "Rough Sets: Theoretical Aspects of Reasoning about Data", "abstract": "I. Theoretical Foundations.- 1. Knowledge.- 1.1. Introduction.- 1.2. Knowledge and Classification.- 1.3. Knowledge Base.- 1.4. Equivalence, Generalization and Specialization of Knowledge.- Summary.- Exercises.- References.- 2. Imprecise Categories, Approximations and Rough Sets.- 2.1. Introduction.- 2.2. Rough Sets.- 2.3. Approximations of Set.- 2.4. Properties of Approximations.- 2.5. Approximations and Membership Relation.- 2.6. Numerical Characterization of Imprecision.- 2.7. Topological Characterization of Imprecision.- 2.8. Approximation of Classifications.- 2.9. Rough Equality of Sets.- 2.10. Rough Inclusion of Sets.- Summary.- Exercises.- References.- 3. Reduction of Knowledge.- 3.1. Introduction.- 3.2. Reduct and Core of Knowledge.- 3.3. Relative Reduct and Relative Core of Knowledge.- 3.4. Reduction of Categories.- 3.5. Relative Reduct and Core of Categories.- Summary.- Exercises.- References.- 4. Dependencies in Knowledge Base.- 4.1. Introduction.- 4.2. Dependency of Knowledge.- 4.3. Partial Dependency of Knowledge.- Summary.- Exercises.- References.- 5. Knowledge Representation.- 5.1. Introduction.- 5.2. Examples.- 5.3. Formal Definition.- 5.4. Significance of Attributes.- 5.5. Discernibility Matrix.- Summary.- Exercises.- References.- 6. Decision Tables.- 6.1. Introduction.- 6.2. Formal Definition and Some Properties.- 6.3. Simplification of Decision Tables.- Summary.- Exercises.- References.- 7. Reasoning about Knowledge.- 7.1. Introduction.- 7.2. Language of Decision Logic.- 7.3. Semantics of Decision Logic Language.- 7.4. Deduction in Decision Logic.- 7.5. Normal Forms.- 7.6. Decision Rules and Decision Algorithms.- 7.7. Truth and Indiscernibility.- 7.8. Dependency of Attributes.- 7.9. Reduction of Consistent Algorithms.- 7.10. Reduction of Inconsistent Algorithms.- 7.11. Reduction of Decision Rules.- 7.12. Minimization of Decision Algorithms.- Summary.- Exercises.- References.- II. Applications.- 8. Decision Making.- 8.1. Introduction.- 8.2. Optician's Decisions Table.- 8.3. Simplification of Decision Table.- 8.4. Decision Algorithm.- 8.5. The Case of Incomplete Information.- Summary.- Exercises.- References.- 9. Data Analysis.- 9.1. Introduction.- 9.2. Decision Table as Protocol of Observations.- 9.3. Derivation of Control Algorithms from Observation.- 9.4. Another Approach.- 9.5. The Case of Inconsistent Data.- Summary.- Exercises.- References.- 10. Dissimilarity Analysis.- 10.1. Introduction.- 10.2. The Middle East Situation.- 10.3. Beauty Contest.- 10.4. Pattern Recognition.- 10.5. Buying a Car.- Summary.- Exercises.- References.- 11. Switching Circuits.- 11.1. Introduction.- 11.2. Minimization of Partially Defined Switching Functions.- 11.3. Multiple-Output Switching Functions.- Summary.- Exercises.- References.- 12. Machine Learning.- 12.1. Introduction.- 12.2. Learning From Examples.- 12.3. The Case of an Imperfect Teacher.- 12.4. Inductive Learning.- Summary.- Exercises.- References.", "year": 1991, "referenceCount": 0, "citationCount": 4911, "influentialCitationCount": 321, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "69054960", "name": "Z. Pawlak"}]}, {"paperId": "07d2ee90b475d2c0d1ed91f6485e86784f61189f", "url": "https://www.semanticscholar.org/paper/07d2ee90b475d2c0d1ed91f6485e86784f61189f", "title": "150 Successful Machine Learning Models: 6 Lessons Learned at Booking.com", "abstract": "Booking.com is the world's largest online travel agent where millions of guests find their accommodation and millions of accommodation providers list their properties including hotels, apartments, bed and breakfasts, guest houses, and more. During the last years we have applied Machine Learning to improve the experience of our customers and our business. While most of the Machine Learning literature focuses on the algorithmic or mathematical aspects of the field, not much has been published about how Machine Learning can deliver meaningful impact in an industrial environment where commercial gains are paramount. We conducted an analysis on about 150 successful customer facing applications of Machine Learning, developed by dozens of teams in Booking.com, exposed to hundreds of millions of users worldwide and validated through rigorous Randomized Controlled Trials. Following the phases of a Machine Learning project we describe our approach, the many challenges we found, and the lessons we learned while scaling up such a complex technology across our organization. Our main conclusion is that an iterative, hypothesis driven process, integrated with other disciplines was fundamental to build 150 successful products enabled by Machine Learning.", "year": 2019, "referenceCount": 14, "citationCount": 52, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38239271", "name": "Lucas Bernardi"}, {"authorId": "3315969", "name": "Themistoklis Mavridis"}, {"authorId": "103873581", "name": "PabloA . Estevez"}]}, {"paperId": "505bee3f5e750c4affa49023585a513210d35a60", "url": "https://www.semanticscholar.org/paper/505bee3f5e750c4affa49023585a513210d35a60", "title": "Feasibility of Supervised Machine Learning for Cloud Security", "abstract": "Cloud computing is gaining significant attention, however, security is the biggest hurdle in its wide acceptance. Users of cloud services are under constant fear of data loss, security threats and availability issues. Recently, learning-based methods for security applications are gaining popularity in the literature with the advents in machine learning techniques. However, the major challenge in these methods is obtaining real-time and unbiased datasets. Many datasets are internal and cannot be shared due to privacy issues or may lack certain statistical characteristics. As a result of this, researchers prefer to generate datasets for training and testing purpose in the simulated or closed experimental environments which may lack comprehensiveness. Machine learning models trained with such a single dataset generally result in a semantic gap between results and their application. There is a dearth of research work which demonstrates the effectiveness of these models across multiple datasets obtained in different environments. We argue that it is necessary to test the robustness of the machine learning models, especially in diversified operating conditions, which are prevalent in cloud scenarios. In this work, we use the UNSW dataset to train the supervised machine learning models. We then test these models with ISOT dataset. We present our results and argue that more research in the field of machine learning is still required for its applicability to the cloud security.", "year": 2016, "referenceCount": 31, "citationCount": 57, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3116378", "name": "D. Bhamare"}, {"authorId": "1935864", "name": "Tara Salman"}, {"authorId": "1932846", "name": "M. Samaka"}, {"authorId": "2884607", "name": "A. Erbad"}, {"authorId": "145889709", "name": "R. Jain"}]}, {"paperId": "b941be02e9c3cb4706b7b3518f57da73f50cb6f7", "url": "https://www.semanticscholar.org/paper/b941be02e9c3cb4706b7b3518f57da73f50cb6f7", "title": "Financial Statement Fraud Detection: An Analysis of Statistical and Machine Learning Algorithms", "abstract": "SUMMARY This study compares the performance of six popular statistical and machine learning models in detecting financial statement fraud under different assumptions of misclassification costs and ratios of fraud firms to nonfraud firms. The results show, somewhat surprisingly, that logistic regression and support vector machines perform well relative to an artificial neural network, bagging, C4.5, and stacking. The results also reveal some diversity in predictors used across the classification algorithms. Out of 42 predictors examined, only six are consistently selected and used by different classification algorithms: auditor turnover, total discretionary accruals, Big 4 auditor, accounts receivable, meeting or beating analyst forecasts, and unexpected employee productivity. These findings extend financial statement fraud research and can be used by practitioners and regulators to improve fraud risk models. Data Availability: A list of fraud companies used in this study is available from the author upon ...", "year": 2011, "referenceCount": 38, "citationCount": 198, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2634729", "name": "Johan L. Perols"}]}, {"paperId": "ec129af4c59e7813ea1e60a5a098b569afcdf4de", "url": "https://www.semanticscholar.org/paper/ec129af4c59e7813ea1e60a5a098b569afcdf4de", "title": "The Kernel-Adatron : A fast and simple learning procedure for support vector machines", "abstract": "The present invention is directed to non-hygroscopic, water-soluble sugar compositions which are prepared by grinding together in a dry, solid state, a white sugar component and a \"pulverizing aid\" in the form of a water-soluble maltodextrin having a measurable dextrose equivalent value not substantially above 20, said \"pulverizing aid\" being employed in amounts ranging from about 5 to about 20% by weight of said total composition, the resulting product having an average particle size such that 95% by weight of the composition passes through a 325 mesh, said composition being further characterized as having a ratio of weight average particle size to number average particle size of less than 2. The compositions are free-flowing powders useful in preparing icings, buttercreams and fudges.", "year": 1998, "referenceCount": 0, "citationCount": 115, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34999823", "name": "T. Frieß"}, {"authorId": "1685083", "name": "N. Cristianini"}, {"authorId": "153410082", "name": "I. Campbell"}]}, {"paperId": "161db5205859cd30d5d637ebf6d443030d95619e", "url": "https://www.semanticscholar.org/paper/161db5205859cd30d5d637ebf6d443030d95619e", "title": "A Primer on Learning in Bayesian Networks for Computational Biology", "abstract": "Bayesian networks (BNs) provide a neat and compact representation for expressing joint probability distributions (JPDs) and for inference. They are becoming increasingly important in the biological sciences for the tasks of inferring cellular networks [1], modelling protein signalling pathways [2], systems biology, data integration [3], classification [4], and genetic data analysis [5]. The representation and use of probability theory makes BNs suitable for combining domain knowledge and data, expressing causal relationships, avoiding overfitting a model to training data, and learning from incomplete datasets. The probabilistic formalism provides a natural treatment for the stochastic nature of biological systems and measurements. This primer aims to introduce BNs to the computational biologist, focusing on the concepts behind methods for learning the parameters and structure of models, at a time when they are becoming the machine learning method of choice. \n \nThere are many applications in biology where we wish to classify data; for example, gene function prediction. To solve such problems, a set of rules are required that can be used for prediction, but often such knowledge is unavailable, or in practice there turn out to be many exceptions to the rules or so many rules that this approach produces poor results. \n \nMachine learning approaches often produce better results, where a large number of examples (the training set) is used to adapt the parameters of a model that can then be used for performing predictions or classifications on data. There are many different types of models that may be required and many different approaches to training the models, each with its pros and cons. An excellent overview of the topic can be found in [6] and [7]. Neural networks, for example, are often able to learn a model from training data, but it is often difficult to extract information about the model, which with other methods can provide valuable insights into the data or problem being solved. A common problem in machine learning is overfitting, where the learned model is too complex and generalises poorly to unseen data. Increasing the size of the training dataset may reduce this; however, this assumes more training data is readily available, which is often not the case. In addition, often it is important to determine the uncertainty in the learned model parameters or even in the choice of model. This primer focuses on the use of BNs, which offer a solution to these issues. The use of Bayesian probability theory provides mechanisms for describing uncertainty and for adapting the number of parameters to the size of the data. Using a graphical representation provides a simple way to visualise the structure of a model. Inspection of models can provide valuable insights into the properties of the data and allow new models to be produced.", "year": 2007, "referenceCount": 18, "citationCount": 276, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "4505078", "name": "C. Needham"}, {"authorId": "47086417", "name": "J. Bradford"}, {"authorId": "2285244", "name": "A. Bulpitt"}, {"authorId": "1825543", "name": "D. Westhead"}]}, {"paperId": "60a67687d892d39c6aeac3ca3e2758fb947c0791", "url": "https://www.semanticscholar.org/paper/60a67687d892d39c6aeac3ca3e2758fb947c0791", "title": "Genetic algorithms in controller design and tuning", "abstract": "A three-phased framework for learning dynamic system control is presented. A genetic algorithm is employed to derive control rules encoded as decision tables. Next, the rules are automatically transformed into comprehensible form by means of inductive machine learning. Finally, a genetic algorithm is applied again to optimize the numerical parameters of the induced rules. The approach is experimentally verified on a benchmark problem of inverted pendulum control, with special emphasis on robustness and reliability. It is also shown that the proposed framework enables exploiting available domain knowledge. In this case, genetic algorithm makes qualitative control rules operational by providing interpretation of symbols in terms of numerical values. >", "year": 1993, "referenceCount": 10, "citationCount": 239, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1931927", "name": "A. Varsek"}, {"authorId": "2654837", "name": "T. Urbancic"}, {"authorId": "1691028", "name": "B. Filipič"}]}, {"paperId": "668fdb1df55ecfa8e97cb3fb6acb1275aa5b4b3b", "url": "https://www.semanticscholar.org/paper/668fdb1df55ecfa8e97cb3fb6acb1275aa5b4b3b", "title": "Sign-to-speech translation using machine-learning-assisted stretchable sensor arrays", "abstract": null, "year": 2020, "referenceCount": 47, "citationCount": 269, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1409871199", "name": "Zhihao Zhou"}, {"authorId": "2110556497", "name": "Kyle Chen"}, {"authorId": "2145462125", "name": "Xiaoshi Li"}, {"authorId": "31290270", "name": "Songlin Zhang"}, {"authorId": "12116782", "name": "Yufen Wu"}, {"authorId": "1491976061", "name": "Yihao Zhou"}, {"authorId": "22663592", "name": "Keyu Meng"}, {"authorId": "2118831165", "name": "Chenchen Sun"}, {"authorId": "145366807", "name": "Qiang He"}, {"authorId": "48144964", "name": "Wenjing Fan"}, {"authorId": "88728278", "name": "Endong Fan"}, {"authorId": "2112411883", "name": "Zhiwei Lin"}, {"authorId": "1576250488", "name": "Xulong Tan"}, {"authorId": "153256240", "name": "W. Deng"}, {"authorId": "2109913153", "name": "Jin Yang"}, {"authorId": "1804810", "name": "Jun Chen"}]}, {"paperId": "261955d76bad5e19cd48902f9cce8fe98e43619e", "url": "https://www.semanticscholar.org/paper/261955d76bad5e19cd48902f9cce8fe98e43619e", "title": "A survey on learning to rank", "abstract": "Ranking is the key problem for information retrieval and other text applications. Recently, the ranking methods based on machine learning approaches, called learning to rank, become the focus for researchers and practitioners. The main idea of these methods is to apply the various existing and effective algorithms on machine learning to ranking. However, as a learning problem, ranking is different from other classical ones such as classification and regression. In this paper, we investigate the important papers in this direction; the cons and pros of the recent-proposed framework and algorithms for ranking are analyzed, and the relationships among them are discussed. Finally, the promising directions in practice are also pointed out.", "year": 2008, "referenceCount": 30, "citationCount": 32, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115066904", "name": "Chuan He"}, {"authorId": "2116641109", "name": "Cong Wang"}, {"authorId": "2680838", "name": "Y. Zhong"}, {"authorId": "2462591", "name": "Ruifan Li"}]}, {"paperId": "086472d176499505a961890a52b0d008b15a3877", "url": "https://www.semanticscholar.org/paper/086472d176499505a961890a52b0d008b15a3877", "title": "Towards trustable machine learning", "abstract": null, "year": 2018, "referenceCount": 0, "citationCount": 38, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": []}, {"paperId": "f0d90cfd564a2ec6281ad58b58aef838decb2fe4", "url": "https://www.semanticscholar.org/paper/f0d90cfd564a2ec6281ad58b58aef838decb2fe4", "title": "XGBoost : Reliable Large-scale Tree Boosting System", "abstract": "Tree boosting is an important type of machine learning algorithms that is widely used in practice. In this paper, we describe XGBoost, a reliable, distributed machine learning system to scale up tree boosting algorithms. The system is optimized for fast parallel tree construction, and designed to be fault tolerant under the distributed setting. XGBoost can handle tens of millions of samples on a single node, and scales beyond billions of samples with distributed computing.", "year": 2015, "referenceCount": 9, "citationCount": 89, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "1913774", "name": "Tianqi Chen"}, {"authorId": "1730156", "name": "Carlos Guestrin"}]}, {"paperId": "edbc873a248768a626ef2bc57b3d1eff30de0e11", "url": "https://www.semanticscholar.org/paper/edbc873a248768a626ef2bc57b3d1eff30de0e11", "title": "Learning Graphical State Transitions", "abstract": "Graph-structured data is important in modeling relationships between multiple entities, and can be used to represent states of the world as well as many data structures. Li et al. (2016) describe a model known as a Gated Graph Sequence Neural Network (GGS-NN) that produces sequences from graph-structured input. In this work I introduce the Gated Graph Transformer Neural Network (GGTNN), an extension of GGS-NNs that uses graph-structured data as an intermediate representation. The model can learn to construct and modify graphs in sophisticated ways based on textual input, and also to use the graphs to produce a variety of outputs. For example, the model successfully learns to solve almost all of the bAbI tasks (Weston et al., 2016), and also discovers the rules governing graphical formulations of a simple cellular automaton and a family of Turing machines.", "year": 2016, "referenceCount": 23, "citationCount": 87, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2150444707", "name": "Daniel D. Johnson"}]}, {"paperId": "9564393f5e2e99d4f14045635ffbbbe2d06e237d", "url": "https://www.semanticscholar.org/paper/9564393f5e2e99d4f14045635ffbbbe2d06e237d", "title": "Sequential Projection-Based Metacognitive Learning in a Radial Basis Function Network for Classification Problems", "abstract": "In this paper, we present a sequential projection-based metacognitive learning algorithm in a radial basis function network (PBL-McRBFN) for classification problems. The algorithm is inspired by human metacognitive learning principles and has two components: a cognitive component and a metacognitive component. The cognitive component is a single-hidden-layer radial basis function network with evolving architecture. The metacognitive component controls the learning process in the cognitive component by choosing the best learning strategy for the current sample and adapts the learning strategies by implementing self-regulation. In addition, sample overlapping conditions and past knowledge of the samples in the form of pseudosamples are used for proper initialization of new hidden neurons to minimize the misclassification. The parameter update strategy uses projection-based direct minimization of hinge loss error. The interaction of the cognitive component and the metacognitive component addresses the what-to-learn, when-to-learn, and how-to-learn human learning principles efficiently. The performance of the PBL-McRBFN is evaluated using a set of benchmark classification problems from the University of California Irvine machine learning repository. The statistical performance evaluation on these problems proves the superior performance of the PBL-McRBFN classifier over results reported in the literature. Also, we evaluate the performance of the proposed algorithm on a practical Alzheimer's disease detection problem. The performance results on open access series of imaging studies and Alzheimer's disease neuroimaging initiative datasets, which are obtained from different demographic regions, clearly show that PBL-McRBFN can handle a problem with change in distribution.", "year": 2013, "referenceCount": 50, "citationCount": 110, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "34094551", "name": "G. S. Babu"}, {"authorId": "2000307852", "name": "S. Sundaram"}]}, {"paperId": "feb272d9bdeff301d267ece37b5387c61203c609", "url": "https://www.semanticscholar.org/paper/feb272d9bdeff301d267ece37b5387c61203c609", "title": "Machine Learning Approaches for Thermoelectric Materials Research", "abstract": "Thermoelectric (TE) materials provide a solid‐state solution in waste heat recovery and refrigeration. During the past few decades, considerable effort has been devoted towards improving the performance of TE materials, which requires the optimization of multiple interrelated properties. A fundamental understanding of the interaction processes between the various energy carriers, such as electrons and phonons, is critical for advances in the development of TE materials. However, this understanding remains challenging primarily due to the inaccessibility of time scales using standard atomistic simulations. Machine learning methods, well known for their data‐analysis capability, have been successfully applied in research on TE materials in recent years. Here, an overview of the machine learning methods used in thermoelectric studies is provided, with the role that each machine learning method plays being systematically discussed. Furthermore, to date, the scale of thermoelectric‐related databases is much smaller than those in other fields, such as e‐commerce, image identification, and speech recognition. To overcome this limitation, possible strategies to utilize small databases in promoting materials science are also discussed. Finally, a brief conclusion and outlook are presented.", "year": 2019, "referenceCount": 78, "citationCount": 67, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "152987957", "name": "T. Wang"}, {"authorId": "50445724", "name": "Cheng Zhang"}, {"authorId": "2103629", "name": "H. Snoussi"}, {"authorId": "145448010", "name": "Gang Zhang"}]}, {"paperId": "5248d7fb049263d0f70e66a62a0dd048d07177ff", "url": "https://www.semanticscholar.org/paper/5248d7fb049263d0f70e66a62a0dd048d07177ff", "title": "Machine-Learning-Assisted Accurate Band Gap Predictions of Functionalized MXene", "abstract": "MXenes are two-dimensional (2D) transition metal carbides and nitrides, and are invariably metallic in pristine form. While spontaneous passivation of their reactive bare surfaces lends unprecedented functionalities, consequently a many-folds increase in number of possible functionalized MXene makes their characterization difficult. Here, we study the electronic properties of this vast class of materials by accurately estimating the band gaps using statistical learning. Using easily available properties of the MXene, namely, boiling and melting points, atomic radii, phases, bond lengths, etc., as input features, models were developed using kernel ridge (KRR), support vector (SVR), Gaussian process (GPR), and bootstrap aggregating regression algorithms. Among these, the GPR model predicts the band gap with lowest root-mean-squared error (rmse) of 0.14 eV, within seconds. Most importantly, these models do not involve the Perdew–Burke–Ernzerhof (PBE) band gap as a feature. Our results demonstrate that machin...", "year": 2018, "referenceCount": 40, "citationCount": 149, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "2715558", "name": "Arunkumar Chitteth Rajan"}, {"authorId": "144767714", "name": "A. Mishra"}, {"authorId": "34099587", "name": "S. Satsangi"}, {"authorId": "95065636", "name": "R. Vaish"}, {"authorId": "50544732", "name": "H. Mizuseki"}, {"authorId": "113861144", "name": "Kwang-Ryeol Lee"}, {"authorId": "47264205", "name": "A. Singh"}]}, {"paperId": "f05155c4d7d77f32855b80a86bb987818838d50d", "url": "https://www.semanticscholar.org/paper/f05155c4d7d77f32855b80a86bb987818838d50d", "title": "EU regulations on algorithmic decision-making and a \"right to explanation\"", "abstract": "We summarize the potential impact that the European Union’s new General Data Protection Regulation will have on the routine use of machine learning algorithms. Slated to take effect as law across the EU in 2018, it will restrict automated individual decision-making (that is, algorithms that make decisions based on user-level predictors) which “significantly affect” users. The law will also create a “right to explanation,” whereby a user can ask for an explanation of an algorithmic decision that was made about them. We argue that while this law will pose large challenges for industry, it highlights opportunities for machine learning researchers to take the lead in designing algorithms and evaluation frameworks which avoid discrimination.", "year": 2016, "referenceCount": 32, "citationCount": 177, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "11025540", "name": "B. Goodman"}, {"authorId": "2127497", "name": "S. Flaxman"}]}, {"paperId": "0d49091e1676856162d9f7914c4dc472267c476d", "url": "https://www.semanticscholar.org/paper/0d49091e1676856162d9f7914c4dc472267c476d", "title": "Machine learning for medical ultrasound: status, methods, and future opportunities", "abstract": null, "year": 2018, "referenceCount": 141, "citationCount": 115, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2865214", "name": "L. Brattain"}, {"authorId": "2341494", "name": "B. Telfer"}, {"authorId": "3542003", "name": "M. Dhyani"}, {"authorId": "5483633", "name": "J. Grajo"}, {"authorId": "8132193", "name": "A. Samir"}]}, {"paperId": "2ac34a6f11c8aec576fa8951ab8b1681fa22abc6", "url": "https://www.semanticscholar.org/paper/2ac34a6f11c8aec576fa8951ab8b1681fa22abc6", "title": "Learning Image Similarity from Flickr Groups Using Fast Kernel Machines", "abstract": "Measuring image similarity is a central topic in computer vision. In this paper, we propose to measure image similarity by learning from the online Flickr image groups. We do so by: Choosing 103 Flickr groups, building a one-versus-all multiclass classifier to classify test images into a group, taking the set of responses of the classifiers as features, calculating the distance between feature vectors to measure image similarity. Experimental results on the Corel dataset and the PASCAL VOC 2007 dataset show that our approach performs better on image matching, retrieval, and classification than using conventional visual features. To build our similarity measure, we need one-versus-all classifiers that are accurate and can be trained quickly on very large quantities of data. We adopt an SVM classifier with a histogram intersection kernel. We describe a novel fast training algorithm for this classifier: the Stochastic Intersection Kernel MAchine (SIKMA) training algorithm. This method can produce a kernel classifier that is more accurate than a linear classifier on tens of thousands of examples in minutes.", "year": 2012, "referenceCount": 57, "citationCount": 55, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2096527", "name": "G. Wang"}, {"authorId": "2433269", "name": "Derek Hoiem"}, {"authorId": "144016256", "name": "D. Forsyth"}]}, {"paperId": "18000ef9b6e02308ae299c4e1e2b3a32e951a508", "url": "https://www.semanticscholar.org/paper/18000ef9b6e02308ae299c4e1e2b3a32e951a508", "title": "Prediction of premature all-cause mortality: A prospective general population cohort study comparing machine-learning and standard epidemiological approaches", "abstract": "Background Prognostic modelling using standard methods is well-established, particularly for predicting risk of single diseases. Machine-learning may offer potential to explore outcomes of even greater complexity, such as premature death. This study aimed to develop novel prediction algorithms using machine-learning, in addition to standard survival modelling, to predict premature all-cause mortality. Methods A prospective population cohort of 502,628 participants aged 40–69 years were recruited to the UK Biobank from 2006–2010 and followed-up until 2016. Participants were assessed on a range of demographic, biometric, clinical and lifestyle factors. Mortality data by ICD-10 were obtained from linkage to Office of National Statistics. Models were developed using deep learning, random forest and Cox regression. Calibration was assessed by comparing observed to predicted risks; and discrimination by area under the ‘receiver operating curve’ (AUC). Findings 14,418 deaths (2.9%) occurred over a total follow-up time of 3,508,454 person-years. A simple age and gender Cox model was the least predictive (AUC 0.689, 95% CI 0.681–0.699). A multivariate Cox regression model significantly improved discrimination by 6.2% (AUC 0.751, 95% CI 0.748–0.767). The application of machine-learning algorithms further improved discrimination by 3.2% using random forest (AUC 0.783, 95% CI 0.776–0.791) and 3.9% using deep learning (AUC 0.790, 95% CI 0.783–0.797). These ML algorithms improved discrimination by 9.4% and 10.1% respectively from a simple age and gender Cox regression model. Random forest and deep learning achieved similar levels of discrimination with no significant difference. Machine-learning algorithms were well-calibrated, while Cox regression models consistently over-predicted risk. Conclusions Machine-learning significantly improved accuracy of prediction of premature all-cause mortality in this middle-aged population, compared to standard methods. This study illustrates the value of machine-learning for risk prediction within a traditional epidemiological study design, and how this approach might be reported to assist scientific verification.", "year": 2019, "referenceCount": 38, "citationCount": 58, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "8955394", "name": "S. Weng"}, {"authorId": "145513333", "name": "L. Vaz"}, {"authorId": "4757323", "name": "N. Qureshi"}, {"authorId": "3428487", "name": "J. Kai"}]}, {"paperId": "9636b31ec96c9cc18e09785192f3377a58ac1731", "url": "https://www.semanticscholar.org/paper/9636b31ec96c9cc18e09785192f3377a58ac1731", "title": "The Definition of Insulin Resistance Using HOMA-IR for Americans of Mexican Descent Using Machine Learning", "abstract": "Objective The lack of standardized reference range for the homeostasis model assessment-estimated insulin resistance (HOMA-IR) index has limited its clinical application. This study defines the reference range of HOMA-IR index in an adult Hispanic population based with machine learning methods. Methods This study investigated a Hispanic population of 1854 adults, randomly selected on the basis of 2000 Census tract data in the city of Brownsville, Cameron County. Machine learning methods, support vector machine (SVM) and Bayesian Logistic Regression (BLR), were used to automatically identify measureable variables using standardized values that correlate with HOMA-IR; K-means clustering was then used to classify the individuals by insulin resistance. Results Our study showed that the best cutoff of HOMA-IR for identifying those with insulin resistance is 3.80. There are 39.1% individuals in this Hispanic population with HOMA-IR>3.80. Conclusions Our results are dramatically different using the popular clinical cutoff of 2.60. The high sensitivity and specificity of HOMA-IR>3.80 for insulin resistance provide a critical fundamental for our further efforts to improve the public health of this Hispanic population.", "year": 2011, "referenceCount": 17, "citationCount": 173, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "87079057", "name": "H. Qu"}, {"authorId": "2108645540", "name": "Quan Li"}, {"authorId": "5985460", "name": "A. Rentfro"}, {"authorId": "1401769191", "name": "S. Fisher-Hoch"}, {"authorId": "143863629", "name": "J. McCormick"}]}, {"paperId": "49325980ff48dd0de373f95b022efc54a22de87e", "url": "https://www.semanticscholar.org/paper/49325980ff48dd0de373f95b022efc54a22de87e", "title": "Technical note: Bias and the quantification of stability", "abstract": null, "year": 1995, "referenceCount": 25, "citationCount": 101, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1689647", "name": "Peter D. Turney"}]}, {"paperId": "2b2ae20ced8cb2ad9dffc69d2bdcb908a7910f6d", "url": "https://www.semanticscholar.org/paper/2b2ae20ced8cb2ad9dffc69d2bdcb908a7910f6d", "title": "Boosting support vector machines for imbalanced data sets", "abstract": null, "year": 2008, "referenceCount": 52, "citationCount": 326, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2115280154", "name": "Benjamin X. Wang"}, {"authorId": "1743642", "name": "N. Japkowicz"}]}, {"paperId": "e3b74d8b51cf67e07d754718d040c51c580f7db6", "url": "https://www.semanticscholar.org/paper/e3b74d8b51cf67e07d754718d040c51c580f7db6", "title": "Machine learning for the solution of the Schrödinger equation", "abstract": "Machine learning (ML) methods have recently been increasingly widely used in quantum chemistry. While ML methods are now accepted as high accuracy approaches to construct interatomic potentials for applications, the use of ML to solve the Schrödinger equation, either vibrational or electronic, while not new, is only now making significant headway towards applications. We survey recent uses of ML techniques to solve the Schrödinger equation, including the vibrational Schrödinger equation, the electronic Schrödinger equation and the related problems of constructing functionals for density functional theory (DFT) as well as potentials which enter semi-empirical approximations to DFT. We highlight similarities and differences and specific difficulties that ML faces in these applications and possibilities for cross-fertilization of ideas.", "year": 2020, "referenceCount": 161, "citationCount": 41, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "2971347", "name": "S. Manzhos"}]}, {"paperId": "d8bd3de1772432af978bbefa7bf32fa801afd99e", "url": "https://www.semanticscholar.org/paper/d8bd3de1772432af978bbefa7bf32fa801afd99e", "title": "Image-Based Cardiac Diagnosis With Machine Learning: A Review", "abstract": "Cardiac imaging plays an important role in the diagnosis of cardiovascular disease (CVD). Until now, its role has been limited to visual and quantitative assessment of cardiac structure and function. However, with the advent of big data and machine learning, new opportunities are emerging to build artificial intelligence tools that will directly assist the clinician in the diagnosis of CVDs. This paper presents a thorough review of recent works in this field and provide the reader with a detailed presentation of the machine learning methods that can be further exploited to enable more automated, precise and early diagnosis of most CVDs.", "year": 2020, "referenceCount": 112, "citationCount": 89, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1412403161", "name": "Carlos Martín-Isla"}, {"authorId": "1412401614", "name": "Víctor M. Campello"}, {"authorId": "121305817", "name": "C. Izquierdo"}, {"authorId": "1416582394", "name": "Z. Raisi-Estabragh"}, {"authorId": "1924789", "name": "B. Baessler"}, {"authorId": "144236487", "name": "S. Petersen"}, {"authorId": "2364820", "name": "K. Lekadir"}]}, {"paperId": "0b97e343364adf2409a666aaf35133b4b4b82740", "url": "https://www.semanticscholar.org/paper/0b97e343364adf2409a666aaf35133b4b4b82740", "title": "A geometric framework for machine learning", "abstract": "Due to advances in the sciences, the ability of mankind to collect data has increased enormously in recent years. In many different areas, the research bottleneck is no longer in data collection, but rather in data interpretation. Often, the underlying processes described by the data are very complex, compounding the problem. In response, much research in computer analysis of large datasets is under way. Machine learning is one of the fields responding to the challenge of this problem. \nThis thesis considers the interpretation of machine learning problems and techniques under a geometric model. Geometry is a useful for several reasons. It aids in visualization, allowing for alternative ways of thinking. It provides a rigorous framework for analyzing learning problems and methods. It suggests modifications to methods which can increase their usefulness and efficiency. \nIn this thesis, geometric analysis is used to formulate and analyze two theoretical machine learning problems and to improve an existing machine learning method. A form of best-case analysis is presented which can be used to generate bounds on the number of examples needed for learning. A formal trade-off between available memory and speed of learning is established. In addition, geometry is used to generalize the decision tree method of machine learning. An algorithm for learning based on this generalization is presented, and its usefulness is demonstrated on a variety of artificial and real-world databases.", "year": 1993, "referenceCount": 0, "citationCount": 49, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2059696865", "name": "David G. Heath"}]}, {"paperId": "2ef26af206f7ebbbd90a7d68d77a7639c8dfc6b6", "url": "https://www.semanticscholar.org/paper/2ef26af206f7ebbbd90a7d68d77a7639c8dfc6b6", "title": "Comparing machines and humans on a visual categorization test", "abstract": "Automated scene interpretation has benefited from advances in machine learning, and restricted tasks, such as face detection, have been solved with sufficient accuracy for restricted settings. However, the performance of machines in providing rich semantic descriptions of natural scenes from digital images remains highly limited and hugely inferior to that of humans. Here we quantify this “semantic gap” in a particular setting: We compare the efficiency of human and machine learning in assigning an image to one of two categories determined by the spatial arrangement of constituent parts. The images are not real, but the category-defining rules reflect the compositional structure of real images and the type of “reasoning” that appears to be necessary for semantic parsing. Experiments demonstrate that human subjects grasp the separating principles from a handful of examples, whereas the error rates of computer programs fluctuate wildly and remain far behind that of humans even after exposure to thousands of examples. These observations lend support to current trends in computer vision such as integrating machine learning with parts-based modeling.", "year": 2011, "referenceCount": 32, "citationCount": 112, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2721983", "name": "F. Fleuret"}, {"authorId": "2118549112", "name": "Ting Li"}, {"authorId": "1720207", "name": "Charles Dubout"}, {"authorId": "6403684", "name": "E. Wampler"}, {"authorId": "2054882", "name": "S. Yantis"}, {"authorId": "1707642", "name": "D. Geman"}]}, {"paperId": "b4f03a9189e5f6a037c97f57cbf7634cbaa213f5", "url": "https://www.semanticscholar.org/paper/b4f03a9189e5f6a037c97f57cbf7634cbaa213f5", "title": "Machine learning algorithms for damage detection under operational and environmental variability", "abstract": "The goal of this article is to detect structural damage in the presence of operational and environmental variations using vibration-based damage identification procedures. For this purpose, four machine learning algorithms are applied based on the auto-associative neural network, factor analysis, Mahalanobis distance, and singular value decomposition. A base-excited three-story frame structure was tested in laboratory environment to obtain time-series data from an array of accelerometers under several structural state conditions. Tests were performed with varying stiffness and mass conditions with the assumption that these sources of variability are representative of changing operational and environmental conditions. Damage is simulated through nonlinear effects introduced by a bumper mechanism that induces a repetitive, impact-type nonlinearity. This mechanism intends to simulate the cracks that open and close under dynamic loads or loose connections that rattle. The unique contribution of this study is a direct comparison of the four proposed machine learning algorithms that have been reported as reliable approaches to separate structural conditions with changes resulting from damage from changes caused by operational and environmental variations.", "year": 2011, "referenceCount": 30, "citationCount": 249, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "32568919", "name": "E. Figueiredo"}, {"authorId": "144474923", "name": "G. Park"}, {"authorId": "3151407", "name": "C. Farrar"}, {"authorId": "144789804", "name": "K. Worden"}, {"authorId": "40538472", "name": "J. Figueiras"}]}, {"paperId": "0d6ef817813d04a3b3ec6c3ce008e104fb3e587a", "url": "https://www.semanticscholar.org/paper/0d6ef817813d04a3b3ec6c3ce008e104fb3e587a", "title": "Classification Based on Decision Tree Algorithm for Machine Learning", "abstract": "Decision tree classifiers are regarded to be a standout of the most well-known methods to data classification representation of classifiers. Different researchers from various fields and backgrounds have considered the problem of extending a decision tree from available data, such as machine study, pattern recognition, and statistics. In various fields such as medical disease analysis, text classification, user smartphone classification, images, and many more the employment of Decision tree classifiers has been proposed in many ways. This paper provides a detailed approach to the decision trees. Furthermore, paper specifics, such as algorithms/approaches used, datasets, and outcomes achieved, are evaluated and outlined comprehensively. In addition, all of the approaches analyzed were discussed to illustrate the themes of the authors and identify the most accurate classifiers. As a result, the uses of different types of datasets are discussed and their findings are analyzed.", "year": 2021, "referenceCount": 85, "citationCount": 144, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2087620751", "name": "Bahzad Charbuty"}, {"authorId": "35323115", "name": "A. Abdulazeez"}]}, {"paperId": "4e5b3910084e75967d2cb627c19d8f0e60154b1e", "url": "https://www.semanticscholar.org/paper/4e5b3910084e75967d2cb627c19d8f0e60154b1e", "title": "A New Dataset and Method for Automatically Grading ESOL Texts", "abstract": "We demonstrate how supervised discriminative machine learning techniques can be used to automate the assessment of 'English as a Second or Other Language' (ESOL) examination scripts. In particular, we use rank preference learning to explicitly model the grade relationships between scripts. A number of different features are extracted and ablation tests are used to investigate their contribution to overall performance. A comparison between regression and rank preference models further supports our method. Experimental results on the first publically available dataset show that our system can achieve levels of performance close to the upper bound for the task, as defined by the agreement between human examiners on the same corpus. Finally, using a set of 'outlier' texts, we test the validity of our model and identify cases where the model's scores diverge from that of a human examiner.", "year": 2011, "referenceCount": 34, "citationCount": 451, "influentialCitationCount": 74, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2169553", "name": "H. Yannakoudakis"}, {"authorId": "145693410", "name": "Ted Briscoe"}, {"authorId": "2310842", "name": "Ben Medlock"}]}, {"paperId": "e1bb329621de73d08c47beae9b5439a1c244eb1a", "url": "https://www.semanticscholar.org/paper/e1bb329621de73d08c47beae9b5439a1c244eb1a", "title": "CSI: Novelty Detection via Contrastive Learning on Distributionally Shifted Instances", "abstract": "Novelty detection, i.e., identifying whether a given sample is drawn from outside the training distribution, is essential for reliable machine learning. To this end, there have been many attempts at learning a representation well-suited for novelty detection and designing a score based on such representation. In this paper, we propose a simple, yet effective method named contrasting shifted instances (CSI), inspired by the recent success on contrastive learning of visual representations. Specifically, in addition to contrasting a given sample with other instances as in conventional contrastive learning methods, our training scheme contrasts the sample with distributionally-shifted augmentations of itself. Based on this, we propose a new detection score that is specific to the proposed training scheme. Our experiments demonstrate the superiority of our method under various novelty detection scenarios, including unlabeled one-class, unlabeled multi-class and labeled multi-class settings, with various image benchmark datasets.", "year": 2020, "referenceCount": 87, "citationCount": 231, "influentialCitationCount": 65, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1750599181", "name": "Jihoon Tack"}, {"authorId": "9962692", "name": "Sangwoo Mo"}, {"authorId": "83125078", "name": "Jongheon Jeong"}, {"authorId": "143720148", "name": "Jinwoo Shin"}]}, {"paperId": "8bd4850cc2ac1a328deaeb97bcc76fb43284d50a", "url": "https://www.semanticscholar.org/paper/8bd4850cc2ac1a328deaeb97bcc76fb43284d50a", "title": "A Bayesian Framework for Learning Rule Sets for Interpretable Classification", "abstract": "We present a machine learning algorithm for building classifiers that are comprised of a small number of short rules. These are restricted disjunctive normal form models. An example of a classifier of this form is as follows: If X satisfies (condition A AND condition B) OR (condition C) OR ..., then Y = 1. Models of this form have the advantage of being interpretable to human experts since they produce a set of rules that concisely describe a specific class. We present two probabilistic models with prior parameters that the user can set to encourage the model to have a desired size and shape, to conform with a domain-specific definition of interpretability. We provide a scalable MAP inference approach and develop theoretical bounds to reduce computation by iteratively pruning the search space. We apply our method (Bayesian Rule Sets - BRS) to characterize and predict user behavior with respect to in-vehicle context-aware personalized recommender systems. Our method has a major advantage over classical associative classification methods and decision trees in that it does not greedily grow the model.", "year": 2017, "referenceCount": 64, "citationCount": 145, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1664686681", "name": "Tong Wang"}, {"authorId": "48395540", "name": "C. Rudin"}, {"authorId": "1388372395", "name": "Finale Doshi-Velez"}, {"authorId": "47910172", "name": "Yimin Liu"}, {"authorId": "1685285", "name": "Erica Klampfl"}, {"authorId": "72687032", "name": "P. MacNeille"}]}, {"paperId": "1e4870524f8de44d4f18c8f9f80eb797dfd25c89", "url": "https://www.semanticscholar.org/paper/1e4870524f8de44d4f18c8f9f80eb797dfd25c89", "title": "Classification with class imbalance problem: A review", "abstract": "Most existing classification approaches assume the underlying training set is evenly distributed. In class imbalanced classification, the training set for one class (majority) far surpassed the training set of the other class (minority), in which, the minority class is often the more interesting class. In this paper, we review the issues that come with learning from imbalanced class data sets and various problems in class imbalance classification. A survey on existing approaches for handling classification with imbalanced datasets is also presented. Finally, we discuss current trends and advancements which potentially could shape the future direction in class imbalance learning and classification. We also found out that the advancement of machine learning techniques would mostly benefit the big data computing in addressing the class imbalance problem which is inevitably presented in many real world applications especially in medicine and social media.", "year": 2015, "referenceCount": 161, "citationCount": 290, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2190028366", "name": "A. Ali"}, {"authorId": "49643108", "name": "S. Shamsuddin"}, {"authorId": "1952385", "name": "A. Ralescu"}]}, {"paperId": "217c3e37092bb094bf226b58f44357db5c284a60", "url": "https://www.semanticscholar.org/paper/217c3e37092bb094bf226b58f44357db5c284a60", "title": "Learning to Resolve Bridging References", "abstract": "We use machine learning techniques to find the best combination of local focus and lexical distance features for identifying the anchor of mereological bridging references. We find that using first mention, utterance distance, and lexical distance computed using either Google or WordNet results in an accuracy significantly higher than obtained in previous experiments.", "year": 2004, "referenceCount": 43, "citationCount": 113, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1678591", "name": "Massimo Poesio"}, {"authorId": "2067925708", "name": "Rahul Mehta"}, {"authorId": "2470445", "name": "Axel Maroudas"}, {"authorId": "2165202", "name": "J. Hitzeman"}]}, {"paperId": "41af363cdebb8809dabaf7d9198bf341622417db", "url": "https://www.semanticscholar.org/paper/41af363cdebb8809dabaf7d9198bf341622417db", "title": "A theoretical and empirical analysis of support vector machine methods for multiple-instance classification", "abstract": null, "year": 2014, "referenceCount": 41, "citationCount": 68, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2084141235", "name": "Gary Doran"}, {"authorId": "145527877", "name": "Soumya Ray"}]}, {"paperId": "21f214165bda8813c95cfa3e471e24aaf8d5776b", "url": "https://www.semanticscholar.org/paper/21f214165bda8813c95cfa3e471e24aaf8d5776b", "title": "Towards Explainable Artificial Intelligence", "abstract": null, "year": 2019, "referenceCount": 111, "citationCount": 232, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1699054", "name": "W. Samek"}, {"authorId": "145034054", "name": "K. Müller"}]}, {"paperId": "a50fe3b47b06451f28ea9ab5d209c5297b03c402", "url": "https://www.semanticscholar.org/paper/a50fe3b47b06451f28ea9ab5d209c5297b03c402", "title": "Learning to Control PDEs with Differentiable Physics", "abstract": "Predicting outcomes and planning interactions with the physical world are long-standing goals for machine learning. A variety of such tasks involves continuous physical systems, which can be described by partial differential equations (PDEs) with many degrees of freedom. Existing methods that aim to control the dynamics of such systems are typically limited to relatively short time frames or a small number of interaction parameters. We show that by using a differentiable PDE solver in conjunction with a novel predictor-corrector scheme, we can train neural networks to understand and control complex nonlinear physical systems over long time frames. We demonstrate that our method successfully develops an understanding of complex physical systems and learns to control them for tasks involving multiple PDEs, including the incompressible Navier-Stokes equations.", "year": 2020, "referenceCount": 72, "citationCount": 98, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "13094542", "name": "Philipp Holl"}, {"authorId": "145231047", "name": "V. Koltun"}, {"authorId": "2045078305", "name": "N. Thuerey"}]}, {"paperId": "1bd61f1f2101030ce506726917ae0c8c04906e20", "url": "https://www.semanticscholar.org/paper/1bd61f1f2101030ce506726917ae0c8c04906e20", "title": "Machine learning vortices at the Kosterlitz-Thouless transition", "abstract": "Efficient and automated classification of phases from minimally processed data is one goal of machine learning in condensed matter and statistical physics. Supervised algorithms trained on raw samples of microstates can successfully detect conventional phase transitions via learning a bulk feature such as an order parameter. In this paper, we investigate whether neural networks can learn to classify phases based on topological defects. We address this question on the two-dimensional classical XY model which exhibits a Kosterlitz-Thouless transition. We find significant feature engineering of the raw spin states is required to convincingly claim that features of the vortex configurations are responsible for learning the transition temperature. We further show a single-layer network does not correctly classify the phases of the XY model, while a convolutional network easily performs classification by learning the global magnetization. Finally, we design a deep network capable of learning vortices without feature engineering. We demonstrate the detection of vortices does not necessarily result in the best classification accuracy, especially for lattices of less than approximately 1000 spins. For larger systems, it remains a difficult task to learn vortices.", "year": 2017, "referenceCount": 53, "citationCount": 87, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics"], "authors": [{"authorId": "153369440", "name": "M. Beach"}, {"authorId": "143999820", "name": "A. Golubeva"}, {"authorId": "3422513", "name": "R. Melko"}]}, {"paperId": "be813b90620b2627226864eaf5e0f3eec9d50e85", "url": "https://www.semanticscholar.org/paper/be813b90620b2627226864eaf5e0f3eec9d50e85", "title": "A Review and Tutorial of Machine Learning Methods for Microbiome Host Trait Prediction", "abstract": "With the growing importance of microbiome research, there is increasing evidence that host variation in microbial communities is associated with overall host health. Advancement in genetic sequencing methods for microbiomes has coincided with improvements in machine learning, with important implications for disease risk prediction in humans. One aspect specific to microbiome prediction is the use of taxonomy-informed feature selection. In this review for non-experts, we explore the most commonly used machine learning methods, and evaluate their prediction accuracy as applied to microbiome host trait prediction. Methods are described at an introductory level, and R/Python code for the analyses is provided.", "year": 2019, "referenceCount": 77, "citationCount": 92, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "34661060", "name": "Yi‐Hui Zhou"}, {"authorId": "5822509", "name": "P. Gallins"}]}, {"paperId": "bbd0e204f48a45735e1065c8b90b298077b73192", "url": "https://www.semanticscholar.org/paper/bbd0e204f48a45735e1065c8b90b298077b73192", "title": "One-shot Learning with Memory-Augmented Neural Networks", "abstract": "Despite recent breakthroughs in the applications of deep neural networks, one setting that presents a persistent challenge is that of “one-shot learning.” Traditional gradient-based networks require a lot of data to learn, often through extensive iterative training. When new data is encountered, the models must inefficiently relearn their parameters to adequately incorporate the new information without catastrophic interference. Architectures with augmented memory capacities, such as Neural Turing Machines (NTMs), offer the ability to quickly encode and retrieve new information, and hence can potentially obviate the downsides of conventional models. Here, we demonstrate the ability of a memory-augmented neural network to rapidly assimilate new data, and leverage this data to make accurate predictions after only a few samples. We also introduce a new method for accessing an external memory that focuses on memory content, unlike previous methods that additionally use memory locationbased focusing mechanisms.", "year": 2016, "referenceCount": 21, "citationCount": 478, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35030998", "name": "Adam Santoro"}, {"authorId": "2258504", "name": "Sergey Bartunov"}, {"authorId": "46378362", "name": "M. Botvinick"}, {"authorId": "1688276", "name": "Daan Wierstra"}, {"authorId": "2542999", "name": "T. Lillicrap"}]}, {"paperId": "237cc12f539dd42c9b91b4337d5cdb35af6fb9ac", "url": "https://www.semanticscholar.org/paper/237cc12f539dd42c9b91b4337d5cdb35af6fb9ac", "title": "Random forest classifier combined with feature selection for breast cancer diagnosis and prognostic", "abstract": "As \nthe incidence of this disease has increased significantly in the recent \nyears, expert systems and machine learning techniques to this problem have \nalso taken a great attention from many scholars. This study aims at diagnosing \nand prognosticating breast cancer with a machine learning method based on random \nforest classifier and feature selection technique. By weighting, keeping useful \nfeatures and removing redundant features in datasets, the method was obtained \nto solve diagnosis problems via classifying Wisconsin Breast Cancer Diagnosis \nDataset and to solve prognosis problem via classifying Wisconsin Breast Cancer \nPrognostic Dataset. On these datasets we obtained classification accuracy of \n100% in the best case and of around 99.8% on average. This is very promising \ncompared to the previously reported results. This result is for Wisconsin \nBreast Cancer Dataset but it states that this method can be used confidently \nfor other breast cancer diagnosis problems, too.", "year": 2013, "referenceCount": 28, "citationCount": 180, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2061207187", "name": "Cuong Nguyen"}, {"authorId": "2153953256", "name": "Yong Wang"}, {"authorId": "153609601", "name": "Ha-Nam Nguyen"}]}, {"paperId": "9bd957c67683bc873998b242b331e9c9d6992db9", "url": "https://www.semanticscholar.org/paper/9bd957c67683bc873998b242b331e9c9d6992db9", "title": "A review of approaches to identifying patient phenotype cohorts using electronic health records", "abstract": "Objective To summarize literature describing approaches aimed at automatically identifying patients with a common phenotype. Materials and methods We performed a review of studies describing systems or reporting techniques developed for identifying cohorts of patients with specific phenotypes. Every full text article published in (1) Journal of American Medical Informatics Association, (2) Journal of Biomedical Informatics, (3) Proceedings of the Annual American Medical Informatics Association Symposium, and (4) Proceedings of Clinical Research Informatics Conference within the past 3 years was assessed for inclusion in the review. Only articles using automated techniques were included. Results Ninety-seven articles met our inclusion criteria. Forty-six used natural language processing (NLP)-based techniques, 24 described rule-based systems, 41 used statistical analyses, data mining, or machine learning techniques, while 22 described hybrid systems. Nine articles described the architecture of large-scale systems developed for determining cohort eligibility of patients. Discussion We observe that there is a rise in the number of studies associated with cohort identification using electronic medical records. Statistical analyses or machine learning, followed by NLP techniques, are gaining popularity over the years in comparison with rule-based systems. Conclusions There are a variety of approaches for classifying patients into a particular phenotype. Different techniques and data sources are used, and good performance is reported on datasets at respective institutions. However, no system makes comprehensive use of electronic medical records addressing all of their known weaknesses.", "year": 2013, "referenceCount": 104, "citationCount": 388, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1866532", "name": "Chaitanya P. Shivade"}, {"authorId": "30088877", "name": "Preethi Raghavan"}, {"authorId": "1398481836", "name": "E. Fosler-Lussier"}, {"authorId": "1797944", "name": "P. Embí"}, {"authorId": "2763493", "name": "Noémie Elhadad"}, {"authorId": "47163349", "name": "Stephen B. Johnson"}, {"authorId": "145812029", "name": "A. Lai"}]}, {"paperId": "df9bef5d2f21530e23ec0deeef0c9ea515e594f8", "url": "https://www.semanticscholar.org/paper/df9bef5d2f21530e23ec0deeef0c9ea515e594f8", "title": "Image Denoising Using the Higher Order Singular Value Decomposition", "abstract": "In this paper, we propose a very simple and elegant patch-based, machine learning technique for image denoising using the higher order singular value decomposition (HOSVD). The technique simply groups together similar patches from a noisy image (with similarity defined by a statistically motivated criterion) into a 3D stack, computes the HOSVD coefficients of this stack, manipulates these coefficients by hard thresholding, and inverts the HOSVD transform to produce the final filtered image. Our technique chooses all required parameters in a principled way, relating them to the noise model. We also discuss our motivation for adopting the HOSVD as an appropriate transform for image denoising. We experimentally demonstrate the excellent performance of the technique on grayscale as well as color images. On color images, our method produces state-of-the-art results, outperforming other color image denoising algorithms at moderately high noise levels. A criterion for optimal patch-size selection and noise variance estimation from the residual images (after denoising) is also presented.", "year": 2013, "referenceCount": 50, "citationCount": 309, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "1787350868", "name": "Ajit Rajwade"}, {"authorId": "145257017", "name": "Anand Rangarajan"}, {"authorId": "143946674", "name": "Arunava Banerjee"}]}, {"paperId": "1eb1c5f369da4f90c8f763f778a21c49cc605117", "url": "https://www.semanticscholar.org/paper/1eb1c5f369da4f90c8f763f778a21c49cc605117", "title": "Detection of Adversarial Training Examples in Poisoning Attacks through Anomaly Detection", "abstract": "Machine learning has become an important component for many systems and applications including computer vision, spam filtering, malware and network intrusion detection, among others. Despite the capabilities of machine learning algorithms to extract valuable information from data and produce accurate predictions, it has been shown that these algorithms are vulnerable to attacks. Data poisoning is one of the most relevant security threats against machine learning systems, where attackers can subvert the learning process by injecting malicious samples in the training data. Recent work in adversarial machine learning has shown that the so-called optimal attack strategies can successfully poison linear classifiers, degrading the performance of the system dramatically after compromising a small fraction of the training dataset. In this paper we propose a defence mechanism to mitigate the effect of these optimal poisoning attacks based on outlier detection. We show empirically that the adversarial examples generated by these attack strategies are quite different from genuine points, as no detectability constrains are considered to craft the attack. Hence, they can be detected with an appropriate pre-filtering of the training dataset.", "year": 2018, "referenceCount": 35, "citationCount": 90, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3055305", "name": "Andrea Paudice"}, {"authorId": "1399031454", "name": "Luis Muñoz-González"}, {"authorId": "145350541", "name": "A. György"}, {"authorId": "1791748", "name": "Emil C. Lupu"}]}, {"paperId": "516c6c89dc29c489878e2a7570c6315ad93fefe6", "url": "https://www.semanticscholar.org/paper/516c6c89dc29c489878e2a7570c6315ad93fefe6", "title": "Robust machine learning by median-of-means: Theory and practice", "abstract": "We introduce new estimators for robust machine learning based on median-of-means (MOM) estimators of the mean of real valued random variables. These estimators achieve optimal rates of convergence under minimal assumptions on the dataset. The dataset may also have been corrupted by outliers on which no assumption is granted. We also analyze these new estimators with standard tools from robust statistics. In particular, we revisit the concept of breakdown point. We modify the original definition by studying the number of outliers that a dataset can contain without deteriorating the estimation properties of a given estimator. This new notion of breakdown number, that takes into account the statistical performances of the estimators, is non-asymptotic in nature and adapted for machine learning purposes. We proved that the breakdown number of our estimator is of the order of (number of observations)*(rate of convergence). For instance, the breakdown number of our estimators for the problem of estimation of a d-dimensional vector with a noise variance sigma^2 is sigma^2d and it becomes sigma^2 s log(d/s) when this vector has only s non-zero component. Beyond this breakdown point, we proved that the rate of convergence achieved by our estimator is (number of outliers) divided by (number of observation). \nBesides these theoretical guarantees, the major improvement brought by these new estimators is that they are easily computable in practice. In fact, basically any algorithm used to approximate the standard Empirical Risk Minimizer (or its regularized versions) has a robust version approximating our estimators. As a proof of concept, we study many algorithms for the classical LASSO estimator. A byproduct of the MOM algorithms is a measure of depth of data that can be used to detect outliers.", "year": 2017, "referenceCount": 116, "citationCount": 112, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2084337661", "name": "G. Lecu'e"}, {"authorId": "2202029", "name": "M. Lerasle"}]}, {"paperId": "ed29c6d08568849c96a525d66ed84aaad55507a8", "url": "https://www.semanticscholar.org/paper/ed29c6d08568849c96a525d66ed84aaad55507a8", "title": "Memetic Extreme Learning Machine", "abstract": null, "year": 2016, "referenceCount": 48, "citationCount": 55, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2055267", "name": "Yongshan Zhang"}, {"authorId": "2109176347", "name": "Jia Wu"}, {"authorId": "145126412", "name": "Z. Cai"}, {"authorId": "2151328693", "name": "Peng Zhang"}, {"authorId": "2119322767", "name": "Ling Chen"}]}, {"paperId": "8b7a185629d5480d207b2d3d74790b9b2ab17015", "url": "https://www.semanticscholar.org/paper/8b7a185629d5480d207b2d3d74790b9b2ab17015", "title": "Assuring the Machine Learning Lifecycle: Desiderata, Methods, and Challenges", "abstract": "Machine learning has evolved into an enabling technology for a wide range of highly successful applications. The potential for this success to continue and accelerate has placed machine learning (ML) at the top of research, economic and political agendas. Such unprecedented interest is fuelled by a vision of ML applicability extending to healthcare, transportation, defence and other domains of great societal importance. Achieving this vision requires the use of ML in safety-critical applications that demand levels of assurance beyond those needed for current ML applications. Our paper provides a comprehensive survey of the state-of-the-art in the assurance of ML, i.e. in the generation of evidence that ML is sufficiently safe for its intended use. The survey covers the methods capable of providing such evidence at different stages of the machine learning lifecycle, i.e. of the complex, iterative process that starts with the collection of the data used to train an ML component for a system, and ends with the deployment of that component within the system. The paper begins with a systematic presentation of the ML lifecycle and its stages. We then define assurance desiderata for each stage, review existing methods that contribute to achieving these desiderata, and identify open challenges that require further research.", "year": 2019, "referenceCount": 181, "citationCount": 102, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "4128943", "name": "Rob Ashmore"}, {"authorId": "143665272", "name": "R. Calinescu"}, {"authorId": "37212373", "name": "Colin Paterson"}]}, {"paperId": "e6c20ed0c3f375f403ab5d750a6e9699d5c3af6a", "url": "https://www.semanticscholar.org/paper/e6c20ed0c3f375f403ab5d750a6e9699d5c3af6a", "title": "A Trainable System for Object Detection", "abstract": null, "year": 2000, "referenceCount": 38, "citationCount": 1428, "influentialCitationCount": 92, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145030811", "name": "C. Papageorgiou"}, {"authorId": "1685292", "name": "T. Poggio"}]}, {"paperId": "da048cdf883f2ac0551162cb1abd7e6d09e8e86a", "url": "https://www.semanticscholar.org/paper/da048cdf883f2ac0551162cb1abd7e6d09e8e86a", "title": "Sensitivity Analysis of k-Fold Cross Validation in Prediction Error Estimation", "abstract": "In the machine learning field, the performance of a classifier is usually measured in terms of prediction error. In most real-world problems, the error cannot be exactly calculated and it must be estimated. Therefore, it is important to choose an appropriate estimator of the error. This paper analyzes the statistical properties, bias and variance, of the k-fold cross-validation classification error estimator (k-cv). Our main contribution is a novel theoretical decomposition of the variance of the k-cv considering its sources of variance: sensitivity to changes in the training set and sensitivity to changes in the folds. The paper also compares the bias and variance of the estimator for different values of k. The experimental study has been performed in artificial domains because they allow the exact computation of the implied quantities and we can rigorously specify the conditions of experimentation. The experimentation has been performed for two classifiers (naive Bayes and nearest neighbor), different numbers of folds, sample sizes, and training sets coming from assorted probability distributions. We conclude by including some practical recommendation on the use of k-fold cross validation.", "year": 2010, "referenceCount": 33, "citationCount": 1024, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2116899260", "name": "J. D. Rodríguez"}, {"authorId": "2110404467", "name": "Aritz Pérez Martínez"}, {"authorId": "144762651", "name": "J. A. Lozano"}]}, {"paperId": "2d274145be01169ab329252524cb9314f5f469c1", "url": "https://www.semanticscholar.org/paper/2d274145be01169ab329252524cb9314f5f469c1", "title": "Music Genre Classification using Machine Learning Techniques", "abstract": "Categorizing music files according to their genre is a challenging task in the area of music information retrieval (MIR). In this study, we compare the performance of two classes of models. The first is a deep learning approach wherein a CNN model is trained end-to-end, to predict the genre label of an audio signal, solely using its spectrogram. The second approach utilizes hand-crafted features, both from the time domain and the frequency domain. We train four traditional machine learning classifiers with these features and compare their performance. The features that contribute the most towards this multi-class classification task are identified. The experiments are conducted on the Audio set data set and we report an AUC value of 0.894 for an ensemble classifier which combines the two proposed approaches.", "year": 2018, "referenceCount": 37, "citationCount": 68, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "22168594", "name": "Hareesh Bahuleyan"}]}, {"paperId": "ae36fe2f70e0ff2f1e7c7281b9add0f5baf7b46f", "url": "https://www.semanticscholar.org/paper/ae36fe2f70e0ff2f1e7c7281b9add0f5baf7b46f", "title": "Online Support Vector Regression", "abstract": "Many approaches for obtaining systems with intelligent behavior are based on components that learn automatically from previous experience. The development of these learning techniques is the objective of the area of research known as machine learning. During the last decade, researchers have produced numerous and outstanding advances in this area, boosted by the successful application of machine learning techniques. This thesis presents one of this techniques, an online version of the algorithm for training the support vector machine for regression and also how it has been extended in order to be more flexible for the hyper parameter estimation. Furthermore the algorithm has been compared with a batch implementation and tested in a real application at the Department of Information, Systematics and Telematics in Genoa.", "year": 2007, "referenceCount": 24, "citationCount": 96, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47465582", "name": "Francesco Parrella"}]}, {"paperId": "8f9fd9a908d19534407ee2168e8fa1e72c478bb2", "url": "https://www.semanticscholar.org/paper/8f9fd9a908d19534407ee2168e8fa1e72c478bb2", "title": "Mobile detection of autism through machine learning on home video: A development and prospective validation study", "abstract": "Background The standard approaches to diagnosing autism spectrum disorder (ASD) evaluate between 20 and 100 behaviors and take several hours to complete. This has in part contributed to long wait times for a diagnosis and subsequent delays in access to therapy. We hypothesize that the use of machine learning analysis on home video can speed the diagnosis without compromising accuracy. We have analyzed item-level records from 2 standard diagnostic instruments to construct machine learning classifiers optimized for sparsity, interpretability, and accuracy. In the present study, we prospectively test whether the features from these optimized models can be extracted by blinded nonexpert raters from 3-minute home videos of children with and without ASD to arrive at a rapid and accurate machine learning autism classification. Methods and findings We created a mobile web portal for video raters to assess 30 behavioral features (e.g., eye contact, social smile) that are used by 8 independent machine learning models for identifying ASD, each with >94% accuracy in cross-validation testing and subsequent independent validation from previous work. We then collected 116 short home videos of children with autism (mean age = 4 years 10 months, SD = 2 years 3 months) and 46 videos of typically developing children (mean age = 2 years 11 months, SD = 1 year 2 months). Three raters blind to the diagnosis independently measured each of the 30 features from the 8 models, with a median time to completion of 4 minutes. Although several models (consisting of alternating decision trees, support vector machine [SVM], logistic regression (LR), radial kernel, and linear SVM) performed well, a sparse 5-feature LR classifier (LR5) yielded the highest accuracy (area under the curve [AUC]: 92% [95% CI 88%–97%]) across all ages tested. We used a prospectively collected independent validation set of 66 videos (33 ASD and 33 non-ASD) and 3 independent rater measurements to validate the outcome, achieving lower but comparable accuracy (AUC: 89% [95% CI 81%–95%]). Finally, we applied LR to the 162-video-feature matrix to construct an 8-feature model, which achieved 0.93 AUC (95% CI 0.90–0.97) on the held-out test set and 0.86 on the validation set of 66 videos. Validation on children with an existing diagnosis limited the ability to generalize the performance to undiagnosed populations. Conclusions These results support the hypothesis that feature tagging of home videos for machine learning classification of autism can yield accurate outcomes in short time frames, using mobile devices. Further work will be needed to confirm that this approach can accelerate autism diagnosis at scale.", "year": 2018, "referenceCount": 51, "citationCount": 103, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "51995164", "name": "Q. Tariq"}, {"authorId": "34240128", "name": "J. Daniels"}, {"authorId": "20482280", "name": "J. Schwartz"}, {"authorId": "145086898", "name": "P. Washington"}, {"authorId": "3079884", "name": "H. Kalantarian"}, {"authorId": "145968749", "name": "D. Wall"}]}, {"paperId": "19444e75dd2bb6f4ea190314a518e83f89b95bd8", "url": "https://www.semanticscholar.org/paper/19444e75dd2bb6f4ea190314a518e83f89b95bd8", "title": "A Comparative Study of Training Algorithms for Supervised Machine Learning", "abstract": "Classification in data mining has gained a lot of importance in literature and it has a great deal of application areas from medicine to astronomy, from banking to text classification.. It can be described as supervised learning algorithm as it assigns class labels to data objects based on the relationship between the data items with a pre-defined class label. The classification techniques are help to learn a model from a set of training data and to classify a test data well into one of the classes. This research is related to the study of the existing classification algorithm and their comparative in terms of speed, accuracy, scalability and other issues which in turn would help other researchers in studying the existing algorithms as well as developing innovative algorithms for applications or requirements which are not available.", "year": 2012, "referenceCount": 30, "citationCount": 145, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8228415", "name": "Hetal Bhavsar"}, {"authorId": "2063948359", "name": "Amit Ganatra"}]}, {"paperId": "99f486ae58cfb29f48ce0a5c07b34e2c9f37f6f7", "url": "https://www.semanticscholar.org/paper/99f486ae58cfb29f48ce0a5c07b34e2c9f37f6f7", "title": "Towards a Cure for BCI Illiteracy", "abstract": null, "year": 2009, "referenceCount": 28, "citationCount": 407, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1753498", "name": "C. Vidaurre"}, {"authorId": "3156886", "name": "B. Blankertz"}]}, {"paperId": "4844150f7aefd3c449c3bd81e94581ff0061037e", "url": "https://www.semanticscholar.org/paper/4844150f7aefd3c449c3bd81e94581ff0061037e", "title": "Computer Vision: Models, Learning, and Inference", "abstract": "This modern treatment of computer vision focuses on learning and inference in probabilistic models as a unifying theme. It shows how to use training data to learn the relationships between the observed image data and the aspects of the world that we wish to estimate, such as the 3D structure or the object class, and how to exploit these relationships to make new inferences about the world from new image data. With minimal prerequisites, the book starts from the basics of probability and model fitting and works up to real examples that the reader can implement and modify to build useful vision systems. Primarily meant for advanced undergraduate and graduate students, the detailed methodological presentation will also be useful for practitioners of computer vision. - Covers cutting-edge techniques, including graph cuts, machine learning, and multiple view geometry. - A unified approach shows the common basis for solutions of important computer vision problems, such as camera calibration, face recognition, and object tracking. - More than 70 algorithms are described in sufficient detail to implement. - More than 350 full-color illustrations amplify the text. - The treatment is self-contained, including all of the background mathematics. - Additional resources at www.computervisionmodels.com.", "year": 2012, "referenceCount": 3, "citationCount": 457, "influentialCitationCount": 35, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144827387", "name": "S. Prince"}]}, {"paperId": "7e38eebdfebf442adcbacb04adbb7549cbcc52d0", "url": "https://www.semanticscholar.org/paper/7e38eebdfebf442adcbacb04adbb7549cbcc52d0", "title": "Real-Time Detection System of Driver Distraction Using Machine Learning", "abstract": "There is accumulating evidence that driver distraction is a leading cause of vehicle crashes and incidents. In particular, increased use of so-called in-vehicle information systems (IVIS) and partially autonomous driving assistance systems (PADAS) have raised important and growing safety concerns. Thus, detecting the driver's state is of paramount importance, to adapt IVIS and PADAS accordingly, therefore avoiding or mitigating their possible negative effects. The purpose of this paper is to show a method for the nonintrusive and real-time detection of visual distraction, using vehicle dynamics data and without using the eye-tracker data as inputs to classifiers. Specifically, we present and compare different models that are based on well-known machine learning (ML) methods. Data for training the models were collected using a static driving simulator, with real human subjects performing a specific secondary task [i.e., a surrogate visual research task (SURT)] while driving. Different training methods, model characteristics, and feature selection criteria have been compared. Based on our results, using a support vector machine (SVM) has outperformed all the other ML methods, providing the highest classification rate for most of the subjects. Potential applications of this paper include the design of an adaptive IVIS and of a “smarter” PADAS.", "year": 2013, "referenceCount": 65, "citationCount": 118, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "1701951", "name": "F. Tango"}, {"authorId": "1777263", "name": "M. Botta"}]}, {"paperId": "2567a27bca06d4c409a1a603281cb78e68f233b1", "url": "https://www.semanticscholar.org/paper/2567a27bca06d4c409a1a603281cb78e68f233b1", "title": "Personalized machine learning for robot perception of affect and engagement in autism therapy", "abstract": "Personalized machine learning enables robot perception of children’s affective states and engagement during robot-assisted autism therapy. Robots have the potential to facilitate future therapies for children on the autism spectrum. However, existing robots are limited in their ability to automatically perceive and respond to human affect, which is necessary for establishing and maintaining engaging interactions. Their inference challenge is made even harder by the fact that many individuals with autism have atypical and unusually diverse styles of expressing their affective-cognitive states. To tackle the heterogeneity in children with autism, we used the latest advances in deep learning to formulate a personalized machine learning (ML) framework for automatic perception of the children’s affective states and engagement during robot-assisted autism therapy. Instead of using the traditional one-size-fits-all ML approach, we personalized our framework to each child using their contextual information (demographics and behavioral assessment scores) and individual characteristics. We evaluated this framework on a multimodal (audio, video, and autonomic physiology) data set of 35 children (ages 3 to 13) with autism, from two cultures (Asia and Europe), and achieved an average agreement (intraclass correlation) of ~60% with human experts in the estimation of affect and engagement, also outperforming nonpersonalized ML solutions. These results demonstrate the feasibility of robot perception of affect and engagement in children with autism and have implications for the design of future autism therapies.", "year": 2018, "referenceCount": 125, "citationCount": 183, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Psychology", "Computer Science", "Medicine", "Engineering"], "authors": [{"authorId": "143776835", "name": "Ognjen Rudovic"}, {"authorId": "77537854", "name": "Jaeryoung Lee"}, {"authorId": "1392261251", "name": "Miles Dai"}, {"authorId": "145411696", "name": "Björn Schuller"}, {"authorId": "1719389", "name": "Rosalind W. Picard"}]}, {"paperId": "04899a75c7e815a5d21b99da8c3de952932f7388", "url": "https://www.semanticscholar.org/paper/04899a75c7e815a5d21b99da8c3de952932f7388", "title": "Building a Basic Block Instruction Scheduler with Reinforcement Learning and Rollouts", "abstract": null, "year": 2002, "referenceCount": 39, "citationCount": 46, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2299685", "name": "A. McGovern"}, {"authorId": "143852087", "name": "J. Moss"}, {"authorId": "1730590", "name": "A. Barto"}]}, {"paperId": "62c15846197d81d7e3ada08fa80e6adf89ff83a3", "url": "https://www.semanticscholar.org/paper/62c15846197d81d7e3ada08fa80e6adf89ff83a3", "title": "Empirical Support for Winnow and Weighted-Majority Algorithms: Results on a Calendar Scheduling Domain", "abstract": null, "year": 2004, "referenceCount": 18, "citationCount": 196, "influentialCitationCount": 28, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1690967", "name": "A. Blum"}]}, {"paperId": "55212c3934663fc825842e85980f74b4254eaeb0", "url": "https://www.semanticscholar.org/paper/55212c3934663fc825842e85980f74b4254eaeb0", "title": "A parallel genetic/neural network learning algorithm for MIMD shared memory machines", "abstract": "A new algorithm is presented for training of multilayer feedforward neural networks by integrating a genetic algorithm with an adaptive conjugate gradient neural network learning algorithm. The parallel hybrid learning algorithm has been implemented in C on an MIMD shared memory machine (Cray Y-MP8/864 supercomputer). It has been applied to two different domains, engineering design and image recognition. The performance of the algorithm has been evaluated by applying it to three examples. The superior convergence property of the parallel hybrid neural network learning algorithm presented in this paper is demonstrated.", "year": 1994, "referenceCount": 19, "citationCount": 151, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2830443", "name": "S. Hung"}, {"authorId": "1750050", "name": "H. Adeli"}]}, {"paperId": "8705455a11ba05178035d29aa234a05afdd28bb5", "url": "https://www.semanticscholar.org/paper/8705455a11ba05178035d29aa234a05afdd28bb5", "title": "Fast relational learning using bottom clause propositionalization with artificial neural networks", "abstract": null, "year": 2013, "referenceCount": 58, "citationCount": 111, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2955030", "name": "M. França"}, {"authorId": "1753715", "name": "Gerson Zaverucha"}, {"authorId": "2925941", "name": "A. Garcez"}]}, {"paperId": "cbff26682ca59509b58b350a955978974d967a60", "url": "https://www.semanticscholar.org/paper/cbff26682ca59509b58b350a955978974d967a60", "title": "Closed-loop optimization of fast-charging protocols for batteries with machine learning", "abstract": null, "year": 2020, "referenceCount": 46, "citationCount": 264, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "51292612", "name": "Peter M. Attia"}, {"authorId": "1954250", "name": "Aditya Grover"}, {"authorId": "47243380", "name": "Norman Jin"}, {"authorId": "2781167", "name": "K. Severson"}, {"authorId": "14113256", "name": "Todor Markov"}, {"authorId": "2114120889", "name": "Yang-Hung Liao"}, {"authorId": "2107951564", "name": "Michael H. Chen"}, {"authorId": "13163240", "name": "B. Cheong"}, {"authorId": "2056753463", "name": "Nicholas Perkins"}, {"authorId": "2111906467", "name": "Zi Yang"}, {"authorId": "144509011", "name": "Patrick K. Herring"}, {"authorId": "7995028", "name": "Muratahan Aykol"}, {"authorId": "2113975130", "name": "Stephen J. Harris"}, {"authorId": "144960825", "name": "R. Braatz"}, {"authorId": "2490652", "name": "S. Ermon"}, {"authorId": "3992087", "name": "W. Chueh"}]}, {"paperId": "08b88af20db007702b57ddcbe0539681b6d3d558", "url": "https://www.semanticscholar.org/paper/08b88af20db007702b57ddcbe0539681b6d3d558", "title": "A Proposal on Machine Learning via Dynamical Systems", "abstract": null, "year": 2017, "referenceCount": 0, "citationCount": 63, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "48145954", "name": "W. E"}]}, {"paperId": "3708f00373fe90df42ac9738644573d474bb794c", "url": "https://www.semanticscholar.org/paper/3708f00373fe90df42ac9738644573d474bb794c", "title": "Identification of neural connectivity signatures of autism using machine learning", "abstract": "Alterations in interregional neural connectivity have been suggested as a signature of the pathobiology of autism. There have been many reports of functional and anatomical connectivity being altered while individuals with autism are engaged in complex cognitive and social tasks. Although disrupted instantaneous correlation between cortical regions observed from functional MRI is considered to be an explanatory model for autism, the causal influence of a brain area on another (effective connectivity) is a vital link missing in these studies. The current study focuses on addressing this in an fMRI study of Theory-of-Mind (ToM) in 15 high-functioning adolescents and adults with autism and 15 typically developing control participants. Participants viewed a series of comic strip vignettes in the MRI scanner and were asked to choose the most logical end to the story from three alternatives, separately for trials involving physical and intentional causality. The mean time series, extracted from 18 activated regions of interest, were processed using a multivariate autoregressive model (MVAR) to obtain the causality matrices for each of the 30 participants. These causal connectivity weights, along with assessment scores, functional connectivity values, and fractional anisotropy obtained from DTI data for each participant, were submitted to a recursive cluster elimination based support vector machine classifier to determine the accuracy with which the classifier can predict a novel participant's group membership (autism or control). We found a maximum classification accuracy of 95.9% with 19 features which had the highest discriminative ability between the groups. All of the 19 features were effective connectivity paths, indicating that causal information may be critical in discriminating between autism and control groups. These effective connectivity paths were also found to be significantly greater in controls as compared to ASD participants and consisted predominantly of outputs from the fusiform face area and middle temporal gyrus indicating impaired connectivity in ASD participants, particularly in the social brain areas. These findings collectively point toward the fact that alterations in causal connectivity in the brain in ASD could serve as a potential non-invasive neuroimaging signature for autism.", "year": 2013, "referenceCount": 99, "citationCount": 143, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "143879680", "name": "G. Deshpande"}, {"authorId": "4244657", "name": "Lauren E. Libero"}, {"authorId": "34588174", "name": "K. Sreenivasan"}, {"authorId": "32128988", "name": "H. Deshpande"}, {"authorId": "1694923", "name": "R. Kana"}]}, {"paperId": "74f23063ca77f5b1caa3770a5957ae5fc565843e", "url": "https://www.semanticscholar.org/paper/74f23063ca77f5b1caa3770a5957ae5fc565843e", "title": "Multi-Task Learning with Deep Neural Networks: A Survey", "abstract": "Multi-task learning (MTL) is a subfield of machine learning in which multiple tasks are simultaneously learned by a shared model. Such approaches offer advantages like improved data efficiency, reduced overfitting through shared representations, and fast learning by leveraging auxiliary information. However, the simultaneous learning of multiple tasks presents new design and optimization challenges, and choosing which tasks should be learned jointly is in itself a non-trivial problem. In this survey, we give an overview of multi-task learning methods for deep neural networks, with the aim of summarizing both the well-established and most recent directions within the field. Our discussion is structured according to a partition of the existing deep MTL techniques into three groups: architectures, optimization methods, and task relationship learning. We also provide a summary of common multi-task benchmarks.", "year": 2020, "referenceCount": 176, "citationCount": 174, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145868671", "name": "M. Crawshaw"}]}, {"paperId": "5817758f0c0fe5242239fa8fe32aba713c893e11", "url": "https://www.semanticscholar.org/paper/5817758f0c0fe5242239fa8fe32aba713c893e11", "title": "DeepSynergy: predicting anti-cancer drug synergy with Deep Learning", "abstract": "Abstract Motivation While drug combination therapies are a well-established concept in cancer treatment, identifying novel synergistic combinations is challenging due to the size of combinatorial space. However, computational approaches have emerged as a time- and cost-efficient way to prioritize combinations to test, based on recently available large-scale combination screening data. Recently, Deep Learning has had an impact in many research areas by achieving new state-of-the-art model performance. However, Deep Learning has not yet been applied to drug synergy prediction, which is the approach we present here, termed DeepSynergy. DeepSynergy uses chemical and genomic information as input information, a normalization strategy to account for input data heterogeneity, and conical layers to model drug synergies. Results DeepSynergy was compared to other machine learning methods such as Gradient Boosting Machines, Random Forests, Support Vector Machines and Elastic Nets on the largest publicly available synergy dataset with respect to mean squared error. DeepSynergy significantly outperformed the other methods with an improvement of 7.2% over the second best method at the prediction of novel drug combinations within the space of explored drugs and cell lines. At this task, the mean Pearson correlation coefficient between the measured and the predicted values of DeepSynergy was 0.73. Applying DeepSynergy for classification of these novel drug combinations resulted in a high predictive performance of an AUC of 0.90. Furthermore, we found that all compared methods exhibit low predictive performance when extrapolating to unexplored drugs or cell lines, which we suggest is due to limitations in the size and diversity of the dataset. We envision that DeepSynergy could be a valuable tool for selecting novel synergistic drug combinations. Availability and implementation DeepSynergy is available via www.bioinf.jku.at/software/DeepSynergy. Supplementary information Supplementary data are available at Bioinformatics online.", "year": 2017, "referenceCount": 78, "citationCount": 210, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "32764807", "name": "Kristina Preuer"}, {"authorId": "49350357", "name": "Richard P. I. Lewis"}, {"authorId": "3308557", "name": "S. Hochreiter"}, {"authorId": "144917032", "name": "A. Bender"}, {"authorId": "3044083", "name": "K. Bulusu"}, {"authorId": "1994964", "name": "G. Klambauer"}]}, {"paperId": "90906360c6477ff9f7ccf6f3bf017761319e6f2c", "url": "https://www.semanticscholar.org/paper/90906360c6477ff9f7ccf6f3bf017761319e6f2c", "title": "Machine Learning in Radiology: Applications Beyond Image Interpretation.", "abstract": null, "year": 2017, "referenceCount": 74, "citationCount": 156, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144102963", "name": "P. Lakhani"}, {"authorId": "3433725", "name": "A. Prater"}, {"authorId": "144234583", "name": "R. K. Hutson"}, {"authorId": "1798929", "name": "K. Andriole"}, {"authorId": "26654844", "name": "K. Dreyer"}, {"authorId": "4573784", "name": "J. Morey"}, {"authorId": "144477836", "name": "L. Prevedello"}, {"authorId": "2055225357", "name": "Toshi J Clark"}, {"authorId": "144304449", "name": "J. R. Geis"}, {"authorId": "2549354", "name": "J. Itri"}, {"authorId": "145116269", "name": "C. Hawkins"}]}, {"paperId": "67b60c720e9691c0d98dbd0b9004e99e6da3fc47", "url": "https://www.semanticscholar.org/paper/67b60c720e9691c0d98dbd0b9004e99e6da3fc47", "title": "Efficient Vector Representation for Documents through Corruption", "abstract": "We present an efficient document representation learning framework, Document Vector through Corruption (Doc2VecC). Doc2VecC represents each document as a simple average of word embeddings. It ensures a representation generated as such captures the semantic meanings of the document during learning. A corruption model is included, which introduces a data-dependent regularization that favors informative or rare words while forcing the embeddings of common and non-discriminative ones to be close to zero. Doc2VecC produces significantly better word embeddings than Word2Vec. We compare Doc2VecC with several state-of-the-art document representation learning algorithms. The simple model architecture introduced by Doc2VecC matches or out-performs the state-of-the-art in generating high-quality document representations for sentiment analysis, document classification as well as semantic relatedness tasks. The simplicity of the model enables training on billions of words per hour on a single machine. At the same time, the model is very efficient in generating representations of unseen documents at test time.", "year": 2017, "referenceCount": 37, "citationCount": 106, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1743082", "name": "Minmin Chen"}]}, {"paperId": "72b8755982c433362b6e7e79d2830b9e98b28581", "url": "https://www.semanticscholar.org/paper/72b8755982c433362b6e7e79d2830b9e98b28581", "title": "ABNER: an open source tool for automatically tagging genes, proteins and other entity names in text", "abstract": "ABNER (A Biomedical Named Entity Recognizer) is an open source software tool for molecular biology text mining. At its core is a machine learning system using conditional random fields with a variety of orthographic and contextual features. The latest version is 1.5, which has an intuitive graphical interface and includes two modules for tagging entities (e.g. protein and cell line) trained on standard corpora, for which performance is roughly state of the art. It also includes a Java application programming interface allowing users to incorporate ABNER into their own systems and train models on new corpora.", "year": 2005, "referenceCount": 8, "citationCount": 494, "influentialCitationCount": 52, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1717452", "name": "Burr Settles"}]}, {"paperId": "6f35b070c250507dbec8a7365cf01b25eb66d792", "url": "https://www.semanticscholar.org/paper/6f35b070c250507dbec8a7365cf01b25eb66d792", "title": "Ex Machina: Personal Attacks Seen at Scale", "abstract": "The damage personal attacks cause to online discourse motivates many platforms to try to curb the phenomenon. However, understanding the prevalence and impact of personal attacks in online platforms at scale remains surprisingly difficult. The contribution of this paper is to develop and illustrate a method that combines crowdsourcing and machine learning to analyze personal attacks at scale. We show an evaluation method for a classifier in terms of the aggregated number of crowd-workers it can approximate. We apply our methodology to English Wikipedia, generating a corpus of over 100k high quality human-labeled comments and 63M machine-labeled ones from a classifier that is as good as the aggregate of 3 crowd-workers, as measured by the area under the ROC curve and Spearman correlation. Using this corpus of machine-labeled scores, our methodology allows us to explore some of the open questions about the nature of online personal attacks. This reveals that the majority of personal attacks on Wikipedia are not the result of a few malicious users, nor primarily the consequence of allowing anonymous contributions from unregistered users.", "year": 2016, "referenceCount": 41, "citationCount": 542, "influentialCitationCount": 105, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2618745", "name": "Ellery Wulczyn"}, {"authorId": "2665391", "name": "Nithum Thain"}, {"authorId": "2065639113", "name": "Lucas Dixon"}]}, {"paperId": "3f1750fa8779b9e90f12f6d2b29db3d6ca533e92", "url": "https://www.semanticscholar.org/paper/3f1750fa8779b9e90f12f6d2b29db3d6ca533e92", "title": "Multilayer Extreme Learning Machine With Subnetwork Nodes for Representation Learning", "abstract": "The extreme learning machine (ELM), which was originally proposed for “generalized” single-hidden layer feedforward neural networks, provides efficient unified learning solutions for the applications of clustering, regression, and classification. It presents competitive accuracy with superb efficiency in many applications. However, ELM with subnetwork nodes architecture has not attracted much research attentions. Recently, many methods have been proposed for supervised/unsupervised dimension reduction or representation learning, but these methods normally only work for one type of problem. This paper studies the general architecture of multilayer ELM (ML-ELM) with subnetwork nodes, showing that: 1) the proposed method provides a representation learning platform with unsupervised/supervised and compressed/sparse representation learning and 2) experimental results on ten image datasets and 16 classification datasets show that, compared to other conventional feature learning methods, the proposed ML-ELM with subnetwork nodes performs competitively or much better than other feature learning methods.", "year": 2016, "referenceCount": 69, "citationCount": 68, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2108776795", "name": "Yimin Yang"}, {"authorId": "2107692485", "name": "Q. M. Wu"}]}, {"paperId": "ac047ab231894655918a74bdc8635a192d08adce", "url": "https://www.semanticscholar.org/paper/ac047ab231894655918a74bdc8635a192d08adce", "title": "Stable machine-learning parameterization of subgrid processes for climate modeling at a range of resolutions", "abstract": null, "year": 2020, "referenceCount": 56, "citationCount": 101, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Environmental Science", "Medicine"], "authors": [{"authorId": "5276672", "name": "J. Yuval"}, {"authorId": "1393698376", "name": "P. O’Gorman"}]}, {"paperId": "3ab11a96f6c475afa7e5977886da301be4ed2f7f", "url": "https://www.semanticscholar.org/paper/3ab11a96f6c475afa7e5977886da301be4ed2f7f", "title": "Tux2: Distributed Graph Computation for Machine Learning", "abstract": "TUX2 is a new distributed graph engine that bridges graph computation and distributed machine learning. TUX2 inherits the benefits of an elegant graph computation model, efficient graph layout, and balanced parallelism to scale to billion-edge graphs; we extend and optimize it for distributed machine learning to support heterogeneity, a Stale Synchronous Parallel model, and a new MEGA (Mini-batch, Exchange, GlobalSync, and Apply) model. \n \nWe have developed a set of representative distributed machine learning algorithms in TUX2, covering both supervised and unsupervised learning. Compared to implementations on distributedmachine learning platforms, writing these algorithms in TUX2 takes only about 25% of the code: Our graph computation model hides the detailed management of data layout, partitioning, and parallelism from developers. Our extensive evaluation of TUX2, using large data sets with up to 64 billion edges, shows that TUX2 outperforms state-of-the-art distributed graph engines PowerGraph and PowerLyra by an order of magnitude, while beating two state-of-the-art distributed machine learning systems by at least 48%.", "year": 2017, "referenceCount": 43, "citationCount": 53, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9754946", "name": "Wencong Xiao"}, {"authorId": "2870618", "name": "Jilong Xue"}, {"authorId": "11009920", "name": "Youshan Miao"}, {"authorId": "1700892", "name": "Z. Li"}, {"authorId": "2145774559", "name": "Cheng Chen"}, {"authorId": "145217421", "name": "Ming Wu"}, {"authorId": null, "name": "Wei Li"}, {"authorId": "93317102", "name": "Lidong Zhou"}]}, {"paperId": "f9d119346b0773ea83251598fa5305bc75bac8ab", "url": "https://www.semanticscholar.org/paper/f9d119346b0773ea83251598fa5305bc75bac8ab", "title": "Spectral–Spatial Classification of Hyperspectral Data Based on Deep Belief Network", "abstract": "Hyperspectral data classification is a hot topic in remote sensing community. In recent years, significant effort has been focused on this issue. However, most of the methods extract the features of original data in a shallow manner. In this paper, we introduce a deep learning approach into hyperspectral image classification. A new feature extraction (FE) and image classification framework are proposed for hyperspectral data analysis based on deep belief network (DBN). First, we verify the eligibility of restricted Boltzmann machine (RBM) and DBN by the following spectral information-based classification. Then, we propose a novel deep architecture, which combines the spectral-spatial FE and classification together to get high classification accuracy. The framework is a hybrid of principal component analysis (PCA), hierarchical learning-based FE, and logistic regression (LR). Experimental results with hyperspectral data indicate that the classifier provide competitive solution with the state-of-the-art methods. In addition, this paper reveals that deep learning system has huge potential for hyperspectral data classification.", "year": 2015, "referenceCount": 55, "citationCount": 801, "influentialCitationCount": 48, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2597809", "name": "Yushi Chen"}, {"authorId": "2143711163", "name": "Xing Zhao"}, {"authorId": "144787387", "name": "X. Jia"}]}, {"paperId": "5a4247676b9fc546410b731e72c38c950f54ce65", "url": "https://www.semanticscholar.org/paper/5a4247676b9fc546410b731e72c38c950f54ce65", "title": "DeepDGA: Adversarially-Tuned Domain Generation and Detection", "abstract": "Many malware families utilize domain generation algorithms (DGAs) to establish command and control (C&C) connections. While there are many methods to pseudorandomly generate domains, we focus in this paper on detecting (and generating) domains on a per-domain basis which provides a simple and flexible means to detect known DGA families. Recent machine learning approaches to DGA detection have been successful on fairly simplistic DGAs, many of which produce names of fixed length. However, models trained on limited datasets are somewhat blind to new DGA variants. In this paper, we leverage the concept of generative adversarial networks to construct a deep learning based DGA that is designed to intentionally bypass a deep learning based detector. In a series of adversarial rounds, the generator learns to generate domain names that are increasingly more difficult to detect. In turn, a detector model updates its parameters to compensate for the adversarially generated domains. We test the hypothesis of whether adversarially generated domains may be used to augment training sets in order to harden other machine learning models against yet-to-be-observed DGAs. We detail solutions to several challenges in training this character-based generative adversarial network. In particular, our deep learning architecture begins as a domain name auto-encoder (encoder + decoder) trained on domains in the Alexa one million. Then the encoder and decoder are reassembled competitively in a generative adversarial network (detector + generator), with novel neural architectures and training strategies to improve convergence.", "year": 2016, "referenceCount": 27, "citationCount": 163, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2639880", "name": "H. Anderson"}, {"authorId": "3107173", "name": "Jonathan Woodbridge"}, {"authorId": "7888676", "name": "Bobby Filar"}]}, {"paperId": "84d2bd1c34dca72d293c965316d32a06f567d96a", "url": "https://www.semanticscholar.org/paper/84d2bd1c34dca72d293c965316d32a06f567d96a", "title": "Interpolants as Classifiers", "abstract": null, "year": 2012, "referenceCount": 35, "citationCount": 92, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2111333766", "name": "Rahul Sharma"}, {"authorId": "34894873", "name": "A. Nori"}, {"authorId": "144653825", "name": "A. Aiken"}]}, {"paperId": "fdd7fa5e2d3777af4410c81f697d348d67ad03d8", "url": "https://www.semanticscholar.org/paper/fdd7fa5e2d3777af4410c81f697d348d67ad03d8", "title": "Learning in Non-Stationary Environments: Methods and Applications", "abstract": "Recent decades have seen rapid advances in automatization processes, supported by modern machines and computers. The result is significant increases in system complexity and state changes, information sources, the need for faster data handling and the integration of environmental influences. Intelligent systems, equipped with a taxonomy of data-driven system identification and machine learning algorithms, can handle these problems partially. Conventional learning algorithms in a batch off-line setting fail whenever dynamic changes of the process appear due to non-stationary environments and external influences. Learning in Non-Stationary Environments: Methods and Applications offers a wide-ranging, comprehensive review of recent developments and important methodologies in the field. The coverage focuses on dynamic learning in unsupervised problems, dynamic learning in supervised classification and dynamic learning in supervised regression problems. A later section is dedicated to applications in which dynamic learning methods serve as keystones for achieving models with high accuracy. Rather than rely on a mathematical theorem/proof style, the editors highlight numerous figures, tables, examples and applications, together with their explanations. This approach offers a useful basis for further investigation and fresh ideas and motivates and inspires newcomers to explore this promising and still emerging field of research.", "year": 2012, "referenceCount": 0, "citationCount": 143, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1407905896", "name": "M. Sayed-Mouchaweh"}, {"authorId": "1689446", "name": "E. Lughofer"}]}, {"paperId": "7c0091f58a51de301bd2906225cd8046f85f7a0a", "url": "https://www.semanticscholar.org/paper/7c0091f58a51de301bd2906225cd8046f85f7a0a", "title": "Genetic algorithms as a tool for feature selection in machine learning", "abstract": "An approach being explored to improve the usefulness of machine learning techniques for generating classification rules for complex, real-world data is described. The approach involves the use of genetic algorithms as a front end to a traditional rule induction system in order to identify and select the best subset of features to be used by the rule induction system. This approach has been implemented and tested on difficult texture classification problems. The results are encouraging and indicate that there are significant advantages to the approach in this domain.<<ETX>>", "year": 1992, "referenceCount": 14, "citationCount": 273, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2020670", "name": "H. Vafaie"}, {"authorId": "145502027", "name": "K. D. Jong"}]}, {"paperId": "f24f951e23c12138e73049e48e29d141d5da498b", "url": "https://www.semanticscholar.org/paper/f24f951e23c12138e73049e48e29d141d5da498b", "title": "Android Malware Detection Using Parallel Machine Learning Classifiers", "abstract": "Mobile malware has continued to grow at an alarming rate despite on-going mitigation efforts. This has been much more prevalent on Android due to being an open platform that is rapidly overtaking other competing platforms in the mobile smart devices market. Recently, a new generation of Android malware families has emerged with advanced evasion capabilities which make them much more difficult to detect using conventional methods. This paper proposes and investigates a parallel machine learning based classification approach for early detection of Android malware. Using real malware samples and benign applications, a composite classification model is developed from parallel combination of heterogeneous classifiers. The empirical evaluation of the model under different combination schemes demonstrates its efficacy and potential to improve detection accuracy. More importantly, by utilizing several classifiers with diverse characteristics, their strengths can be harnessed not only for enhanced Android malware detection but also quicker white box analysis by means of the more interpretable constituent classifiers.", "year": 2014, "referenceCount": 22, "citationCount": 114, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1839835", "name": "S. Yerima"}, {"authorId": "1738421", "name": "S. Sezer"}, {"authorId": "2448335", "name": "Igor Muttik"}]}, {"paperId": "e1b77eb03d753da13d1c6ce7cb45dd98e64c7fb6", "url": "https://www.semanticscholar.org/paper/e1b77eb03d753da13d1c6ce7cb45dd98e64c7fb6", "title": "Explainable Reinforcement Learning: A Survey", "abstract": null, "year": 2020, "referenceCount": 81, "citationCount": 98, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1693988322", "name": "Erika Puiutta"}, {"authorId": "3250049", "name": "Eric M. S. P. Veith"}]}, {"paperId": "d4c4076a4e3a1ea24f292e68dbb5eeb99e1ea35d", "url": "https://www.semanticscholar.org/paper/d4c4076a4e3a1ea24f292e68dbb5eeb99e1ea35d", "title": "TorchCraft: a Library for Machine Learning Research on Real-Time Strategy Games", "abstract": "We present TorchCraft, a library that enables deep learning research on Real-Time \nStrategy (RTS) games such as StarCraft: Brood War, by making it easier to control these \ngames from a machine learning framework, here Torch [9]. This white paper argues for \nusing RTS games as a benchmark for AI research, and describes the design and components \nof TorchCraft.", "year": 2016, "referenceCount": 26, "citationCount": 99, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2282478", "name": "Gabriel Synnaeve"}, {"authorId": "39683441", "name": "Nantas Nardelli"}, {"authorId": "3082019", "name": "Alex Auvolat"}, {"authorId": "2127604", "name": "Soumith Chintala"}, {"authorId": "47733973", "name": "Timothée Lacroix"}, {"authorId": "3370429", "name": "Zeming Lin"}, {"authorId": "2127603", "name": "Florian Richoux"}, {"authorId": "1746841", "name": "Nicolas Usunier"}]}, {"paperId": "870a7d576937f2ff6a85384bd0764fb3c51a23d2", "url": "https://www.semanticscholar.org/paper/870a7d576937f2ff6a85384bd0764fb3c51a23d2", "title": "Learning Nonrecursive Definitions of Relations with LINUS", "abstract": null, "year": 1991, "referenceCount": 14, "citationCount": 199, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1730104", "name": "N. Lavrac"}, {"authorId": "1693549", "name": "S. Džeroski"}, {"authorId": "1775954", "name": "M. Grobelnik"}]}, {"paperId": "b13e9d23983273c0c67b91ae70c55d4c3f745b8b", "url": "https://www.semanticscholar.org/paper/b13e9d23983273c0c67b91ae70c55d4c3f745b8b", "title": "Learning to Translate in Real-time with Neural Machine Translation", "abstract": "Translating in real-time, a.k.a.simultaneous translation, outputs translation words before the input sentence ends, which is a challenging problem for conventional machine translation methods. We propose a neural machine translation (NMT) framework for simultaneous translation in which an agent learns to make decisions on when to translate from the interaction with a pre-trained NMT environment. To trade off quality and delay, we extensively explore various targets for delay and design a method for beam-search applicable in the simultaneous MT setting. Experiments against state-of-the-art baselines on two language pairs demonstrate the efficacy of the proposed framework both quantitatively and qualitatively.", "year": 2016, "referenceCount": 25, "citationCount": 146, "influentialCitationCount": 37, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1700325", "name": "Graham Neubig"}, {"authorId": "1979489", "name": "Kyunghyun Cho"}, {"authorId": "3016273", "name": "Jiatao Gu"}, {"authorId": "2052674293", "name": "V. Li"}]}, {"paperId": "52e844b5cc587dfb9641f74f35a3fbc1af4cd4ee", "url": "https://www.semanticscholar.org/paper/52e844b5cc587dfb9641f74f35a3fbc1af4cd4ee", "title": "Achieving standards in urban systemic reform: An example of a sixth grade project‐based science curriculum", "abstract": "A challenge for urban systemic reform initiatives in science education has been to achieve local, state, and national standards for teaching and learning. We have collaborated with teachers in the Detroit Public School System to design project-based curriculum materials that contextualize the learning of science in meaningful real-world problems, engage students in science inquiry, and use learning tech- nologies. We present a sixth grade project-based science unit in which students explored the driving question ''How Do Machines Help Me Build Big Things?'' and address the science learning goals of balanced and unbalanced forces, simple and complex machines, and mechanical advantage. Twenty-four teachers and over 2500 students in Detroit participated in enactments of this project over 4 years. Student learning outcomes were determined for the three learning goals and inquiry process skills using pre- and postachievement tests. Achievement outcomes as measured by the pre/posttest show significant and con- sistently high learning gains, even as participation in the project increased to include greater numbers of teachers and students in successive enactments, and leadership of the professional development support for this project transitioned from university researchers to district teacher leaders. These results illustrate that materials which contextualize learning and support student inquiry as part of an urban systemic reform effort can promote learning of important and meaningful science content aligned with standards. 2004 Wiley Periodicals, Inc. J Res Sci Teach 41: 669-692, 2004", "year": 2004, "referenceCount": 51, "citationCount": 134, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Sociology"], "authors": [{"authorId": "1965080", "name": "Ann E. Rivet"}, {"authorId": "1794213", "name": "J. Krajcik"}]}, {"paperId": "ec07a9b3a6641d2d1b38afb0ab79c4c4b25d20a5", "url": "https://www.semanticscholar.org/paper/ec07a9b3a6641d2d1b38afb0ab79c4c4b25d20a5", "title": "A review of epileptic seizure detection using machine learning classifiers", "abstract": null, "year": 2020, "referenceCount": 152, "citationCount": 106, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3068767", "name": "Mohammad Khubeb Siddiqui"}, {"authorId": "1398478541", "name": "R. Morales-Menéndez"}, {"authorId": "1680567", "name": "Xiaodi Huang"}, {"authorId": "48536060", "name": "Nasir Hussain"}]}, {"paperId": "c93c57ee7b5ffbf25131b046948aa45d93629f7c", "url": "https://www.semanticscholar.org/paper/c93c57ee7b5ffbf25131b046948aa45d93629f7c", "title": "Incremental Majorization-Minimization Optimization with Application to Large-Scale Machine Learning", "abstract": "Majorization-minimization algorithms consist of successively minimizing a sequence of upper bounds of the objective function. These upper bounds are tight at the current estimate, and each iteration monotonically drives the objective function downhill. Such a simple principle is widely applicable and has been very popular in various scientific fields, especially in signal processing and statistics. We propose an incremental majorization-minimization scheme for minimizing a large sum of continuous functions, a problem of utmost importance in machine learning. We present convergence guarantees for nonconvex and convex optimization when the upper bounds approximate the objective up to a smooth error; we call such upper bounds “first-order surrogate functions.” More precisely, we study asymptotic stationary point guarantees for nonconvex problems, and for convex ones, we provide convergence rates for the expected objective function value. We apply our scheme to composite optimization and obtain a new incremental proximal gradient algorithm with linear convergence rate for strongly convex functions. Our experiments show that our method is competitive with the state of the art for solving machine learning problems such as logistic regression when the number of training samples is large enough, and we demonstrate its usefulness for sparse estimation with nonconvex penalties.", "year": 2014, "referenceCount": 64, "citationCount": 264, "influentialCitationCount": 35, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2599292", "name": "J. Mairal"}]}, {"paperId": "0a4230af7869cf63159a444510627b4f91e38eed", "url": "https://www.semanticscholar.org/paper/0a4230af7869cf63159a444510627b4f91e38eed", "title": "Zeno: Distributed Stochastic Gradient Descent with Suspicion-based Fault-tolerance", "abstract": "We present Zeno, a technique to make distributed machine learning, particularly Stochastic Gradient Descent (SGD), tolerant to an arbitrary number of faulty workers. Zeno generalizes previous results that assumed a majority of non-faulty nodes; we need assume only one non-faulty worker. Our key idea is to suspect workers that are potentially defective. Since this is likely to lead to false positives, we use a ranking-based preference mechanism. We prove the convergence of SGD for non-convex problems under these scenarios. Experimental results show that Zeno outperforms existing approaches.", "year": 2018, "referenceCount": 15, "citationCount": 116, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144586627", "name": "Cong Xie"}, {"authorId": "143812875", "name": "O. Koyejo"}, {"authorId": "143720373", "name": "Indranil Gupta"}]}, {"paperId": "7e3224180c274ce8bb64a998ba2aafa6427dfbb0", "url": "https://www.semanticscholar.org/paper/7e3224180c274ce8bb64a998ba2aafa6427dfbb0", "title": "Kymatio: Scattering Transforms in Python", "abstract": "The wavelet scattering transform is an invariant signal representation suitable for many signal processing and machine learning applications. We present the Kymatio software package, an easy-to-use, high-performance Python implementation of the scattering transform in 1D, 2D, and 3D that is compatible with modern deep learning frameworks. All transforms may be executed on a GPU (in addition to CPU), offering a considerable speed up over CPU implementations. The package also has a small memory footprint, resulting inefficient memory usage. The source code, documentation, and examples are available undera BSD license at this https URL", "year": 2018, "referenceCount": 20, "citationCount": 67, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "authors": [{"authorId": "3357294", "name": "M. Andreux"}, {"authorId": "3433059", "name": "Tomás Angles"}, {"authorId": "2969624", "name": "Georgios Exarchakis"}, {"authorId": "48077877", "name": "R. Leonarduzzi"}, {"authorId": "51518656", "name": "G. Rochette"}, {"authorId": "46199268", "name": "L. Thiry"}, {"authorId": "67004796", "name": "J. Zarka"}, {"authorId": "1746242", "name": "S. Mallat"}, {"authorId": "2708847", "name": "J. Andén"}, {"authorId": "1829344", "name": "Eugene Belilovsky"}, {"authorId": "143627859", "name": "Joan Bruna"}, {"authorId": "2507441", "name": "V. Lostanlen"}, {"authorId": "145500870", "name": "M. Hirn"}, {"authorId": "3306593", "name": "Edouard Oyallon"}, {"authorId": "66686215", "name": "Sixhin Zhang"}, {"authorId": "1881241", "name": "Carmine-Emanuele Cella"}, {"authorId": "1823753", "name": "Michael Eickenberg"}]}, {"paperId": "54d2be3b053c36b7b8fb928926c19da609143be2", "url": "https://www.semanticscholar.org/paper/54d2be3b053c36b7b8fb928926c19da609143be2", "title": "Active Learning by Labeling Features", "abstract": "Methods that learn from prior information about input features such as generalized expectation (GE) have been used to train accurate models with very little effort. In this paper, we propose an active learning approach in which the machine solicits \"labels\" on features rather than instances. In both simulated and real user experiments on two sequence labeling tasks we show that our active learning method outperforms passive learning with features as well as traditional active learning with instances. Preliminary experiments suggest that novel interfaces which intelligently solicit labels on multiple features facilitate more efficient annotation.", "year": 2009, "referenceCount": 19, "citationCount": 168, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2476903", "name": "Gregory Druck"}, {"authorId": "1717452", "name": "Burr Settles"}, {"authorId": "143753639", "name": "A. McCallum"}]}, {"paperId": "ea07fd3326df220bcbe6e76695e6decf90c26252", "url": "https://www.semanticscholar.org/paper/ea07fd3326df220bcbe6e76695e6decf90c26252", "title": "Data Mining on Imbalanced Data Sets", "abstract": "The majority of machine learning algorithms previously designed usually assume that their training sets are well-balanced, and implicitly assume that all misclassification errors cost equally. But data in real-world is usually imbalanced. The class imbalance problem is pervasive and ubiquitous, causing trouble to a large segment of the data mining community. The tradition machine learning algorithms have bad performance when they learn from imbalanced data sets. Thus, machine learning on imbalanced data sets becomes an urgent problem. The importance of imbalanced data sets and their broad application domains in data mining are introduced, and then methods to deal with the class imbalance problem are discussed and their effectiveness are compared. Last but not least, the existing evaluation measures of class imbalance problem are systematically analyzed.", "year": 2008, "referenceCount": 29, "citationCount": 91, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2054919287", "name": "Qiong Gu"}, {"authorId": "145126412", "name": "Z. Cai"}, {"authorId": "2116293719", "name": "Li Zhu"}, {"authorId": "2110607114", "name": "Bo Huang"}]}, {"paperId": "c0604dbe2d4f75e7a53cbd186858fbff75f9a9e9", "url": "https://www.semanticscholar.org/paper/c0604dbe2d4f75e7a53cbd186858fbff75f9a9e9", "title": "Comparative analysis of machine learning methods in ligand-based virtual screening of large compound libraries.", "abstract": "Machine learning methods have been explored as ligand-based virtual screening tools for facilitating drug lead discovery. These methods predict compounds of specific pharmacodynamic, pharmacokinetic or toxicological properties based on their structure-derived structural and physicochemical properties. Increasing attention has been directed at these methods because of their capability in predicting compounds of diverse structures and complex structure-activity relationships without requiring the knowledge of target 3D structure. This article reviews current progresses in using machine learning methods for virtual screening of pharmacodynamically active compounds from large compound libraries, and analyzes and compares the reported performances of machine learning tools with those of structure-based and other ligand-based (such as pharmacophore and clustering) virtual screening methods. The feasibility to improve the performance of machine learning methods in screening large libraries is discussed.", "year": 2009, "referenceCount": 12, "citationCount": 56, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "39307058", "name": "X. H. Ma"}, {"authorId": "2888440", "name": "J. Jia"}, {"authorId": "2075368283", "name": "F. Zhu"}, {"authorId": "144564095", "name": "Y. Xue"}, {"authorId": "152985876", "name": "Ze-Rong Li"}, {"authorId": "2144836340", "name": "Y. Chen"}]}]}