{"total": 5120627, "offset": 4800, "next": 4900, "data": [{"paperId": "8229fc91f497e40a9092d4544248491fe40203e7", "url": "https://www.semanticscholar.org/paper/8229fc91f497e40a9092d4544248491fe40203e7", "title": "Sparse Bayesian nonparametric regression", "abstract": "One of the most common problems in machine learning and statistics consists of estimating the mean response <i>Xβ</i> from a vector of observations <i>y</i> assuming <i>y</i> = <i>Xβ</i> + <i>ε</i> where <i>X</i> is known, β is a vector of parameters of interest and <i>ε</i> a vector of stochastic errors. We are particularly interested here in the case where the dimension <i>K</i> of β is much higher than the dimension of <i>y</i>. We propose some flexible Bayesian models which can yield sparse estimates of β. We show that as <i>K</i> → ∞ these models are closely related to a class of Lévy processes. Simulations demonstrate that our models outperform significantly a range of popular alternatives.", "year": 2008, "referenceCount": 23, "citationCount": 105, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1774837", "name": "F. Caron"}, {"authorId": "1701800", "name": "A. Doucet"}]}, {"paperId": "7e2bb65668288d54e3da9007ed261588241dfab2", "url": "https://www.semanticscholar.org/paper/7e2bb65668288d54e3da9007ed261588241dfab2", "title": "Analysis of interpretability-accuracy tradeoff of fuzzy systems by multiobjective fuzzy genetics-based machine learning", "abstract": null, "year": 2007, "referenceCount": 38, "citationCount": 380, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "10022373", "name": "H. Ishibuchi"}, {"authorId": "34654033", "name": "Y. Nojima"}]}, {"paperId": "c2f792c74ae86f41f74e7a5babdcbe8ec347fa6e", "url": "https://www.semanticscholar.org/paper/c2f792c74ae86f41f74e7a5babdcbe8ec347fa6e", "title": "Automated de novo molecular design by hybrid machine intelligence and rule-driven chemical synthesis", "abstract": null, "year": 2019, "referenceCount": 27, "citationCount": 41, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47000850", "name": "Alexander L. Button"}, {"authorId": "2077451014", "name": "D. Merk"}, {"authorId": "40008184", "name": "J. A. Hiss"}, {"authorId": "144522872", "name": "G. Schneider"}]}, {"paperId": "fa917268d42bf36ee31a442b47cf578b9c4143f3", "url": "https://www.semanticscholar.org/paper/fa917268d42bf36ee31a442b47cf578b9c4143f3", "title": "Georgia Institute of Technology", "abstract": "Interactive and intelligent computing is an emerging discipline on the frontier of ways computation impacts the external world. The School of Interactive Computing advances computing-mediated interactions by encompassing fields ranging from artificial intelligence and machine learning to graphics and computer vision to interface design and empirical methods. We don't just evaluate technology, we create technology that makes interactions better. Much of the research within the School of Interactive Computing produces new artifacts that embody new capabilities or methods. Examples include:", "year": 2002, "referenceCount": 47, "citationCount": 269, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2100834673", "name": "Music Musi"}]}, {"paperId": "0f5954b91a2f7bdd343caecab123cf077f566fb4", "url": "https://www.semanticscholar.org/paper/0f5954b91a2f7bdd343caecab123cf077f566fb4", "title": "Going Deep in Medical Image Analysis: Concepts, Methods, Challenges, and Future Directions", "abstract": "Medical image analysis is currently experiencing a paradigm shift due to deep learning. This technology has recently attracted so much interest of the Medical Imaging Community that it led to a specialized conference in “Medical Imaging with Deep Learning” in the year 2018. This paper surveys the recent developments in this direction and provides a critical review of the related major aspects. We organize the reviewed literature according to the underlying pattern recognition tasks and further sub-categorize it following a taxonomy based on human anatomy. This paper does not assume prior knowledge of deep learning and makes a significant contribution in explaining the core deep learning concepts to the non-experts in the Medical Community. This paper provides a unique computer vision/machine learning perspective taken on the advances of deep learning in medical imaging. This enables us to single out “lack of appropriately annotated large-scale data sets” as the core challenge (among other challenges) in this research direction. We draw on the insights from the sister research fields of computer vision, pattern recognition, and machine learning, where the techniques of dealing with such challenges have already matured, to provide promising directions for the Medical Imaging Community to fully harness deep learning in the future.", "year": 2019, "referenceCount": 322, "citationCount": 116, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48438050", "name": "F. Altaf"}, {"authorId": "2112527803", "name": "S. M. Islam"}, {"authorId": "47398812", "name": "Naveed Akhtar"}, {"authorId": "1979066", "name": "N. Janjua"}]}, {"paperId": "0ebcf6037c0aae64a65e3fc7b058b806defbe22c", "url": "https://www.semanticscholar.org/paper/0ebcf6037c0aae64a65e3fc7b058b806defbe22c", "title": "VILLAGE - Virtual Immersive Language Learning and Gaming Environment: Immersion and presence", "abstract": "3 D virtual worlds are promising for immersive learning in English as a Foreign Language ( EFL). Unlike English as a Second Language ( ESL), EFL typically takes place in the learners' home countries, and the potential of the language is limited by geography. Although learning contexts where English is spoken is important, in most EFL courses at the college level, EFL is taught by acquiring vocabularies, grammar and pragmatic features without contextual immersion. In this study, an immersive English learning environment in a 3 D virtual world, Open Simulator, was developed with two key learning artifacts, chatbot and time machine. A single-factor, independent measures design was used to examines learners' presence under four learning conditions: virtual learning environment without digital learning artifacts ( VE), virtual learning environment with chatbot ( VEC), virtual learning environment with time machine ( VETM) and virtual learning environment with chatbot and time machine ( VECTM). Three research questions emerging from the four learning conditions form the backbone of this study: (1) Does chatbot increase language learners' presence in the immersive virtual English learning environment? (2) Does time machine increase language learners' presence in the immersive virtual English learning environment? (3) Does the combined use of chatbot and time machine increase presence more than either learning artifact alone? The experimental results indicate that the chatbot and time machine increase the learners' sense of immersion and presence. Best design practices should address how immersion and presence can be integrated into affordances of virtual worlds. [ABSTRACT FROM AUTHOR]", "year": 2017, "referenceCount": 24, "citationCount": 51, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115568428", "name": "Yifei Wang"}, {"authorId": "9675772", "name": "S. Petrina"}, {"authorId": "46782202", "name": "Franc Feng"}]}, {"paperId": "c31b35fbac605b6c47e29eae1c68ba0c267ebd09", "url": "https://www.semanticscholar.org/paper/c31b35fbac605b6c47e29eae1c68ba0c267ebd09", "title": "Software Defect Identification Using Machine Learning Techniques", "abstract": "Software engineering is a tedious job that includes people, tight deadlines and limited budgets. Delivering what customer wants involves minimizing the defects in the programs. Hence, it is important to establish quality measures early on in the project life cycle. The main objective of this research is to analyze problems in software code and propose a model that will help catching those problems earlier in the project life cycle. Our proposed model uses machine learning methods. Principal component analysis is used for dimensionality reduction, and decision tree, multi layer perceptron and radial basis functions are used for defect prediction. The experiments in this research are carried out with different software metric datasets that are obtained from real-life projects of three big software companies in Turkey. We can say that, the improved method that we proposed brings out satisfactory results in terms of defect prediction", "year": 2006, "referenceCount": 18, "citationCount": 61, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "15371442", "name": "Evren Ceylan"}, {"authorId": "2530616", "name": "F. O. Kutlubay"}, {"authorId": "1730000", "name": "A. Bener"}]}, {"paperId": "817f5e02d30195305e8e7f9f7e036152b48faf53", "url": "https://www.semanticscholar.org/paper/817f5e02d30195305e8e7f9f7e036152b48faf53", "title": "Evaluating Late Blight Severity in Potato Crops Using Unmanned Aerial Vehicles and Machine Learning Algorithms", "abstract": "This work presents quantitative prediction of severity of the disease caused by Phytophthora infestans in potato crops using machine learning algorithms such as multilayer perceptron, deep learning convolutional neural networks, support vector regression, and random forests. The machine learning algorithms are trained using datasets extracted from multispectral data captured at the canopy level with an unmanned aerial vehicle, carrying an inexpensive digital camera. The results indicate that deep learning convolutional neural networks, random forests and multilayer perceptron using band differences can predict the level of Phytophthora infestans affectation on potato crops with acceptable accuracy.", "year": 2018, "referenceCount": 39, "citationCount": 60, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Geology"], "authors": [{"authorId": "1397244014", "name": "J. Duarte-Carvajalino"}, {"authorId": "2064606609", "name": "Diego F. Alzate"}, {"authorId": "144909163", "name": "Andrés A. Ramirez"}, {"authorId": "1423439241", "name": "Juan D. Santa-Sepulveda"}, {"authorId": "1423438724", "name": "Alexandra E. Fajardo-Rojas"}, {"authorId": "1490706353", "name": "Mauricio Soto-Suárez"}]}, {"paperId": "93e348038aebdc6b4c728527635a06d72d261f4f", "url": "https://www.semanticscholar.org/paper/93e348038aebdc6b4c728527635a06d72d261f4f", "title": "ASD-DiagNet: A Hybrid Learning Approach for Detection of Autism Spectrum Disorder Using fMRI Data", "abstract": "Heterogeneous mental disorders such as Autism Spectrum Disorder (ASD) are notoriously difficult to diagnose, especially in children. The current psychiatric diagnostic process is based purely on the behavioral observation of symptomology (DSM-5/ICD-10) and may be prone to misdiagnosis. In order to move the field toward more quantitative diagnosis, we need advanced and scalable machine learning infrastructure that will allow us to identify reliable biomarkers of mental health disorders. In this paper, we propose a framework called ASD-DiagNet for classifying subjects with ASD from healthy subjects by using only fMRI data. We designed and implemented a joint learning procedure using an autoencoder and a single layer perceptron (SLP) which results in improved quality of extracted features and optimized parameters for the model. Further, we designed and implemented a data augmentation strategy, based on linear interpolation on available feature vectors, that allows us to produce synthetic datasets needed for training of machine learning models. The proposed approach is evaluated on a public dataset provided by Autism Brain Imaging Data Exchange including 1, 035 subjects coming from 17 different brain imaging centers. Our machine learning model outperforms other state of the art methods from 10 imaging centers with increase in classification accuracy up to 28% with maximum accuracy of 82%. The machine learning technique presented in this paper, in addition to yielding better quality, gives enormous advantages in terms of execution time (40 min vs. 7 h on other methods). The implemented code is available as GPL license on GitHub portal of our lab (https://github.com/pcdslab/ASD-DiagNet).", "year": 2019, "referenceCount": 62, "citationCount": 111, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics", "Medicine"], "authors": [{"authorId": "23131613", "name": "Taban Eslami"}, {"authorId": "2067221484", "name": "Vahid Mirjalili"}, {"authorId": "32250369", "name": "A. Fong"}, {"authorId": "8075165", "name": "A. Laird"}, {"authorId": "145052952", "name": "F. Saeed"}]}, {"paperId": "d9cb035237c76349015373fec54a1b07ce2f4503", "url": "https://www.semanticscholar.org/paper/d9cb035237c76349015373fec54a1b07ce2f4503", "title": "Accelerated Coordinate Descent with Adaptive Coordinate Frequencies", "abstract": "Coordinate descent (CD) algorithms have become the method of choice for solving a number of machine learning tasks. They are particularly popular for training linear models, includ- ing linear support vector machine classication, LASSO regression, and logistic regression. We propose an extension of the CD algorithm, called the adaptive coordinate frequencies (ACF) method. This modied CD scheme does not treat all coordinates equally, in that it does not pick all coordinates equally often for optimization. Instead the relative frequen- cies of coordinates are subject to online adaptation. The resulting optimization scheme can result in signicant speed-ups. We demonstrate the usefulness of our approach on a number of large scale machine learning problems.", "year": 2013, "referenceCount": 19, "citationCount": 29, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1756710", "name": "T. Glasmachers"}, {"authorId": "2154404", "name": "Ü. Dogan"}]}, {"paperId": "805d950d6df9bdabd6b87d06de213909192341db", "url": "https://www.semanticscholar.org/paper/805d950d6df9bdabd6b87d06de213909192341db", "title": "The carbon impact of artificial intelligence", "abstract": null, "year": 2020, "referenceCount": 0, "citationCount": 66, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "40564935", "name": "Payal Dhar"}]}, {"paperId": "9c93dd3ea94a3e81e6240a51968ad6f1d40380f3", "url": "https://www.semanticscholar.org/paper/9c93dd3ea94a3e81e6240a51968ad6f1d40380f3", "title": "Automatic classification of citation function", "abstract": "Citation function is defined as the author's reason for citing a given paper (e.g. acknowledgement of the use of the cited method). The automatic recognition of the rhetorical function of citations in scientific text has many applications, from improvement of impact factor calculations to text summarisation and more informative citation indexers. We show that our annotation scheme for citation function is reliable, and present a supervised machine learning framework to automatically classify citation function, using both shallow and linguistically-inspired features. We find, amongst other things, a strong relationship between citation function and sentiment classification.", "year": 2006, "referenceCount": 43, "citationCount": 435, "influentialCitationCount": 67, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2480901", "name": "Simone Teufel"}, {"authorId": "1722590", "name": "Advaith Siddharthan"}, {"authorId": "2542428", "name": "Dan Tidhar"}]}, {"paperId": "77332906ee0dabba93ddf6a088d80d8b13329574", "url": "https://www.semanticscholar.org/paper/77332906ee0dabba93ddf6a088d80d8b13329574", "title": "Low-Rank Tensor Networks for Dimensionality Reduction and Large-Scale Optimization Problems: Perspectives and Challenges PART 1", "abstract": "Machine learning and data mining algorithms are becoming increasingly important in analyzing large volume, multi-relational and ∗Copyright A.Cichocki et al. Please make reference to: A. Cichocki, N. Lee, I. Oseledets, A.-H. Phan, Q. Zhao and D.P. Mandic (2016), “Tensor Networks for Dimensionality Reduction and Large-scale Optimization: Part 1 Low-Rank Tensor Decompositions”, Foundations and Trends in Machine Learning: Vol. 9: No. 4-5, pp 249-429.", "year": 2016, "referenceCount": 327, "citationCount": 81, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145683892", "name": "A. Cichocki"}, {"authorId": "1777061", "name": "Namgil Lee"}, {"authorId": "1738205", "name": "I. Oseledets"}, {"authorId": "9377326", "name": "A. Phan"}, {"authorId": "144251712", "name": "Qibin Zhao"}, {"authorId": "9368519", "name": "D. Mandic"}]}, {"paperId": "4fd355ee3a17ee1cc3e3eb7ebe5064200611adbb", "url": "https://www.semanticscholar.org/paper/4fd355ee3a17ee1cc3e3eb7ebe5064200611adbb", "title": "Machine Learning in Acute Ischemic Stroke Neuroimaging", "abstract": "Machine Learning (ML) through pattern recognition algorithms is currently becoming an essential aid for the diagnosis, treatment, and prediction of complications and patient outcomes in a number of neurological diseases. The evaluation and treatment of Acute Ischemic Stroke (AIS) have experienced a significant advancement over the past few years, increasingly requiring the use of neuroimaging for decision-making. In this review, we offer an insight into the recent developments and applications of ML in neuroimaging focusing on acute ischemic stroke.", "year": 2018, "referenceCount": 72, "citationCount": 61, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "47150922", "name": "H. Kamal"}, {"authorId": "2061878276", "name": "V. Lopez"}, {"authorId": "31965568", "name": "S. Sheth"}]}, {"paperId": "933c0c1604b7f1748665875a905356a929ad2970", "url": "https://www.semanticscholar.org/paper/933c0c1604b7f1748665875a905356a929ad2970", "title": "Random Forest.", "abstract": "For the task of analyzing survival data to derive risk factors associated with mortality, physicians, researchers, and biostatisticians have typically relied on certain types of regression techniques, most notably the Cox model. With the advent of more widely distributed computing power, methods which require more complex mathematics have become increasingly common. Particularly in this era of \"big data\" and machine learning, survival analysis has become methodologically broader. This paper aims to explore one technique known as Random Forest. The Random Forest technique is a regression tree technique which uses bootstrap aggregation and randomization of predictors to achieve a high degree of predictive accuracy. The various input parameters of the random forest are explored. Colon cancer data (n = 66,807) from the SEER database is then used to construct both a Cox model and a random forest model to determine how well the models perform on the same data. Both models perform well, achieving a concordance error rate of approximately 18%.", "year": 2017, "referenceCount": 1, "citationCount": 1021, "influentialCitationCount": 61, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "13988265", "name": "S. Rigatti"}]}, {"paperId": "d8c1840c5f155a9f2a6caf26fd999e9bf068c73a", "url": "https://www.semanticscholar.org/paper/d8c1840c5f155a9f2a6caf26fd999e9bf068c73a", "title": "Multi-task Learning", "abstract": "A fundamental limitation of standard machine learning methods is the cost incurred by the preparation of the large training samples required for good generalization. A potential remedy is offered by multi-task learning: in many cases, while individual sample sizes are rather small, there are samples to represent a large number of learning tasks (linear regression problems), which share some constraining or generative property. If this property is sufficiently simple it should allow for better learning of the individual tasks despite their small individual sample sizes. In this talk I will review a wide class of multi-task learning methods which encourage low-dimensional representations of the regression vectors. I will describe techniques to solve the underlying optimization problems and present an analysis of the generalization performance of these learning methods which provides a proof of the superiority of multi-task learning under specific conditions. ROKS 2013", "year": 2020, "referenceCount": 276, "citationCount": 55, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1704699", "name": "M. Pontil"}]}, {"paperId": "e7a24925d166768de9e8b6b97b33c93e03a1f00d", "url": "https://www.semanticscholar.org/paper/e7a24925d166768de9e8b6b97b33c93e03a1f00d", "title": "Artificial Intelligence and Machine Learning in Radiology: Opportunities, Challenges, Pitfalls, and Criteria for Success.", "abstract": null, "year": 2018, "referenceCount": 21, "citationCount": 351, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "145466601", "name": "J. Thrall"}, {"authorId": "47057650", "name": "Xiang Li"}, {"authorId": "1762919", "name": "Quanzheng Li"}, {"authorId": "123922859", "name": "Cinthia Cruz"}, {"authorId": "1788855", "name": "Synho Do"}, {"authorId": "26654844", "name": "K. Dreyer"}, {"authorId": "144685698", "name": "J. Brink"}]}, {"paperId": "f86afc5f0b76d2b7a6147ac2b6c367eaa0d24c3b", "url": "https://www.semanticscholar.org/paper/f86afc5f0b76d2b7a6147ac2b6c367eaa0d24c3b", "title": "Machine learning for long-distance quantum communication", "abstract": "Machine learning can help us in solving problems in the context big data analysis and classification, as well as in playing complex games such as Go. But can it also be used to find novel protocols and algorithms for applications such as large-scale quantum communication? Here we show that machine learning can be used to identify central quantum protocols, including teleportation, entanglement purification and the quantum repeater. These schemes are of importance in long-distance quantum communication, and their discovery has shaped the field of quantum information processing. However, the usefulness of learning agents goes beyond the mere re-production of known protocols; the same approach allows one to find improved solutions to long-distance communication problems, in particular when dealing with asymmetric situations where channel noise and segment distance are non-uniform. Our findings are based on the use of projective simulation, a model of a learning agent that combines reinforcement learning and decision making in a physically motivated framework. The learning agent is provided with a universal gate set, and the desired task is specified via a reward scheme. From a technical perspective, the learning agent has to deal with stochastic environments and reactions. We utilize an idea reminiscent of hierarchical skill acquisition, where solutions to sub-problems are learned and re-used in the overall scheme. This is of particular importance in the development of long-distance communication schemes, and opens the way for using machine learning in the design and implementation of quantum networks.", "year": 2019, "referenceCount": 69, "citationCount": 48, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "67091356", "name": "J. Wallnöfer"}, {"authorId": "47610941", "name": "A. Melnikov"}, {"authorId": "2863386", "name": "W. Dür"}, {"authorId": "32534184", "name": "H. Briegel"}]}, {"paperId": "334c32286f3af8cfbce4dc4bed8e110dd91826cb", "url": "https://www.semanticscholar.org/paper/334c32286f3af8cfbce4dc4bed8e110dd91826cb", "title": "Bond Risk Premia with Machine Learning", "abstract": "We show that machine learning methods, in particular extreme trees and neural networks (NNs), provide strong statistical evidence in favor of bond return predictability. NN forecasts based on macroeconomic and yield information translate into economic gains that are larger than those obtained using yields alone. Interestingly, the nature of unspanned factors changes along the yield curve: stock and labor market related variables are more relevant for short-term maturities, whereas output and income variables matter more for longer maturities. Finally, NN forecasts correlate with proxies for time-varying risk aversion and uncertainty, lending support to models featuring both of these channels.", "year": 2020, "referenceCount": 155, "citationCount": 61, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "146467911", "name": "Daniele Bianchi"}, {"authorId": "48556577", "name": "M. Büchner"}, {"authorId": "2468965", "name": "A. Tamoni"}]}, {"paperId": "3f8c2a71dd1f399079cc2fa87e15e065b59ebfbe", "url": "https://www.semanticscholar.org/paper/3f8c2a71dd1f399079cc2fa87e15e065b59ebfbe", "title": "Feature space interpretation of SVMs with indefinite kernels", "abstract": "Kernel methods are becoming increasingly popular for various kinds of machine learning tasks, the most famous being the support vector machine (SVM) for classification. The SVM is well understood when using conditionally positive definite (cpd) kernel functions. However, in practice, non-cpd kernels arise and demand application in SVM. The procedure of \"plugging\" these indefinite kernels in SVM often yields good empirical classification results. However, they are hard to interpret due to missing geometrical and theoretical understanding. In this paper, we provide a step toward the comprehension of SVM classifiers in these situations. We give a geometric interpretation of SVM with indefinite kernel functions. We show that such SVM are optimal hyperplane classifiers not by margin maximization, but by minimization of distances between convex hulls in pseudo-Euclidean spaces. By this, we obtain a sound framework and motivation for indefinite SVM. This interpretation is the basis for further theoretical analysis, e.g., investigating uniqueness, and for the derivation of practical guidelines like characterizing the suitability of indefinite SVM.", "year": 2005, "referenceCount": 32, "citationCount": 255, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2800929", "name": "B. Haasdonk"}]}, {"paperId": "bb86e6d01eb795d2ca1079986348b9aa8721164b", "url": "https://www.semanticscholar.org/paper/bb86e6d01eb795d2ca1079986348b9aa8721164b", "title": "A machine learning approach to geochemical mapping", "abstract": null, "year": 2016, "referenceCount": 75, "citationCount": 81, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Geology"], "authors": [{"authorId": "102538074", "name": "Charlie Kirkwood"}, {"authorId": "1909448", "name": "M. Cave"}, {"authorId": "35102483", "name": "D. Beamish"}, {"authorId": "3251075", "name": "S. Grebby"}, {"authorId": "152731330", "name": "António Ferreira"}]}, {"paperId": "51bd09c164893927ec190dff33be617edda84208", "url": "https://www.semanticscholar.org/paper/51bd09c164893927ec190dff33be617edda84208", "title": "Cluster-based instance selection for machine classification", "abstract": null, "year": 2010, "referenceCount": 59, "citationCount": 60, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1987465", "name": "I. Czarnowski"}]}, {"paperId": "5507dc32b368c8afd3b9507e9b5888da7bd7d7cd", "url": "https://www.semanticscholar.org/paper/5507dc32b368c8afd3b9507e9b5888da7bd7d7cd", "title": "Sequence-to-Sequence Learning as Beam-Search Optimization", "abstract": "Sequence-to-Sequence (seq2seq) modeling has rapidly become an important general-purpose NLP tool that has proven effective for many text-generation and sequence-labeling tasks. Seq2seq builds on deep neural language modeling and inherits its remarkable accuracy in estimating local, next-word distributions. In this work, we introduce a model and beam-search training scheme, based on the work of Daume III and Marcu (2005), that extends seq2seq to learn global sequence scores. This structured approach avoids classical biases associated with local training and unifies the training loss with the test-time usage, while preserving the proven model architecture of seq2seq and its efficient training approach. We show that our system outperforms a highly-optimized attention-based seq2seq system and other baselines on three different sequence to sequence tasks: word ordering, parsing, and machine translation.", "year": 2016, "referenceCount": 46, "citationCount": 493, "influentialCitationCount": 36, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2844243", "name": "Sam Wiseman"}, {"authorId": "2531268", "name": "Alexander M. Rush"}]}, {"paperId": "33e20449aa40488c6d4b430a48edf5c4b43afdab", "url": "https://www.semanticscholar.org/paper/33e20449aa40488c6d4b430a48edf5c4b43afdab", "title": "The Faces of Engagement: Automatic Recognition of Student Engagementfrom Facial Expressions", "abstract": "Student engagement is a key concept in contemporary education, where it is valued as a goal in its own right. In this paper we explore approaches for automatic recognition of engagement from students' facial expressions. We studied whether human observers can reliably judge engagement from the face; analyzed the signals observers use to make these judgments; and automated the process using machine learning. We found that human observers reliably agree when discriminating low versus high degrees of engagement (Cohen's κ = 0.96). When fine discrimination is required (four distinct levels) the reliability decreases, but is still quite high ( κ = 0.56). Furthermore, we found that engagement labels of 10-second video clips can be reliably predicted from the average labels of their constituent frames (Pearson r=0.85), suggesting that static expressions contain the bulk of the information used by observers. We used machine learning to develop automatic engagement detectors and found that for binary classification (e.g., high engagement versus low engagement), automated engagement detectors perform with comparable accuracy to humans. Finally, we show that both human and automatic engagement judgments correlate with task performance. In our experiment, student post-test performance was predicted with comparable accuracy from engagement labels ( r=0.47) as from pre-test scores ( r=0.44).", "year": 2014, "referenceCount": 67, "citationCount": 339, "influentialCitationCount": 38, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Psychology"], "authors": [{"authorId": "143973061", "name": "J. Whitehill"}, {"authorId": "3089406", "name": "Zewelanji N Serpell"}, {"authorId": "3267606", "name": "Yi-Ching Lin"}, {"authorId": "39687351", "name": "A. Foster"}, {"authorId": "1741200", "name": "J. Movellan"}]}, {"paperId": "6241702ad6c469b1e347a018ec191b0c31eef4a5", "url": "https://www.semanticscholar.org/paper/6241702ad6c469b1e347a018ec191b0c31eef4a5", "title": "A case for machine learning to optimize multicore performance", "abstract": "Multicore architectures have become so complex and diverse that there is no obvious path to achieving good performance. Hundreds of code transformations, compiler flags, architectural features and optimization parameters result in a search space that can take many machinemonths to explore exhaustively. Inspired by successes in the systems community, we apply state-of-the-art machine learning techniques to explore this space more intelligently. On 7-point and 27-point stencil code, our technique takes about two hours to discover a configuration whose performance is within 1% of and up to 18% better than that achieved by a human expert. This factor of 2000 speedup over manual exploration of the auto-tuning parameter space enables us to explore optimizations that were previously off-limits. We believe the opportunity for using machine learning in multicore autotuning is even more promising than the successes to date in the systems literature.", "year": 2009, "referenceCount": 18, "citationCount": 99, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1701816", "name": "A. Ganapathi"}, {"authorId": "49589461", "name": "K. Datta"}, {"authorId": "2057888081", "name": "Armando Fox"}, {"authorId": "2052997025", "name": "David A. Patterson"}]}, {"paperId": "c3f329c528887c082ec0b51ea3815371c70f99ac", "url": "https://www.semanticscholar.org/paper/c3f329c528887c082ec0b51ea3815371c70f99ac", "title": "CPAS: the UK’s national machine learning-based hospital capacity planning system for COVID-19", "abstract": null, "year": 2020, "referenceCount": 53, "citationCount": 25, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "authors": [{"authorId": "8797071", "name": "Zhaozhi Qian"}, {"authorId": "145629795", "name": "A. Alaa"}, {"authorId": "1729969", "name": "M. Schaar"}]}, {"paperId": "c48e2b6da0383e5602d883ca6b42354aea06e882", "url": "https://www.semanticscholar.org/paper/c48e2b6da0383e5602d883ca6b42354aea06e882", "title": "First-order and Stochastic Optimization Methods for Machine Learning", "abstract": null, "year": 2020, "referenceCount": 0, "citationCount": 143, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2070945", "name": "Guanghui Lan"}]}, {"paperId": "ee71c6bc5c5102e68eee86795b3cea35a83a1e22", "url": "https://www.semanticscholar.org/paper/ee71c6bc5c5102e68eee86795b3cea35a83a1e22", "title": "Search Engines that Learn from Implicit Feedback", "abstract": "Search-engine logs provide a wealth of information that machine-learning techniques can harness to improve search quality. With proper interpretations that avoid inherent biases, a search engine can use training data extracted from the logs to automatically tailor ranking functions to a particular user group or collection.", "year": 2007, "referenceCount": 13, "citationCount": 195, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1680188", "name": "T. Joachims"}, {"authorId": "1803571", "name": "Filip Radlinski"}]}, {"paperId": "84fc03d493da87e0d8086760e92560eec9749594", "url": "https://www.semanticscholar.org/paper/84fc03d493da87e0d8086760e92560eec9749594", "title": "Multi-machine scheduling-a multi-agent learning approach", "abstract": "Multi machine scheduling, that is, the assignment of jobs to machines such that certain performance demands like cost and time effectiveness are fulfilled, is a ubiquitous and complex activity in everyday life. The paper presents an approach to multi machine scheduling that follows the multiagent learning paradigm known from the field of distributed artificial intelligence. According to this approach the machines collectively and as a whole learn and iteratively refine appropriate schedules. The major characteristic of this approach is that learning is distributed over several machines, and that the individual machines carry out their learning activities in a parallel and asynchronous way.", "year": 1998, "referenceCount": 29, "citationCount": 46, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1799693", "name": "W. Brauer"}, {"authorId": "144799183", "name": "Gerhard Weiss"}]}, {"paperId": "e7c36f2caeb0bd6d691c4500d223abd482c61180", "url": "https://www.semanticscholar.org/paper/e7c36f2caeb0bd6d691c4500d223abd482c61180", "title": "Intrusion detection in SCADA systems using machine learning techniques", "abstract": "In this paper we present a intrusion detection module capable of detecting malicious network traffic in a SCADA (Supervisory Control and Data Acquisition) system. Malicious data in a SCADA system disrupt its correct functioning and tamper with its normal operation. OCSVM (One-Class Support Vector Machine) is an intrusion detection mechanism that does not need any labeled data for training or any information about the kind of anomaly is expecting for the detection process. This feature makes it ideal for processing SCADA environment data and automate SCADA performance monitoring. The OCSVM module developed is trained by network traces off line and detect anomalies in the system real time. The module is part of an IDS (Intrusion Detection System) system developed under CockpitCI project and communicates with the other parts of the system by the exchange of IDMEF (Intrusion Detection Message Exchange Format) messages that carry information about the source of the incident, the time and a classification of the alarm.", "year": 2014, "referenceCount": 97, "citationCount": 131, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3001662", "name": "L. Maglaras"}, {"authorId": "2149531404", "name": "Jianmin Jiang"}]}, {"paperId": "04ea4e24a418b80eea17faacfa00ee717d8867bb", "url": "https://www.semanticscholar.org/paper/04ea4e24a418b80eea17faacfa00ee717d8867bb", "title": "Manifold Learning of Brain MRIs by Deep Learning", "abstract": null, "year": 2013, "referenceCount": 13, "citationCount": 211, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "12710958", "name": "T. Brosch"}, {"authorId": "37709604", "name": "R. Tam"}]}, {"paperId": "24b471802eda460d4cc17e591804ef04c0cd18ef", "url": "https://www.semanticscholar.org/paper/24b471802eda460d4cc17e591804ef04c0cd18ef", "title": "Curriculum Learning: A Survey", "abstract": null, "year": 2021, "referenceCount": 238, "citationCount": 62, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40901288", "name": "Petru Soviany"}, {"authorId": "1817759", "name": "Radu Tudor Ionescu"}, {"authorId": "39337007", "name": "Paolo Rota"}, {"authorId": "1703601", "name": "N. Sebe"}]}, {"paperId": "484b3c21c75c6676c26703fa33c0d38747bd90be", "url": "https://www.semanticscholar.org/paper/484b3c21c75c6676c26703fa33c0d38747bd90be", "title": "Presto: distributed machine learning and graph processing with sparse matrices", "abstract": "It is cumbersome to write machine learning and graph algorithms in data-parallel models such as MapReduce and Dryad. We observe that these algorithms are based on matrix computations and, hence, are inefficient to implement with the restrictive programming and communication interface of such frameworks.\n In this paper we show that array-based languages such as R [3] are suitable for implementing complex algorithms and can outperform current data parallel solutions. Since R is single-threaded and does not scale to large datasets, we have built Presto, a distributed system that extends R and addresses many of its limitations. Presto efficiently shares sparse structured data, can leverage multi-cores, and dynamically partitions data to mitigate load imbalance. Our results show the promise of this approach: many important machine learning and graph algorithms can be expressed in a single framework and are substantially faster than those in Hadoop and Spark.", "year": 2013, "referenceCount": 41, "citationCount": 98, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2697906", "name": "S. Venkataraman"}, {"authorId": "152711509", "name": "Erik Bodzsar"}, {"authorId": "48315986", "name": "Indrajit Roy"}, {"authorId": "3274692", "name": "A. AuYoung"}, {"authorId": "143986781", "name": "R. Schreiber"}]}, {"paperId": "edb6e403ac6d25d23d10d563ab893556231b7b9c", "url": "https://www.semanticscholar.org/paper/edb6e403ac6d25d23d10d563ab893556231b7b9c", "title": "Putting Fairness Principles into Practice: Challenges, Metrics, and Improvements", "abstract": "As more researchers have become aware of and passionate about algorithmic fairness, there has been an explosion in papers laying out new metrics, suggesting algorithms to address issues, and calling attention to issues in existing applications of machine learning. This research has greatly expanded our understanding of the concerns and challenges in deploying machine learning, but there has been much less work in seeing how the rubber meets the road. In this paper we provide a case-study on the application of fairness in machine learning research to a production classification system, and offer new insights in how to measure and address algorithmic fairness issues. We discuss open questions in implementing equality of opportunity and describe our fairness metric, conditional equality, that takes into account distributional differences. Further, we provide a new approach to improve on the fairness metric during model training and demonstrate its efficacy in improving performance for a real-world product.", "year": 2019, "referenceCount": 39, "citationCount": 85, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2638246", "name": "Alex Beutel"}, {"authorId": "2144168512", "name": "Jilin Chen"}, {"authorId": "2155007", "name": "Tulsee Doshi"}, {"authorId": "2051972757", "name": "Hai Qian"}, {"authorId": "2064061699", "name": "Allison Woodruff"}, {"authorId": "2077109405", "name": "Christine Luu"}, {"authorId": "1759904", "name": "Pierre Kreitmann"}, {"authorId": "2153931", "name": "Jonathan Bischof"}, {"authorId": "2226805", "name": "Ed H. Chi"}]}, {"paperId": "600be3dde18d1059c6b56170bd04ee65ce79a848", "url": "https://www.semanticscholar.org/paper/600be3dde18d1059c6b56170bd04ee65ce79a848", "title": "Lookahead Optimizer: k steps forward, 1 step back", "abstract": "The vast majority of successful deep neural networks are trained using variants of stochastic gradient descent (SGD) algorithms. Recent attempts to improve SGD can be broadly categorized into two approaches: (1) adaptive learning rate schemes, such as AdaGrad and Adam, and (2) accelerated schemes, such as heavy-ball and Nesterov momentum. In this paper, we propose a new optimization algorithm, Lookahead, that is orthogonal to these previous approaches and iteratively updates two sets of weights. Intuitively, the algorithm chooses a search direction by looking ahead at the sequence of fast weights generated by another optimizer. We show that Lookahead improves the learning stability and lowers the variance of its inner optimizer with negligible computation and memory cost. We empirically demonstrate Lookahead can significantly improve the performance of SGD and Adam, even with their default hyperparameter settings on ImageNet, CIFAR-10/100, neural machine translation, and Penn Treebank.", "year": 2019, "referenceCount": 51, "citationCount": 450, "influentialCitationCount": 69, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "50495487", "name": "Michael Ruogu Zhang"}, {"authorId": "145202377", "name": "James Lucas"}, {"authorId": "1695689", "name": "Geoffrey E. Hinton"}, {"authorId": "2503659", "name": "Jimmy Ba"}]}, {"paperId": "5c21646d709daa1d9db51caae614c91da3342db8", "url": "https://www.semanticscholar.org/paper/5c21646d709daa1d9db51caae614c91da3342db8", "title": "Feature Selection Based on Structured Sparsity: A Comprehensive Study", "abstract": "Feature selection (FS) is an important component of many pattern recognition tasks. In these tasks, one is often confronted with very high-dimensional data. FS algorithms are designed to identify the relevant feature subset from the original features, which can facilitate subsequent analysis, such as clustering and classification. Structured sparsity-inducing feature selection (SSFS) methods have been widely studied in the last few years, and a number of algorithms have been proposed. However, there is no comprehensive study concerning the connections between different SSFS methods, and how they have evolved. In this paper, we attempt to provide a survey on various SSFS methods, including their motivations and mathematical representations. We then explore the relationship among different formulations and propose a taxonomy to elucidate their evolution. We group the existing SSFS methods into two categories, i.e., vector-based feature selection (feature selection based on lasso) and matrix-based feature selection (feature selection based on  ${l_{r,p}}$ -norm). Furthermore, FS has been combined with other machine learning algorithms for specific applications, such as multitask learning, multilabel learning, multiview learning, classification, and clustering. This paper not only compares the differences and commonalities of these methods based on regression and regularization strategies, but also provides useful guidelines to practitioners working in related fields to guide them how to do feature selection.", "year": 2017, "referenceCount": 169, "citationCount": 141, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143987790", "name": "Jie Gui"}, {"authorId": "1757186", "name": "Zhenan Sun"}, {"authorId": "1743600", "name": "Shuiwang Ji"}, {"authorId": "143719920", "name": "D. Tao"}, {"authorId": "143874948", "name": "T. Tan"}]}, {"paperId": "287bbba8e65cccb5dc61e438334dca430e7d001f", "url": "https://www.semanticscholar.org/paper/287bbba8e65cccb5dc61e438334dca430e7d001f", "title": "Spam Classification Based on Supervised Learning Using Machine Learning Techniques", "abstract": "E-mail is one of the most popular and frequently used ways of communication due to its worldwide accessibility, relatively fast message transfer, and low sending cost. The flaws in the e-mail protocols and the increasing amount of electronic business and financial transactions directly contribute to the increase in e-mail-based threats. Email spam is one of the major problems of the today‟s Internet, bringing financial damage to companies and annoying individual users. Spam emails are invading users without their consent and filling their mail boxes. They consume more network capacity as well as time in checking and deleting spam mails. The vast majority of Internet users are outspoken in their disdain for spam, although enough of them respond to commercial offers that spam remains a viable source of income to spammers. While most of the users want to do right think to avoid and get rid of spam, they need clear and simple guidelines on how to behave. In spite of all the measures taken to eliminate spam, they are not yet eradicated. Also when the counter measures are over sensitive, even legitimate emails will be eliminated. Among the approaches developed to stop spam, filtering is the one of the most important technique. Many researches in spam filtering have been centered on the more sophisticated classifier-related issues. In recent days, Machine learning for spam classification is an important research issue. The effectiveness of the proposed work is explores and identifies the use of different learning algorithms for classifying spam messages from e-mail. A comparative analysis among the algorithms has also been presented.", "year": 2011, "referenceCount": 14, "citationCount": 58, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35196491", "name": "D. Renuka"}, {"authorId": "2205613", "name": "T. Hamsapriya"}, {"authorId": "9404610", "name": "M. R. Chakkaravarthi"}, {"authorId": "2140666555", "name": "P. Surya"}]}, {"paperId": "efa8b1c728a06a4f01a60f586ea684592cb746a2", "url": "https://www.semanticscholar.org/paper/efa8b1c728a06a4f01a60f586ea684592cb746a2", "title": "An Empirical Study of the Behavior of Active Learning for Word Sense Disambiguation", "abstract": "This paper shows that two uncertainty-based active learning methods, combined with a maximum entropy model, work well on learning English verb senses. Data analysis on the learning process, based on both instance and feature levels, suggests that a careful treatment of feature extraction is important for the active learning to be useful for WSD. The overfitting phenomena that occurred during the active learning process are identified as classic overfitting in machine learning based on the data analysis.", "year": 2006, "referenceCount": 16, "citationCount": 89, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2108216213", "name": "Jinying Chen"}, {"authorId": "34568108", "name": "A. Schein"}, {"authorId": "1412391493", "name": "L. Ungar"}, {"authorId": "145755155", "name": "Martha Palmer"}]}, {"paperId": "537be27743beabd3338e4a8f033e24380bed9165", "url": "https://www.semanticscholar.org/paper/537be27743beabd3338e4a8f033e24380bed9165", "title": "Information Visualization in Data Mining and Knowledge Discovery", "abstract": "Data mining Wikipedia Fri, 23 Nov 2018 06:51:00 GMT Data mining is the process of discovering patterns in large data sets involving methods at the intersection of machine learning, statistics, and database systems. Data mining is an interdisciplinary subfield of computer science with an overall goal to extract information (with intelligent methods) from a data set and transform the information into a comprehensible structure for further use. ST-DBSCAN: An algorithm for clustering spatial–temporal data Mon, 19 Nov 2018 15:17:00 GMT", "year": 2001, "referenceCount": 0, "citationCount": 441, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145506801", "name": "Download Book"}]}, {"paperId": "dc95fb644c12ee9caa989390af29c969b4c1d646", "url": "https://www.semanticscholar.org/paper/dc95fb644c12ee9caa989390af29c969b4c1d646", "title": "Deep Ensemble Machine for Video Classification", "abstract": "Video classification has been extensively researched in computer vision due to its wide spread applications. However, it remains an outstanding task because of the great challenges in effective spatial-temporal feature extraction and efficient classification with high-dimensional video representations. To address these challenges, in this paper, we propose an end-to-end learning framework called deep ensemble machine (DEM) for video classification. Specifically, to establish effective spatio-temporal features, we propose using two deep convolutional neural networks (CNNs), i.e., vision and graphics group and C3-D to extract heterogeneous spatial and temporal features for complementary representations. To achieve efficient classification, we propose ensemble learning based on random projections aiming to transform high-dimensional features into a set of lower dimensional compact features in subspaces; an ensemble of classifiers is trained on the subspaces and combined with a weighting layer during the backpropagation. To further enhance the performance, we introduce rectified linear encoding (RLE) inspired from error-correcting output coding to encode the initial outputs of classifiers, followed by a softmax layer to produce the final classification results. DEM combines the strengths of deep CNNs and ensemble learning, which establishes a new end-to-end learning architecture for more accurate and efficient video classification. We show the great effectiveness of DEM by extensive experiments on four data sets for diverse video classification tasks including action recognition and dynamic scene classification. Results have shown that DEM achieves high performance on all tasks with an improvement of up to 13% on CIFAR10 data set over the baseline model.", "year": 2019, "referenceCount": 73, "citationCount": 38, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "23124669", "name": "Jiewan Zheng"}, {"authorId": "40916581", "name": "Xianbin Cao"}, {"authorId": "1740430", "name": "Baochang Zhang"}, {"authorId": "34798935", "name": "Xiantong Zhen"}, {"authorId": "7883602", "name": "Xiangbo Su"}]}, {"paperId": "a6e92f6fa9e91b7e869562a63b30a9a56cf14582", "url": "https://www.semanticscholar.org/paper/a6e92f6fa9e91b7e869562a63b30a9a56cf14582", "title": "Learning Fast Algorithms for Linear Transforms Using Butterfly Factorizations", "abstract": "Fast linear transforms are ubiquitous in machine learning, including the discrete Fourier transform, discrete cosine transform, and other structured transformations such as convolutions. All of these transforms can be represented by dense matrix-vector multiplication, yet each has a specialized and highly efficient (subquadratic) algorithm. We ask to what extent hand-crafting these algorithms and implementations is necessary, what structural priors they encode, and how much knowledge is required to automatically learn a fast algorithm for a provided structured transform. Motivated by a characterization of fast matrix-vector multiplication as products of sparse matrices, we introduce a parameterization of divide-and-conquer methods that is capable of representing a large class of transforms. This generic formulation can automatically learn an efficient algorithm for many important transforms; for example, it recovers the O(N log N) Cooley-Tukey FFT algorithm to machine precision, for dimensions N up to 1024. Furthermore, our method can be incorporated as a lightweight replacement of generic matrices in machine learning pipelines to learn efficient and compressible transformations. On a standard task of compressing a single hidden-layer network, our method exceeds the classification accuracy of unconstrained matrices on CIFAR-10 by 3.9 points-the first time a structured approach has done so-with 4× faster inference speed and 40× fewer parameters.", "year": 2019, "referenceCount": 54, "citationCount": 46, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "authors": [{"authorId": "24593911", "name": "Tri Dao"}, {"authorId": "39499001", "name": "Albert Gu"}, {"authorId": "41022841", "name": "Matthew Eichhorn"}, {"authorId": "1755572", "name": "A. Rudra"}, {"authorId": "2114485554", "name": "C. Ré"}]}, {"paperId": "9b618fa0cd834f7c4122c8e53539085e06922f8c", "url": "https://www.semanticscholar.org/paper/9b618fa0cd834f7c4122c8e53539085e06922f8c", "title": "Adversarial Perturbations Against Deep Neural Networks for Malware Classification", "abstract": "Deep neural networks, like many other machine learning models, have recently been shown to lack robustness against adversarially crafted inputs. These inputs are derived from regular inputs by minor yet carefully selected perturbations that deceive machine learning models into desired misclassifications. Existing work in this emerging field was largely specific to the domain of image classification, since the high-entropy of images can be conveniently manipulated without changing the images' overall visual appearance. Yet, it remains unclear how such attacks translate to more security-sensitive applications such as malware detection - which may pose significant challenges in sample generation and arguably grave consequences for failure. \nIn this paper, we show how to construct highly-effective adversarial sample crafting attacks for neural networks used as malware classifiers. The application domain of malware classification introduces additional constraints in the adversarial sample crafting problem when compared to the computer vision domain: (i) continuous, differentiable input domains are replaced by discrete, often binary inputs; and (ii) the loose condition of leaving visual appearance unchanged is replaced by requiring equivalent functional behavior. We demonstrate the feasibility of these attacks on many different instances of malware classifiers that we trained using the DREBIN Android malware data set. We furthermore evaluate to which extent potential defensive mechanisms against adversarial crafting can be leveraged to the setting of malware classification. While feature reduction did not prove to have a positive impact, distillation and re-training on adversarially crafted samples show promising results.", "year": 2016, "referenceCount": 28, "citationCount": 343, "influentialCitationCount": 27, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39221858", "name": "Kathrin Grosse"}, {"authorId": "1967156", "name": "Nicolas Papernot"}, {"authorId": "2134700604", "name": "Praveen Manoharan"}, {"authorId": "144588806", "name": "M. Backes"}, {"authorId": "144061974", "name": "P. Mcdaniel"}]}, {"paperId": "f92a6bd243245358b3ca8f65613f493bed3df2f5", "url": "https://www.semanticscholar.org/paper/f92a6bd243245358b3ca8f65613f493bed3df2f5", "title": "Towards Geo-Distributed Machine Learning", "abstract": "Latency to end-users and regulatory requirements push large companies to build data centers all around the world. The resulting data is \"born\" geographically distributed. On the other hand, many machine learning applications require a global view of such data in order to achieve the best results. These types of applications form a new class of learning problems, which we call Geo-Distributed Machine Learning (GDML). Such applications need to cope with: 1) scarce and expensive cross-data center bandwidth, and 2) growing privacy concerns that are pushing for stricter data sovereignty regulations. Current solutions to learning from geo-distributed data sources revolve around the idea of first centralizing the data in one data center, and then training locally. As machine learning algorithms are communication-intensive, the cost of centralizing the data is thought to be offset by the lower cost of intra-data center communication during training. In this work, we show that the current centralized practice can be far from optimal, and propose a system for doing geo-distributed training. Furthermore, we argue that the geo-distributed approach is structurally more amenable to dealing with regulatory constraints, as raw data never leaves the source data center. Our empirical evaluation on three real datasets confirms the general validity of our approach, and shows that GDML is not only possible but also advisable in many scenarios.", "year": 2016, "referenceCount": 58, "citationCount": 43, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "151032942", "name": "Ignacio Cano"}, {"authorId": "2965406", "name": "Markus Weimer"}, {"authorId": "144542135", "name": "D. Mahajan"}, {"authorId": "1692732", "name": "C. Curino"}, {"authorId": "2260647", "name": "Giovanni Matteo Fumarola"}, {"authorId": "144695691", "name": "A. Krishnamurthy"}]}, {"paperId": "f850c084395d7fb1f75eb21d0ab8c2f1df6bc938", "url": "https://www.semanticscholar.org/paper/f850c084395d7fb1f75eb21d0ab8c2f1df6bc938", "title": "Comparative Study of Chronic Kidney Disease Prediction using KNN and SVM", "abstract": "Chronic kidney disease (CKD), also known as chronic renal disease. Chronic kidney disease involves conditions that damage your kidneys and decrease their ability to keep you healthy. You may develop complications like high blood pressure, anemia (low blood count), weak bones, poor nutritional health and nerve damage. . Early detection and treatment can often keep chronic kidney disease from getting worse. Data Mining is the term used for knowledge discovery from large databases. The task of data mining is to make use of historical data, to discover regular patterns and improve future decisions, follows from the convergence of several recent trends: the lessening cost of large data storage devices and the everincreasing ease of collecting data over networks; the expansion of robust and efficient machine learning algorithms to process this data; and the lessening cost of computational power, enabling use of computationally intensive methods for data analysis. Machine learning, has already created practical applications in such areas as analyzing medical science outcomes, detecting fraud, detecting fake users etc. Various data mining classification approaches and machine learning algorithms are applied for prediction of chronic diseases. The objective of this research work is to introduce a new decision support system to predict chronic kidney disease. The aim of this work is to compare the performance of Support vector machine (SVM) and K-Nearest Neighbour (KNN) classifier on the basis of its accuracy, precision and execution time for CKD prediction. From the experimental results it is observed that the performance of KNN classifier is better than SVM. Keywords—Data Mining, Machine learning, Chronic kidney disease, Classification, K-Nearest Neighbour, Support vector machine.", "year": 2015, "referenceCount": 31, "citationCount": 92, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "4326521", "name": "P. Sinha"}, {"authorId": "2855039", "name": "P. Sinha"}]}, {"paperId": "711d306909d394172f0d7735c6d253e0838e3c5e", "url": "https://www.semanticscholar.org/paper/711d306909d394172f0d7735c6d253e0838e3c5e", "title": "A learning agent for wireless news access", "abstract": "We describe a user interface for wireless information devices, specifically designed to facilitate learning about users' individual interests in daily news stories. User feedback is collected unobtrusively to form the basis for a content-based machine learning algorithm. As a result, the described system can adapt to users' individual interests, reduce the amount of information that needs to be transmitted, and help users access relevant information with minimal effort.", "year": 2000, "referenceCount": 11, "citationCount": 134, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1691741", "name": "Daniel Billsus"}, {"authorId": "1694780", "name": "M. Pazzani"}, {"authorId": "2108206346", "name": "James Chen"}]}, {"paperId": "0ebe4b852b57530be9e1502f81f1a441a55d6d54", "url": "https://www.semanticscholar.org/paper/0ebe4b852b57530be9e1502f81f1a441a55d6d54", "title": "A Parametric Optimization Method for Machine Learning", "abstract": "The classification problem of constructing a plane to separate the members of two sets can be formulated as a parametric bilinear program. This approach was originally created to minimize the number of points misclassified. However, a novel interpretation of the algorithm is that the subproblems represent alternative error functions of the misclassified points. Each subproblem identifies a specified number of outliers and minimizes the magnitude of the errors on the remaining points. A tuning set is used to select the best result among the subproblems. A parametric Frank-Wolfe method was used to solve the bilinear subproblems. Computational results on a number of datasets indicate that the results compare very favorably with linear programming and heuristic search approaches. The algorithm can be used as part of a decision tree algorithm to create nonlinear classifiers.", "year": 1997, "referenceCount": 16, "citationCount": 73, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2065549778", "name": "Kristin P. Bennett"}, {"authorId": "2647543", "name": "Erin J. Bredensteiner"}]}, {"paperId": "f77854f94c2f849ed93c018662bb3f0a3f8e38d2", "url": "https://www.semanticscholar.org/paper/f77854f94c2f849ed93c018662bb3f0a3f8e38d2", "title": "Missing data imputation using statistical and machine learning methods in a real breast cancer problem", "abstract": null, "year": 2010, "referenceCount": 77, "citationCount": 388, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "145311379", "name": "J. M. Jerez"}, {"authorId": "2070563347", "name": "Ignacio Molina"}, {"authorId": "1398630827", "name": "P. J. García-Laencina"}, {"authorId": "143902219", "name": "E. Alba"}, {"authorId": "3121666", "name": "N. Ribelles"}, {"authorId": "1663772072", "name": "Miguel Martín"}, {"authorId": "144324013", "name": "L. Franco"}]}, {"paperId": "db6b56557d4b8c722e1fc504af4a361cfe1e22d8", "url": "https://www.semanticscholar.org/paper/db6b56557d4b8c722e1fc504af4a361cfe1e22d8", "title": "Contributions to the study of SMS spam filtering: new collection and results", "abstract": "The growth of mobile phone users has lead to a dramatic increasing of SMS spam messages. In practice, fighting mobile phone spam is difficult by several factors, including the lower rate of SMS that has allowed many users and service providers to ignore the issue, and the limited availability of mobile phone spam-filtering software. On the other hand, in academic settings, a major handicap is the scarcity of public SMS spam datasets, that are sorely needed for validation and comparison of different classifiers. Moreover, as SMS messages are fairly short, content-based spam filters may have their performance degraded. In this paper, we offer a new real, public and non-encoded SMS spam collection that is the largest one as far as we know. Moreover, we compare the performance achieved by several established machine learning methods. The results indicate that Support Vector Machine outperforms other evaluated classifiers and, hence, it can be used as a good baseline for further comparison.", "year": 2011, "referenceCount": 21, "citationCount": 332, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144775226", "name": "Tiago A. Almeida"}, {"authorId": "2045680", "name": "J. M. G. Hidalgo"}, {"authorId": "145534026", "name": "A. Yamakami"}]}, {"paperId": "ef8a87960d1402226e126858276d34f85efc40a0", "url": "https://www.semanticscholar.org/paper/ef8a87960d1402226e126858276d34f85efc40a0", "title": "Machine learning: A revolution in risk management and compliance?", "abstract": "Financial institutions (FIs) are increasingly looking to deploy machine learning approaches to manage and mine regulatory reporting data and unstructured information. This article aims to introduce the machine learning field and discusses several \"regtech\" application cases within FIs, based on discussions with the sector and with technology ventures: credit risk modeling, detection of credit card fraud and money laundering, and surveillance of conduct breaches. Two tentative conclusions emerge on the added value of applying machine learning in the financial services sector. First, the ability of machine learning methods to analyze very large amounts of data, while offering a high granularity and depth of predictive analysis, can significantly improve analytical capabilities across risk management and compliance areas, such as money laundering detection and credit risk modeling. Second, the application of machine learning approaches within the financial services sector is highly context-dependent. Data quality and availability can be an issue; more importantly, the predictive performance and granularity of analysis of several approaches can come at the cost of increased model complexity and a lack of explanatory insight. This is an issue particularly where analytics are applied in a regulatory context, and a supervisor or compliance team will want to audit and understand the applied model.", "year": 2017, "referenceCount": 1, "citationCount": 54, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "123624581", "name": "Bart. Van Liebergen"}]}, {"paperId": "906c38d0bb8ef10859de936c29c31290ca2c7cb9", "url": "https://www.semanticscholar.org/paper/906c38d0bb8ef10859de936c29c31290ca2c7cb9", "title": "Machine learning in cardiovascular magnetic resonance: basic concepts and applications", "abstract": null, "year": 2019, "referenceCount": 104, "citationCount": 105, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "3148583", "name": "T. Leiner"}, {"authorId": "1717710", "name": "D. Rueckert"}, {"authorId": "1804579", "name": "Avan Suinesiaputra"}, {"authorId": "1924789", "name": "B. Baessler"}, {"authorId": "2347736", "name": "R. Nezafat"}, {"authorId": "3165444", "name": "I. Išgum"}, {"authorId": "145098781", "name": "A. Young"}]}, {"paperId": "bad2bbfc9b5cf6c93ece1731ac9389bf08407be0", "url": "https://www.semanticscholar.org/paper/bad2bbfc9b5cf6c93ece1731ac9389bf08407be0", "title": "Learning to Distinguish Hypernyms and Co-Hyponyms", "abstract": "This work is concerned with distinguishing different semantic relations which exist between distributionally similar words. We compare a novel approach based on training a linear Support Vector Machine on pairs of feature vectors with state-of-the-art methods based on distributional similarity. We show that the new supervised approach does better even when there is minimal information about the target words in the training data, giving a 15% reduction in error rate over unsupervised approaches.", "year": 2014, "referenceCount": 41, "citationCount": 194, "influentialCitationCount": 48, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2500077", "name": "Julie Weeds"}, {"authorId": "32914745", "name": "Daoud Clarke"}, {"authorId": "2056788", "name": "Jeremy Reffin"}, {"authorId": "35258592", "name": "David J. Weir"}, {"authorId": "39877126", "name": "B. Keller"}]}, {"paperId": "1cb8de070943349373fbf527e1abd8451903c6db", "url": "https://www.semanticscholar.org/paper/1cb8de070943349373fbf527e1abd8451903c6db", "title": "Student Performance Prediction using Machine Learning", "abstract": "In this paper, a model is proposed to predict the performance of students in an academic organization. The algorithm employed is a machine learning technique called Neural Networks. Further, the importance of several different attributes, or \"features\" is considered, in order to determine which of these are correlated with student performance. Finally, the results of an experiment follow, showcasing the power of machine learning in such an application. Keywords— Artificial intelligence, machine learning, student performance, neural networks", "year": 2015, "referenceCount": 4, "citationCount": 42, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "123770158", "name": "H. Agrawal"}, {"authorId": "70048579", "name": "Harshil Mavani"}]}, {"paperId": "fd5f4d69d60372ea8c16ee185a7bd66abeb5d9f0", "url": "https://www.semanticscholar.org/paper/fd5f4d69d60372ea8c16ee185a7bd66abeb5d9f0", "title": "Disjunctions of Conjunctions, Cognitive Simplicity, and Consideration Sets", "abstract": "The authors test methods, based on cognitively simple decision rules, that predict which products consumers select for their consideration sets. Drawing on qualitative research, the authors propose disjunctions-of-conjunctions (DOC) decision rules that generalize well-studied decision models, such as disjunctive, conjunctive, lexicographic, and subset conjunctive rules. They propose two machine-learning methods to estimate cognitively simple DOC rules. They observe consumers' consideration sets for global positioning systems for both calibration and validation data. They compare the proposed methods with both machine-learning and hierarchical Bayes methods, each based on five extant compensatory and noncompensatory rules. For the validation data, the cognitively simple DOC-based methods predict better than the ten benchmark methods on an information theoretic measure and on hit rates. The results are robust with respect to format by which consideration is measured, sample, and presentation of profiles. The article closes with an illustration of how DOC-based rules can affect managerial decisions.", "year": 2010, "referenceCount": 89, "citationCount": 160, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "2344635", "name": "J. Hauser"}, {"authorId": "3089062", "name": "Olivier Toubia"}, {"authorId": "1801089", "name": "T. Evgeniou"}, {"authorId": "103227759", "name": "R. Befurt"}, {"authorId": "2530415", "name": "Daria Dzyabura"}]}, {"paperId": "c25da542b00e724e87c4b86b7a7ff0fd01521cd3", "url": "https://www.semanticscholar.org/paper/c25da542b00e724e87c4b86b7a7ff0fd01521cd3", "title": "Learning to Rank with Extreme Learning Machine", "abstract": null, "year": 2013, "referenceCount": 26, "citationCount": 38, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2459175", "name": "Weiwei Zong"}, {"authorId": "145678691", "name": "G. Huang"}]}, {"paperId": "5afbc0e1cb4cfb6f22bb1b11de3498a610a99ec7", "url": "https://www.semanticscholar.org/paper/5afbc0e1cb4cfb6f22bb1b11de3498a610a99ec7", "title": "Parsing and Question Classification for Question Answering", "abstract": "This paper describes machine learning based parsing and question classification for question answering. We demonstrate that for this type of application, parse trees have to be semantically richer and structurally more oriented towards semantics than what most treebanks offer. We empirically show how question parsing dramatically improves when augmenting a semantically enriched Penn treebank training corpus with an additional question treebank.", "year": 2001, "referenceCount": 16, "citationCount": 194, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1791311", "name": "U. Hermjakob"}]}, {"paperId": "3360768fcb265a8b7c1ee5ba7cfe03de0e2fad62", "url": "https://www.semanticscholar.org/paper/3360768fcb265a8b7c1ee5ba7cfe03de0e2fad62", "title": "Mixture Models for Diverse Machine Translation: Tricks of the Trade", "abstract": "Mixture models trained via EM are among the simplest, most widely used and well understood latent variable models in the machine learning literature. Surprisingly, these models have been hardly explored in text generation applications such as machine translation. In principle, they provide a latent variable to control generation and produce a diverse set of hypotheses. In practice, however, mixture models are prone to degeneracies---often only one component gets trained or the latent variable is simply ignored. We find that disabling dropout noise in responsibility computation is critical to successful training. In addition, the design choices of parameterization, prior distribution, hard versus soft EM and online versus offline assignment can dramatically affect model performance. We develop an evaluation protocol to assess both quality and diversity of generations against multiple references, and provide an extensive empirical study of several mixture model variants. Our analysis shows that certain types of mixture models are more robust and offer the best trade-off between translation quality and diversity compared to variational models and diverse decoding approaches.\\footnote{Code to reproduce the results in this paper is available at \\url{this https URL}}", "year": 2019, "referenceCount": 41, "citationCount": 91, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3456570", "name": "T. Shen"}, {"authorId": "40511414", "name": "Myle Ott"}, {"authorId": "2325985", "name": "Michael Auli"}, {"authorId": "1706809", "name": "Marc'Aurelio Ranzato"}]}, {"paperId": "6818a0042d3fa930bf84d3c45caca555a50f29bb", "url": "https://www.semanticscholar.org/paper/6818a0042d3fa930bf84d3c45caca555a50f29bb", "title": "Online Sequential Fuzzy Extreme Learning Machine for Function Approximation and Classification Problems", "abstract": "In this correspondence, an online sequential fuzzy extreme learning machine (OS-fuzzy-ELM) has been developed for function approximation and classification problems. The equivalence of a Takagi-Sugeno-Kang (TSK) fuzzy inference system (FIS) to a generalized single hidden-layer feedforward network is shown first, which is then used to develop the OS-fuzzy-ELM algorithm. This results in a FIS that can handle any bounded nonconstant piecewise continuous membership function. Furthermore, the learning in OS-fuzzy-ELM can be done with the input data coming in a one-by-one mode or a chunk-by-chunk (a block of data) mode with fixed or varying chunk size. In OS-fuzzy-ELM, all the antecedent parameters of membership functions are randomly assigned first, and then, the corresponding consequent parameters are determined analytically. Performance comparisons of OS-fuzzy-ELM with other existing algorithms are presented using real-world benchmark problems in the areas of nonlinear system identification, regression, and classification. The results show that the proposed OS-fuzzy-ELM produces similar or better accuracies with at least an order-of-magnitude reduction in the training time.", "year": 2009, "referenceCount": 26, "citationCount": 322, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Medicine", "Computer Science"], "authors": [{"authorId": "2774247", "name": "Hai-Jun Rong"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "145411276", "name": "N. Sundararajan"}, {"authorId": "1800678", "name": "P. Saratchandran"}]}, {"paperId": "f3eda875e14bf933759f3b777131a4a9973537b4", "url": "https://www.semanticscholar.org/paper/f3eda875e14bf933759f3b777131a4a9973537b4", "title": "Data-driven science and engineering: machine learning, dynamical systems, and control", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 368, "influentialCitationCount": 50, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153929250", "name": "T. Peters"}]}, {"paperId": "ed6c7caed5933e15ceb76a71c720778716cff693", "url": "https://www.semanticscholar.org/paper/ed6c7caed5933e15ceb76a71c720778716cff693", "title": "Driving Style Classification Using a Semisupervised Support Vector Machine", "abstract": "Supervised learning approaches are widely used for driving style classification; however, they often require a large amount of labeled training data, which is usually scarce in a real-world setting. Moreover, it is time-consuming to manually label huge amounts of driving data due to uncertainties of driver behavior and variances among the data analysts. To address this problem, a semisupervised approach, a semisupervised support vector machine (S3VM), is employed to classify drivers into aggressive and normal styles based on a few labeled data points. First, a few data clusters are selected and manually labeled using a $ k$ -means clustering method. Then, a specific differentiable surrogate of a loss function is developed, which makes it feasible to use standard optimization tools to solve the nonconvex optimization problem. One of the most popular quasi-Newton algorithms is then used to assign the optimal label to all of the training data. Finally, we compare the S3VM method with a support vector machine method for classifying driving styles from different amounts of labeled data. Experiments show that the S3VM method can improve the classification accuracy by about 10% and reduce the labeling effort by using only a few labeled data clusters among huge amounts of unlabeled data.", "year": 2017, "referenceCount": 46, "citationCount": 129, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2108270996", "name": "Wenshuo Wang"}, {"authorId": "2466765", "name": "Junqiang Xi"}, {"authorId": "2058487323", "name": "Alexandre Chong"}, {"authorId": "47681623", "name": "Lin Li"}]}, {"paperId": "3dac0f361aa02435c39ba5a0b7d33543d4195145", "url": "https://www.semanticscholar.org/paper/3dac0f361aa02435c39ba5a0b7d33543d4195145", "title": "Designing Anticancer Peptides by Constructive Machine Learning", "abstract": "Constructive (generative) machine learning enables the automated generation of novel chemical structures without the need for explicit molecular design rules. This study presents the experimental application of such a deep machine learning model to design membranolytic anticancer peptides (ACPs) de novo. A recurrent neural network with long short‐term memory cells was trained on α‐helical cationic amphipathic peptide sequences and then fine‐tuned with 26 known ACPs by transfer learning. This optimized model was used to generate unique and novel amino acid sequences. Twelve of the peptides were synthesized and tested for their activity on MCF7 human breast adenocarcinoma cells and selectivity against human erythrocytes. Ten of these peptides were active against cancer cells. Six of the active peptides killed MCF7 cancer cells without affecting human erythrocytes with at least threefold selectivity. These results advocate constructive machine learning for the automated design of peptides with desired biological activities.", "year": 2018, "referenceCount": 18, "citationCount": 53, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "3674456", "name": "F. Grisoni"}, {"authorId": "46703885", "name": "Claudia S Neuhaus"}, {"authorId": "8760576", "name": "G. Gabernet"}, {"authorId": "35276897", "name": "A. T. Müller"}, {"authorId": "40008184", "name": "J. A. Hiss"}, {"authorId": "144522872", "name": "G. Schneider"}]}, {"paperId": "cc4d0ef3005c7472be37f2ba80923bb935ee2e01", "url": "https://www.semanticscholar.org/paper/cc4d0ef3005c7472be37f2ba80923bb935ee2e01", "title": "Incremental Learning From Stream Data", "abstract": "Recent years have witnessed an incredibly increasing interest in the topic of incremental learning. Unlike conventional machine learning situations, data flow targeted by incremental learning becomes available continuously over time. Accordingly, it is desirable to be able to abandon the traditional assumption of the availability of representative training data during the training period to develop decision boundaries. Under scenarios of continuous data flow, the challenge is how to transform the vast amount of stream raw data into information and knowledge representation, and accumulate experience over time to support future decision-making process. In this paper, we propose a general adaptive incremental learning framework named ADAIN that is capable of learning from continuous raw data, accumulating experience over time, and using such knowledge to improve future learning and prediction performance. Detailed system level architecture and design strategies are presented in this paper. Simulation results over several real-world data sets are used to validate the effectiveness of this method.", "year": 2011, "referenceCount": 65, "citationCount": 156, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2198278", "name": "Haibo He"}, {"authorId": "2118529566", "name": "Sheng Chen"}, {"authorId": "145078521", "name": "Kang Li"}, {"authorId": "145880436", "name": "Xin Xu"}]}, {"paperId": "7c573ca029c19fd342b7e4b81a53031c69bd303c", "url": "https://www.semanticscholar.org/paper/7c573ca029c19fd342b7e4b81a53031c69bd303c", "title": "Hedonic Housing Theory — A Machine Learning Investigation", "abstract": "The hedonic pricing theory suggests that house is a differ-entiated commodity, whose value depends on its hetero-geneous characteristics. Application of the theory has been well implemented using OLS Regression. Our study investigates this econometric concept using machine learning algorithms. An improved pricing will benefit buyers, sellers, investors, banks and real estate professionals. Normality test for the experiment was done using Chi-Square Quantile-Quantile plot and Henze-Zirkler's Multivariate Normality Test. Statistical relationship was based on correlation matrix, Kaiser-Meyer-Olkin and Bartlett tests. Support Vector Regression (SVR), K-Nearest Neighbor (K-NN) and Principal Component Re-gression (PCR) were used as learning algorithms. Per-formance comparison of the learning algorithms was done using spearman's rho correlation coefficient. The performance of the model showed that PCR has a slight edge over SVR and K-NN. Also, the study validated the suitability and substitutability of PCR, SVR and K-NN in the implementation of the hedonic pricing theory.", "year": 2016, "referenceCount": 18, "citationCount": 25, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8844525", "name": "T. Oladunni"}, {"authorId": "2109850347", "name": "Sharad Sharma"}]}, {"paperId": "3d78d00e44e924eea39972ebbefd7dd933c23145", "url": "https://www.semanticscholar.org/paper/3d78d00e44e924eea39972ebbefd7dd933c23145", "title": "Using machine learning to detect events in eye-tracking data", "abstract": null, "year": 2018, "referenceCount": 52, "citationCount": 96, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2388767", "name": "R. Zemblys"}, {"authorId": "47171148", "name": "D. Niehorster"}, {"authorId": "1778350", "name": "Oleg V. Komogortsev"}, {"authorId": "3165327", "name": "K. Holmqvist"}]}, {"paperId": "e55a12818d7b65f3b728059ab8937c30bfa2b694", "url": "https://www.semanticscholar.org/paper/e55a12818d7b65f3b728059ab8937c30bfa2b694", "title": "Gesture modeling and recognition using finite state machines", "abstract": "We propose a state-based approach to gesture learning and recognition. Using spatial clustering and temporal alignment, each gesture is defined to be an ordered sequence of states in spatial-temporal space. The 2D image positions of the centers of the head and both hands of the user are used as features; these are located by a color-based tracking method. From training data of a given gesture, we first learn the spatial information and then group the data into segments that are automatically aligned temporally. The temporal information is further integrated to build a finite state machine (FSM) recognizer. Each gesture has a FSM corresponding to it. The computational efficiency of the FSM recognizers allows us to achieve real-time on-line performance. We apply this technique to build an experimental system that plays a game of \"Simon Says\" with the user.", "year": 2000, "referenceCount": 11, "citationCount": 269, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8824068", "name": "P. Hong"}, {"authorId": "153652752", "name": "Thomas S. Huang"}, {"authorId": "144097660", "name": "M. Turk"}]}, {"paperId": "c990dcda41076956426872b7d72ec4121f354102", "url": "https://www.semanticscholar.org/paper/c990dcda41076956426872b7d72ec4121f354102", "title": "Computational Modeling of β-Secretase 1 (BACE-1) Inhibitors Using Ligand Based Approaches", "abstract": "The binding affinities (IC50) reported for diverse structural and chemical classes of human β-secretase 1 (BACE-1) inhibitors in literature were modeled using multiple in silico ligand based modeling approaches and statistical techniques. The descriptor space encompasses simple binary molecular fingerprint, one- and two-dimensional constitutional, physicochemical, and topological descriptors, and sophisticated three-dimensional molecular fields that require appropriate structural alignments of varied chemical scaffolds in one universal chemical space. The affinities were modeled using qualitative classification or quantitative regression schemes involving linear, nonlinear, and deep neural network (DNN) machine-learning methods used in the scientific literature for quantitative-structure activity relationships (QSAR). In a departure from tradition, ∼20% of the chemically diverse data set (205 compounds) was used to train the model with the remaining ∼80% of the structural and chemical analogs used as part of an external validation (1273 compounds) and prospective test (69 compounds) sets respectively to ascertain the model performance. The machine-learning methods investigated herein performed well in both the qualitative classification (∼70% accuracy) and quantitative IC50 predictions (RMSE ∼ 1 log). The success of the 2D descriptor based machine learning approach when compared against the 3D field based technique pursued for hBACE-1 inhibitors provides a strong impetus for systematically applying such methods during the lead identification and optimization efforts for other protein families as well.", "year": 2016, "referenceCount": 74, "citationCount": 143, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine", "Chemistry"], "authors": [{"authorId": "144865677", "name": "G. Subramanian"}, {"authorId": "2378027", "name": "Bharath Ramsundar"}, {"authorId": "1806271", "name": "V. Pande"}, {"authorId": "144030239", "name": "R. Denny"}]}, {"paperId": "3dc0f10f117bdfb6d5c15ad738929daf3f862585", "url": "https://www.semanticscholar.org/paper/3dc0f10f117bdfb6d5c15ad738929daf3f862585", "title": "ATMSeer: Increasing Transparency and Controllability in Automated Machine Learning", "abstract": "To relieve the pain of manually selecting machine learning algorithms and tuning hyperparameters, automated machine learning (AutoML) methods have been developed to automatically search for good models. Due to the huge model search space, it is impossible to try all models. Users tend to distrust automatic results and increase the search budget as much as they can, thereby undermining the efficiency of AutoML. To address these issues, we design and implement ATMSeer, an interactive visualization tool that supports users in refining the search space of AutoML and in analyzing the results. To guide the design of ATMSeer, we derive a workflow of using AutoML based on interviews with machine learning experts. A multi-granularity visualization is proposed to enable users to monitor the AutoML process, analyze the searched models, and refine the search space in real time. We demonstrate the utility and usability of ATMSeer through two case studies, expert interviews, and a user study with 13 end users.", "year": 2019, "referenceCount": 34, "citationCount": 64, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "49110486", "name": "Qianwen Wang"}, {"authorId": "2056968793", "name": "Yao Ming"}, {"authorId": "2111472932", "name": "Zhihua Jin"}, {"authorId": "2647686", "name": "Qiaomu Shen"}, {"authorId": "35386454", "name": "Dongyu Liu"}, {"authorId": "35651709", "name": "Micah J. Smith"}, {"authorId": "1803567", "name": "K. Veeramachaneni"}, {"authorId": "145506027", "name": "Huamin Qu"}]}, {"paperId": "9ae08a7b7dc0002fb326832a1cc90804b63e35e0", "url": "https://www.semanticscholar.org/paper/9ae08a7b7dc0002fb326832a1cc90804b63e35e0", "title": "An introduction to machine learning methods", "abstract": null, "year": 1999, "referenceCount": 74, "citationCount": 58, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143841380", "name": "A. Fielding"}]}, {"paperId": "2edc8083073837564306943aab77d6dcc19d0cdc", "url": "https://www.semanticscholar.org/paper/2edc8083073837564306943aab77d6dcc19d0cdc", "title": "Realization of a geometry theorem proving machine", "abstract": null, "year": 1995, "referenceCount": 0, "citationCount": 430, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2969408", "name": "H. Gelernter"}]}, {"paperId": "8fd58293e18a43fa97746bf3cd1273641054084b", "url": "https://www.semanticscholar.org/paper/8fd58293e18a43fa97746bf3cd1273641054084b", "title": "A Machine Learning Framework to Identify Students at Risk of Adverse Academic Outcomes", "abstract": "Many school districts have developed successful intervention programs to help students graduate high school on time. However, identifying and prioritizing students who need those interventions the most remains challenging. This paper describes a machine learning framework to identify such students, discusses features that are useful for this task, applies several classification algorithms, and evaluates them using metrics important to school administrators. To help test this framework and make it practically useful, we partnered with two U.S. school districts with a combined enrollment of approximately 200,000 students. We together designed several evaluation metrics to assess the goodness of machine learning algorithms from an educator's perspective. This paper focuses on students at risk of not finishing high school on time, but our framework lays a strong foundation for future work on other adverse academic outcomes.", "year": 2015, "referenceCount": 36, "citationCount": 123, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1892673", "name": "Himabindu Lakkaraju"}, {"authorId": "49112220", "name": "E. Aguiar"}, {"authorId": "1393011928", "name": "Carl Shan"}, {"authorId": "152724738", "name": "David I Miller"}, {"authorId": "2067076804", "name": "Nasir Bhanpuri"}, {"authorId": "1791498", "name": "R. Ghani"}, {"authorId": "36990335", "name": "Kecia L. Addison"}]}, {"paperId": "a0309aebc917601f10a29b91811a70819a68e6a5", "url": "https://www.semanticscholar.org/paper/a0309aebc917601f10a29b91811a70819a68e6a5", "title": "Review of Machine Learning Approaches for Biomass and Soil Moisture Retrievals from Remote Sensing Data", "abstract": "The enormous increase of remote sensing data from airborne and space-borne platforms, as well as ground measurements has directed the attention of scientists towards new and efficient retrieval methodologies. Of particular importance is the consideration of the large extent and the high dimensionality (spectral, temporal and spatial) of remote sensing data. Moreover, the launch of the Sentinel satellite family will increase the availability of data, especially in the temporal domain, at no cost to the users. To analyze these data and to extract relevant features, such as essential climate variables (ECV), specific methodologies need to be exploited. Among these, greater attention is devoted to machine learning methods due to their flexibility and the capability to process large number of inputs and to handle non-linear problems. The main objective of this paper is to provide a review of research that is being carried out to retrieve two critically important terrestrial biophysical quantities (vegetation biomass and soil moisture) from remote sensing data using machine learning methods.", "year": 2015, "referenceCount": 143, "citationCount": 235, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48714739", "name": "Iftikhar Ali"}, {"authorId": "1766110", "name": "F. Greifeneder"}, {"authorId": "49048618", "name": "J. Stamenkovic"}, {"authorId": "7679232", "name": "M. Neumann"}, {"authorId": "1774944", "name": "C. Notarnicola"}]}, {"paperId": "2f80e4f9488a685c2f5d1784bd75bef537e9e1cd", "url": "https://www.semanticscholar.org/paper/2f80e4f9488a685c2f5d1784bd75bef537e9e1cd", "title": "MMR-based Active Machine Learning for Bio Named Entity Recognition", "abstract": "This paper presents a new active learning paradigm which considers not only the uncertainty of the classifier but also the diversity of the corpus. The two measures for uncertainty and diversity were combined using the MMR (Maximal Marginal Relevance) method to give the sampling scores in our active learning strategy. We incorporated MMR-based active machine-learning idea into the biomedical named-entity recognition system. Our experimental results indicated that our strategies for active-learning based sample selection could significantly reduce the human effort.", "year": 2006, "referenceCount": 12, "citationCount": 64, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2047181", "name": "Seokhwan Kim"}, {"authorId": "2152603843", "name": "Yu Song"}, {"authorId": "2572316", "name": "Kyungduk Kim"}, {"authorId": "2007875", "name": "Jeongwon Cha"}, {"authorId": "2167149040", "name": "G. G. Lee"}]}, {"paperId": "3879db5c30532fff41af1ffef9e265818e7c9285", "url": "https://www.semanticscholar.org/paper/3879db5c30532fff41af1ffef9e265818e7c9285", "title": "A Survey on Machine-Learning Techniques for UAV-Based Communications", "abstract": "Unmanned aerial vehicles (UAVs) will be an integral part of the next generation wireless communication networks. Their adoption in various communication-based applications is expected to improve coverage and spectral efficiency, as compared to traditional ground-based solutions. However, this new degree of freedom that will be included in the network will also add new challenges. In this context, the machine-learning (ML) framework is expected to provide solutions for the various problems that have already been identified when UAVs are used for communication purposes. In this article, we provide a detailed survey of all relevant research works, in which ML techniques have been used on UAV-based communications for improving various design and functional aspects such as channel modeling, resource management, positioning, and security.", "year": 2019, "referenceCount": 154, "citationCount": 106, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3315482", "name": "P. Bithas"}, {"authorId": "32340863", "name": "E. T. Michailidis"}, {"authorId": "2636013", "name": "Nikolaos Nomikos"}, {"authorId": "2338906", "name": "D. Vouyioukas"}, {"authorId": "144905712", "name": "A. Kanatas"}]}, {"paperId": "58c6f890a1ae372958b7decf56132fe258152722", "url": "https://www.semanticscholar.org/paper/58c6f890a1ae372958b7decf56132fe258152722", "title": "Regularizing and Optimizing LSTM Language Models", "abstract": "Recurrent neural networks (RNNs), such as long short-term memory networks (LSTMs), serve as a fundamental building block for many sequence learning tasks, including machine translation, language modeling, and question answering. In this paper, we consider the specific problem of word-level language modeling and investigate strategies for regularizing and optimizing LSTM-based models. We propose the weight-dropped LSTM which uses DropConnect on hidden-to-hidden weights as a form of recurrent regularization. Further, we introduce NT-ASGD, a variant of the averaged stochastic gradient method, wherein the averaging trigger is determined using a non-monotonic condition as opposed to being tuned by the user. Using these and other regularization strategies, we achieve state-of-the-art word level perplexities on two data sets: 57.3 on Penn Treebank and 65.8 on WikiText-2. In exploring the effectiveness of a neural cache in conjunction with our proposed model, we achieve an even lower state-of-the-art perplexity of 52.8 on Penn Treebank and 52.0 on WikiText-2.", "year": 2017, "referenceCount": 46, "citationCount": 923, "influentialCitationCount": 197, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3375440", "name": "Stephen Merity"}, {"authorId": "2844898", "name": "N. Keskar"}, {"authorId": "2166511", "name": "R. Socher"}]}, {"paperId": "39a2213edfe830139e338957edc9dd501e478013", "url": "https://www.semanticscholar.org/paper/39a2213edfe830139e338957edc9dd501e478013", "title": "Machine learning and big data analytics in bipolar disorder: A position paper from the International Society for Bipolar Disorders Big Data Task Force", "abstract": "The International Society for Bipolar Disorders Big Data Task Force assembled leading researchers in the field of bipolar disorder (BD), machine learning, and big data with extensive experience to evaluate the rationale of machine learning and big data analytics strategies for BD.", "year": 2019, "referenceCount": 146, "citationCount": 57, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "6726432", "name": "I. Passos"}, {"authorId": "1404475067", "name": "P. Ballester"}, {"authorId": "1394833592", "name": "Rodrigo C. Barros"}, {"authorId": "1400579984", "name": "D. Librenza-Garcia"}, {"authorId": "145321317", "name": "B. Mwangi"}, {"authorId": "2071277728", "name": "B. Birmaher"}, {"authorId": "4374437", "name": "E. Brietzke"}, {"authorId": "2421793", "name": "T. Hajek"}, {"authorId": "14009475", "name": "C. L. López Jaramillo"}, {"authorId": "4291984", "name": "R. Mansur"}, {"authorId": "145779969", "name": "M. Alda"}, {"authorId": "2454765", "name": "B. Haarman"}, {"authorId": "8473133", "name": "E. Isometsa"}, {"authorId": "145628926", "name": "R. Lam"}, {"authorId": "8030249", "name": "R. McIntyre"}, {"authorId": "2356244", "name": "L. Minuzzi"}, {"authorId": "2915804", "name": "L. Kessing"}, {"authorId": "4378601", "name": "L. Yatham"}, {"authorId": "144295169", "name": "A. Duffy"}, {"authorId": "145688648", "name": "F. Kapczinski"}]}, {"paperId": "e66c68bf96da13119c366781def13e2ae096f851", "url": "https://www.semanticscholar.org/paper/e66c68bf96da13119c366781def13e2ae096f851", "title": "Land cover and land use classification performance of machine learning algorithms in a boreal landscape using Sentinel-2 data", "abstract": "ABSTRACT In recent years, the data science and remote sensing communities have started to align due to user-friendly programming tools, access to high-end consumer computing power, and the availability of free satellite data. In particular, publicly available data from the European Space Agency’s Sentinel missions have been used in various remote sensing applications. However, there is a lack of studies that utilize these data to assess the performance of machine learning algorithms in complex boreal landscapes. In this article, I compare the classification performance of four non-parametric algorithms: support vector machines (SVM), random forests (RF), extreme gradient boosting (Xgboost), and deep learning (DL). The study area chosen is a complex mixed-use landscape in south-central Sweden with eight land-cover and land-use (LCLU) classes. The satellite imagery used for the classification were multi-temporal scenes from Sentinel-2 covering spring, summer, autumn and winter conditions. Using stratified random sampling, each LCLU class was allocated 1477 samples, which were divided into training (70%) and evaluation (30%) subsets. Accuracy was assessed through metrics derived from an error matrix, but primarily overall accuracy was used in allocating algorithm hierarchy. A two-proportion Z-test was used to compare the proportions of correctly classified pixels of the algorithms and a McNemar’s chi-square test was used to compare class-wise predictions. The results show that the highest overall accuracy was produced by support vector machines (0.758 ± 0.017), closely followed by extreme gradient boosting (0.751 ± 0.017), random forests (0.739 ± 0.018), and finally deep learning (0.733 ± 0.0023). The Z-test comparison of classifiers showed that a third of algorithm pairings were statistically different. On a class-wise basis, McNemar’s test results showed that 62% of class-wise predictions were significant from one another at the 5% level or less. Variable importance metrics show that nearly half of the top twenty Sentinel-2 bands belonged to the red edge (25%) and shortwave infrared (23%) portions of the electromagnetic spectrum, and were dominated by scenes from spring (38%) and summer (40%). The results are discussed within the scope of recent studies involving machine learning and Sentinel-2 data and key knowledge gaps identified. The article concludes with recommendations for future research.", "year": 2019, "referenceCount": 129, "citationCount": 172, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144418691", "name": "A. Abdi"}]}, {"paperId": "2028713e597c1a4dbd385af4ab1359ac9b3289e1", "url": "https://www.semanticscholar.org/paper/2028713e597c1a4dbd385af4ab1359ac9b3289e1", "title": "Semi-supervised Learning for Unknown Malware Detection", "abstract": null, "year": 2011, "referenceCount": 22, "citationCount": 86, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145030657", "name": "I. Santos"}, {"authorId": "1694284", "name": "J. Nieves"}, {"authorId": "46387576", "name": "P. G. Bringas"}]}, {"paperId": "a28e2fe4ccde9a0e14123c126459be3e01ebe40f", "url": "https://www.semanticscholar.org/paper/a28e2fe4ccde9a0e14123c126459be3e01ebe40f", "title": "Learning Flexible Models from Image Sequences", "abstract": null, "year": 1994, "referenceCount": 16, "citationCount": 331, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2679389", "name": "A. Baumberg"}, {"authorId": "1967104", "name": "David C. Hogg"}]}, {"paperId": "083ae941ae4f2d8f969580e24a928f4c7e36256d", "url": "https://www.semanticscholar.org/paper/083ae941ae4f2d8f969580e24a928f4c7e36256d", "title": "Waffles: A Machine Learning Toolkit", "abstract": "We present a breadth-oriented collection of cross-platform command-line tools for researchers in machine learning called Waffles. The Waffles tools are designed to offer a broad spectrum of functionality in a manner that is friendly for scripted automation. All functionality is also available in a C++ class library. Waffles is available under the GNU Lesser General Public License.", "year": 2011, "referenceCount": 9, "citationCount": 44, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3231678", "name": "Michael S. Gashler"}]}, {"paperId": "90bc7d8beae294dbd1fead2e9c613665f281d4a9", "url": "https://www.semanticscholar.org/paper/90bc7d8beae294dbd1fead2e9c613665f281d4a9", "title": "Single-channel speech separation using sparse non-negative matrix factorization", "abstract": "We apply machine learning techniques to the problem of separating multiple speech sources from a single microphone recording. The method of choice is a sparse non-negative matrix factorization algorithm, which in an unsupervised manner can learn sparse representations of the data. This is applied to the learning of personalized dictionaries from a speech corpus, which in turn are used to separate the audio stream into its components. We show that computational savings can be achieved by segmenting the training data on a phoneme level. To split the data, a conventional speech recognizer is used. The performance of the unsupervised and supervised adaptation schemes result in significant improvements in terms of the target-to-masker ratio.", "year": 2006, "referenceCount": 14, "citationCount": 386, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3299548", "name": "Mikkel N. Schmidt"}, {"authorId": "40377086", "name": "R. Olsson"}]}, {"paperId": "8c44f3a842527da5f522ba2da65dd66c4e88dc45", "url": "https://www.semanticscholar.org/paper/8c44f3a842527da5f522ba2da65dd66c4e88dc45", "title": "Intrusion detection. Applying machine learning to Solaris audit data", "abstract": "An intrusion detection system (IDS) seeks to identify unauthorized access to computer systems' resources and data. The most common analysis tool that these modern systems apply is the operating system audit trail that provides a fingerprint of system events over time. In this research, the Basic Security Module auditing tool of Sun's Solaris operating environment was used in both an anomaly and misuse detection approach. The anomaly detector consisted of the statistical likelihood analysis of system calls, while the misuse detector was built with a neural network trained on groupings of system calls. This research demonstrates the potential benefits of combining both aspects of detection in future IDSs to decrease false positive and false negative errors.", "year": 1998, "referenceCount": 27, "citationCount": 133, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145370840", "name": "D. Endler"}]}, {"paperId": "edc1eb854855f56ebe45d684543bd8ae2fa8bfff", "url": "https://www.semanticscholar.org/paper/edc1eb854855f56ebe45d684543bd8ae2fa8bfff", "title": "On the use of machine learning methods to predict component reliability from data-driven industrial case studies", "abstract": null, "year": 2018, "referenceCount": 65, "citationCount": 47, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2540287", "name": "E. Alsina"}, {"authorId": "144278344", "name": "M. Chica"}, {"authorId": "1731942", "name": "Krzysztof Trawiński"}, {"authorId": "2124851", "name": "A. Regattieri"}]}, {"paperId": "62c16289e72ffecfa68e8b3d8f42f2e1eb9be25b", "url": "https://www.semanticscholar.org/paper/62c16289e72ffecfa68e8b3d8f42f2e1eb9be25b", "title": "A Deep Reinforcement Learning Chatbot", "abstract": "We present MILABOT: a deep reinforcement learning chatbot developed by the Montreal Institute for Learning Algorithms (MILA) for the Amazon Alexa Prize competition. MILABOT is capable of conversing with humans on popular small talk topics through both speech and text. The system consists of an ensemble of natural language generation and retrieval models, including template-based models, bag-of-words models, sequence-to-sequence neural network and latent variable neural network models. By applying reinforcement learning to crowdsourced data and real-world user interactions, the system has been trained to select an appropriate response from the models in its ensemble. The system has been evaluated through A/B testing with real-world users, where it performed significantly better than many competing systems. Due to its machine learning architecture, the system is likely to improve with additional data.", "year": 2017, "referenceCount": 97, "citationCount": 187, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "35224828", "name": "Iulian Serban"}, {"authorId": "21669342", "name": "Chinnadhurai Sankar"}, {"authorId": "39844381", "name": "M. Germain"}, {"authorId": "35097114", "name": "Saizheng Zhang"}, {"authorId": "3146592", "name": "Zhouhan Lin"}, {"authorId": "50324141", "name": "Sandeep Subramanian"}, {"authorId": "3307885", "name": "Taesup Kim"}, {"authorId": "2065504069", "name": "Michael Pieper"}, {"authorId": "144631588", "name": "A. Chandar"}, {"authorId": "145604319", "name": "Nan Rosemary Ke"}, {"authorId": "2130601185", "name": "Sai Mudumba"}, {"authorId": "2346028", "name": "A. D. Brébisson"}, {"authorId": "143778281", "name": "Jose M. R. Sotelo"}, {"authorId": "26412506", "name": "Dendi Suhubdy"}, {"authorId": "1748421", "name": "Vincent Michalski"}, {"authorId": "13969204", "name": "A. Nguyen"}, {"authorId": "145134886", "name": "Joelle Pineau"}, {"authorId": "1751762", "name": "Yoshua Bengio"}]}, {"paperId": "45ac43993bb43fa9aa046ed4377f2277a3736eeb", "url": "https://www.semanticscholar.org/paper/45ac43993bb43fa9aa046ed4377f2277a3736eeb", "title": "Lifelong machine learning: a paradigm for continuous learning", "abstract": null, "year": 2017, "referenceCount": 17, "citationCount": 50, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145321667", "name": "B. Liu"}]}, {"paperId": "e437d877d141cfff1e1becc02726854060d26136", "url": "https://www.semanticscholar.org/paper/e437d877d141cfff1e1becc02726854060d26136", "title": "A Developmental Approach to Machine Learning?", "abstract": "Visual learning depends on both the algorithms and the training material. This essay considers the natural statistics of infant- and toddler-egocentric vision. These natural training sets for human visual object recognition are very different from the training data fed into machine vision systems. Rather than equal experiences with all kinds of things, toddlers experience extremely skewed distributions with many repeated occurrences of a very few things. And though highly variable when considered as a whole, individual views of things are experienced in a specific order – with slow, smooth visual changes moment-to-moment, and developmentally ordered transitions in scene content. We propose that the skewed, ordered, biased visual experiences of infants and toddlers are the training data that allow human learners to develop a way to recognize everything, both the pervasively present entities and the rarely encountered ones. The joint consideration of real-world statistics for learning by researchers of human and machine learning seems likely to bring advances in both disciplines.", "year": 2017, "referenceCount": 100, "citationCount": 59, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "2836466", "name": "Linda B. Smith"}, {"authorId": "1952199", "name": "Lauren K Slone"}]}, {"paperId": "33656048f1eb1ffcc08739368102ee46f69a86d7", "url": "https://www.semanticscholar.org/paper/33656048f1eb1ffcc08739368102ee46f69a86d7", "title": "Predicting Software Anomalies Using Machine Learning Techniques", "abstract": "In this paper, we present a detailed evaluation of a set of well-known Machine Learning classifiers in front of dynamic and non-deterministic software anomalies. The system state prediction is based on monitoring system metrics. This allows software proactive rejuvenation to be triggered automatically. Random Forest approach achieves validation errors less than 1% in comparison to the well-known ML algorithms under a valuation. In order to reduce automatically the number of monitored parameters, needed to predict software anomalies, we analyze Lasso Regularization technique jointly with the Machine Learning classifiers to evaluate how the prediction accuracy could be guaranteed within an acceptable threshold. This allows to reduce drastically (around 60% in the best case) the number of monitoring parameters. The framework, based on ML and Lasso regularization techniques, has been validated using an ecommerce environment with Apache Tomcat server, and MySql database server.", "year": 2011, "referenceCount": 27, "citationCount": 59, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2072641308", "name": "Javier Alonso"}, {"authorId": "1692333", "name": "L. B. Muñoz"}, {"authorId": "1795485", "name": "D. Avresky"}]}, {"paperId": "3de90b45645cb0bcd3486608592e7b19ff87a240", "url": "https://www.semanticscholar.org/paper/3de90b45645cb0bcd3486608592e7b19ff87a240", "title": "Structure-Based Virtual Screening for Drug Discovery: a Problem-Centric Review", "abstract": "Structure-based virtual screening (SBVS) has been widely applied in early-stage drug discovery. From a problem-centric perspective, we reviewed the recent advances and applications in SBVS with a special focus on docking-based virtual screening. We emphasized the researchers’ practical efforts in real projects by understanding the ligand-target binding interactions as a premise. We also highlighted the recent progress in developing target-biased scoring functions by optimizing current generic scoring functions toward certain target classes, as well as in developing novel ones by means of machine learning techniques.", "year": 2012, "referenceCount": 105, "citationCount": 443, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1797121", "name": "Tiejun Cheng"}, {"authorId": "2108047195", "name": "Qingliang Li"}, {"authorId": "50251758", "name": "Zhigang Zhou"}, {"authorId": "49417787", "name": "Yanli Wang"}, {"authorId": "1807652", "name": "S. Bryant"}]}, {"paperId": "f3cd9095d9c0cf07384d39c0847903a2c922c87e", "url": "https://www.semanticscholar.org/paper/f3cd9095d9c0cf07384d39c0847903a2c922c87e", "title": "Machine learning in mental health: a scoping review of methods and applications", "abstract": "Abstract Background This paper aims to synthesise the literature on machine learning (ML) and big data applications for mental health, highlighting current research and applications in practice. Methods We employed a scoping review methodology to rapidly map the field of ML in mental health. Eight health and information technology research databases were searched for papers covering this domain. Articles were assessed by two reviewers, and data were extracted on the article's mental health application, ML technique, data type, and study results. Articles were then synthesised via narrative review. Results Three hundred papers focusing on the application of ML to mental health were identified. Four main application domains emerged in the literature, including: (i) detection and diagnosis; (ii) prognosis, treatment and support; (iii) public health, and; (iv) research and clinical administration. The most common mental health conditions addressed included depression, schizophrenia, and Alzheimer's disease. ML techniques used included support vector machines, decision trees, neural networks, latent Dirichlet allocation, and clustering. Conclusions Overall, the application of ML to mental health has demonstrated a range of benefits across the areas of diagnosis, treatment and support, research, and clinical administration. With the majority of studies identified focusing on the detection and diagnosis of mental health conditions, it is evident that there is significant room for the application of ML to other areas of psychology and mental health. The challenges of using ML techniques are discussed, as well as opportunities to improve and advance the field.", "year": 2019, "referenceCount": 414, "citationCount": 261, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Psychology"], "authors": [{"authorId": "2527291", "name": "Adrian B. R. Shatte"}, {"authorId": "145951110", "name": "D. Hutchinson"}, {"authorId": "47255235", "name": "S. Teague"}]}, {"paperId": "8260246ff9ca16f478bc7e9a0f62b88315905acf", "url": "https://www.semanticscholar.org/paper/8260246ff9ca16f478bc7e9a0f62b88315905acf", "title": "Learning surface molecular structures via machine vision", "abstract": null, "year": 2017, "referenceCount": 44, "citationCount": 74, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144432098", "name": "M. Ziatdinov"}, {"authorId": "2354060", "name": "A. Maksov"}, {"authorId": "37455773", "name": "Sergei V. Kalinin"}]}, {"paperId": "a9d64adde7776b043716442fe59b4e937d24c9e2", "url": "https://www.semanticscholar.org/paper/a9d64adde7776b043716442fe59b4e937d24c9e2", "title": "Reconstructing Human Skill with Machine Learning", "abstract": null, "year": 1994, "referenceCount": 0, "citationCount": 78, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2654837", "name": "T. Urbancic"}, {"authorId": "1725040", "name": "I. Bratko"}]}, {"paperId": "7b2228a9a3ee6ae893bd96a561b4c8ad0a6d6c37", "url": "https://www.semanticscholar.org/paper/7b2228a9a3ee6ae893bd96a561b4c8ad0a6d6c37", "title": "Machine learning in sedimentation modelling", "abstract": null, "year": 2006, "referenceCount": 25, "citationCount": 56, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "95970828", "name": "B. Bhattacharya"}, {"authorId": "1895474", "name": "D. Solomatine"}]}, {"paperId": "8b4dbca699440d0cc34ad98af94f76eb26b8780a", "url": "https://www.semanticscholar.org/paper/8b4dbca699440d0cc34ad98af94f76eb26b8780a", "title": "Lung and Pancreatic Tumor Characterization in the Deep Learning Era: Novel Supervised and Unsupervised Learning Approaches", "abstract": "Risk stratification (characterization) of tumors from radiology images can be more accurate and faster with computer-aided diagnosis (CAD) tools. Tumor characterization through such tools can also enable non-invasive cancer staging, prognosis, and foster personalized treatment planning as a part of precision medicine. In this papet, we propose both supervised and unsupervised machine learning strategies to improve tumor characterization. Our first approach is based on supervised learning for which we demonstrate significant gains with deep learning algorithms, particularly by utilizing a 3D convolutional neural network and transfer learning. Motivated by the radiologists’ interpretations of the scans, we then show how to incorporate task-dependent feature representations into a CAD system via a graph-regularized sparse multi-task learning framework. In the second approach, we explore an unsupervised learning algorithm to address the limited availability of labeled training data, a common problem in medical imaging applications. Inspired by learning from label proportion approaches in computer vision, we propose to use proportion-support vector machine for characterizing tumors. We also seek the answer to the fundamental question about the goodness of “deep features” for unsupervised tumor classification. We evaluate our proposed supervised and unsupervised learning algorithms on two different tumor diagnosis challenges: lung and pancreas with 1018 CT and 171 MRI scans, respectively, and obtain the state-of-the-art sensitivity and specificity results in both problems.", "year": 2018, "referenceCount": 50, "citationCount": 115, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "34030794", "name": "Sarfaraz Hussein"}, {"authorId": "50712226", "name": "Pujan Kandel"}, {"authorId": "34458717", "name": "C. Bolan"}, {"authorId": "1991161", "name": "M. Wallace"}, {"authorId": "1717161", "name": "U. Bagci"}]}, {"paperId": "76b76fa69cf7578145bc303ac49ae9602b0bebae", "url": "https://www.semanticscholar.org/paper/76b76fa69cf7578145bc303ac49ae9602b0bebae", "title": "Diabetes Prediction Using Ensembling of Different Machine Learning Classifiers", "abstract": "Diabetes, also known as chronic illness, is a group of metabolic diseases due to a high level of sugar in the blood over a long period. The risk factor and severity of diabetes can be reduced significantly if the precise early prediction is possible. The robust and accurate prediction of diabetes is highly challenging due to the limited number of labeled data and also the presence of outliers (or missing values) in the diabetes datasets. In this literature, we are proposing a robust framework for diabetes prediction where the outlier rejection, filling the missing values, data standardization, feature selection, K-fold cross-validation, and different Machine Learning (ML) classifiers (k-nearest Neighbour, Decision Trees, Random Forest, AdaBoost, Naive Bayes, and XGBoost) and Multilayer Perceptron (MLP) were employed. The weighted ensembling of different ML models is also proposed, in this literature, to improve the prediction of diabetes where the weights are estimated from the corresponding Area Under ROC Curve (AUC) of the ML model. AUC is chosen as the performance metric, which is then maximized during hyperparameter tuning using the grid search technique. All the experiments, in this literature, were conducted under the same experimental conditions using the Pima Indian Diabetes Dataset. From all the extensive experiments, our proposed ensembling classifier is the best performing classifier with the sensitivity, specificity, false omission rate, diagnostic odds ratio, and AUC as 0.789, 0.934, 0.092, 66.234, and 0.950 respectively which outperforms the state-of-the-art results by 2.00 % in AUC. Our proposed framework for the diabetes prediction outperforms the other methods discussed in the article. It can also provide better results on the same dataset which can lead to better performance in diabetes prediction. Our source code for diabetes prediction is made publicly available.", "year": 2020, "referenceCount": 51, "citationCount": 114, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2078332709", "name": "Md. Kamrul Hasan"}, {"authorId": "40143512", "name": "Md. Ashraful Alam"}, {"authorId": "1491231514", "name": "Dola Das"}, {"authorId": "8947956", "name": "Eklas Hossain"}, {"authorId": "2152302089", "name": "Mahmudul Hasan"}]}, {"paperId": "a937a8061710c5dcc9111f4f150c528c1706b649", "url": "https://www.semanticscholar.org/paper/a937a8061710c5dcc9111f4f150c528c1706b649", "title": "Learning Shape Templates With Structured Implicit Functions", "abstract": "Template 3D shapes are useful for many tasks in graphics and vision, including fitting observation data, analyzing shape collections, and transferring shape attributes. Because of the variety of geometry and topology of real-world shapes, previous methods generally use a library of hand-made templates. In this paper, we investigate learning a general shape template from data. To allow for widely varying geometry and topology, we choose an implicit surface representation based on composition of local shape elements. While long known to computer graphics, this representation has not yet been explored in the context of machine learning for vision. We show that structured implicit functions are suitable for learning and allow a network to smoothly and simultaneously fit multiple classes of shapes. The learned shape template supports applications such as shape exploration, correspondence, abstraction, interpolation, and semantic segmentation from an RGB image.", "year": 2019, "referenceCount": 63, "citationCount": 237, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "32627314", "name": "Kyle Genova"}, {"authorId": "39578349", "name": "Forrester Cole"}, {"authorId": "1880628", "name": "Daniel Vlasic"}, {"authorId": "8707513", "name": "Aaron Sarna"}, {"authorId": "1768236", "name": "W. Freeman"}, {"authorId": "1807080", "name": "T. Funkhouser"}]}, {"paperId": "7ed8fc104c498f6d725ec822ab5df0b5fa9e1482", "url": "https://www.semanticscholar.org/paper/7ed8fc104c498f6d725ec822ab5df0b5fa9e1482", "title": "A study of machine-learning-based approaches to extract clinical entities and their assertions from discharge summaries", "abstract": "OBJECTIVE\nThe authors' goal was to develop and evaluate machine-learning-based approaches to extracting clinical entities-including medical problems, tests, and treatments, as well as their asserted status-from hospital discharge summaries written using natural language. This project was part of the 2010 Center of Informatics for Integrating Biology and the Bedside/Veterans Affairs (VA) natural-language-processing challenge.\n\n\nDESIGN\nThe authors implemented a machine-learning-based named entity recognition system for clinical text and systematically evaluated the contributions of different types of features and ML algorithms, using a training corpus of 349 annotated notes. Based on the results from training data, the authors developed a novel hybrid clinical entity extraction system, which integrated heuristic rule-based modules with the ML-base named entity recognition module. The authors applied the hybrid system to the concept extraction and assertion classification tasks in the challenge and evaluated its performance using a test data set with 477 annotated notes.\n\n\nMEASUREMENTS\nStandard measures including precision, recall, and F-measure were calculated using the evaluation script provided by the Center of Informatics for Integrating Biology and the Bedside/VA challenge organizers. The overall performance for all three types of clinical entities and all six types of assertions across 477 annotated notes were considered as the primary metric in the challenge.\n\n\nRESULTS AND DISCUSSION\nSystematic evaluation on the training set showed that Conditional Random Fields outperformed Support Vector Machines, and semantic information from existing natural-language-processing systems largely improved performance, although contributions from different types of features varied. The authors' hybrid entity extraction system achieved a maximum overall F-score of 0.8391 for concept extraction (ranked second) and 0.9313 for assertion classification (ranked fourth, but not statistically different than the first three systems) on the test data set in the challenge.", "year": 2011, "referenceCount": 47, "citationCount": 250, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1405907603", "name": "Min Jiang"}, {"authorId": "1768324", "name": "Yukun Chen"}, {"authorId": "2152969441", "name": "Mei Liu"}, {"authorId": "145746834", "name": "S. T. Rosenbloom"}, {"authorId": "145945701", "name": "S. Mani"}, {"authorId": "26430919", "name": "J. Denny"}, {"authorId": "49507401", "name": "H. Xu"}]}, {"paperId": "a19b8d946a464b6417545734b370992dfbb95265", "url": "https://www.semanticscholar.org/paper/a19b8d946a464b6417545734b370992dfbb95265", "title": "Texture analysis as a radiomic marker for differentiating renal tumors", "abstract": null, "year": 2017, "referenceCount": 31, "citationCount": 110, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "11429081", "name": "HeiShun Yu"}, {"authorId": "3366609", "name": "Jonathan Scalera"}, {"authorId": "2143894993", "name": "M. Khalid"}, {"authorId": "12918328", "name": "Anne-Sophie Touret"}, {"authorId": "14699146", "name": "N. Bloch"}, {"authorId": "48218755", "name": "Baojun Li"}, {"authorId": "145352629", "name": "M. M. Qureshi"}, {"authorId": "145042956", "name": "J. Soto"}, {"authorId": "79888329", "name": "S. Anderson"}]}, {"paperId": "13b67a40b2a58c5ad0340bce433b1aa1faa7f013", "url": "https://www.semanticscholar.org/paper/13b67a40b2a58c5ad0340bce433b1aa1faa7f013", "title": "Machine-learning-assisted discovery of polymers with high thermal conductivity using a molecular design algorithm", "abstract": null, "year": 2019, "referenceCount": 49, "citationCount": 154, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "2112298575", "name": "Stephen Wu"}, {"authorId": "2069967998", "name": "Y. Kondo"}, {"authorId": "39048631", "name": "M. Kakimoto"}, {"authorId": "2118582562", "name": "Bin Yang"}, {"authorId": "11127956", "name": "H. Yamada"}, {"authorId": "48188724", "name": "I. Kuwajima"}, {"authorId": "98309634", "name": "G. Lambard"}, {"authorId": "20516948", "name": "K. Hongo"}, {"authorId": "153018856", "name": "Yibin Xu"}, {"authorId": "3212617", "name": "J. Shiomi"}, {"authorId": "144062267", "name": "C. Schick"}, {"authorId": "2064792060", "name": "Junko Morikawa"}, {"authorId": "145234017", "name": "Ryo Yoshida"}]}, {"paperId": "16af1a1930d859fa7d84d251246406ec36d7f7ee", "url": "https://www.semanticscholar.org/paper/16af1a1930d859fa7d84d251246406ec36d7f7ee", "title": "Deep Multiple Kernel Learning", "abstract": "Deep learning methods have predominantly been applied to large artificial neural networks. Despite their state-of-the-art performance, these large networks typically do not generalize well to datasets with limited sample sizes. In this paper, we take a different approach by learning multiple layers of kernels. We combine kernels at each layer and then optimize over an estimate of the support vector machine leave-one-out error rather than the dual objective function. Our experiments on a variety of datasets show that each layer successively increases performance with only a few base kernels.", "year": 2013, "referenceCount": 6, "citationCount": 49, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "38629354", "name": "Eric V. Strobl"}, {"authorId": "1765482", "name": "S. Visweswaran"}]}, {"paperId": "bedf5b02f2ef4bdf1bdf01eceaa6dcc7359784a3", "url": "https://www.semanticscholar.org/paper/bedf5b02f2ef4bdf1bdf01eceaa6dcc7359784a3", "title": "Comparison of Classification Techniques used in Machine Learning as Applied on Vocational Guidance Data", "abstract": "Recent developments in information systems as well as computerization of business processes by organizations have led to a faster, easier and more accurate data analysis. Data mining and machine learning techniques have been used increasingly in the analysis of data in various fields ranging from medicine to finance, education and energy applications. Machine learning techniques make it possible to deduct meaningful further information from those data processed by data mining. Such meaningful and significant information helps organizations to establish their future policies on a sounder basis, and to gain major advantages in terms of time and cost. This study applies classification algorithms used in data mining and machine learning techniques on those data obtained from individuals during the vocational guidance process, and tries to determine the most appropriate algorithm.", "year": 2011, "referenceCount": 21, "citationCount": 29, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144309530", "name": "H. Bulbul"}, {"authorId": "2988271", "name": "Özkan Ünsal"}]}, {"paperId": "b63a6e4af24006525da469d3531fab9b7c7cc406", "url": "https://www.semanticscholar.org/paper/b63a6e4af24006525da469d3531fab9b7c7cc406", "title": "Optimization on machine learning based approaches for sentiment analysis on HPV vaccines related tweets", "abstract": null, "year": 2017, "referenceCount": 30, "citationCount": 72, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1728324", "name": "Jingcheng Du"}, {"authorId": "145306377", "name": "Jun Xu"}, {"authorId": "8776912", "name": "Hsing-yi Song"}, {"authorId": "2144224568", "name": "Xiangyu Liu"}, {"authorId": "34394575", "name": "Cui Tao"}]}, {"paperId": "fa346892959022552020067521eb7ccb358efeae", "url": "https://www.semanticscholar.org/paper/fa346892959022552020067521eb7ccb358efeae", "title": "Outlier-robust extreme learning machine for regression problems", "abstract": null, "year": 2015, "referenceCount": 44, "citationCount": 145, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2158519436", "name": "Kai Zhang"}, {"authorId": "40459349", "name": "M. Luo"}]}]}