{"total": 5120629, "offset": 4900, "next": 5000, "data": [{"paperId": "39cbb3a0c09ff8bb30437dd8503935ca2aa07d91", "url": "https://www.semanticscholar.org/paper/39cbb3a0c09ff8bb30437dd8503935ca2aa07d91", "title": "Single trajectory characterization via machine learning", "abstract": "In order to study transport in complex environments, it is extremely important to determine the physical mechanism underlying diffusion and precisely characterize its nature and parameters. Often, this task is strongly impacted by data consisting of trajectories with short length (either due to brief recordings or previous trajectory segmentation) and limited localization precision. In this paper, we propose a machine learning method based on a random forest architecture, which is able to associate single trajectories to the underlying diffusion mechanism with high accuracy. In addition, the algorithm is able to determine the anomalous exponent with a small error, thus inherently providing a classification of the motion as normal or anomalous (sub- or super-diffusion). The method provides highly accurate outputs even when working with very short trajectories and in the presence of experimental noise. We further demonstrate the application of transfer learning to experimental and simulated data not included in the training/test dataset. This allows for a full, high-accuracy characterization of experimental trajectories without the need of any prior information.", "year": 2020, "referenceCount": 41, "citationCount": 63, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "1412620650", "name": "G. Muñoz-Gil"}, {"authorId": "1398728149", "name": "M. Garcia-March"}, {"authorId": "40025272", "name": "C. Manzo"}, {"authorId": "84306443", "name": "J. Martín-Guerrero"}, {"authorId": "145453642", "name": "M. Lewenstein"}]}, {"paperId": "4fd355ee3a17ee1cc3e3eb7ebe5064200611adbb", "url": "https://www.semanticscholar.org/paper/4fd355ee3a17ee1cc3e3eb7ebe5064200611adbb", "title": "Machine Learning in Acute Ischemic Stroke Neuroimaging", "abstract": "Machine Learning (ML) through pattern recognition algorithms is currently becoming an essential aid for the diagnosis, treatment, and prediction of complications and patient outcomes in a number of neurological diseases. The evaluation and treatment of Acute Ischemic Stroke (AIS) have experienced a significant advancement over the past few years, increasingly requiring the use of neuroimaging for decision-making. In this review, we offer an insight into the recent developments and applications of ML in neuroimaging focusing on acute ischemic stroke.", "year": 2018, "referenceCount": 72, "citationCount": 61, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "47150922", "name": "H. Kamal"}, {"authorId": "2061878276", "name": "V. Lopez"}, {"authorId": "31965568", "name": "S. Sheth"}]}, {"paperId": "5d07b34998465bd2907d5d05424ed69b068b3e3f", "url": "https://www.semanticscholar.org/paper/5d07b34998465bd2907d5d05424ed69b068b3e3f", "title": "Machine learning in laboratory medicine: waiting for the flood?", "abstract": "Abstract This review focuses on machine learning and on how methods and models combining data analytics and artificial intelligence have been applied to laboratory medicine so far. Although still in its infancy, the potential for applying machine learning to laboratory data for both diagnostic and prognostic purposes deserves more attention by the readership of this journal, as well as by physician-scientists who will want to take advantage of this new computer-based support in pathology and laboratory medicine.", "year": 2017, "referenceCount": 45, "citationCount": 63, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "3037324", "name": "F. Cabitza"}, {"authorId": "145244821", "name": "G. Banfi"}]}, {"paperId": "74aca1a6cf3d9a45c93145a318f7f1357836cf99", "url": "https://www.semanticscholar.org/paper/74aca1a6cf3d9a45c93145a318f7f1357836cf99", "title": "Machine Learning of Noise-Resilient Quantum Circuits", "abstract": "Noise mitigation and reduction will be crucial for obtaining useful answers from near-term quantum computers. In this work, we present a general framework based on machine learning for reducing the impact of quantum hardware noise on quantum circuits. Our method, called noise-aware circuit learning (NACL), applies to circuits designed to compute a unitary transformation, prepare a set of quantum states, or estimate an observable of a many-qubit state. Given a task and a device model that captures information about the noise and connectivity of qubits in a device, NACL outputs an optimized circuit to accomplish this task in the presence of noise. It does so by minimizing a task-specific cost function over circuit depths and circuit structures. To demonstrate NACL, we construct circuits resilient to a fine-grained noise model derived from gate set tomography on a superconducting-circuit quantum device, for applications including quantum state overlap, quantum Fourier transform, and W-state preparation.", "year": 2020, "referenceCount": 55, "citationCount": 57, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "49556529", "name": "L. Cincio"}, {"authorId": "47368368", "name": "K. Rudinger"}, {"authorId": "2707503", "name": "M. Sarovar"}, {"authorId": "50721537", "name": "Patrick J. Coles"}]}, {"paperId": "a62d9c573d8882a6741a72780162176c66cb1e3d", "url": "https://www.semanticscholar.org/paper/a62d9c573d8882a6741a72780162176c66cb1e3d", "title": "An application of machine learning to haematological diagnosis", "abstract": null, "year": 2017, "referenceCount": 42, "citationCount": 98, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2171573490", "name": "Gregor Gunčar"}, {"authorId": "1719813", "name": "M. Kukar"}, {"authorId": "47014538", "name": "Mateja Notar"}, {"authorId": "4609956", "name": "M. Brvar"}, {"authorId": "3597486", "name": "P. Cernelc"}, {"authorId": "31783242", "name": "Manca Notar"}, {"authorId": "32795773", "name": "M. Notar"}]}, {"paperId": "7877fadd83bb863badd70ea2ef754cd66e996ecc", "url": "https://www.semanticscholar.org/paper/7877fadd83bb863badd70ea2ef754cd66e996ecc", "title": "Arabic Handwritten Characters Recognition Using Convolutional Neural Network", "abstract": "Handwritten Arabic character recognition systems face several challenges, including the unlimited variation in human handwriting and large public databases. In this work, we model a deep learning architecture that can be effectively apply to recognizing Arabic handwritten characters. A Convolutional Neural Network (CNN) is a special type of feed-forward multilayer trained in supervised mode. The CNN trained and tested our database that contain 16800 of handwritten Arabic characters. In this paper, the optimization methods implemented to increase the performance of CNN. Common machine learning methods usually apply a combination of feature extractor and trainable classifier. The use of CNN leads to significant improvements across different machine-learning classification algorithms. Our proposed CNN is giving an average 5.1% misclassification error on testing data.", "year": 2017, "referenceCount": 0, "citationCount": 115, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2143771787", "name": "A. El-Sawy"}, {"authorId": "8132473", "name": "Mohamed Loey"}, {"authorId": "9176423", "name": "H. El-Bakry"}]}, {"paperId": "02fc310d7032e56e242a8e560a99df869f172930", "url": "https://www.semanticscholar.org/paper/02fc310d7032e56e242a8e560a99df869f172930", "title": "Automated Essay Scoring by Maximizing Human-Machine Agreement", "abstract": "Previous approaches for automated essay scoring (AES) learn a rating model by minimizing either the classification, regression, or pairwise classification loss, depending on the learning algorithm used. In this paper, we argue that the current AES systems can be further improved by taking into account the agreement between human and machine raters. To this end, we propose a rankbased approach that utilizes listwise learning to rank algorithms for learning a rating model, where the agreement between the human and machine raters is directly incorporated into the loss function. Various linguistic and statistical features are utilized to facilitate the learning algorithms. Experiments on the publicly available English essay dataset, Automated Student Assessment Prize (ASAP), show that our proposed approach outperforms the state-of-the-art algorithms, and achieves performance comparable to professional human raters, which suggests the effectiveness of our proposed method for automated essay scoring.", "year": 2013, "referenceCount": 38, "citationCount": 86, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2117989460", "name": "Hongbo Chen"}, {"authorId": "40368776", "name": "Ben He"}]}, {"paperId": "732380f4711b09a2b18213245df32abbfe77e8c7", "url": "https://www.semanticscholar.org/paper/732380f4711b09a2b18213245df32abbfe77e8c7", "title": "Traffic accident detection using random forest classifier", "abstract": "The Internet of Things (IoT) has been growing in recent years with the improvements in several different applications in the military, marine, intelligent transportation, smart health, smart grid, smart home and smart city domains. Although IoT brings significant advantages over traditional information and communication (ICT) technologies for Intelligent Transportation Systems (ITS), these applications are still very rare. Although there is a continuous improvement in road and vehicle safety, as well as improvements in IoT, the road traffic accidents have been increasing over the last decades. Therefore, it is necessary to find an effective way to reduce the frequency and severity of traffic accidents. Hence, this paper presents an intelligent traffic accident detection system in which vehicles exchange their microscopic vehicle variables with each other. The proposed system uses simulated data collected from vehicular ad-hoc networks (VANETs) based on the speeds and coordinates of the vehicles and then, it sends traffic alerts to the drivers. Furthermore, it shows how machine learning methods can be exploited to detect accidents on freeways in ITS. It is shown that if position and velocity values of every vehicle are given, vehicles' behavior could be analyzed and accidents can be detected easily. Supervised machine learning algorithms such as Artificial Neural Networks (ANN), Support Vector Machine (SVM), and Random Forests (RF) are implemented on traffic data to develop a model to distinguish accident cases from normal cases. The performance of RF algorithm, in terms of its accuracy, was found superior to ANN and SVM algorithms. RF algorithm has showed better performance with 91.56% accuracy than SVM with 88.71% and ANN with 90.02% accuracy.", "year": 2018, "referenceCount": 29, "citationCount": 117, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "25774305", "name": "Nejdet Dogru"}, {"authorId": "9076397", "name": "A. Subasi"}]}, {"paperId": "b80f0d5bb0fde8be65db99d5f4e6505b38502d08", "url": "https://www.semanticscholar.org/paper/b80f0d5bb0fde8be65db99d5f4e6505b38502d08", "title": "Analysis and prediction of unplanned intensive care unit readmission using recurrent neural networks with long short-term memory", "abstract": "Background Unplanned readmission of a hospitalized patient is an extremely undesirable outcome as the patient may have been exposed to additional risks. The rates of unplanned readmission are, therefore, regarded as an important performance indicator for the medical quality of a hospital and healthcare system. Identifying high-risk patients likely to suffer from readmission before release benefits both the patients and the medical providers. The emergence of machine learning to detect hidden patterns in complex, multi-dimensional datasets provides unparalleled opportunities to develop efficient discharge decision-making support system for physicians. Methods and Findings We used supervised machine learning approaches for ICU readmission prediction. We used machine learning methods on comprehensive, longitudinal clinical data from the MIMIC-III to predict the ICU readmission of patients within 30 days of their discharge. We have utilized recent machine learning techniques such as Recurrent Neural Networks (RNN) with Long Short-Term Memory (LSTM), by this we have been able incorporate the multivariate features of EHRs and capture sudden fluctuations in chart event features (e.g. glucose and heart rate) that are significant in time series with temporal dependencies, which cannot be properly captured by traditional static models, but can be captured by our proposed deep neural network based model. We incorporate multiple types of features including chart events, demographic, and ICD9 embeddings. Our machine learning models identifies ICU readmissions at a higher sensitivity rate (0.742) and an improved Area Under the Curve (0.791) compared with traditional methods. We also illustrate the importance of each portion of the features and different combinations of the models to verify the effectiveness of the proposed model. Conclusion Our manuscript highlights the ability of machine learning models to improve our ICU decision making accuracy, and is a real-world example of precision medicine in hospitals. These data-driven results enable clinicians to make assisted decisions within their patient cohorts. This knowledge could have immediate implications for hospitals by improving the detection of possible readmission. We anticipate that machine learning models will improve patient counseling, hospital administration, allocation of healthcare resources and ultimately individualized clinical care.", "year": 2018, "referenceCount": 82, "citationCount": 83, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "2155853837", "name": "Yu-Wei Lin"}, {"authorId": "2144119424", "name": "Yuqian Zhou"}, {"authorId": "3404467", "name": "F. Faghri"}, {"authorId": "2061360907", "name": "Michael J. Shaw"}, {"authorId": "143775101", "name": "R. Campbell"}]}, {"paperId": "3a52b0e1c29650892b587b9578297e498d9e001b", "url": "https://www.semanticscholar.org/paper/3a52b0e1c29650892b587b9578297e498d9e001b", "title": "An application of Random Forests to a genome-wide association dataset: Methodological considerations & new findings", "abstract": null, "year": 2010, "referenceCount": 36, "citationCount": 215, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "35352396", "name": "B. Goldstein"}, {"authorId": "37767525", "name": "A. Hubbard"}, {"authorId": "2484933", "name": "Adele Cutler"}, {"authorId": "3765647", "name": "L. Barcellos"}]}, {"paperId": "dd9b99fac67c18be82d7763a8fbf231fc3512423", "url": "https://www.semanticscholar.org/paper/dd9b99fac67c18be82d7763a8fbf231fc3512423", "title": "A Survey on Evolutionary Computation Approaches to Feature Selection", "abstract": "Feature selection is an important task in data mining and machine learning to reduce the dimensionality of the data and increase the performance of an algorithm, such as a classification algorithm. However, feature selection is a challenging task due mainly to the large search space. A variety of methods have been applied to solve feature selection problems, where evolutionary computation (EC) techniques have recently gained much attention and shown some success. However, there are no comprehensive guidelines on the strengths and weaknesses of alternative approaches. This leads to a disjointed and fragmented field with ultimately lost opportunities for improving performance and successful applications. This paper presents a comprehensive survey of the state-of-the-art work on EC for feature selection, which identifies the contributions of these different algorithms. In addition, current issues and challenges are also discussed to identify promising areas for future research.", "year": 2016, "referenceCount": 252, "citationCount": 1000, "influentialCitationCount": 50, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144395433", "name": "Bing Xue"}, {"authorId": "145269712", "name": "Mengjie Zhang"}, {"authorId": "2309030", "name": "Will N. Browne"}, {"authorId": "143901532", "name": "X. Yao"}]}, {"paperId": "f3324c5b6de1df62f84f1cf23df37db3c48d53ed", "url": "https://www.semanticscholar.org/paper/f3324c5b6de1df62f84f1cf23df37db3c48d53ed", "title": "Machine learning and natural language processing", "abstract": "In this report, some collaborative work between the fields of Machine Learning (ML) and Natural Language Processing (NLP) \nis presented. The document is structured in two parts. The first part includes a superficial but comprehensive survey covering \nthe state-of-the-art of machine learning techniques applied to natural language learning tasks. In the second part, a particular \nproblem, namely Word Sense Disambiguation (WSD), is studied in more detail. In doing so, four algorithms for supervised \nlearning, which belong to different families, are compared in a benchmark corpus for the WSD task. Both qualitative and \nquantitative conclusions are drawn.", "year": 2000, "referenceCount": 0, "citationCount": 47, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3049328", "name": "Lluís Màrquez i Villodre"}]}, {"paperId": "2e95b2f6a94a1806ba3eac2d0ad65b0be11f27ad", "url": "https://www.semanticscholar.org/paper/2e95b2f6a94a1806ba3eac2d0ad65b0be11f27ad", "title": "Medical Imaging using Machine Learning and Deep Learning Algorithms: A Review", "abstract": "Machine and deep learning algorithms are rapidly growing in dynamic research of medical imaging. Currently, substantial efforts are developed for the enrichment of medical imaging applications using these algorithms to diagnose the errors in disease diagnostic systems which may result in extremely ambiguous medical treatments. Machine and deep learning algorithms are important ways in medical imaging to predict the symptoms of early disease. Deep learning techniques, in specific convolutional networks, have promptly developed a methodology of special for investigating medical images. It uses the supervised or unsupervised algorithms using some specific standard dataset to indicate the predictions. We survey image classification, object detection, pattern recognition, reasoning etc. concepts in medical imaging. These are used to improve the accuracy by extracting the meaningful patterns for the specific disease in medical imaging. These ways also indorse the decision-making procedure. The major aim of this survey is to highlight the machine learning and deep learning techniques used in medical images. We intended to provide an outline for researchers to know the existing techniques carried out for medical imaging, highlight the advantages and drawbacks of these algorithms, and to discuss the future directions. For the study of multi-dimensional medical data, machine and deep learning provide a commendable technique for creation of classification and automatic decision making. This paper provides a survey of medical imaging in the machine and deep learning methods to analyze distinctive diseases. It carries consideration concerning the suite of these algorithms which can be used for the investigation of diseases and automatic decision-making.", "year": 2019, "referenceCount": 22, "citationCount": 51, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "88726646", "name": "Jahanzaib Latif"}, {"authorId": "2863393", "name": "Chuangbai Xiao"}, {"authorId": "35717220", "name": "A. Imran"}, {"authorId": "8150390", "name": "Shanshan Tu"}]}, {"paperId": "19aa08300b7f10a5121fac5aad2f56a5a7dfcb87", "url": "https://www.semanticscholar.org/paper/19aa08300b7f10a5121fac5aad2f56a5a7dfcb87", "title": "Distributed Learning with Sublinear Communication", "abstract": "In distributed statistical learning, $N$ samples are split across $m$ machines and a learner wishes to use minimal communication to learn as well as if the examples were on a single machine. This model has received substantial interest in machine learning due to its scalability and potential for parallel speedup. However, in high-dimensional settings, where the number examples is smaller than the number of features (\"dimension\"), the speedup afforded by distributed learning may be overshadowed by the cost of communicating a single example. This paper investigates the following question: When is it possible to learn a $d$-dimensional model in the distributed setting with total communication sublinear in $d$? \nStarting with a negative result, we show that for learning $\\ell_1$-bounded or sparse linear models, no algorithm can obtain optimal error until communication is linear in dimension. Our main result is that that by slightly relaxing the standard boundedness assumptions for linear models, we can obtain distributed algorithms that enjoy optimal error with communication logarithmic in dimension. This result is based on a family of algorithms that combine mirror descent with randomized sparsification/quantization of iterates, and extends to the general stochastic convex optimization model.", "year": 2019, "referenceCount": 50, "citationCount": 33, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2595479", "name": "Jayadev Acharya"}, {"authorId": "1801197", "name": "Christopher De Sa"}, {"authorId": "26198391", "name": "Dylan J. Foster"}, {"authorId": "37564609", "name": "Karthik Sridharan"}]}, {"paperId": "1cb8de070943349373fbf527e1abd8451903c6db", "url": "https://www.semanticscholar.org/paper/1cb8de070943349373fbf527e1abd8451903c6db", "title": "Student Performance Prediction using Machine Learning", "abstract": "In this paper, a model is proposed to predict the performance of students in an academic organization. The algorithm employed is a machine learning technique called Neural Networks. Further, the importance of several different attributes, or \"features\" is considered, in order to determine which of these are correlated with student performance. Finally, the results of an experiment follow, showcasing the power of machine learning in such an application. Keywords— Artificial intelligence, machine learning, student performance, neural networks", "year": 2015, "referenceCount": 4, "citationCount": 42, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "123770158", "name": "H. Agrawal"}, {"authorId": "70048579", "name": "Harshil Mavani"}]}, {"paperId": "8ad56d996586291cbbc41567138d9ce467d8ff0d", "url": "https://www.semanticscholar.org/paper/8ad56d996586291cbbc41567138d9ce467d8ff0d", "title": "Socio-economic futures in climate change impact assessment: using scenarios as ‘learning machines’", "abstract": null, "year": 2002, "referenceCount": 64, "citationCount": 443, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "145887183", "name": "F. Berkhout"}, {"authorId": "98643765", "name": "J. Hertin"}, {"authorId": "2054376783", "name": "A. Jordan"}]}, {"paperId": "6194c942b91634e8b7c340f158ba759b0789ca7d", "url": "https://www.semanticscholar.org/paper/6194c942b91634e8b7c340f158ba759b0789ca7d", "title": "Cross-trial prediction of treatment outcome in depression: a machine learning approach.", "abstract": null, "year": 2016, "referenceCount": 44, "citationCount": 384, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "6609752", "name": "A. Chekroud"}, {"authorId": "46497361", "name": "Ryan Zotti"}, {"authorId": "1992036", "name": "Z. Shehzad"}, {"authorId": "1993316", "name": "R. Gueorguieva"}, {"authorId": "3075665", "name": "Marcia K. Johnson"}, {"authorId": "4095031", "name": "M. Trivedi"}, {"authorId": "7554981", "name": "Tyrone D. Cannon"}, {"authorId": "5584248", "name": "J. Krystal"}, {"authorId": "4185333", "name": "P. Corlett"}]}, {"paperId": "f54b36edae733ab9cd7a748595947710bd28a2e3", "url": "https://www.semanticscholar.org/paper/f54b36edae733ab9cd7a748595947710bd28a2e3", "title": "A Study of Reinforcement Learning for Neural Machine Translation", "abstract": "Recent studies have shown that reinforcement learning (RL) is an effective approach for improving the performance of neural machine translation (NMT) system. However, due to its instability, successfully RL training is challenging, especially in real-world systems where deep models and large datasets are leveraged. In this paper, taking several large-scale translation tasks as testbeds, we conduct a systematic study on how to train better NMT models using reinforcement learning. We provide a comprehensive comparison of several important factors (e.g., baseline reward, reward shaping) in RL training. Furthermore, to fill in the gap that it remains unclear whether RL is still beneficial when monolingual data is used, we propose a new method to leverage RL to further boost the performance of NMT systems trained with source/target monolingual data. By integrating all our findings, we obtain competitive results on WMT14 English-German, WMT17 English-Chinese, and WMT17 Chinese-English translation tasks, especially setting a state-of-the-art performance on WMT17 Chinese-English translation task.", "year": 2018, "referenceCount": 44, "citationCount": 126, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "47767550", "name": "Lijun Wu"}, {"authorId": "143853336", "name": "Fei Tian"}, {"authorId": "143826491", "name": "Tao Qin"}, {"authorId": "66117656", "name": "J. Lai"}, {"authorId": "2110264337", "name": "Tie-Yan Liu"}]}, {"paperId": "6603a3e0e2abae158ceef494e0fdc9edc4a032b2", "url": "https://www.semanticscholar.org/paper/6603a3e0e2abae158ceef494e0fdc9edc4a032b2", "title": "Prediction of Remaining Useful Lifetime (RUL) of turbofan engine using machine learning", "abstract": "Maintenance of equipment is a critical activity for any business involving machines. Predictive maintenance is the method of scheduling maintenance based on the prediction about the failure time of any equipment. The prediction can be done by analyzing the data measurements from the equipment. Machine learning is a technology by which the outcomes can be predicted based on a model prepared by training it on past input data and its output behavior. The model developed can be used to predict machine failure before it actually happens. There are different approaches available for developing a machine learning model. In this paper, a comparative study of existing set of machine learning algorithms to predict the Remaining Useful Lifetime of aircraft's turbo fan engine is done. The machine learning models were constructed based on the datasets from turbo fan engine data from the Prognostics Data Repository of NASA. Using a training set, a model was constructed and was verified with a test data set. The results obtained were compared with the actual results to calculate the accuracy and the algorithm that results in maximum accuracy is identified. We have selected ten machine learning algorithms for comparing the prediction accuracy. The different algorithms were compared to obtain the prediction model having the closest prediction of remaining useful lifecycle in terms of number of life cycles.", "year": 2017, "referenceCount": 14, "citationCount": 49, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40868771", "name": "Vimala Mathew"}, {"authorId": "40865804", "name": "Tom Toby"}, {"authorId": "144254252", "name": "Vikram Singh"}, {"authorId": "2065087296", "name": "B. Rao"}, {"authorId": "48388083", "name": "M. G. Kumar"}]}, {"paperId": "d9cb035237c76349015373fec54a1b07ce2f4503", "url": "https://www.semanticscholar.org/paper/d9cb035237c76349015373fec54a1b07ce2f4503", "title": "Accelerated Coordinate Descent with Adaptive Coordinate Frequencies", "abstract": "Coordinate descent (CD) algorithms have become the method of choice for solving a number of machine learning tasks. They are particularly popular for training linear models, includ- ing linear support vector machine classication, LASSO regression, and logistic regression. We propose an extension of the CD algorithm, called the adaptive coordinate frequencies (ACF) method. This modied CD scheme does not treat all coordinates equally, in that it does not pick all coordinates equally often for optimization. Instead the relative frequen- cies of coordinates are subject to online adaptation. The resulting optimization scheme can result in signicant speed-ups. We demonstrate the usefulness of our approach on a number of large scale machine learning problems.", "year": 2013, "referenceCount": 19, "citationCount": 29, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1756710", "name": "T. Glasmachers"}, {"authorId": "2154404", "name": "Ü. Dogan"}]}, {"paperId": "e68c509d0664a188409022f501d88f33c28ebcaf", "url": "https://www.semanticscholar.org/paper/e68c509d0664a188409022f501d88f33c28ebcaf", "title": "Federated Collaborative Filtering for Privacy-Preserving Personalized Recommendation System", "abstract": "The increasing interest in user privacy is leading to new privacy preserving machine learning paradigms. In the Federated Learning paradigm, a master machine learning model is distributed to user clients, the clients use their locally stored data and model for both inference and calculating model updates. The model updates are sent back and aggregated on the server to update the master model then redistributed to the clients. In this paradigm, the user data never leaves the client, greatly enhancing the user' privacy, in contrast to the traditional paradigm of collecting, storing and processing user data on a backend server beyond the user's control. In this paper we introduce, as far as we are aware, the first federated implementation of a Collaborative Filter. The federated updates to the model are based on a stochastic gradient approach. As a classical case study in machine learning, we explore a personalized recommendation system based on users' implicit feedback and demonstrate the method's applicability to both the MovieLens and an in-house dataset. Empirical validation confirms a collaborative filter can be federated without a loss of accuracy compared to a standard implementation, hence enhancing the user's privacy in a widely used recommender application while maintaining recommender performance.", "year": 2019, "referenceCount": 34, "citationCount": 115, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1401402845", "name": "Muhammad Ammad-ud-din"}, {"authorId": "1698688", "name": "E. Ivannikova"}, {"authorId": "37332034", "name": "Suleiman A. Khan"}, {"authorId": "2943386", "name": "Were Oyomno"}, {"authorId": "2113771356", "name": "Qiang Fu"}, {"authorId": "35643160", "name": "K. E. Tan"}, {"authorId": "144795201", "name": "Adrian Flanagan"}]}, {"paperId": "0ec6e5be68d2a1f91fec084bb8357ba5bcff61f9", "url": "https://www.semanticscholar.org/paper/0ec6e5be68d2a1f91fec084bb8357ba5bcff61f9", "title": "Advances in Machine Learning Modeling Reviewing Hybrid and Ensemble Methods", "abstract": null, "year": 2019, "referenceCount": 85, "citationCount": 78, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "96693599", "name": "S. Ardabili"}, {"authorId": "3081489", "name": "A. Mosavi"}, {"authorId": "1401945699", "name": "A. Várkonyi-Kóczy"}]}, {"paperId": "c6c6a76ba0c86715a67d64dcf9178b56df1d343d", "url": "https://www.semanticscholar.org/paper/c6c6a76ba0c86715a67d64dcf9178b56df1d343d", "title": "Real-Time Analysis of EEG Indexes of Alertness, Cognition, and Memory Acquired With a Wireless EEG Headset", "abstract": "The integration of brain monitoring into the man-machine interface holds great promise for real-time assessment of operator status and intelligent allocation of tasks between machines and humans. This article presents an integrated hardware and software solution for acquisition and real-time analysis of the electroencephalogram (EEG) to monitor indexes of alertness, cognition, and memory. Three experimental paradigms were evaluated in a total of 45 participants to identify EEG indexes associated with changes in cognitive workload: the Warship Commander Task (WCT), a simulated navy command and control environment that allowed workload levels to be systematically manipulated; a cognitive task with three levels of difficulty and consistent sensory inputs and motor outputs; and a multisession image learning and recognition memory test. Across tasks and participants, specific changes in the EEG were identified that were reliably associated with levels of cognitive workload. The EEG indexes were also shown to change as a function of training on the WCT and the learning and memory task. Future applications of the system to augment cognition in military and industrial environments are discussed.", "year": 2004, "referenceCount": 63, "citationCount": 395, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1762780", "name": "C. Berka"}, {"authorId": "2957279", "name": "D. Levendowski"}, {"authorId": "31809357", "name": "Milenko Cvetinovic"}, {"authorId": "29850590", "name": "M. M. Petrovic"}, {"authorId": "144916352", "name": "G. Davis"}, {"authorId": "2329013", "name": "Michelle N. Lumicao"}, {"authorId": "2111695951", "name": "Vladimir T. Zivkovic"}, {"authorId": "38918198", "name": "M. Popovic"}, {"authorId": "144333651", "name": "R. Olmstead"}]}, {"paperId": "a8156a77ec99bff4dbb914d9153600fb51e51fd0", "url": "https://www.semanticscholar.org/paper/a8156a77ec99bff4dbb914d9153600fb51e51fd0", "title": "Support Vector Machines", "abstract": null, "year": 2002, "referenceCount": 0, "citationCount": 71, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "1680188", "name": "T. Joachims"}]}, {"paperId": "36845e5d13e6d8698561d416b694122cfa754332", "url": "https://www.semanticscholar.org/paper/36845e5d13e6d8698561d416b694122cfa754332", "title": "Aequitas: A Bias and Fairness Audit Toolkit", "abstract": "Recent work has raised concerns on the risk of unintended bias in AI systems being used nowadays that can affect individuals unfairly based on race, gender or religion, among other possible characteristics. While a lot of bias metrics and fairness definitions have been proposed in recent years, there is no consensus on which metric/definition should be used and there are very few available resources to operationalize them. Therefore, despite recent awareness, auditing for bias and fairness when developing and deploying AI systems is not yet a standard practice. We present Aequitas, an open source bias and fairness audit toolkit that is an intuitive and easy to use addition to the machine learning workflow, enabling users to seamlessly test models for several bias and fairness metrics in relation to multiple population sub-groups. Aequitas facilitates informed and equitable decisions around developing and deploying algorithmic decision making systems for both data scientists, machine learning researchers and policymakers.", "year": 2018, "referenceCount": 29, "citationCount": 155, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2266550", "name": "Pedro Saleiro"}, {"authorId": "2064395768", "name": "Benedict Kuester"}, {"authorId": "2053987304", "name": "Abby Stevens"}, {"authorId": "2064076204", "name": "Ari Anisfeld"}, {"authorId": "117010066", "name": "Loren Hinkson"}, {"authorId": "116944217", "name": "J. London"}, {"authorId": "1791498", "name": "R. Ghani"}]}, {"paperId": "9a62d26420afc77543c8f17bae1b482bcb28dc66", "url": "https://www.semanticscholar.org/paper/9a62d26420afc77543c8f17bae1b482bcb28dc66", "title": "Inference of finite automata using homing sequences", "abstract": "We present new algorithms for inferring an unknown finite-state automaton from its input/output behavior <italic>in the absence of a means of resetting the machine to a start state</italic>. A key technique used is inference of a <italic>homing sequence</italic> for the unknown automaton.\nOur inference procedures experiment with the unknown machine, and from time to time require a teacher to supply counterexamples to incorrect conjectures about the structure of the unknown automaton. In this setting, we describe a learning algorithm which, with probability 1-δ, outputs a correct description of the unknown machine in time polynomial in the automaton's size, the length of the longest counterexample, and log (1/<italic>δ</italic>). We present an analogous algorithm which makes use of a diversity-based representation of the finite-state system. <italic>Our algorithms are the first which are provably effective for these problems, in the absence of a “reset.”</italic>\nWe also present probabilistic algorithms for permutation automata which do not require a teacher to supply counterexamples. For inferring a permutation automaton of diversity <italic>D</italic>, we improve the best previous time bound by roughly a factor of <italic>D</italic><supscrpt>3</supscrpt>/log<italic>D</italic>.", "year": 1989, "referenceCount": 21, "citationCount": 540, "influentialCitationCount": 62, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2113911099", "name": "R. Rivest"}, {"authorId": "1716301", "name": "R. Schapire"}]}, {"paperId": "122595559778b92c76be9c07b2610b271d1d744d", "url": "https://www.semanticscholar.org/paper/122595559778b92c76be9c07b2610b271d1d744d", "title": "Machine learning in artificial intelligence", "abstract": null, "year": 1993, "referenceCount": 24, "citationCount": 56, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1725040", "name": "I. Bratko"}]}, {"paperId": "bdcab784aeb123bde9428e1c5f9656370b82d0cb", "url": "https://www.semanticscholar.org/paper/bdcab784aeb123bde9428e1c5f9656370b82d0cb", "title": "OIL PRICE PREDICTORS: MACHINE LEARNING APPROACH", "abstract": "The paper proposes a machine-learning approach to predict oil price. Market participants can forecast prices using such factors as: US key rate, US dollar index, S and P500 index, Volatility index, US consumer price index. After analyzing the results and comparing the accuracy of the model first, we can conclude that oil prices in 2019-2022 will have a slight upward trend and will generally be stable. At the time of the fall in June 2012 the price of Brent fell to a minimum of 17 months. The reason for this was the weak demand for oil futures, which was caused by poor data on the state of the US labor market.", "year": 2019, "referenceCount": 27, "citationCount": 60, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "2613255", "name": "Jaehyung An"}, {"authorId": "3886903", "name": "A. Mikhaylov"}, {"authorId": "2076654905", "name": "N. Moiseev"}]}, {"paperId": "83aebb26820db9ebf7ba0221d5b24acad1318032", "url": "https://www.semanticscholar.org/paper/83aebb26820db9ebf7ba0221d5b24acad1318032", "title": "Edge Machine Learning: Enabling Smart Internet of Things Applications", "abstract": "Machine learning has traditionally been solely performed on servers and high-performance machines. However, advances in chip technology have given us miniature libraries that fit in our pockets and mobile processors have vastly increased in capability narrowing the vast gap between the simple processors embedded in such things and their more complex cousins in personal computers. Thus, with the current advancement in these devices, in terms of processing power, energy storage and memory capacity, the opportunity has arisen to extract great value in having on-device machine learning for Internet of Things (IoT) devices. Implementing machine learning inference on edge devices has huge potential and is still in its early stages. However, it is already more powerful than most realise. In this paper, a step forward has been taken to understand the feasibility of running machine learning algorithms, both training and inference, on a Raspberry Pi, an embedded version of the Android operating system designed for IoT device development. Three different algorithms: Random Forests, Support Vector Machine (SVM) and Multi-Layer Perceptron, respectively, have been tested using ten diverse data sets on the Raspberry Pi to profile their performance in terms of speed (training and inference), accuracy, and power consumption. As a result of the conducted tests, the SVM algorithm proved to be slightly faster in inference and more efficient in power consumption, but the Random Forest algorithm exhibited the highest accuracy. In addition to the performance results, we will discuss their usability scenarios and the idea of implementing more complex and taxing algorithms such as Deep Learning on these small devices in more details.", "year": 2018, "referenceCount": 37, "citationCount": 62, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2071719758", "name": "Mahmut Taha Yazici"}, {"authorId": "46226298", "name": "S. Basurra"}, {"authorId": "1698684", "name": "M. Gaber"}]}, {"paperId": "13b67a40b2a58c5ad0340bce433b1aa1faa7f013", "url": "https://www.semanticscholar.org/paper/13b67a40b2a58c5ad0340bce433b1aa1faa7f013", "title": "Machine-learning-assisted discovery of polymers with high thermal conductivity using a molecular design algorithm", "abstract": null, "year": 2019, "referenceCount": 49, "citationCount": 154, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "2112298575", "name": "Stephen Wu"}, {"authorId": "2069967998", "name": "Y. Kondo"}, {"authorId": "39048631", "name": "M. Kakimoto"}, {"authorId": "2118582562", "name": "Bin Yang"}, {"authorId": "11127956", "name": "H. Yamada"}, {"authorId": "48188724", "name": "I. Kuwajima"}, {"authorId": "98309634", "name": "G. Lambard"}, {"authorId": "20516948", "name": "K. Hongo"}, {"authorId": "153018856", "name": "Yibin Xu"}, {"authorId": "3212617", "name": "J. Shiomi"}, {"authorId": "144062267", "name": "C. Schick"}, {"authorId": "2064792060", "name": "Junko Morikawa"}, {"authorId": "145234017", "name": "Ryo Yoshida"}]}, {"paperId": "e26bfde04b8d38a526f687673388b04d35bee2b2", "url": "https://www.semanticscholar.org/paper/e26bfde04b8d38a526f687673388b04d35bee2b2", "title": "Machine learning in tolerancing for additive manufacturing", "abstract": null, "year": 2018, "referenceCount": 13, "citationCount": 80, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9167346", "name": "Zuowei Zhu"}, {"authorId": "1920845", "name": "N. Anwer"}, {"authorId": "144938776", "name": "Qiang Huang"}, {"authorId": "3390775", "name": "L. Mathieu"}]}, {"paperId": "bc26e1272340c4493ab74f9d831144ba224cab36", "url": "https://www.semanticscholar.org/paper/bc26e1272340c4493ab74f9d831144ba224cab36", "title": "Scalable Active Learning for Multiclass Image Classification", "abstract": "Machine learning techniques for computer vision applications like object recognition, scene classification, etc., require a large number of training samples for satisfactory performance. Especially when classification is to be performed over many categories, providing enough training samples for each category is infeasible. This paper describes new ideas in multiclass active learning to deal with the training bottleneck, making it easier to train large multiclass image classification systems. First, we propose a new interaction modality for training which requires only yes-no type binary feedback instead of a precise category label. The modality is especially powerful in the presence of hundreds of categories. For the proposed modality, we develop a Value-of-Information (VOI) algorithm that chooses informative queries while also considering user annotation cost. Second, we propose an active selection measure that works with many categories and is extremely fast to compute. This measure is employed to perform a fast seed search before computing VOI, resulting in an algorithm that scales linearly with dataset size. Third, we use locality sensitive hashing to provide a very fast approximation to active learning, which gives sublinear time scaling, allowing application to very large datasets. The approximation provides up to two orders of magnitude speedups with little loss in accuracy. Thorough empirical evaluation of classification accuracy, noise sensitivity, imbalanced data, and computational performance on a diverse set of image datasets demonstrates the strengths of the proposed algorithms.", "year": 2012, "referenceCount": 55, "citationCount": 121, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1692604", "name": "Ajay J. Joshi"}, {"authorId": "29905643", "name": "F. Porikli"}, {"authorId": "1696163", "name": "N. Papanikolopoulos"}]}, {"paperId": "a536bfd8939c43ee3e2d239a514d8847b4d3076a", "url": "https://www.semanticscholar.org/paper/a536bfd8939c43ee3e2d239a514d8847b4d3076a", "title": "Diagnosing Rotating Machines With Weakly Supervised Data Using Deep Transfer Learning", "abstract": "Rotating machinery fault diagnosis problems have been well-addressed when sufficient supervised data of the tested machine are available using the latest data-driven methods. However, it is still challenging to develop effective diagnostic method with insufficient training data, which is highly demanded in real-industrial scenarios, since high-quality data are usually difficult and expensive to collect. Considering the underlying similarities of rotating machines, data mining on different but related equipments potentially benefit the diagnostic performance on the target machine. Therefore, a novel transfer learning method for diagnostics based on deep learning is proposed in this article, where the diagnostic knowledge learned from sufficient supervised data of multiple rotating machines is transferred to the target equipment with domain adversarial training. Different from the existing studies, a more generalized transfer learning problem with different label spaces of domains is investigated, and different fault severities are also considered in fault diagnostics. The experimental results on four datasets validate the effectiveness of the proposed method, and show it is feasible and promising to explore different datasets to improve diagnostic performance.", "year": 2020, "referenceCount": 38, "citationCount": 108, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2144439563", "name": "Xiang Li"}, {"authorId": "2155469192", "name": "Wei Zhang"}, {"authorId": "145537225", "name": "Q. Ding"}, {"authorId": "2116327300", "name": "Xu Li"}]}, {"paperId": "1caeddb73d1ab51e283c201dcfad5d634000e5c2", "url": "https://www.semanticscholar.org/paper/1caeddb73d1ab51e283c201dcfad5d634000e5c2", "title": "Value Regularization and Fenchel Duality", "abstract": "Regularization is an approach to function learning that balances fit and smoothness. In practice, we search for a function f with a finite representation f = Σi ci φi(·). In most treatments, the ci are the primary objects of study. We consider value regularization, constructing optimization problems in which the predicted values at the training points are the primary variables, and therefore the central objects of study. Although this is a simple change, it has profound consequences. From convex conjugacy and the theory of Fenchel duality, we derive separate optimality conditions for the regularization and loss portions of the learning problem; this technique yields clean and short derivations of standard algorithms. This framework is ideally suited to studying many other phenomena at the intersection of learning theory and optimization. We obtain a value-based variant of the representer theorem, which underscores the transductive nature of regularization in reproducing kernel Hilbert spaces. We unify and extend previous results on learning kernel functions, with very simple proofs. We analyze the use of unregularized bias terms in optimization problems, and low-rank approximations to kernel matrices, obtaining new results in these areas. In summary, the combination of value regularization and Fenchel duality are valuable tools for studying the optimization problems in machine learning.", "year": 2007, "referenceCount": 38, "citationCount": 88, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "11691394", "name": "R. Rifkin"}, {"authorId": "47167981", "name": "R. Lippert"}]}, {"paperId": "7a90dccbefee7b10bbc97a20d0d3a66755c66230", "url": "https://www.semanticscholar.org/paper/7a90dccbefee7b10bbc97a20d0d3a66755c66230", "title": "Arabic Sentiment Analysis Using Supervised Classification", "abstract": "Sentiment analysis is a process during which the polarity (i.e. positive, negative or neutral) of a given text is determined. In general there are two approaches to address this problem, namely, machine learning approach or lexicon based approach. The current paper deals with sentiment analysis in Arabic reviews from a machine learning perspective. Three classifiers were applied on an in-house developed dataset of tweets/comments. In particular, the Naïve Bayes, SVM and K-Nearest Neighbor classifiers were run on this dataset. The results show that SVM gives the highest precision while KNN (K=10) gives the highest Recall.", "year": 2014, "referenceCount": 30, "citationCount": 103, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1926336", "name": "R. Duwairi"}, {"authorId": "3285240", "name": "Islam Qarqaz"}]}, {"paperId": "7c573ca029c19fd342b7e4b81a53031c69bd303c", "url": "https://www.semanticscholar.org/paper/7c573ca029c19fd342b7e4b81a53031c69bd303c", "title": "Hedonic Housing Theory — A Machine Learning Investigation", "abstract": "The hedonic pricing theory suggests that house is a differ-entiated commodity, whose value depends on its hetero-geneous characteristics. Application of the theory has been well implemented using OLS Regression. Our study investigates this econometric concept using machine learning algorithms. An improved pricing will benefit buyers, sellers, investors, banks and real estate professionals. Normality test for the experiment was done using Chi-Square Quantile-Quantile plot and Henze-Zirkler's Multivariate Normality Test. Statistical relationship was based on correlation matrix, Kaiser-Meyer-Olkin and Bartlett tests. Support Vector Regression (SVR), K-Nearest Neighbor (K-NN) and Principal Component Re-gression (PCR) were used as learning algorithms. Per-formance comparison of the learning algorithms was done using spearman's rho correlation coefficient. The performance of the model showed that PCR has a slight edge over SVR and K-NN. Also, the study validated the suitability and substitutability of PCR, SVR and K-NN in the implementation of the hedonic pricing theory.", "year": 2016, "referenceCount": 18, "citationCount": 25, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8844525", "name": "T. Oladunni"}, {"authorId": "2109850347", "name": "Sharad Sharma"}]}, {"paperId": "ae85a32fb402effb4f1a2bde1d40243c66fd1096", "url": "https://www.semanticscholar.org/paper/ae85a32fb402effb4f1a2bde1d40243c66fd1096", "title": "Hate speech detection in the Indonesian language: A dataset and preliminary study", "abstract": "The objective of our work is to detect hate speech in the Indonesian language. As far as we know, the research on this subject is still very rare. The only research we found has created a dataset for hate speech against religion, but the quality of this dataset is inadequate. Our research aimed to create a new dataset that covers hate speech in general, including hatred for religion, race, ethnicity, and gender. In addition, we also conducted a preliminary study using machine learning approach. Machine learning so far is the most frequently used approach in classifying text. We compared the performance of several features and machine learning algorithms for hate speech detection. Features that extracted were word n-gram with n=l and n=2, character n-gram with n=3 and n=4, and negative sentiment. The classification was performed using Naïve Bayes, Support Vector Machine, Bayesian Logistic Regression, and Random Forest Decision Tree. An F-measure of 93.5% was achieved when using word n-gram feature with Random Forest Decision Tree algorithm. Results also show that word n-gram feature outperformed character n-gram.", "year": 2017, "referenceCount": 11, "citationCount": 108, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2683858", "name": "Ika Alfina"}, {"authorId": "2072451661", "name": "Rio Mulia"}, {"authorId": "2656725", "name": "M. I. Fanany"}, {"authorId": "41037202", "name": "Yudo Ekanata"}]}, {"paperId": "b44928816cf5afec15613315749f0a0114be8704", "url": "https://www.semanticscholar.org/paper/b44928816cf5afec15613315749f0a0114be8704", "title": "Machine Learning, Machine Vision, and the Brain", "abstract": "The problem of learning is arguably at the very core of the problem of intelligence, both biological and artificial. In this article, we review our work over the last 10 years in the area of supervised learning, focusing on three interlinked directions of research -- (1) theory, (2) engineering applications (making intelligent software), and (3) neuroscience (understanding the brain's mechanisms of learnings) -- that contribute to and complement each other.", "year": 1999, "referenceCount": 40, "citationCount": 36, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1685292", "name": "T. Poggio"}, {"authorId": "3564227", "name": "C. Shelton"}]}, {"paperId": "ac3ccaf58ba543fd8d7b787cf939e55345b1659f", "url": "https://www.semanticscholar.org/paper/ac3ccaf58ba543fd8d7b787cf939e55345b1659f", "title": "The square-root unscented Kalman filter for state and parameter-estimation", "abstract": "Over the last 20-30 years, the extended Kalman filter (EKF) has become the algorithm of choice in numerous nonlinear estimation and machine learning applications. These include estimating the state of a nonlinear dynamic system as well estimating parameters for nonlinear system identification (eg, learning the weights of a neural network). The EKF applies the standard linear Kalman filter methodology to a linearization of the true nonlinear system. This approach is sub-optimal, and can easily lead to divergence. Julier et al. (1997), proposed the unscented Kalman filter (UKF) as a derivative-free alternative to the extended Kalman filter in the framework of state estimation. This was extended to parameter estimation by Wan and Van der Merwe et al., (2000). The UKF consistently outperforms the EKF in terms of prediction and estimation error, at an equal computational complexity of (OL/sup 3/)/sup l/ for general state-space problems. When the EKF is applied to parameter estimation, the special form of the state-space equations allows for an O(L/sup 2/) implementation. This paper introduces the square-root unscented Kalman filter (SR-UKF) which is also O(L/sup 3/) for general state estimation and O(L/sup 2/) for parameter estimation (note the original formulation of the UKF for parameter-estimation was O(L/sup 3/)). In addition, the square-root forms have the added benefit of numerical stability and guaranteed positive semi-definiteness of the state covariances.", "year": 2001, "referenceCount": 13, "citationCount": 1110, "influentialCitationCount": 103, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1908796", "name": "Rudolph van der Merwe"}, {"authorId": "48385057", "name": "E. Wan"}]}, {"paperId": "9df7ea68ca770b2def86a8b33f67ddc0515d2580", "url": "https://www.semanticscholar.org/paper/9df7ea68ca770b2def86a8b33f67ddc0515d2580", "title": "Perceptual Annotation: Measuring Human Vision to Improve Computer Vision", "abstract": "For many problems in computer vision, human learners are considerably better than machines. Humans possess highly accurate internal recognition and learning mechanisms that are not yet understood, and they frequently have access to more extensive training data through a lifetime of unbiased experience with the visual world. We propose to use visual psychophysics to directly leverage the abilities of human subjects to build better machine learning systems. First, we use an advanced online psychometric testing platform to make new kinds of annotation data available for learning. Second, we develop a technique for harnessing these new kinds of information-“perceptual annotations”-for support vector machines. A key intuition for this approach is that while it may remain infeasible to dramatically increase the amount of data and high-quality labels available for the training of a given system, measuring the exemplar-by-exemplar difficulty and pattern of errors of human annotators can provide important information for regularizing the solution of the system at hand. A case study for the problem face detection demonstrates that this approach yields state-of-the-art results on the challenging FDDB data set.", "year": 2014, "referenceCount": 50, "citationCount": 58, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2613438", "name": "W. Scheirer"}, {"authorId": "2503235", "name": "Samuel E. Anthony"}, {"authorId": "1728376", "name": "K. Nakayama"}, {"authorId": "2042941", "name": "D. Cox"}]}, {"paperId": "0120f750e2fdf0b2b727fddf0fa21fc16e7eb011", "url": "https://www.semanticscholar.org/paper/0120f750e2fdf0b2b727fddf0fa21fc16e7eb011", "title": "Logistic regression (machine learning)", "abstract": null, "year": 2017, "referenceCount": 0, "citationCount": 46, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "3608264", "name": "A. Murphy"}, {"authorId": "17758983", "name": "J. Seah"}]}, {"paperId": "38106a8810f7f178e1fbe8a6798b5e1d231ed324", "url": "https://www.semanticscholar.org/paper/38106a8810f7f178e1fbe8a6798b5e1d231ed324", "title": "Top-down induction of logical decision trees", "abstract": "Top-down induction of decison trees (TDIDT) is a very popular machine learning technique. Up till now, it has mainly used for propositional learning, but seldomly for relational learning or inductive logic programming. The main contribution of this paper is the introduction of logic decision trees, which make it possible to use TDIDT in inductive logic programming. An implementation of this top-down induction of logic decision trees, the TILDE system, is presented and experimentally evaluated. Top-down Induction of Logical Decision Trees Hendrik Blockeel and Luc De Raedt Katholieke Universiteit Leuven Department of Computer Science Celestijnenlaan 200A 3001 Heverlee e-mail: fHendrik.Blockeel, Luc.DeRaedtg@cs.kuleuven.ac.be January 21, 1997 Abstract Top-down induction of decision trees (TDIDT) is a very popular machine learning technique. Up till now, it has mainly been used for propositional learning, but seldomly for relational learning or inductive logic programming. The main contribution of this paper is the introduction of logical decision trees, which make it possible to use TDIDT in inductive logic programming. An implementation of this top-down induction of logical decision trees, the Tilde system, is presented and experimentally evaluated.", "year": 1997, "referenceCount": 34, "citationCount": 132, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1755851", "name": "H. Blockeel"}, {"authorId": "1740042", "name": "L. D. Raedt"}]}, {"paperId": "7d878fe31b9b57f75071586d83cdec2e8b81e039", "url": "https://www.semanticscholar.org/paper/7d878fe31b9b57f75071586d83cdec2e8b81e039", "title": "Fréchet ChemNet Distance: A Metric for Generative Models for Molecules in Drug Discovery", "abstract": "The new wave of successful generative models in machine learning has increased the interest in deep learning driven de novo drug design. However, method comparison is difficult because of various flaws of the currently employed evaluation metrics. We propose an evaluation metric for generative models called Fréchet ChemNet distance (FCD). The advantage of the FCD over previous metrics is that it can detect whether generated molecules are diverse and have similar chemical and biological properties as real molecules.", "year": 2018, "referenceCount": 29, "citationCount": 143, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Biology", "Mathematics", "Medicine"], "authors": [{"authorId": "32764807", "name": "Kristina Preuer"}, {"authorId": "30578364", "name": "Philipp Renz"}, {"authorId": "2465270", "name": "Thomas Unterthiner"}, {"authorId": "3308557", "name": "S. Hochreiter"}, {"authorId": "1994964", "name": "G. Klambauer"}]}, {"paperId": "7ebddbd758e9b4a1466e48416d046478452bf6a3", "url": "https://www.semanticscholar.org/paper/7ebddbd758e9b4a1466e48416d046478452bf6a3", "title": "A machine learning approach for stock price prediction", "abstract": "Data mining and machine learning approaches can be incorporated into business intelligence (BI) systems to help users for decision support in many real-life applications. Here, in this paper, we propose a machine learning approach for BI applications. Specifically, we apply structural support vector machines (SSVMs) to perform classification on complex inputs such as the nodes of a graph structure. We connect collaborating companies in the information technology sector in a graph structure and use an SSVM to predict positive or negative movement in their stock prices. The complexity of the SSVM cutting plane optimization problem is determined by the complexity of the separation oracle. It is shown that (i) the separation oracle performs a task equivalent to maximum a posteriori (MAP) inference and (ii) a minimum graph cutting algorithm can solve this problem in the stock price case in polynomial time. Experimental results show the practicability of our proposed machine learning approach in predicting stock prices.", "year": 2014, "referenceCount": 19, "citationCount": 55, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1726081", "name": "C. Leung"}, {"authorId": "34210834", "name": "R. MacKinnon"}, {"authorId": "2153675679", "name": "Yang Wang"}]}, {"paperId": "bad2bbfc9b5cf6c93ece1731ac9389bf08407be0", "url": "https://www.semanticscholar.org/paper/bad2bbfc9b5cf6c93ece1731ac9389bf08407be0", "title": "Learning to Distinguish Hypernyms and Co-Hyponyms", "abstract": "This work is concerned with distinguishing different semantic relations which exist between distributionally similar words. We compare a novel approach based on training a linear Support Vector Machine on pairs of feature vectors with state-of-the-art methods based on distributional similarity. We show that the new supervised approach does better even when there is minimal information about the target words in the training data, giving a 15% reduction in error rate over unsupervised approaches.", "year": 2014, "referenceCount": 41, "citationCount": 194, "influentialCitationCount": 48, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2500077", "name": "Julie Weeds"}, {"authorId": "32914745", "name": "Daoud Clarke"}, {"authorId": "2056788", "name": "Jeremy Reffin"}, {"authorId": "35258592", "name": "David J. Weir"}, {"authorId": "39877126", "name": "B. Keller"}]}, {"paperId": "6554746eb9893e1d060277257d8d83bf440333ad", "url": "https://www.semanticscholar.org/paper/6554746eb9893e1d060277257d8d83bf440333ad", "title": "Evaluation of machine-learning methods for ligand-based virtual screening", "abstract": null, "year": 2007, "referenceCount": 69, "citationCount": 103, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "48951561", "name": "Beining Chen"}, {"authorId": "89207181", "name": "R. Harrison"}, {"authorId": "2044753", "name": "G. Papadatos"}, {"authorId": "144610645", "name": "P. Willett"}, {"authorId": "39821805", "name": "D. J. Wood"}, {"authorId": "32724222", "name": "X. Lewell"}, {"authorId": "2495228", "name": "P. Greenidge"}, {"authorId": "2094094", "name": "N. Stiefl"}]}, {"paperId": "2a4d5bb3e8c61d1bb86dfa093869564ac94ac613", "url": "https://www.semanticscholar.org/paper/2a4d5bb3e8c61d1bb86dfa093869564ac94ac613", "title": "Decision tree and ensemble learning algorithms with their applications in bioinformatics.", "abstract": null, "year": 2011, "referenceCount": 21, "citationCount": 114, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "35254987", "name": "Dongsheng Che"}, {"authorId": "2118892847", "name": "Qi Liu"}, {"authorId": "1799121", "name": "K. Rasheed"}, {"authorId": "8366427", "name": "Xiuping Tao"}]}, {"paperId": "1e93a4cac60f31a51ed512584eb0daceeb4f3ea2", "url": "https://www.semanticscholar.org/paper/1e93a4cac60f31a51ed512584eb0daceeb4f3ea2", "title": "Machine Learning-based Intrusion Detection Algorithms", "abstract": "Machine learning-based intrusion detection approaches have attracted increasing attention in the network intrusion detection research area because of their intrinsic capabilities in discovering novel attacks. In this paper we propose a new approach to detect network attacks, which aims to study the efficiency of the method based on machine learning in intrusion detection, including artificial neural networks and support vector machine. It will provide an important reference for the future research. The experimental results obtained by applying this approach to the KDD CUP'99 data set demonstrate that the proposed approach performs high performance, especially to U2R and U2L type attacks.", "year": 2009, "referenceCount": 16, "citationCount": 54, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2112701184", "name": "Huanyu Tang"}, {"authorId": "72437532", "name": "Zhuolin Cao"}]}, {"paperId": "b0d7accc43e36a8a2c8d67b5f430575ed49b377c", "url": "https://www.semanticscholar.org/paper/b0d7accc43e36a8a2c8d67b5f430575ed49b377c", "title": "Sales forecasting using extreme learning machine with applications in fashion retailing", "abstract": null, "year": 2008, "referenceCount": 45, "citationCount": 399, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31443079", "name": "Zhan-Li Sun"}, {"authorId": "144728286", "name": "T. Choi"}, {"authorId": "118105327", "name": "K. Au"}, {"authorId": "2111509512", "name": "Yong Yu"}]}, {"paperId": "39c2f99cf2ccb7ec7214983d26bed9246278891c", "url": "https://www.semanticscholar.org/paper/39c2f99cf2ccb7ec7214983d26bed9246278891c", "title": "On the Performance of Convolutional Neural Networks for Side-Channel Analysis", "abstract": null, "year": 2018, "referenceCount": 42, "citationCount": 83, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1686538", "name": "S. Picek"}, {"authorId": "40485209", "name": "I. P. Samiotis"}, {"authorId": "2744489", "name": "Jaehun Kim"}, {"authorId": "2563182", "name": "Annelie Heuser"}, {"authorId": "40428273", "name": "S. Bhasin"}, {"authorId": "143833035", "name": "Axel Legay"}]}, {"paperId": "22499d33e81a9bc63bc45ac682c1f26498048425", "url": "https://www.semanticscholar.org/paper/22499d33e81a9bc63bc45ac682c1f26498048425", "title": "Template Attacks vs. Machine Learning Revisited (and the Curse of Dimensionality in Side-Channel Analysis)", "abstract": null, "year": 2015, "referenceCount": 36, "citationCount": 120, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39319437", "name": "Liran Lerman"}, {"authorId": "2759945", "name": "R. Poussier"}, {"authorId": "1772497", "name": "Gianluca Bontempi"}, {"authorId": "1802747", "name": "O. Markowitch"}, {"authorId": "1706533", "name": "François-Xavier Standaert"}]}, {"paperId": "dc6ef05427462f715c339c6e436a08a218d324ea", "url": "https://www.semanticscholar.org/paper/dc6ef05427462f715c339c6e436a08a218d324ea", "title": "Contrastive Analysis and Native Language Identification", "abstract": "Attempts to profile authors based on their characteristics, including native language, have drawn attention in recent years, via several approaches using machine learning with simple features. In this paper we investigate the potential usefulness to this task of contrastive analysis from second language acquistion research, which postulates that the (syntactic) errors in a text are influenced by an author’s native language. We explore this, first, by conducting an analysis of three syntactic error types, through hypothesis testing and machine learning; and second, through adding in these errors as features to the replication of a previous machine learning approach. This preliminary study provides some support for the use of this kind of syntactic errors as a clue to identifying the native language of an author.", "year": 2009, "referenceCount": 29, "citationCount": 83, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "2074494", "name": "S. J. Wong"}, {"authorId": "1795294", "name": "M. Dras"}]}, {"paperId": "25c19c8c1d6778a16f8b27beac4d9c6a55357580", "url": "https://www.semanticscholar.org/paper/25c19c8c1d6778a16f8b27beac4d9c6a55357580", "title": "Higher Order Recurrent Networks and Grammatical Inference", "abstract": "A higher order single layer recursive network easily learns to simulate a deterministic finite state machine and recognize regular grammars. When an enhanced version of this neural net state machine is connected through a common error term to an external analog stack memory, the combination can be interpreted as a neural net pushdown automata. The neural net finite state machine is given the primitives, push and POP, and is able to read the top of the stack. Through a gradient descent learning rule derived from the common error function, the hybrid network learns to effectively use the stack actions to manipulate the stack memory and to learn simple contextfree grammars.", "year": 1989, "referenceCount": 9, "citationCount": 146, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145157784", "name": "C. Lee Giles"}, {"authorId": "34922532", "name": "Guo-Zheng Sun"}, {"authorId": "2115401300", "name": "Hsing-Hen Chen"}, {"authorId": "2552960", "name": "Yee-Chun Lee"}, {"authorId": "2158193072", "name": "Dong Chen"}]}, {"paperId": "691bd46d8c1bef282b214c3a0d4d8cfb651d0aa8", "url": "https://www.semanticscholar.org/paper/691bd46d8c1bef282b214c3a0d4d8cfb651d0aa8", "title": "DiSMEC: Distributed Sparse Machines for Extreme Multi-label Classification", "abstract": "Extreme multi-label classification refers to supervised multi-label learning involving hundreds of thousands or even millions of labels. Datasets in extreme classification exhibit fit to power-law distribution, i.e. a large fraction of labels have very few positive instances in the data distribution. Most state-of-the-art approaches for extreme multi-label classification attempt to capture correlation among labels by embedding the label matrix to a low-dimensional linear sub-space. However, in the presence of power-law distributed extremely large and diverse label spaces, structural assumptions such as low rank can be easily violated. In this work, we present DiSMEC, which is a large-scale distributed framework for learning one-versus-rest linear classifiers coupled with explicit capacity control to control model size. Unlike most state-of-the-art methods, DiSMEC does not make any low rank assumptions on the label matrix. Using double layer of parallelization, DiSMEC can learn classifiers for datasets consisting hundreds of thousands labels within few hours. The explicit capacity control mechanism filters out spurious parameters which keep the model compact in size, without losing prediction accuracy. We conduct extensive empirical evaluation on publicly available real-world datasets consisting upto 670,000 labels. We compare DiSMEC with recent state-of-the-art approaches, including - SLEEC which is a leading approach for learning sparse local embeddings, and FastXML which is a tree-based approach optimizing ranking based loss function. On some of the datasets, DiSMEC can significantly boost prediction accuracies - 10% better compared to SLECC and 15% better compared to FastXML, in absolute terms.", "year": 2016, "referenceCount": 39, "citationCount": 183, "influentialCitationCount": 46, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1986256", "name": "Rohit Babbar"}, {"authorId": "1707625", "name": "B. Schölkopf"}]}, {"paperId": "d4848673c95383ddc7398b913e8ebc7a19e6b701", "url": "https://www.semanticscholar.org/paper/d4848673c95383ddc7398b913e8ebc7a19e6b701", "title": "Adversarial Controls for Scientific Machine Learning.", "abstract": "New machine learning methods to analyze raw chemical and biological data are now widely accessible as open-source toolkits. This positions researchers to leverage powerful, predictive models in their own domains. We caution, however, that the application of machine learning to experimental research merits careful consideration. Machine learning algorithms readily exploit confounding variables and experimental artifacts instead of relevant patterns, leading to overoptimistic performance and poor model generalization. In parallel to the strong control experiments that remain a cornerstone of experimental research, we advance the concept of adversarial controls for scientific machine learning: the design of exacting and purposeful experiments to ensure that predictive performance arises from meaningful models.", "year": 2018, "referenceCount": 8, "citationCount": 39, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "7935819", "name": "Kangway V Chuang"}, {"authorId": "2780351", "name": "Michael J. Keiser"}]}, {"paperId": "c33a8c8af8b3d9af04ebff5f85e1cf7f770be513", "url": "https://www.semanticscholar.org/paper/c33a8c8af8b3d9af04ebff5f85e1cf7f770be513", "title": "Mutual learning in a tree parity machine and its application to cryptography.", "abstract": "Mutual learning of a pair of tree parity machines with continuous and discrete weight vectors is studied analytically. The analysis is based on a mapping procedure that maps the mutual learning in tree parity machines onto mutual learning in noisy perceptrons. The stationary solution of the mutual learning in the case of continuous tree parity machines depends on the learning rate where a phase transition from partial to full synchronization is observed. In the discrete case the learning process is based on a finite increment and a full synchronized state is achieved in a finite number of steps. The synchronization of discrete parity machines is introduced in order to construct an ephemeral key-exchange protocol. The dynamic learning of a third tree parity machine (an attacker) that tries to imitate one of the two machines while the two still update their weight vectors is also analyzed. In particular, the synchronization times of the naive attacker and the flipping attacker recently introduced in Ref. 9 are analyzed. All analytical results are found to be in good agreement with simulation results.", "year": 2002, "referenceCount": 19, "citationCount": 54, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Physics", "Mathematics"], "authors": [{"authorId": "1398315116", "name": "M. Rosen-Zvi"}, {"authorId": "39466350", "name": "Einat Klein"}, {"authorId": "145556695", "name": "I. Kanter"}, {"authorId": "144345775", "name": "W. Kinzel"}]}, {"paperId": "02bc6ea395abd935c9996df0c92446f817704526", "url": "https://www.semanticscholar.org/paper/02bc6ea395abd935c9996df0c92446f817704526", "title": "Predicting the location of mobile users: a machine learning approach", "abstract": "Mobile context-aware applications experience a constantly changing environment with increased dynamicity. In order to work efficiently, the location of mobile users needs to be predicted and properly exploited by mobile applications. We propose a spatial context model, which deals with the location prediction of mobile users. Such model is used for the classification of the users' trajectories through Machine Learning (ML) algorithms. Predicting spatial context is treated through supervised learning. We evaluate our model in terms of prediction accuracy w.r.t. specific prediction parameters. The proposed model is also compared with other ML algorithms for location prediction. Our findings are very promising for the efficient operation of mobile context-aware applications.", "year": 2009, "referenceCount": 35, "citationCount": 88, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "37177797", "name": "Theodoros Anagnostopoulos"}, {"authorId": "145078804", "name": "C. Anagnostopoulos"}, {"authorId": "1685468", "name": "S. Hadjiefthymiades"}, {"authorId": "35350232", "name": "Miltos Kyriakakos"}, {"authorId": "1784711", "name": "Alexandros Kalousis"}]}, {"paperId": "7bb5d9abd15d42526b0f99a54e8f1621c9cea620", "url": "https://www.semanticscholar.org/paper/7bb5d9abd15d42526b0f99a54e8f1621c9cea620", "title": "Cognitive Model Priors for Predicting Human Decisions", "abstract": "Human decision-making underlies all economic behavior. For the past four decades, human decision-making under uncertainty has continued to be explained by theoretical models based on prospect theory, a framework that was awarded the Nobel Prize in Economic Sciences. However, theoretical models of this kind have developed slowly, and robust, high-precision predictive models of human decisions remain a challenge. While machine learning is a natural candidate for solving these problems, it is currently unclear to what extent it can improve predictions obtained by current theories. We argue that this is mainly due to data scarcity, since noisy human behavior requires massive sample sizes to be accurately captured by off-the-shelf machine learning methods. To solve this problem, what is needed are machine learning models with appropriate inductive biases for capturing human behavior, and larger datasets. We offer two contributions towards this end: first, we construct \"cognitive model priors\" by pretraining neural networks with synthetic data generated by cognitive models (i.e., theoretical models developed by cognitive psychologists). We find that fine-tuning these networks on small datasets of real human decisions results in unprecedented state-of-the-art improvements on two benchmark datasets. Second, we present the first large-scale dataset for human decision-making, containing over 240,000 human judgments across over 13,000 decision problems. This dataset reveals the circumstances where cognitive model priors are useful, and provides a new standard for benchmarking prediction of human decisions under uncertainty.", "year": 2019, "referenceCount": 27, "citationCount": 45, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145423354", "name": "David D. Bourgin"}, {"authorId": "6672056", "name": "Joshua C. Peterson"}, {"authorId": "7240083", "name": "Daniel Reichman"}, {"authorId": "1799860", "name": "T. Griffiths"}, {"authorId": "145107462", "name": "Stuart J. Russell"}]}, {"paperId": "c7d244dde874f82e5982e27391251fa66d41de8f", "url": "https://www.semanticscholar.org/paper/c7d244dde874f82e5982e27391251fa66d41de8f", "title": "Speaker Recognition by Machines and Humans: A tutorial review", "abstract": "Identifying a person by his or her voice is an important human trait most take for granted in natural human-to-human interaction/communication. Speaking to someone over the telephone usually begins by identifying who is speaking and, at least in cases of familiar speakers, a subjective verification by the listener that the identity is correct and the conversation can proceed. Automatic speaker-recognition systems have emerged as an important means of verifying identity in many e-commerce applications as well as in general business interactions, forensics, and law enforcement. Human experts trained in forensic speaker recognition can perform this task even better by examining a set of acoustic, prosodic, and linguistic characteristics of speech in a general approach referred to as structured listening. Techniques in forensic speaker recognition have been developed for many years by forensic speech scientists and linguists to help reduce any potential bias or preconceived understanding as to the validity of an unknown audio sample and a reference template from a potential suspect. Experienced researchers in signal processing and machine learning continue to develop automatic algorithms to effectively perform speaker recognition?with ever-improving performance?to the point where automatic systems start to perform on par with human listeners. In this article, we review the literature on speaker recognition by machines and humans, with an emphasis on prominent speaker-modeling techniques that have emerged in the last decade for automatic systems. We discuss different aspects of automatic systems, including voice-activity detection (VAD), features, speaker models, standard evaluation data sets, and performance metrics. Human speaker recognition is discussed in two parts?the first part involves forensic speaker-recognition methods, and the second illustrates how a na?ve listener performs this task from a neuroscience perspective. We conclude this review with a comparative study of human versus machine speaker recognition and attempt to point out strengths and weaknesses of each.", "year": 2015, "referenceCount": 138, "citationCount": 472, "influentialCitationCount": 29, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144270764", "name": "J. Hansen"}, {"authorId": "144782474", "name": "T. Hasan"}]}, {"paperId": "bab99f252a2339f8499da755eb159e4cc7277411", "url": "https://www.semanticscholar.org/paper/bab99f252a2339f8499da755eb159e4cc7277411", "title": "Photonic machine learning implementation for signal recovery in optical communications", "abstract": null, "year": 2017, "referenceCount": 75, "citationCount": 102, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Engineering"], "authors": [{"authorId": "2112018", "name": "A. Argyris"}, {"authorId": "49206957", "name": "Julián Bueno"}, {"authorId": "1795232", "name": "Ingo Fischer"}]}, {"paperId": "6c2c04c7ae9158311da6b1eee99a7edfed213460", "url": "https://www.semanticscholar.org/paper/6c2c04c7ae9158311da6b1eee99a7edfed213460", "title": "The acquisition of syntactic knowledge", "abstract": "This landmark work in computational linguistics is of great importance both theoretically and practically because it shows that much of English grammar can be learned by a simple program.The Acquisition of Syntactic Knowledge investigates the central questions of human and machine cognition: How do people learn language? How can we get a machine to learn language? It first presents an explicit computational model of language acquisition which can actually learn rules of English syntax given a sequence of grammatical, but otherwise unprepared, sentences.It shows that natural languages are designed to be easily learned and easily processed-an exciting breakthrough from the point of view of artificial intelligence and the design of expert systems because it shows how extensive knowledge might be acquired automatically, without outside intervention. Computationally, the book demonstrates how constraints that may be reasonably assumed to aid sentence processing also aid language acquisition.Chapters in the book's second part apply computational methods to the general problem of developmental growth, particularly the thorny problem of the interaction between innate genetic endowment and environmental input, with the intent of uncovering the constraints on the acquisition of syntactic knowledge. A number of \"mini-theories\" of learning are incorporated in this study of syntax with results that should appeal to a wide range of scholarly interests. These include how lexical categories, phonological rule systems, and phrase structure rules are learned; the role of semantic-syntactic interaction in language acquisition; how a \"parameter setting\" model may be formalized as a learning procedure; how multiple constraints (from syntax, thematic knowledge, or phrase structure) interact to aid acquisition; how transformational-type rules may be learned; and, the role of lexical ambiguity in language acquisition.Robert Berwick is an assistant professor in the Department of Electrical Engineering and Computer Science at MIT. The Acquisition of Syntactic Knowledge is sixteenth in the Artificial Intelligence Series, edited by Patrick Winston and Michael Brady.", "year": 1985, "referenceCount": 4, "citationCount": 767, "influentialCitationCount": 54, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3086368", "name": "R. Berwick"}]}, {"paperId": "f9eacf0bb25e35fdacc4c4a9a06b66757168dbdf", "url": "https://www.semanticscholar.org/paper/f9eacf0bb25e35fdacc4c4a9a06b66757168dbdf", "title": "Reproducibility standards for machine learning in the life sciences.", "abstract": null, "year": 2021, "referenceCount": 17, "citationCount": 53, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "41070189", "name": "Benjamin J. Heil"}, {"authorId": "35290352", "name": "M. M. Hoffman"}, {"authorId": "1796516", "name": "F. Markowetz"}, {"authorId": "2180463", "name": "Su-In Lee"}, {"authorId": "2104940", "name": "C. Greene"}, {"authorId": "35099275", "name": "S. Hicks"}]}, {"paperId": "2770d683a8a63ed1d87e51ca73a8571e930269a7", "url": "https://www.semanticscholar.org/paper/2770d683a8a63ed1d87e51ca73a8571e930269a7", "title": "Implementing a distance-based classifier with a quantum interference circuit", "abstract": "Lately, much attention has been given to quantum algorithms that solve pattern recognition tasks in machine learning. Many of these quantum machine learning algorithms try to implement classical models on large-scale universal quantum computers that have access to non-trivial subroutines such as Hamiltonian simulation, amplitude amplification and phase estimation. We approach the problem from the opposite direction and analyse a distance-based classifier that is realised by a simple quantum interference circuit. After state preparation, the circuit only consists of a Hadamard gate as well as two single-qubit measurements, and computes the distance between data points in quantum parallel. We demonstrate the proof of principle using the IBM Quantum Experience and analyse the performance of the classifier with numerical simulations.", "year": 2017, "referenceCount": 40, "citationCount": 155, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Physics", "Computer Science"], "authors": [{"authorId": "3048564", "name": "M. Schuld"}, {"authorId": "52538762", "name": "M. Fingerhuth"}, {"authorId": "2258749", "name": "Francesco Petruccione"}]}, {"paperId": "cee36473ff970b98a36543bf2997360abdcead50", "url": "https://www.semanticscholar.org/paper/cee36473ff970b98a36543bf2997360abdcead50", "title": "Machine learning coarse grained models for water", "abstract": null, "year": 2019, "referenceCount": 86, "citationCount": 73, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "143777552", "name": "Henry Chan"}, {"authorId": "12480512", "name": "M. Cherukara"}, {"authorId": "145454890", "name": "B. Narayanan"}, {"authorId": "4810023", "name": "T. Loeffler"}, {"authorId": "4969681", "name": "C. Benmore"}, {"authorId": "1885545", "name": "S. Gray"}, {"authorId": "2929500", "name": "S. Sankaranarayanan"}]}, {"paperId": "9b02e2fe6cfd04115f8c303e62d6a15e540ed19e", "url": "https://www.semanticscholar.org/paper/9b02e2fe6cfd04115f8c303e62d6a15e540ed19e", "title": "Machine learning techniques for FPS in Q3", "abstract": "This paper presents a First Person Shooter Artificial Intelligence system that makes use of machine learning capabilities to achieve more human-like behavior and strategies. The AI is trained with a supervised learning paradigm using example recorded during the observation of expert human players. The Machine Learning section of the AI is based on various Feed Forward Multi-layer Neural Networks trained by Genetic Algorithms. The AI system is developed and tested in the Quake 3 Arena game engine. The system is able to learn certain behaviors but still lack on some others. The results are evaluated and possible improvements are proposed.", "year": 2004, "referenceCount": 19, "citationCount": 50, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "26254959", "name": "Stephano Zanetti"}, {"authorId": "1794784", "name": "A. Rhalibi"}]}, {"paperId": "86bd56fb6a30a807e99278ecf3cffc33a3a448b4", "url": "https://www.semanticscholar.org/paper/86bd56fb6a30a807e99278ecf3cffc33a3a448b4", "title": "Automated brain histology classification using machine learning", "abstract": null, "year": 2019, "referenceCount": 30, "citationCount": 77, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "34812292", "name": "Justin Ker"}, {"authorId": "115358722", "name": "Yeqi Bai"}, {"authorId": "1943247769", "name": "Hwei Yee Lee"}, {"authorId": "39917910", "name": "J. Rao"}, {"authorId": "46659335", "name": "Lipo Wang"}]}, {"paperId": "fbd529b31145bfaf90e87e452334ef7d067bf6ab", "url": "https://www.semanticscholar.org/paper/fbd529b31145bfaf90e87e452334ef7d067bf6ab", "title": "Learning to classify documents according to genre", "abstract": "Current document-retrieval tools succeed in locating large numbers of documents relevant to a given query. While search results may be relevant according to the topic of the documents, it is more difficult to identify which of the relevant documents are most suitable for a particular user. Automatic genre analysis (i.e., the ability to distinguish documents according to style) would be a useful tool for identifying documents that are most suitable for a particular user. We investigate the use of machine learning for automatic genre classification. We introduce the idea of domain transfer—genre classifiers should be reusable across multiple topics—which does not arise in standard text classification. We investigate different features for building genre classifiers and their ability to transfer across multiple-topic domains. We also show how different feature-sets can be used in conjunction with each other to improve performance and reduce the number of documents that need to be labeled.", "year": 2006, "referenceCount": 31, "citationCount": 246, "influentialCitationCount": 26, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2296259", "name": "Aidan Finn"}, {"authorId": "8551365", "name": "N. Kushmerick"}]}, {"paperId": "f78aa3eca20e37d74a9bbb53121a007e5ef977f0", "url": "https://www.semanticscholar.org/paper/f78aa3eca20e37d74a9bbb53121a007e5ef977f0", "title": "Knowledge-based connectionism for revising domain theories", "abstract": "A knowledge-based connectionist model for machine learning referred to as KBCNN is presented. In the KBCNN learning model, useful domain attributes and concepts are first identified and linked in a way consistent with initial domain knowledge, and then the links are weighted properly so as to maintain the semantics. Hidden units and additional connections may be introduced into this initial connectionist structure as appropriate. Then, this primitive structure evolves to minimize empirical error. The KBCNN learning model allows the theory learned or revised to be translated into the symbolic rule-based language that describes the initial theory. Thus, a domain theory can be pushed onto the network, revised empirically over time, and decoded in symbolic form. The domain of molecular genetics is used to demonstrate the validity of the KBCNN learning model and its superiority over related learning methods. >", "year": 1993, "referenceCount": 25, "citationCount": 175, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39779537", "name": "Limin Fu"}]}, {"paperId": "2c47bd8bd699914e3535292b17ba46542800845c", "url": "https://www.semanticscholar.org/paper/2c47bd8bd699914e3535292b17ba46542800845c", "title": "Do we need hundreds of classifiers to solve real world classification problems", "abstract": "We evaluate 179 classifiers arising from 17 families (discriminant analysis, Bayesian, neural networks, support vector machines, decision trees, rule-based classifiers, boosting, bagging, stacking, random forests and other ensembles, generalized linear models, nearest-neighbors, partial least squares and principal component regression, logistic and multinomial regression, multiple adaptive regression splines and other methods), implemented in Weka, R (with and without the caret package), C and Matlab, including all the relevant classifiers available today. We use 121 data sets, which represent the whole UCI data base (excluding the large-scale problems) and other own real problems, in order to achieve significant conclusions about the classifier behavior, not dependent on the data set collection. The classifiers most likely to be the bests are the random forest (RF) versions, the best of which (implemented in R and accessed via caret) achieves 94.1% of the maximum accuracy overcoming 90% in the 84.3% of the data sets. However, the difference is not statistically significant with the second best, the SVM with Gaussian kernel implemented in C using LibSVM, which achieves 92.3% of the maximum accuracy. A few models are clearly better than the remaining ones: random forest, SVM with Gaussian and polynomial kernels, extreme learning machine with Gaussian kernel, C5.0 and avNNet (a committee of multi-layer perceptrons implemented in R with the caret package). The random forest is clearly the best family of classifiers (3 out of 5 bests classifiers are RF), followed by SVM (4 classifiers in the top-10), neural networks and boosting ensembles (5 and 3 members in the top-20, respectively).", "year": 2014, "referenceCount": 114, "citationCount": 2524, "influentialCitationCount": 112, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "1406550059", "name": "M. Fernández-Delgado"}, {"authorId": "2746944", "name": "E. Cernadas"}, {"authorId": "145676637", "name": "S. Barro"}, {"authorId": "2061412126", "name": "D. Amorim"}]}, {"paperId": "c98bcc8689c34d72fd0b696f2a49e7f86d151782", "url": "https://www.semanticscholar.org/paper/c98bcc8689c34d72fd0b696f2a49e7f86d151782", "title": "An introduction to domain adaptation and transfer learning", "abstract": "In machine learning, if the training data is an unbiased sample of an underlying distribution, then the learned classification function will make accurate predictions for new samples. However, if the training data is not an unbiased sample, then there will be differences between how the training data is distributed and how the test data is distributed. Standard classifiers cannot cope with changes in data distributions between training and test phases, and will not perform well. Domain adaptation and transfer learning are sub-fields within machine learning that are concerned with accounting for these types of changes. Here, we present an introduction to these fields, guided by the question: when and how can a classifier generalize from a source to a target domain? We will start with a brief introduction into risk minimization, and how transfer learning and domain adaptation expand upon this framework. Following that, we discuss three special cases of data set shift, namely prior, covariate and concept shift. For more complex domain shifts, there are a wide variety of approaches. These are categorized into: importance-weighting, subspace mapping, domain-invariant spaces, feature augmentation, minimax estimators and robust algorithms. A number of points will arise, which we will discuss in the last section. We conclude with the remark that many open questions will have to be addressed before transfer learners and domain-adaptive classifiers become practical.", "year": 2018, "referenceCount": 241, "citationCount": 166, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3191461", "name": "Wouter M. Kouw"}]}, {"paperId": "36cfd68da9e0c521c8b09ecf9ca48e0dbf24cc19", "url": "https://www.semanticscholar.org/paper/36cfd68da9e0c521c8b09ecf9ca48e0dbf24cc19", "title": "Advances and opportunities in machine learning for process data analytics", "abstract": null, "year": 2019, "referenceCount": 77, "citationCount": 139, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143609842", "name": "S. Qin"}, {"authorId": "144546220", "name": "Leo H. Chiang"}]}, {"paperId": "5ae68cd141a748ec0b209b6b9212cdd4b8498959", "url": "https://www.semanticscholar.org/paper/5ae68cd141a748ec0b209b6b9212cdd4b8498959", "title": "Towards a holistic approach to auto-parallelization: integrating profile-driven parallelism detection and machine-learning based mapping", "abstract": "Compiler-based auto-parallelization is a much studied area, yet has still not found wide-spread application. This is largely due to the poor exploitation of application parallelism, subsequently resulting in performance levels far below those which a skilled expert programmer could achieve. We have identified two weaknesses in traditional parallelizing compilers and propose a novel, integrated approach, resulting in significant performance improvements of the generated parallel code. Using profile-driven parallelism detection we overcome the limitations of static analysis, enabling us to identify more application parallelism and only rely on the user for final approval. In addition, we replace the traditional target-specific and inflexible mapping heuristics with a machine-learning based prediction mechanism, resulting in better mapping decisions while providing more scope for adaptation to different target architectures. We have evaluated our parallelization strategy against the NAS and SPEC OMP benchmarks and two different multi-core platforms (dual quad-core Intel Xeon SMP and dual-socket QS20 Cell blade). We demonstrate that our approach not only yields significant improvements when compared with state-of-the-art parallelizing compilers, but comes close to and sometimes exceeds the performance of manually parallelized codes. On average, our methodology achieves 96% of the performance of the hand-tuned OpenMP NAS and SPEC parallel benchmarks on the Intel Xeon platform and gains a significant speedup for the IBM Cell platform, demonstrating the potential of profile-guided and machine-learning based parallelization for complex multi-core platforms.", "year": 2009, "referenceCount": 42, "citationCount": 245, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2753715", "name": "Georgios Tournavitis"}, {"authorId": "40072305", "name": "Zheng Wang"}, {"authorId": "2644436", "name": "Björn Franke"}, {"authorId": "1401533251", "name": "M. O’Boyle"}]}, {"paperId": "51bd09c164893927ec190dff33be617edda84208", "url": "https://www.semanticscholar.org/paper/51bd09c164893927ec190dff33be617edda84208", "title": "Cluster-based instance selection for machine classification", "abstract": null, "year": 2010, "referenceCount": 59, "citationCount": 60, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1987465", "name": "I. Czarnowski"}]}, {"paperId": "7f8213487ef7910c74d8494b1609a591def2461e", "url": "https://www.semanticscholar.org/paper/7f8213487ef7910c74d8494b1609a591def2461e", "title": "Tapprints: your finger taps have fingerprints", "abstract": "This paper shows that the location of screen taps on modern smartphones and tablets can be identified from accelerometer and gyroscope readings. Our findings have serious implications, as we demonstrate that an attacker can launch a background process on commodity smartphones and tablets, and silently monitor the user's inputs, such as keyboard presses and icon taps. While precise tap detection is nontrivial, requiring machine learning algorithms to identify fingerprints of closely spaced keys, sensitive sensors on modern devices aid the process. We present TapPrints, a framework for inferring the location of taps on mobile device touch-screens using motion sensor data combined with machine learning analysis. By running tests on two different off-the-shelf smartphones and a tablet computer we show that identifying tap locations on the screen and inferring English letters could be done with up to 90% and 80% accuracy, respectively. By optimizing the core tap detection capability with additional information, such as contextual priors, we are able to further magnify the core threat.", "year": 2012, "referenceCount": 30, "citationCount": 334, "influentialCitationCount": 28, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3325038", "name": "E. Miluzzo"}, {"authorId": "39818716", "name": "A. Varshavsky"}, {"authorId": "5246203", "name": "Suhrid Balakrishnan"}, {"authorId": "1694368", "name": "Romit Roy Choudhury"}]}, {"paperId": "47733616c788b18ea2ada3742df6be9e0ed0af50", "url": "https://www.semanticscholar.org/paper/47733616c788b18ea2ada3742df6be9e0ed0af50", "title": "Machine Learning: A Theoretical Approach", "abstract": null, "year": 1992, "referenceCount": 0, "citationCount": 53, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "52639844", "name": "Translator-IEEE Expert staff"}]}, {"paperId": "a28e2fe4ccde9a0e14123c126459be3e01ebe40f", "url": "https://www.semanticscholar.org/paper/a28e2fe4ccde9a0e14123c126459be3e01ebe40f", "title": "Learning Flexible Models from Image Sequences", "abstract": null, "year": 1994, "referenceCount": 16, "citationCount": 331, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2679389", "name": "A. Baumberg"}, {"authorId": "1967104", "name": "David C. Hogg"}]}, {"paperId": "87d9b486605234370944638eda727fa43003e1d0", "url": "https://www.semanticscholar.org/paper/87d9b486605234370944638eda727fa43003e1d0", "title": "Machine Learning in Complex Networks", "abstract": null, "year": 2016, "referenceCount": 209, "citationCount": 43, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143763475", "name": "Thiago C. Silva"}, {"authorId": "144000229", "name": "Liang Zhao"}]}, {"paperId": "70571cf09abef4bcad07eac3425e925d55202d7a", "url": "https://www.semanticscholar.org/paper/70571cf09abef4bcad07eac3425e925d55202d7a", "title": "Improving active Mealy machine learning for protocol conformance testing", "abstract": null, "year": 2014, "referenceCount": 79, "citationCount": 31, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39315305", "name": "F. Aarts"}, {"authorId": "2255155", "name": "Harco Kuppens"}, {"authorId": "2089466", "name": "J. Tretmans"}, {"authorId": "1678787", "name": "F. Vaandrager"}, {"authorId": "1682757", "name": "S. Verwer"}]}, {"paperId": "954db9aa9f141ce9719d9ffc76c7677b27d9e45f", "url": "https://www.semanticscholar.org/paper/954db9aa9f141ce9719d9ffc76c7677b27d9e45f", "title": "Learning to track 3D human motion from silhouettes", "abstract": "We describe a sparse Bayesian regression method for recovering 3D human body motion directly from silhouettes extracted from monocular video sequences. No detailed body shape model is needed, and realism is ensured by training on real human motion capture data. The tracker estimates 3D body pose by using Relevance Vector Machine regression to combine a learned autoregressive dynamical model with robust shape descriptors extracted automatically from image silhouettes. We studied several different combination methods, the most effective being to learn a nonlinear observation-update correction based on joint regression with respect to the predicted state and the observations. We demonstrate the method on a 54-parameter full body pose model, both quantitatively using motion capture based test sequences, and qualitatively on a test video sequence.", "year": 2004, "referenceCount": 26, "citationCount": 110, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145984136", "name": "A. Agarwal"}, {"authorId": "1756114", "name": "B. Triggs"}]}, {"paperId": "54245d2f74795c2430c576625832aec7c9cbda40", "url": "https://www.semanticscholar.org/paper/54245d2f74795c2430c576625832aec7c9cbda40", "title": "A Knowledge-Intensive Genetic Algorithm for Supervised Learning", "abstract": null, "year": 2004, "referenceCount": 43, "citationCount": 77, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "2751408", "name": "C. Janikow"}]}, {"paperId": "8bba999de25bfb288b3f7f88e1d907aab02638b6", "url": "https://www.semanticscholar.org/paper/8bba999de25bfb288b3f7f88e1d907aab02638b6", "title": "Big-Data Science in Porous Materials: Materials Genomics and Machine Learning", "abstract": "By combining metal nodes with organic linkers we can potentially synthesize millions of possible metal–organic frameworks (MOFs). The fact that we have so many materials opens many exciting avenues but also create new challenges. We simply have too many materials to be processed using conventional, brute force, methods. In this review, we show that having so many materials allows us to use big-data methods as a powerful technique to study these materials and to discover complex correlations. The first part of the review gives an introduction to the principles of big-data science. We show how to select appropriate training sets, survey approaches that are used to represent these materials in feature space, and review different learning architectures, as well as evaluation and interpretation strategies. In the second part, we review how the different approaches of machine learning have been applied to porous materials. In particular, we discuss applications in the field of gas storage and separation, the stability of these materials, their electronic properties, and their synthesis. Given the increasing interest of the scientific community in machine learning, we expect this list to rapidly expand in the coming years.", "year": 2020, "referenceCount": 606, "citationCount": 160, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science", "Chemistry", "Medicine", "Physics", "Computer Science"], "authors": [{"authorId": "134251468", "name": "K. Jablonka"}, {"authorId": "17711197", "name": "D. Ongari"}, {"authorId": "144683061", "name": "S. M. Moosavi"}, {"authorId": "144189527", "name": "B. Smit"}]}, {"paperId": "aef103e43b2b40828db776ddb5b39a9d76b03217", "url": "https://www.semanticscholar.org/paper/aef103e43b2b40828db776ddb5b39a9d76b03217", "title": "Application of Machine Learning in Wireless Networks: Key Techniques and Open Issues", "abstract": "As a key technique for enabling artificial intelligence, machine learning (ML) is capable of solving complex problems without explicit programming. Motivated by its successful applications to many practical tasks like image recognition, both industry and the research community have advocated the applications of ML in wireless communication. This paper comprehensively surveys the recent advances of the applications of ML in wireless communication, which are classified as: resource management in the MAC layer, networking and mobility management in the network layer, and localization in the application layer. The applications in resource management further include power control, spectrum management, backhaul management, cache management, and beamformer design and computation resource management, while ML-based networking focuses on the applications in clustering, base station switching control, user association, and routing. Moreover, literatures in each aspect is organized according to the adopted ML techniques. In addition, several conditions for applying ML to wireless communication are identified to help readers decide whether to use ML and which kind of ML techniques to use. Traditional approaches are also summarized together with their performance comparison with ML-based approaches, based on which the motivations of surveyed literatures to adopt ML are clarified. Given the extensiveness of the research area, challenges and unresolved issues are presented to facilitate future studies. Specifically, ML-based network slicing, infrastructure update to support ML-based paradigms, open data sets and platforms for researchers, theoretical guidance for ML implementation, and so on are discussed.", "year": 2018, "referenceCount": 174, "citationCount": 267, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1922678", "name": "Yaohua Sun"}, {"authorId": "144874832", "name": "M. Peng"}, {"authorId": "79558827", "name": "Yangcheng Zhou"}, {"authorId": "51121256", "name": "Yuzhe Huang"}, {"authorId": "145536403", "name": "S. Mao"}]}, {"paperId": "ee3a96949d59a6aaff7c3cb66ddcd3512831d257", "url": "https://www.semanticscholar.org/paper/ee3a96949d59a6aaff7c3cb66ddcd3512831d257", "title": "RECIPE: A Grammar-Based Framework for Automatically Evolving Classification Pipelines", "abstract": null, "year": 2017, "referenceCount": 30, "citationCount": 89, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2779493", "name": "A. G. C. D. Sá"}, {"authorId": "37035128", "name": "Walter José G. S. Pinto"}, {"authorId": "145872832", "name": "Luiz Otavio Vilas Boas Oliveira"}, {"authorId": "1685457", "name": "G. Pappa"}]}, {"paperId": "465bac0e623215236cb9d417a81d2e428691123a", "url": "https://www.semanticscholar.org/paper/465bac0e623215236cb9d417a81d2e428691123a", "title": "Machine learning for environmental monitoring", "abstract": null, "year": 2018, "referenceCount": 22, "citationCount": 45, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "70855440", "name": "M. Hino"}, {"authorId": "119147631", "name": "E. Benami"}, {"authorId": "2082330944", "name": "N. Brooks"}]}, {"paperId": "2e52ed9601bae3f659f757438447f6ad8d9087e9", "url": "https://www.semanticscholar.org/paper/2e52ed9601bae3f659f757438447f6ad8d9087e9", "title": "Autonomous driving: A comparison of machine learning techniques by means of the prediction of lane change behavior", "abstract": "In the presented work we compare machine learning techniques in the context of lane change behavior performed by humans in a semi-naturalistic simulated environment. We evaluate different learning approaches using differing feature combinations in order to identify appropriate feature, best feature combination, and the most appropriate machine learning technique for the described task. Based on the data acquired from human drivers in the traffic simulator NISYS TRS1, we trained a recurrent neural network, a feed forward neural network and a set of support vector machines. In the followed test drives the system was able to predict lane changes up to 1.5 sec in beforehand.", "year": 2011, "referenceCount": 19, "citationCount": 54, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2154404", "name": "Ü. Dogan"}, {"authorId": "2884308", "name": "J. Edelbrunner"}, {"authorId": "2932744", "name": "I. Iossifidis"}]}, {"paperId": "619301d3ee619af5b6b58e1fe0ffbd5f2d38f895", "url": "https://www.semanticscholar.org/paper/619301d3ee619af5b6b58e1fe0ffbd5f2d38f895", "title": "Machine learning classifiers for glaucoma diagnosis based on classification of retinal nerve fibre layer thickness parameters measured by Stratus OCT", "abstract": "Purpose:  To compare the performance of two machine learning classifiers (MLCs), artificial neural networks (ANNs) and support vector machines (SVMs), with input based on retinal nerve fibre layer thickness (RNFLT) measurements by optical coherence tomography (OCT), on the diagnosis of glaucoma, and to assess the effects of different input parameters.", "year": 2010, "referenceCount": 47, "citationCount": 84, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "6999117", "name": "Dimitrios Bizios"}, {"authorId": "5027094", "name": "A. Heijl"}, {"authorId": "4103839", "name": "J. Hougaard"}, {"authorId": "145637436", "name": "B. Bengtsson"}]}, {"paperId": "2dee25bbab17a83854b0ff7ec46ef758e74a0e58", "url": "https://www.semanticscholar.org/paper/2dee25bbab17a83854b0ff7ec46ef758e74a0e58", "title": "Using Stacking Approaches for Machine Learning Models", "abstract": "In this paper, we study the usage of stacking approach for building ensembles of machine learning models. The cases for time series forecasting and logistic regression have been considered. The results show that using stacking technics we can improve performance of predictive models in considered cases.", "year": 2018, "referenceCount": 7, "citationCount": 59, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3008532", "name": "B. Pavlyshenko"}]}, {"paperId": "c3172ea74996bc7d390a1bebdc53e373db903b1d", "url": "https://www.semanticscholar.org/paper/c3172ea74996bc7d390a1bebdc53e373db903b1d", "title": "On the Weaknesses of Reinforcement Learning for Neural Machine Translation", "abstract": "Reinforcement learning (RL) is frequently used to increase performance in text generation tasks, including machine translation (MT), notably through the use of Minimum Risk Training (MRT) and Generative Adversarial Networks (GAN). However, little is known about what and how these methods learn in the context of MT. We prove that one of the most common RL methods for MT does not optimize the expected reward, as well as show that other methods take an infeasibly long time to converge. In fact, our results suggest that RL practices in MT are likely to improve performance only where the pre-trained parameters are already close to yielding the correct translation. Our findings further suggest that observed gains may be due to effects unrelated to the training signal, but rather from changes in the shape of the distribution curve.", "year": 2019, "referenceCount": 46, "citationCount": 49, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "41019330", "name": "Leshem Choshen"}, {"authorId": "113940484", "name": "Lior Fox"}, {"authorId": "46258223", "name": "Zohar Aizenbud"}, {"authorId": "2769805", "name": "Omri Abend"}]}, {"paperId": "09ddf6771c7d946eef42b4fcf9fee7abec968699", "url": "https://www.semanticscholar.org/paper/09ddf6771c7d946eef42b4fcf9fee7abec968699", "title": "Application of Machine Learning in Disease Prediction", "abstract": "The application of machine learning in the field of medical diagnosis is increasing gradually. This can be contributed primarily to the improvement in the classification and recognition systems used in disease diagnosis which is able to provide data that aids medical experts in early detection of fatal diseases and therefore, increase the survival rate of patients significantly. In this paper, we apply different classification algorithms, each with its own advantage on three separate databases of disease (Heart, Breast cancer, Diabetes) available in UCI repository for disease prediction. The feature selection for each dataset was accomplished by backward modeling using the p-value test. The results of the study strengthen the idea of the application of machine learning in early detection of diseases.", "year": 2018, "referenceCount": 15, "citationCount": 58, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "151457673", "name": "Pahulpreet Singh Kohli"}, {"authorId": "145210862", "name": "Shriya Arora"}]}, {"paperId": "29143359cccc8e5e72fb3f3df5914bd8aa158efe", "url": "https://www.semanticscholar.org/paper/29143359cccc8e5e72fb3f3df5914bd8aa158efe", "title": "On Cognitive Computing", "abstract": "Cognitive Computing (CC) is a contemporary field of studies on intelligent computing methodologies and brain-inspired mechanisms of cognitive systems, cognitive machine learning and cognitive robotics. The IEEE conference ICCI*CC'17 on Cognitive Informatics and Cognitive Computing was focused on the theme of neurocomputation, cognitive machine learning and brain-inspired systems. This article reports the plenary panel (Part II) in IEEE ICCI*CC'17 at Oxford University. The summary is contributed by distinguished panelists who are part of the world's renowned scholars in the transdisciplinary field of cognitive computing.", "year": 2009, "referenceCount": 74, "citationCount": 102, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46395270", "name": "Yingxu Wang"}]}, {"paperId": "2f80e4f9488a685c2f5d1784bd75bef537e9e1cd", "url": "https://www.semanticscholar.org/paper/2f80e4f9488a685c2f5d1784bd75bef537e9e1cd", "title": "MMR-based Active Machine Learning for Bio Named Entity Recognition", "abstract": "This paper presents a new active learning paradigm which considers not only the uncertainty of the classifier but also the diversity of the corpus. The two measures for uncertainty and diversity were combined using the MMR (Maximal Marginal Relevance) method to give the sampling scores in our active learning strategy. We incorporated MMR-based active machine-learning idea into the biomedical named-entity recognition system. Our experimental results indicated that our strategies for active-learning based sample selection could significantly reduce the human effort.", "year": 2006, "referenceCount": 12, "citationCount": 64, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2047181", "name": "Seokhwan Kim"}, {"authorId": "2152603843", "name": "Yu Song"}, {"authorId": "2572316", "name": "Kyungduk Kim"}, {"authorId": "2007875", "name": "Jeongwon Cha"}, {"authorId": "2167149040", "name": "G. G. Lee"}]}, {"paperId": "4bd48e59590908d103e0c8b379002a64253f124a", "url": "https://www.semanticscholar.org/paper/4bd48e59590908d103e0c8b379002a64253f124a", "title": "Learning to Align from Scratch", "abstract": "Unsupervised joint alignment of images has been demonstrated to improve performance on recognition tasks such as face verification. Such alignment reduces undesired variability due to factors such as pose, while only requiring weak supervision in the form of poorly aligned examples. However, prior work on unsupervised alignment of complex, real-world images has required the careful selection of feature representation based on hand-crafted image descriptors, in order to achieve an appropriate, smooth optimization landscape. In this paper, we instead propose a novel combination of unsupervised joint alignment with unsupervised feature learning. Specifically, we incorporate deep learning into the congealing alignment framework. Through deep learning, we obtain features that can represent the image at differing resolutions based on network depth, and that are tuned to the statistics of the specific data being aligned. In addition, we modify the learning algorithm for the restricted Boltzmann machine by incorporating a group sparsity penalty, leading to a topographic organization of the learned filters and improving subsequent alignment results. We apply our method to the Labeled Faces in the Wild database (LFW). Using the aligned images produced by our proposed unsupervised algorithm, we achieve higher accuracy in face verification compared to prior work in both unsupervised and supervised alignment. We also match the accuracy for the best available commercial method.", "year": 2012, "referenceCount": 47, "citationCount": 298, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3219900", "name": "Gary B. Huang"}, {"authorId": "2985062", "name": "Marwan A. Mattar"}, {"authorId": "1697141", "name": "Honglak Lee"}, {"authorId": "1389846455", "name": "E. Learned-Miller"}]}, {"paperId": "ee0195862a599854b6b23f6479bd58d1714f4345", "url": "https://www.semanticscholar.org/paper/ee0195862a599854b6b23f6479bd58d1714f4345", "title": "Identifying Pb-free perovskites for solar cells by machine learning", "abstract": null, "year": 2019, "referenceCount": 64, "citationCount": 94, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31110445", "name": "J. Im"}, {"authorId": "2108643711", "name": "Seongwon Lee"}, {"authorId": "50283779", "name": "Tae-Wook Ko"}, {"authorId": "2154858256", "name": "Hyunwoo Kim"}, {"authorId": "3127577", "name": "YunKyong Hyon"}, {"authorId": "5355349", "name": "Hyunju Chang"}]}, {"paperId": "fb7caddac20dca012f48c90b2e1e2383f7185051", "url": "https://www.semanticscholar.org/paper/fb7caddac20dca012f48c90b2e1e2383f7185051", "title": "Interpreting Interpretability: Understanding Data Scientists' Use of Interpretability Tools for Machine Learning", "abstract": "Machine learning (ML) models are now routinely deployed in domains ranging from criminal justice to healthcare. With this newfound ubiquity, ML has moved beyond academia and grown into an engineering discipline. To that end, interpretability tools have been designed to help data scientists and machine learning practitioners better understand how ML models work. However, there has been little evaluation of the extent to which these tools achieve this goal. We study data scientists' use of two existing interpretability tools, the InterpretML implementation of GAMs and the SHAP Python package. We conduct a contextual inquiry (N=11) and a survey (N=197) of data scientists to observe how they use interpretability tools to uncover common issues that arise when building and evaluating ML models. Our results indicate that data scientists over-trust and misuse interpretability tools. Furthermore, few of our participants were able to accurately describe the visualizations output by these tools. We highlight qualitative themes for data scientists' mental models of interpretability tools. We conclude with implications for researchers and tool designers, and contextualize our findings in the social science literature.", "year": 2020, "referenceCount": 116, "citationCount": 235, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48712213", "name": "Harmanpreet Kaur"}, {"authorId": "40900039", "name": "Harsha Nori"}, {"authorId": "2057108610", "name": "Samuel Jenkins"}, {"authorId": "145727186", "name": "R. Caruana"}, {"authorId": "1831395", "name": "H. Wallach"}, {"authorId": "4006636", "name": "Jennifer Wortman Vaughan"}]}, {"paperId": "3b28d045c49315665ebf3242ffa8dd6f166a9d70", "url": "https://www.semanticscholar.org/paper/3b28d045c49315665ebf3242ffa8dd6f166a9d70", "title": "Application of Artificial Intelligence for Preoperative Diagnostic and Prognostic Prediction in Epithelial Ovarian Cancer Based on Blood Biomarkers", "abstract": "Purpose: We aimed to develop an ovarian cancer–specific predictive framework for clinical stage, histotype, residual tumor burden, and prognosis using machine learning methods based on multiple biomarkers. Experimental Design: Overall, 334 patients with epithelial ovarian cancer (EOC) and 101 patients with benign ovarian tumors were randomly assigned to “training” and “test” cohorts. Seven supervised machine learning classifiers, including Gradient Boosting Machine (GBM), Support Vector Machine, Random Forest (RF), Conditional RF (CRF), Naïve Bayes, Neural Network, and Elastic Net, were used to derive diagnostic and prognostic information from 32 parameters commonly available from pretreatment peripheral blood tests and age. Results: Machine learning techniques were superior to conventional regression-based analyses in predicting multiple clinical parameters pertaining to EOC. Ensemble methods combining weak decision trees, such as GBM, RF, and CRF, showed the best performance in EOC prediction. The values for the highest accuracy and area under the ROC curve (AUC) for segregating EOC from benign ovarian tumors with RF were 92.4% and 0.968, respectively. The highest accuracy and AUC for predicting clinical stages with RF were 69.0% and 0.760, respectively. High-grade serous and mucinous histotypes of EOC could be preoperatively predicted with RF. An ordinal RF classifier could distinguish complete resection from others. Unsupervised clustering analysis identified subgroups among early-stage EOC patients with significantly worse survival. Conclusions: Machine learning systems can provide critical diagnostic and prognostic prediction for patients with EOC before initial intervention, and the use of predictive algorithms may facilitate personalized treatment options through pretreatment stratification of patients.", "year": 2019, "referenceCount": 33, "citationCount": 69, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "35710644", "name": "Eiryo Kawakami"}, {"authorId": "79285108", "name": "Junya Tabata"}, {"authorId": "50006097", "name": "N. Yanaihara"}, {"authorId": "2147102820", "name": "T. Ishikawa"}, {"authorId": "2094009813", "name": "K. Koseki"}, {"authorId": "34577991", "name": "Y. Iida"}, {"authorId": "3627947", "name": "M. Saito"}, {"authorId": "50236018", "name": "H. Komazaki"}, {"authorId": "2868230", "name": "J. Shapiro"}, {"authorId": "150057277", "name": "C. Goto"}, {"authorId": "2133165981", "name": "Yuka Akiyama"}, {"authorId": "48435216", "name": "Ryosuke Saito"}, {"authorId": "49160513", "name": "M. Saito"}, {"authorId": "49099926", "name": "H. Takano"}, {"authorId": "35248844", "name": "Kyosuke Yamada"}, {"authorId": "40373837", "name": "A. Okamoto"}]}, {"paperId": "62346756772d7e7721028b561af26d4076d3ef11", "url": "https://www.semanticscholar.org/paper/62346756772d7e7721028b561af26d4076d3ef11", "title": "Parameter optimization for machine-learning of word sense disambiguation", "abstract": "Various Machine Learning (ML) approaches have been demonstrated to produce relatively successful Word Sense Disambiguation (WSD) systems. There are still unexplained differences among the performance measurements of different algorithms, hence it is warranted to deepen the investigation into which algorithm has the right ‘bias’ for this task. In this paper, we show that this is not easy to accomplish, due to intricate interactions between information sources, parameter settings, and properties of the training data. We investigate the impact of parameter optimization on generalization accuracy in a memory-based learning approach to English and Dutch WSD. A ‘word-expert’ architecture was adopted, yielding a set of classifiers, each specialized in one single wordform. The experts consist of multiple memory-based learning classifiers, each taking different information sources as input, combined in a voting scheme. We optimized the architectural and parametric settings for each individual word-expert by performing cross-validation experiments on the learning material. The results of these experiments show that the variation of both the algorithmic parameters and the information sources available to the classifiers leads to large fluctuations in accuracy. We demonstrate that optimization per word-expert leads to an overall significant improvement in the generalization accuracies of the produced WSD systems.", "year": 2002, "referenceCount": 23, "citationCount": 88, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2653729", "name": "Veronique Hoste"}, {"authorId": "1708288", "name": "Iris Hendrickx"}, {"authorId": "1735272", "name": "Walter Daelemans"}, {"authorId": "145977875", "name": "Antal van den Bosch"}]}, {"paperId": "e1a4f559f339b10f3fc86ba51b998aa2a9ccb2bd", "url": "https://www.semanticscholar.org/paper/e1a4f559f339b10f3fc86ba51b998aa2a9ccb2bd", "title": "Correct machine learning on protein sequences: a peer-reviewing perspective", "abstract": "Machine learning methods are becoming increasingly popular to predict protein features from sequences. Machine learning in bioinformatics can be powerful but carries also the risk of introducing unexpected biases, which may lead to an overestimation of the performance. This article espouses a set of guidelines to allow both peer reviewers and authors to avoid common machine learning pitfalls. Understanding biology is necessary to produce useful data sets, which have to be large and diverse. Separating the training and test process is imperative to avoid over-selling method performance, which is also dependent on several hidden parameters. A novel predictor has always to be compared with several existing methods, including simple baseline strategies. Using the presented guidelines will help nonspecialists to appreciate the critical issues in machine learning.", "year": 2016, "referenceCount": 47, "citationCount": 49, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Biology", "Computer Science"], "authors": [{"authorId": "144218611", "name": "Ian Walsh"}, {"authorId": "2028880", "name": "G. Pollastri"}, {"authorId": "1801645", "name": "S. Tosatto"}]}, {"paperId": "5aad6be00624abf34b5dd6ee9c1b34679be72d79", "url": "https://www.semanticscholar.org/paper/5aad6be00624abf34b5dd6ee9c1b34679be72d79", "title": "Drug Discovery Using Support Vector Machines. The Case Studies of Drug-likeness, Agrochemical-likeness, and Enzyme Inhibition Predictions", "abstract": "Support Vector Machines (SVM) is a powerful classification and regression tool that is becoming increasingly popular in various machine learning applications. We tested the ability of SVM, in comparison with well-known neural network techniques, to predict drug-likeness and agrochemical-likeness for large compound collections. For both kinds of data, SVM outperforms various neural networks using the same set of descriptors. We also used SVM for estimating the activity of Carbonic Anhydrase II (CA II) enzyme inhibitors and found that the prediction quality of our SVM model is better than that reported earlier for conventional QSAR. Model characteristics and data set features were studied in detail.", "year": 2003, "referenceCount": 33, "citationCount": 168, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "34789820", "name": "V. V. Zernov"}, {"authorId": "1783444", "name": "K. Balakin"}, {"authorId": "2901920", "name": "A. Ivaschenko"}, {"authorId": "1779456", "name": "N. Savchuk"}, {"authorId": "1832519", "name": "I. Pletnev"}]}, {"paperId": "1050141af39d7c64303e60b608db1cec23db528d", "url": "https://www.semanticscholar.org/paper/1050141af39d7c64303e60b608db1cec23db528d", "title": "Bayesian Modeling of Human Concept Learning", "abstract": "I consider the problem of learning concepts from small numbers of positive examples, a feat which humans perform routinely but which computers are rarely capable of. Bridging machine learning and cognitive science perspectives, I present both theoretical analysis and an empirical study with human subjects for the simple task oflearning concepts corresponding to axis-aligned rectangles in a multidimensional feature space. Existing learning models, when applied to this task, cannot explain how subjects generalize from only a few examples of the concept. I propose a principled Bayesian model based on the assumption that the examples are a random sample from the concept to be learned. The model gives precise fits to human behavior on this simple task and provides qualitative insights into more complex, realistic cases of concept learning.", "year": 1998, "referenceCount": 12, "citationCount": 194, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1763295", "name": "J. Tenenbaum"}]}, {"paperId": "f3eda875e14bf933759f3b777131a4a9973537b4", "url": "https://www.semanticscholar.org/paper/f3eda875e14bf933759f3b777131a4a9973537b4", "title": "Data-driven science and engineering: machine learning, dynamical systems, and control", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 368, "influentialCitationCount": 50, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153929250", "name": "T. Peters"}]}]}