{"total": 5120680, "offset": 6000, "next": 6100, "data": [{"paperId": "abcb8026694d0fafce5d1cc8230ce49f42a7f5e3", "url": "https://www.semanticscholar.org/paper/abcb8026694d0fafce5d1cc8230ce49f42a7f5e3", "title": "Hybrid SVM/HMM architectures for speech recognition", "abstract": "In this paper, we describe the use of a powerful machine learning scheme, Support Vector Machines (SVM), within the framework of hidden Markov model (HMM) based speech recognition. The hybrid SVM/HMM system has been developed based on our public domain toolkit. The hybrid system has been evaluated on the OGI Alphadigits corpus and performs at 11.6% WER, as compared to 12.7% with a triphone mixture-Gaussian HMM system, while using only a fifth of the training data used by triphone system. Several important issues that arise out of the nature of SVM classiﬁers have been addressed. We are in the process of migrating this technology to large vocabulary recognition tasks like SWITCHBOARD.", "year": 2000, "referenceCount": 14, "citationCount": 151, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1782807", "name": "A. Ganapathiraju"}, {"authorId": "144170973", "name": "J. Hamaker"}, {"authorId": "1744408", "name": "J. Picone"}]}, {"paperId": "269be66378a4314445a781b1bf577c5d61b93b71", "url": "https://www.semanticscholar.org/paper/269be66378a4314445a781b1bf577c5d61b93b71", "title": "Imitation Learning", "abstract": "Imitation learning techniques aim to mimic human behavior in a given task. An agent (a learning machine) is trained to perform a task from demonstrations by learning a mapping between observations and actions. The idea of teaching by imitation has been around for many years; however, the field is gaining attention recently due to advances in computing and sensing as well as rising demand for intelligent applications. The paradigm of learning by imitation is gaining popularity because it facilitates teaching complex tasks with minimal expert knowledge of the tasks. Generic imitation learning methods could potentially reduce the problem of teaching a task to that of providing demonstrations, without the need for explicit programming or designing reward functions specific to the task. Modern sensors are able to collect and transmit high volumes of data rapidly, and processors with high computational power allow fast processing that maps the sensory data to actions in a timely manner. This opens the door for many potential AI applications that require real-time perception and reaction such as humanoid robots, self-driving vehicles, human computer interaction, and computer games, to name a few. However, specialized algorithms are needed to effectively and robustly learn models as learning by imitation poses its own set of challenges. In this article, we survey imitation learning methods and present design options in different steps of the learning process. We introduce a background and motivation for the field as well as highlight challenges specific to the imitation problem. Methods for designing and evaluating imitation learning tasks are categorized and reviewed. Special attention is given to learning methods in robotics and games as these domains are the most popular in the literature and provide a wide array of problems and methodologies. We extensively discuss combining imitation learning approaches using different sources and methods, as well as incorporating other motion learning methods to enhance imitation. We also discuss the potential impact on industry, present major applications, and highlight current and future research directions.", "year": 2017, "referenceCount": 166, "citationCount": 214, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2061099244", "name": "A. Hussein"}, {"authorId": "1698684", "name": "M. Gaber"}, {"authorId": "1807106", "name": "Eyad Elyan"}, {"authorId": "8683625", "name": "Chrisina Jayne"}]}, {"paperId": "03c1db0b27621c051da7780c2fa72e012c7a726e", "url": "https://www.semanticscholar.org/paper/03c1db0b27621c051da7780c2fa72e012c7a726e", "title": "Kohonen feature maps as a supervised learning machine", "abstract": "Kohonen feature maps as a supervised learning machine are proposed and discussed. The proposed models adopt supervised learning without modifying the basic learning algorithm. They behave as a supervised learning machine, which can learn input-output functions in addition to the characteristics of the conventional Kohonen feature maps. In the pattern recognition problems, the proposed models can structure the recognition system more simply than the conventional method, i.e., structuring a pattern recognition machine using a supervised learning machine after pre-processing by the Kohonen feature map. The proposed models do not distinguish the input vectors from the desired vectors because they regard them as the same kind of vectors. Several examples are simulated in order to compare with the conventional supervised learning machines. The results indicate the effectiveness of the proposed models.<<ETX>>", "year": 1993, "referenceCount": 5, "citationCount": 40, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2085100318", "name": "H. Ichiki"}, {"authorId": "145719769", "name": "M. Hagiwara"}, {"authorId": "1747731", "name": "M. Nakagawa"}]}, {"paperId": "ef172109af9456839dec1eea19b150f2210b3846", "url": "https://www.semanticscholar.org/paper/ef172109af9456839dec1eea19b150f2210b3846", "title": "Darwin machines and the nature of knowledge", "abstract": "Learn and survive. Behind this simple equation lies a revolution in the study of knowledge, which has left the halls of philosophy for the labs of science. This book offers a cogent account of what such a move does to our understanding of the nature of learning, rationality, and intelligence. Bringing together evolutionary biology, psychology, and philosophy, Henry Plotkin presents a new science of knowledge, one that traces an unbreakable link between instinct and our ability to know. Contrary to the modern liberal idea that knowledge is something derived from experience, this science shows us that what we know is what our nature allows us to know, what our instincts tell us we must know. Since our ability to know our world depends primarily on what we call intelligence, intelligence must be understood as an extension of instinct. Drawing on contemporary evolutionary theory, especially notions of hierarchical structure and universal Darwinism, Plotkin tells us that the capacity for knowledge, which is what makes us human, is deeply rooted in our biology and, in a special sense, is shared by all living things. This leads to a discussion of animal and human intelligence as well as an appraisal of what an instinct-based capacity for knowledge might mean to our understanding of language, reasoning, emotion, and culture. The result is nothing less than a three-dimensional theory of our nature, in which all knowledge is adaptation and all adaptation is a specific form of knowledge.", "year": 1994, "referenceCount": 0, "citationCount": 252, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Psychology"], "authors": [{"authorId": "40429633", "name": "H. Plotkin"}]}, {"paperId": "db5511e90b2f4d650067ebf934294617eff81eca", "url": "https://www.semanticscholar.org/paper/db5511e90b2f4d650067ebf934294617eff81eca", "title": "Locate the Hate: Detecting Tweets against Blacks", "abstract": "\n \n Although the social medium Twitter grants users freedom of speech, its instantaneous nature and retweeting features also amplify hate speech. Because Twitter has a sizeable black constituency, racist tweets against blacks are especially detrimental in the Twitter community, though this effect may not be obvious against a backdrop of half a billion tweets a day.1 We apply a supervised machine learning approach, employing inexpensively acquired labeled data from diverse Twitter accounts to learn a binary classifier for the labels “racist” and “nonracist.” The classifier has a 76% average accuracy on individual tweets, suggesting that with further improvements, our work can contribute data on the sources of anti-black hate speech.\n \n", "year": 2013, "referenceCount": 5, "citationCount": 341, "influentialCitationCount": 27, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "116436971", "name": "Irene Kwok"}, {"authorId": "2136948237", "name": "Yuzhou Wang"}]}, {"paperId": "d27ce25b29a4a059e9dfc9e0782d1f7d09cfc891", "url": "https://www.semanticscholar.org/paper/d27ce25b29a4a059e9dfc9e0782d1f7d09cfc891", "title": "Drug Design by Machine Learning", "abstract": null, "year": 1995, "referenceCount": 0, "citationCount": 21, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145410834", "name": "M. Sternberg"}, {"authorId": "33654217", "name": "R. King"}, {"authorId": "143780768", "name": "A. Srinivasan"}, {"authorId": "145147566", "name": "S. Muggleton"}]}, {"paperId": "6fe84ae5a785391e1f8805eb261cc7cb1bf8a2fc", "url": "https://www.semanticscholar.org/paper/6fe84ae5a785391e1f8805eb261cc7cb1bf8a2fc", "title": "APPLYING MACHINE LEARNING ALGORITHMS IN SOFTWARE DEVELOPMENT", "abstract": "Machine learning deals with the issue of how to build programs that improve their performance at some task through experience. Machine learning algorithms have proven to be of great practical value in a variety of application domains. They are particularly useful for (a) poorly understood problem domains where little knowledge exists for the humans to develop effective algorithms; (b) domains where there are large databases containing valuable implicit regularities to be discovered; or (c) domains where programs must adapt to changing conditions. Not surprisingly, the field of software engineering turns out to be a fertile ground where many software development tasks could be formulated as learning problems and approached in terms of learning algorithms. In this paper, we first take a look at the characteristics and applicability of some frequently utilized machine learning algorithms. We then provide formulations of some software development tasks using learning algorithms. Finally, a brief summary is given of the existing work.", "year": 2000, "referenceCount": 18, "citationCount": 38, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1711711", "name": "Du Zhang"}]}, {"paperId": "60061de387ca4d85a674a844893ecb2d30a3459e", "url": "https://www.semanticscholar.org/paper/60061de387ca4d85a674a844893ecb2d30a3459e", "title": "Robust online Hamiltonian learning", "abstract": "In this work we combine two distinct machine learning methodologies, sequential Monte Carlo and Bayesian experimental design, and apply them to the problem of inferring the dynamical parameters of a quantum system. We design the algorithm with practicality in mind by including parameters that control trade-offs between the requirements on computational and experimental resources. The algorithm can be implemented online (during experimental data collection), avoiding the need for storage and post-processing. Most importantly, our algorithm is capable of learning Hamiltonian parameters even when the parameters change from experiment-to-experiment, and also when additional noise processes are present and unknown. The algorithm also numerically estimates the Cramer–Rao lower bound, certifying its own performance.", "year": 2012, "referenceCount": 96, "citationCount": 130, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Computer Science"], "authors": [{"authorId": "10720158", "name": "C. Granade"}, {"authorId": "2625463", "name": "C. Ferrie"}, {"authorId": "3253856", "name": "N. Wiebe"}, {"authorId": "28786601", "name": "D. Cory"}]}, {"paperId": "03bb3537ce1baf2d6872ce8299935ef11f43390e", "url": "https://www.semanticscholar.org/paper/03bb3537ce1baf2d6872ce8299935ef11f43390e", "title": "Efficient nonparametric n -body force fields from machine learning", "abstract": "The authors present a scheme to construct classical $n$-body force fields using Gaussian Process (GP) Regression, appropriately mapped over explicit n-body functions (M-FFs). The procedure is possible, and will yield accurate forces, whenever prior knowledge allows to restrict the interactions to a finite order $n$, so that the ``universal approximator'' resolving power of standard GPs or Neural Networks is not needed. Under these conditions, the proposed construction preserves flexibility of training, systematically improvable accuracy, and a clear framework for validation of the underlying machine learning technique. Moreover, the M-FFs are as fast as classical parametrized potentials, since they avoid lengthy summations over database entries or weight parameters.", "year": 2018, "referenceCount": 86, "citationCount": 83, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "17859109", "name": "Aldo Glielmo"}, {"authorId": "50978878", "name": "C. Zeni"}, {"authorId": "145362749", "name": "A. D. Vita"}]}, {"paperId": "2a8e26f7ad35b0a322936f648608aab3b6c1f44d", "url": "https://www.semanticscholar.org/paper/2a8e26f7ad35b0a322936f648608aab3b6c1f44d", "title": "Sparse and unique nonnegative matrix factorization through data preprocessing", "abstract": "Nonnegative matrix factorization (NMF) has become a very popular technique in machine learning because it automatically extracts meaningful features through a sparse and part-based representation. However, NMF has the drawback of being highly ill-posed, that is, there typically exist many different but equivalent factorizations. In this paper, we introduce a completely new way to obtaining more well-posed NMF problems whose solutions are sparser. Our technique is based on the preprocessing of the nonnegative input data matrix, and relies on the theory of M-matrices and the geometric interpretation of NMF. This approach provably leads to optimal and sparse solutions under the separability assumption of Donoho and Stodden (2003), and, for rank-three matrices, makes the number of exact factorizations finite. We illustrate the effectiveness of our technique on several image data sets.", "year": 2012, "referenceCount": 48, "citationCount": 140, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2039115", "name": "Nicolas Gillis"}]}, {"paperId": "22c6c6deac6141de63f9f6d2729a944a1e4a90a6", "url": "https://www.semanticscholar.org/paper/22c6c6deac6141de63f9f6d2729a944a1e4a90a6", "title": "Training SVM with indefinite kernels", "abstract": "Similarity matrices generated from many applications may not be positive semidefinite, and hence can't fit into the kernel machine framework. In this paper, we study the problem of training support vector machines with an indefinite kernel. We consider a regularized SVM formulation, in which the indefinite kernel matrix is treated as a noisy observation of some unknown positive semidefinite one (proxy kernel) and the support vectors and the proxy kernel can be computed simultaneously. We propose a semi-infinite quadratically constrained linear program formulation for the optimization, which can be solved iteratively to find a global optimum solution. We further propose to employ an additional pruning strategy, which significantly improves the efficiency of the algorithm, while retaining the convergence property of the algorithm. In addition, we show the close relationship between the proposed formulation and multiple kernel learning. Experiments on a collection of benchmark data sets demonstrate the efficiency and effectiveness of the proposed algorithm.", "year": 2008, "referenceCount": 30, "citationCount": 73, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2108513551", "name": "Jianhui Chen"}, {"authorId": "144030870", "name": "Jieping Ye"}]}, {"paperId": "9649482b7f4dfff3e30c7838b6070cfddf0e6668", "url": "https://www.semanticscholar.org/paper/9649482b7f4dfff3e30c7838b6070cfddf0e6668", "title": "A Survey of Stealth Malware Attacks, Mitigation Measures, and Steps Toward Autonomous Open World Solutions", "abstract": "As our professional, social, and financial existences become increasingly digitized and as our government, healthcare, and military infrastructures rely more on computer technologies, they present larger and more lucrative targets for malware. Stealth malware in particular poses an increased threat because it is specifically designed to evade detection mechanisms, spreading dormant, in the wild for extended periods of time, gathering sensitive information or positioning itself for a high-impact zero-day attack. Policing the growing attack surface requires the development of efficient anti-malware solutions with improved generalization to detect novel types of malware and resolve these occurrences with as little burden on human experts as possible. In this paper, we survey malicious stealth technologies as well as existing solutions for detecting and categorizing these countermeasures autonomously. While machine learning offers promising potential for increasingly autonomous solutions with improved generalization to new malware types, both at the network level and at the host level, our findings suggest that several flawed assumptions inherent to most recognition algorithms prevent a direct mapping between the stealth malware recognition problem and a machine learning solution. The most notable of these flawed assumptions is the closed world assumption: that no sample belonging to a class outside of a static training set will appear at query time. We present a formalized adaptive open world framework for stealth malware recognition and relate it mathematically to research from other machine learning domains.", "year": 2016, "referenceCount": 225, "citationCount": 115, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39886114", "name": "Ethan M. Rudd"}, {"authorId": "2974221", "name": "Andras Rozsa"}, {"authorId": "38636666", "name": "Manuel Günther"}, {"authorId": "32163276", "name": "T. Boult"}]}, {"paperId": "beb7ab375b32be7a51703e05c2d7166140bfb32e", "url": "https://www.semanticscholar.org/paper/beb7ab375b32be7a51703e05c2d7166140bfb32e", "title": "Machine learning applications in IC testing", "abstract": "In recent years, a large number of works have surfaced demonstrating applications of machine learning in the field of integrated circuit testing. Many of these works showcase the effectiveness of machine learning compared to the current industry practice on actual case studies with industrial data. The aim of the paper is to offer a concise and comprehensive tutorial on machine learning applications in integrated circuit testing and to provide some practical recommendations for practitioners.", "year": 2018, "referenceCount": 91, "citationCount": 36, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1689094", "name": "H. Stratigopoulos"}]}, {"paperId": "902a7ed3484d73354f9eac6af7986619bb1b2293", "url": "https://www.semanticscholar.org/paper/902a7ed3484d73354f9eac6af7986619bb1b2293", "title": "Generalization and similarity in exemplar models of categorization: Insights from machine learning", "abstract": null, "year": 2008, "referenceCount": 111, "citationCount": 61, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "80488489", "name": "F. Jäkel"}, {"authorId": "1707625", "name": "B. Schölkopf"}, {"authorId": "1924112", "name": "Felix Wichmann"}]}, {"paperId": "d3044544cdd56e99af037dba71654c0942d0feb2", "url": "https://www.semanticscholar.org/paper/d3044544cdd56e99af037dba71654c0942d0feb2", "title": "Advances in Smart Environment Monitoring Systems Using IoT and Sensors", "abstract": "Air quality, water pollution, and radiation pollution are major factors that pose genuine challenges in the environment. Suitable monitoring is necessary so that the world can achieve sustainable growth, by maintaining a healthy society. In recent years, the environment monitoring has turned into a smart environment monitoring (SEM) system, with the advances in the internet of things (IoT) and the development of modern sensors. Under this scenario, the present manuscript aims to accomplish a critical review of noteworthy contributions and research studies on SEM, that involve monitoring of air quality, water quality, radiation pollution, and agriculture systems. The review is divided on the basis of the purposes where SEM methods are applied, and then each purpose is further analyzed in terms of the sensors used, machine learning techniques involved, and classification methods used. The detailed analysis follows the extensive review which has suggested major recommendations and impacts of SEM research on the basis of discussion results and research trends analyzed. The authors have critically studied how the advances in sensor technology, IoT and machine learning methods make environment monitoring a truly smart monitoring system. Finally, the framework of robust methods of machine learning; denoising methods and development of suitable standards for wireless sensor networks (WSNs), has been suggested.", "year": 2020, "referenceCount": 109, "citationCount": 114, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "1698957", "name": "S. Ullo"}, {"authorId": "2064479350", "name": "G. Sinha"}]}, {"paperId": "e572c08976412c49a450fd69857d5f722656d004", "url": "https://www.semanticscholar.org/paper/e572c08976412c49a450fd69857d5f722656d004", "title": "Learning EMG control of a robotic hand: towards active prostheses", "abstract": "We introduce a method based on support vector machines which can detect opening and closing actions of the human thumb, index finger, and other fingers recorded via surface EMG only. The method is shown to be robust across sessions and can be used independently of the position of the arm. With these stability criteria, the method is ideally suited for the control of active prosthesis with a high number of active degrees of freedom. The method is successfully demonstrated on a robotic four-finger hand, and can be used to grasp objects", "year": 2006, "referenceCount": 10, "citationCount": 254, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "1854700", "name": "Sebastian Bitzer"}, {"authorId": "1715782", "name": "Patrick van der Smagt"}]}, {"paperId": "639bc5a8144cce90711993a1e860359ce70b2d0f", "url": "https://www.semanticscholar.org/paper/639bc5a8144cce90711993a1e860359ce70b2d0f", "title": "Is inductive machine learning just another wild goose (or might it lay the golden egg)?", "abstract": "The research reported here contrasts the roles, methodologies and capabilities of statistical methods with those of inductive machine learning methods, as they are used inferentially in geographical analysis. To this end, various established problems with statistical inference applied in geographical settings are reviewed, based on Gould's (1970) critique. Possible solutions to the problems outlined by Gould are suggested via reviews of: (i) improved statistical methods, and (ii) recent inductive machine learning techniques. Following this, some newer problems with inference are described, emerging from the increased complexity of geographical datasets and from the analysis tasks to which we put them. Again, some solutions are suggested by pointing to newer methods. By way of results, questions are posed, and answered, relating to the changes brought about by adopting inductive machine learning methods for geographical analysis. Specifically, these questions relate to analysis capabilities, methodologies, the role of the geographer and consequences for teaching and learning. Conclusions argue that there is now a strong need, motivated from many perspectives, to give geographical data a stronger voice, thus favouring techniques that minimize the prior assumptions made of a dataset.", "year": 2003, "referenceCount": 120, "citationCount": 76, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1801583", "name": "M. Gahegan"}]}, {"paperId": "b12e9e5d3edeb2bd8040fba0c7a9b74755dd81ef", "url": "https://www.semanticscholar.org/paper/b12e9e5d3edeb2bd8040fba0c7a9b74755dd81ef", "title": "Deep neural networks in psychiatry", "abstract": null, "year": 2019, "referenceCount": 202, "citationCount": 118, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2361055", "name": "D. Durstewitz"}, {"authorId": "2243141", "name": "G. Koppe"}, {"authorId": "1397954143", "name": "A. Meyer-Lindenberg"}]}, {"paperId": "ab2ad4118683a42e6a1262f6239c0f3c033df581", "url": "https://www.semanticscholar.org/paper/ab2ad4118683a42e6a1262f6239c0f3c033df581", "title": "Fast and Accurate Uncertainty Estimation in Chemical Machine Learning.", "abstract": "We present a scheme to obtain an inexpensive and reliable estimate of the uncertainty associated with the predictions of a machine-learning model of atomic and molecular properties. The scheme is based on resampling, with multiple models being generated based on subsampling of the same training data. The accuracy of the uncertainty prediction can be benchmarked by maximum likelihood estimation, which can also be used to correct for correlations between resampled models and to improve the performance of the uncertainty estimation by a cross-validation procedure. In the case of sparse Gaussian Process Regression models, this resampled estimator can be evaluated at negligible cost. We demonstrate the reliability of these estimates for the prediction of molecular and materials energetics and for the estimation of nuclear chemical shieldings in molecular crystals. Extension to estimate the uncertainty in energy differences, forces, or other correlated predictions is straightforward. This method can be easily applied to other machine-learning schemes and will be beneficial to make data-driven predictions more reliable and to facilitate training-set optimization and active-learning strategies.", "year": 2018, "referenceCount": 62, "citationCount": 82, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Physics"], "authors": [{"authorId": "34778608", "name": "F. Musil"}, {"authorId": "11042469", "name": "Michael J. Willatt"}, {"authorId": "88754305", "name": "Mikhail A. Langovoy"}, {"authorId": "1917770", "name": "M. Ceriotti"}]}, {"paperId": "30d41b40869999190022257dcfb38587e85fccb2", "url": "https://www.semanticscholar.org/paper/30d41b40869999190022257dcfb38587e85fccb2", "title": "Machine Learning Outperforms ACC/AHA CVD Risk Calculator in MESA", "abstract": "Background Studies have demonstrated that the current US guidelines based on American College of Cardiology/American Heart Association (ACC/AHA) Pooled Cohort Equations Risk Calculator may underestimate risk of atherosclerotic cardiovascular disease (CVD) in certain high‐risk individuals, therefore missing opportunities for intensive therapy and preventing CVD events. Similarly, the guidelines may overestimate risk in low risk populations resulting in unnecessary statin therapy. We used Machine Learning (ML) to tackle this problem. Methods and Results We developed a ML Risk Calculator based on Support Vector Machines (SVMs) using a 13‐year follow up data set from MESA (the Multi‐Ethnic Study of Atherosclerosis) of 6459 participants who were atherosclerotic CVD‐free at baseline. We provided identical input to both risk calculators and compared their performance. We then used the FLEMENGHO study (the Flemish Study of Environment, Genes and Health Outcomes) to validate the model in an external cohort. ACC/AHA Risk Calculator, based on 7.5% 10‐year risk threshold, recommended statin to 46.0%. Despite this high proportion, 23.8% of the 480 “Hard CVD” events occurred in those not recommended statin, resulting in sensitivity 0.76, specificity 0.56, and AUC 0.71. In contrast, ML Risk Calculator recommended only 11.4% to take statin, and only 14.4% of “Hard CVD” events occurred in those not recommended statin, resulting in sensitivity 0.86, specificity 0.95, and AUC 0.92. Similar results were found for prediction of “All CVD” events. Conclusions The ML Risk Calculator outperformed the ACC/AHA Risk Calculator by recommending less drug therapy, yet missing fewer events. Additional studies are underway to validate the ML model in other cohorts and to explore its ability in short‐term CVD risk prediction.", "year": 2018, "referenceCount": 38, "citationCount": 89, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1706204", "name": "I. Kakadiaris"}, {"authorId": "2045915", "name": "Michalis Vrigkas"}, {"authorId": "40563453", "name": "A. Yen"}, {"authorId": "2056540866", "name": "T. Kuznetsova"}, {"authorId": "145197121", "name": "M. Budoff"}, {"authorId": "20627607", "name": "M. Naghavi"}]}, {"paperId": "69ee679b0357ff1ae7656d66bd23d98328258e6e", "url": "https://www.semanticscholar.org/paper/69ee679b0357ff1ae7656d66bd23d98328258e6e", "title": "Attack and anomaly detection in IoT sensors in IoT sites using machine learning approaches", "abstract": null, "year": 2019, "referenceCount": 32, "citationCount": 305, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2118720453", "name": "Mahmudul Hasan"}, {"authorId": "2157630857", "name": "Md. Milon Islam"}, {"authorId": "1412660145", "name": "Md Ishrak Islam Zarif"}, {"authorId": "143733972", "name": "M. Hashem"}]}, {"paperId": "205bebb4a332a54839c3f3866d15f6e551320914", "url": "https://www.semanticscholar.org/paper/205bebb4a332a54839c3f3866d15f6e551320914", "title": "Heart Disease Prediction using Machine Learning", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 66, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "71212695", "name": "M. M. Bhajibhakare"}]}, {"paperId": "b28813076fdab6fb23bd30f48b065fc245f00697", "url": "https://www.semanticscholar.org/paper/b28813076fdab6fb23bd30f48b065fc245f00697", "title": "A Machine Learning Approach to Identifying the Thought Markers of Suicidal Subjects: A Prospective Multicenter Trial", "abstract": "Death by suicide demonstrates profound personal suffering and societal failure. While basic sciences provide the opportunity to understand biological markers related to suicide, computer science provides opportunities to understand suicide thought markers. In this novel prospective, multimodal, multicenter, mixed demographic study, we used machine learning to measure and fuse two classes of suicidal thought markers: verbal and nonverbal. Machine learning algorithms were used with the subjects' words and vocal characteristics to classify 379 subjects recruited from two academic medical centers and a rural community hospital into one of three groups: suicidal, mentally ill but not suicidal, or controls. By combining linguistic and acoustic characteristics, subjects could be classified into one of the three groups with up to 85% accuracy. The results provide insight into how advanced technology can be used for suicide assessment and prevention.", "year": 2017, "referenceCount": 63, "citationCount": 98, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1787579", "name": "J. Pestian"}, {"authorId": "6277794", "name": "M. Sorter"}, {"authorId": "152225746", "name": "B. Connolly"}, {"authorId": "11819898", "name": "Kevin Bretonnel Cohen"}, {"authorId": "5128264", "name": "C. Mccullumsmith"}, {"authorId": "15414486", "name": "Jeffry T Gee"}, {"authorId": "49933077", "name": "Louis-Philippe Morency"}, {"authorId": "1770312", "name": "Stefan Scherer"}, {"authorId": "2008541165", "name": "Lesley Rohlfs"}]}, {"paperId": "9149d4ff45e27a2652d129a2dfa0256142932707", "url": "https://www.semanticscholar.org/paper/9149d4ff45e27a2652d129a2dfa0256142932707", "title": "Deep learning wavefront sensing.", "abstract": "We present a new class of wavefront sensors by extending their design space based on machine learning. This approach simplifies both the optical hardware and image processing in wavefront sensing. We experimentally demonstrated a variety of image-based wavefront sensing architectures that can directly estimate Zernike coefficients of aberrated wavefronts from a single intensity image by using a convolutional neural network. We also demonstrated that the proposed deep learning wavefront sensor can be trained to estimate wavefront aberrations stimulated by a point source and even extended sources.", "year": 2019, "referenceCount": 27, "citationCount": 101, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "66189441", "name": "Yohei Nishizaki"}, {"authorId": "65761171", "name": "Matias Valdivia"}, {"authorId": "3614205", "name": "R. Horisaki"}, {"authorId": "2853937", "name": "K. Kitaguchi"}, {"authorId": "2149878786", "name": "M. Saito"}, {"authorId": "2063601", "name": "J. Tanida"}, {"authorId": "144189957", "name": "E. Vera"}]}, {"paperId": "ed0616c039241e89f56696a96ca998ccaeec2407", "url": "https://www.semanticscholar.org/paper/ed0616c039241e89f56696a96ca998ccaeec2407", "title": "A Machine Learning System to Improve Heart Failure Patient Assistance", "abstract": "In this paper, we present a clinical decision support system (CDSS) for the analysis of heart failure (HF) patients, providing various outputs such as an HF severity evaluation, HF-type prediction, as well as a management interface that compares the different patients' follow-ups. The whole system is composed of a part of intelligent core and of an HF special-purpose management tool also providing the function to act as interface for the artificial intelligence training and use. To implement the smart intelligent functions, we adopted a machine learning approach. In this paper, we compare the performance of a neural network (NN), a support vector machine, a system with fuzzy rules genetically produced, and a classification and regression tree and its direct evolution, which is the random forest, in analyzing our database. Best performances in both HF severity evaluation and HF-type prediction functions are obtained by using the random forest algorithm. The management tool allows the cardiologist to populate a “supervised database” suitable for machine learning during his or her regular outpatient consultations. The idea comes from the fact that in literature there are a few databases of this type, and they are not scalable to our case.", "year": 2014, "referenceCount": 25, "citationCount": 80, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2056466685", "name": "Gabriele Guidi"}, {"authorId": "35142795", "name": "M. C. Pettenati"}, {"authorId": "3350505", "name": "P. Melillo"}, {"authorId": "2387863", "name": "E. Iadanza"}]}, {"paperId": "27ab2cbb3b26a431d5ede5be34e9ee9a464d144c", "url": "https://www.semanticscholar.org/paper/27ab2cbb3b26a431d5ede5be34e9ee9a464d144c", "title": "A Machine Learning Approach to Answering Questions for Reading Comprehension Tests", "abstract": "In this paper, we report results on answering questions for the reading comprehension task, using a machine learning approach. We evaluated our approach on the Remedia data set, a common data set used in several recent papers on the reading comprehension task. Our learning approach achieves accuracy competitive to previous approaches that rely on hand-crafted, deterministic rules and algorithms. To the best of our knowledge, this is the first work that reports that the use of a machine learning approach achieves competitive results on answering questions for reading comprehension tests.", "year": 2000, "referenceCount": 13, "citationCount": 55, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34789794", "name": "H. Ng"}, {"authorId": "38963764", "name": "Leonghwee Teo"}, {"authorId": "2136756", "name": "J. Kwan"}]}, {"paperId": "6bbc29f35e323ebb27566898ad8b1be3f1ff834c", "url": "https://www.semanticscholar.org/paper/6bbc29f35e323ebb27566898ad8b1be3f1ff834c", "title": "Comparative Analysis of Supervised and Unsupervised Discretization Techniques", "abstract": "Most of the Machine Learning and Data Mining applications can be applicable only on discrete features. However, data in real world are often continuous in nature. Even for algorithms that can directly deal with continuous features, learning is often less efficient and effective. Hence discretization addresses this issue by finding the intervals of numbers which are more concise to represent and specify. Discretization of continuous attributes is one of the important data preprocessing steps of knowledge extraction. An effective discretization method not only can reduce the demand of system memory and improve the efficiency of data mining and machine learning algorithm, but also make the knowledge extracted from the discretized dataset more compact, easy to be understand and used. In this paper, different types of traditional Supervised and Unsupervised discretization techniques along with examples, as well as their advantages and drawbacks have been discussed.", "year": 2011, "referenceCount": 10, "citationCount": 95, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35199040", "name": "Rajashree Dash"}, {"authorId": "67334749", "name": "Rajib Lochan Paramguru"}, {"authorId": "40567424", "name": "Rasmita Dash"}]}, {"paperId": "01be7624aa0e0251182593350a984411c2e5128a", "url": "https://www.semanticscholar.org/paper/01be7624aa0e0251182593350a984411c2e5128a", "title": "Credit Card Fraud Detection using Deep Learning based on Auto-Encoder and Restricted Boltzmann Machine", "abstract": "Frauds have no constant patterns. They always change their behavior; so, we need to use an unsupervised learning. Fraudsters learn about new technology that allows them to execute frauds through online transactions. Fraudsters assume the regular behavior of consumers, and fraud patterns change fast. So, fraud detection systems need to detect online transactions by using unsupervised learning, because some fraudsters commit frauds once through online mediums and then switch to other techniques. This paper aims to 1) focus on fraud cases that cannot be detected based on previous history or supervised learning, 2) create a model of deep Auto-encoder and restricted Boltzmann machine (RBM) that can reconstruct normal transactions to find anomalies from normal patterns. The proposed deep learning based on auto-encoder (AE) is an unsupervised learning algorithm that applies backpropagation by setting the inputs equal to the outputs. The RBM has two layers, the input layer (visible) and hidden layer. In this research, we use the Tensorflow library from Google to implement AE, RBM, and H2O by using deep learning. The results show the mean squared error, root mean squared error, and area under curve.", "year": 2018, "referenceCount": 17, "citationCount": 107, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "73369554", "name": "Apapan Pumsirirat"}, {"authorId": "2149103067", "name": "Liu Yan"}]}, {"paperId": "a39d6bccc01ca64713c0ab05901cae6629cf8e90", "url": "https://www.semanticscholar.org/paper/a39d6bccc01ca64713c0ab05901cae6629cf8e90", "title": "Bringing the People Back In: Contesting Benchmark Machine Learning Datasets", "abstract": "In response to algorithmic unfairness embedded in sociotechnical systems, significant attention has been focused on the contents of machine learning datasets which have revealed biases towards white, cisgender, male, and Western data subjects. In contrast, comparatively less attention has been paid to the histories, values, and norms embedded in such datasets. In this work, we outline a research program - a genealogy of machine learning data - for investigating how and why these datasets have been created, what and whose values influence the choices of data to collect, the contextual and contingent conditions of their creation. We describe the ways in which benchmark datasets in machine learning operate as infrastructure and pose four research questions for these datasets. This interrogation forces us to \"bring the people back in\" by aiding us in understanding the labor embedded in dataset construction, and thereby presenting new avenues of contestation for other researchers encountering the data.", "year": 2020, "referenceCount": 42, "citationCount": 55, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40081727", "name": "Emily L. Denton"}, {"authorId": "40540250", "name": "A. Hanna"}, {"authorId": "2097216156", "name": "Razvan Amironesei"}, {"authorId": "152735378", "name": "A. Smart"}, {"authorId": "1816756517", "name": "Hilary Nicole"}, {"authorId": "10691918", "name": "M. Scheuerman"}]}, {"paperId": "b3f21a20186ae8f306913e49b265f407ed91d959", "url": "https://www.semanticscholar.org/paper/b3f21a20186ae8f306913e49b265f407ed91d959", "title": "Machine Learning: Between Accuracy and Interpretability", "abstract": null, "year": 1997, "referenceCount": 6, "citationCount": 53, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1725040", "name": "I. Bratko"}]}, {"paperId": "61c88b55d74b6d7bd2b0a5fc13b4dae754616f60", "url": "https://www.semanticscholar.org/paper/61c88b55d74b6d7bd2b0a5fc13b4dae754616f60", "title": "Machine Learning: A Review of the Algorithms and Its Applications", "abstract": null, "year": 2019, "referenceCount": 18, "citationCount": 42, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1581931259", "name": "Devanshi Dhall"}, {"authorId": "49081734", "name": "Ravinder Kaur"}, {"authorId": "2343974", "name": "Mamta Juneja"}]}, {"paperId": "138fafc2d679bc6446ff74f55dfd316b0d5674b9", "url": "https://www.semanticscholar.org/paper/138fafc2d679bc6446ff74f55dfd316b0d5674b9", "title": "Evidential Deep Learning to Quantify Classification Uncertainty", "abstract": "Deterministic neural nets have been shown to learn effective predictors on a wide range of machine learning problems. However, as the standard approach is to train the network to minimize a prediction loss, the resultant model remains ignorant to its prediction confidence. Orthogonally to Bayesian neural nets that indirectly infer prediction uncertainty through weight uncertainties, we propose explicit modeling of the same using the theory of subjective logic. By placing a Dirichlet distribution on the class probabilities, we treat predictions of a neural net as subjective opinions and learn the function that collects the evidence leading to these opinions by a deterministic neural net from data. The resultant predictor for a multi-class classification problem is another Dirichlet distribution whose parameters are set by the continuous output of a neural net. We provide a preliminary analysis on how the peculiarities of our new loss function drive improved uncertainty estimation. We observe that our method achieves unprecedented success on detection of out-of-distribution queries and endurance against adversarial perturbations.", "year": 2018, "referenceCount": 31, "citationCount": 312, "influentialCitationCount": 59, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1715430", "name": "M. Sensoy"}, {"authorId": "11213556", "name": "M. Kandemir"}, {"authorId": "1795727", "name": "Lance M. Kaplan"}]}, {"paperId": "abcbfc9742e8f4825cfc536091fd414e08d03998", "url": "https://www.semanticscholar.org/paper/abcbfc9742e8f4825cfc536091fd414e08d03998", "title": "Reinforcement Learning for Bandit Neural Machine Translation with Simulated Human Feedback", "abstract": "Machine translation is a natural candidate problem for reinforcement learning from human feedback: users provide quick, dirty ratings on candidate translations to guide a system to improve. Yet, current neural machine translation training focuses on expensive human-generated reference translations. We describe a reinforcement learning algorithm that improves neural machine translation systems from simulated human feedback. Our algorithm combines the advantage actor-critic algorithm (Mnih et al., 2016) with the attention-based neural encoder-decoder architecture (Luong et al., 2015). This algorithm (a) is well-designed for problems with a large action space and delayed rewards, (b) effectively optimizes traditional corpus-level machine translation metrics, and (c) is robust to skewed, high-variance, granular feedback modeled after actual human behaviors.", "year": 2017, "referenceCount": 45, "citationCount": 73, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144867624", "name": "Khanh Nguyen"}, {"authorId": "1722360", "name": "Hal Daumé"}, {"authorId": "1389036863", "name": "Jordan L. Boyd-Graber"}]}, {"paperId": "ae365c85a23f422300b89ef646bf6b04f2edb94e", "url": "https://www.semanticscholar.org/paper/ae365c85a23f422300b89ef646bf6b04f2edb94e", "title": "Molecular contrastive learning of representations via graph neural networks", "abstract": null, "year": 2021, "referenceCount": 73, "citationCount": 49, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "2145199173", "name": "Yuyang Wang"}, {"authorId": "2966240", "name": "Jianren Wang"}, {"authorId": "103987521", "name": "Zhonglin Cao"}, {"authorId": "3614493", "name": "A. Farimani"}]}, {"paperId": "3d5d954aaba0ca66d7f30ab8dbcc7d998e8c200f", "url": "https://www.semanticscholar.org/paper/3d5d954aaba0ca66d7f30ab8dbcc7d998e8c200f", "title": "MLPerf: An Industry Standard Benchmark Suite for Machine Learning Performance", "abstract": "In this article, we describe the design choices behind MLPerf, a machine learning performance benchmark that has become an industry standard. The first two rounds of the MLPerf Training benchmark helped drive improvements to software-stack performance and scalability, showing a 1.3× speedup in the top 16-chip results despite higher quality targets and a 5.5× increase in system scale. The first round of MLPerf Inference received over 500 benchmark results from 14 different organizations, showing growing adoption.", "year": 2020, "referenceCount": 15, "citationCount": 82, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2065823421", "name": "Peter Mattson"}, {"authorId": "46666025", "name": "Hanlin Tang"}, {"authorId": "2255803", "name": "Gu-Yeon Wei"}, {"authorId": "2797270", "name": "Carole-Jean Wu"}, {"authorId": "1805668", "name": "V. Reddi"}, {"authorId": "2109795452", "name": "Christine Cheng"}, {"authorId": "2866919", "name": "Cody A. Coleman"}, {"authorId": "2040049", "name": "G. Diamos"}, {"authorId": "2033833485", "name": "David Kanter"}, {"authorId": "1802359", "name": "P. Micikevicius"}, {"authorId": "1701130", "name": "D. Patterson"}, {"authorId": "1403239610", "name": "Guenther Schmuelling"}]}, {"paperId": "9720635bebdffa5fa46c6400746f32862d2d6ebb", "url": "https://www.semanticscholar.org/paper/9720635bebdffa5fa46c6400746f32862d2d6ebb", "title": "Prediction of Coronary Heart Disease using Machine Learning: An Experimental Analysis", "abstract": "The field of medical analysis is often referred to be a valuable source of rich information. Coronary Heart Disease (CHD) is one of the major causes of death all around the world therefore early detection of CHD can help reduce these rates. The challenge lies in the complexity of the data and correlations when it comes to prediction using conventional techniques. The aim of this research is to use the historical medical data to predict CHD using Machine Learning (ML) technology. The scope of this research is limited to using three supervised learning techniques namely Naïve Bayes (NB), Support Vector Machine (SVM) and Decision Tree (DT), to discover correlations in CHD data that might help improving the prediction rate. Using the South African Heart Disease dataset of 462 instances, intelligent models are derived by the considered ML techniques using 10-fold cross validation. Empirical results using different performance evaluation measures report that probabilistic models derived by NB are promising in detecting CHD.", "year": 2019, "referenceCount": 28, "citationCount": 40, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153536286", "name": "Amanda Gonsalves"}, {"authorId": "1692763", "name": "F. Thabtah"}, {"authorId": "145612369", "name": "R. Mohammad"}, {"authorId": "2117055852", "name": "Gurpreet Singh"}]}, {"paperId": "89e352129303691c22f7c64b90f452147eb5c07c", "url": "https://www.semanticscholar.org/paper/89e352129303691c22f7c64b90f452147eb5c07c", "title": "An ensemble scheme based on language function analysis and feature engineering for text genre classification", "abstract": "Text genre classification is the process of identifying functional characteristics of text documents. The immense quantity of text documents available on the web can be properly filtered, organised and retrieved with the use of text genre classification, which may have potential use on several other tasks of natural language processing and information retrieval. Genre may refer to several aspects of text documents, such as function and purpose. The language function analysis (LFA) concentrates on single aspect of genres and it aims to classify text documents into three abstract classes, such as expressive, appellative and informative. Text genre classification is typically performed by supervised machine learning algorithms. The extraction of an efficient feature set to represent text documents is an essential task for building a robust classification scheme with high predictive performance. In addition, ensemble learning, which combines the outputs of individual classifiers to obtain a robust classification scheme, is a promising research field in machine learning research. In this regard, this article presents an extensive comparative analysis of different feature engineering schemes (such as features used in authorship attribution, linguistic features, character n-grams, part of speech n-grams and the frequency of the most discriminative words) and five different base learners (Naïve Bayes, support vector machines, logistic regression, k-nearest neighbour and Random Forest) in conjunction with ensemble learning methods (such as Boosting, Bagging and Random Subspace). Based on the empirical analysis, an ensemble classification scheme is presented, which integrates Random Subspace ensemble of Random Forest with four types of features (features used in authorship attribution, character n-grams, part of speech n-grams and the frequency of the most discriminative words). For LFA corpus, the highest average predictive performance obtained by the proposed scheme is 94.43%.", "year": 2018, "referenceCount": 64, "citationCount": 139, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3170717", "name": "Aytuğ Onan"}]}, {"paperId": "df721fd78e29c06409730b0cac90f394da6bc96c", "url": "https://www.semanticscholar.org/paper/df721fd78e29c06409730b0cac90f394da6bc96c", "title": "UX Design Innovation: Challenges for Working with Machine Learning as a Design Material", "abstract": "Machine learning (ML) is now a fairly established technology, and user experience (UX) designers appear regularly to integrate ML services in new apps, devices, and systems. Interestingly, this technology has not experienced a wealth of design innovation that other technologies have, and this might be because it is a new and difficult design material. To better understand why we have witnessed little design innovation, we conducted a survey of current UX practitioners with regards to how new ML services are envisioned and developed in UX practice. Our survey probed on how ML may or may not have been a part of their UX design education, on how they work to create new things with developers, and on the challenges they have faced working with this material. We use the findings from this survey and our review of related literature to present a series of challenges for UX and interaction design research and education. Finally, we discuss areas where new research and new curriculum might help our community unlock the power of design thinking to re-imagine what ML might be and might do.", "year": 2017, "referenceCount": 67, "citationCount": 217, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153836482", "name": "G. Dove"}, {"authorId": "7918941", "name": "Kim Halskov"}, {"authorId": "145174228", "name": "J. Forlizzi"}, {"authorId": "145308025", "name": "J. Zimmerman"}]}, {"paperId": "f48b92b6268be68eca81b8c556b6c1bef815aa82", "url": "https://www.semanticscholar.org/paper/f48b92b6268be68eca81b8c556b6c1bef815aa82", "title": "Deep Learning in Visual Computing and Signal Processing", "abstract": "Deep learning is a subfield of machine learning, which aims to learn a hierarchy of features from input data. Nowadays, researchers have intensively investigated deep learning algorithms for solving challenging problems in many areas such as image classification, speech recognition, signal processing, and natural language processing. In this study, we not only review typical deep learning algorithms in computer vision and signal processing but also provide detailed information on how to apply deep learning to specific areas such as road crack detection, fault diagnosis, and human activity detection. Besides, this study also discusses the challenges of designing and training deep neural networks.", "year": 2017, "referenceCount": 105, "citationCount": 97, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3107463", "name": "Danfeng Xie"}, {"authorId": "2152836933", "name": "Lei Zhang"}, {"authorId": "143642697", "name": "Li Bai"}]}, {"paperId": "81b751c223324576495582a1d5b033b61b6f7b38", "url": "https://www.semanticscholar.org/paper/81b751c223324576495582a1d5b033b61b6f7b38", "title": "CORN: Correlation-driven nonparametric learning approach for portfolio selection", "abstract": "Machine learning techniques have been adopted to select portfolios from financial markets in some emerging intelligent business applications. In this article, we propose a novel learning-to-trade algorithm termed CORrelation-driven Nonparametric learning strategy (CORN) for actively trading stocks. CORN effectively exploits statistical relations between stock market windows via a nonparametric learning approach. We evaluate the empirical performance of our algorithm extensively on several large historical and latest real stock markets, and show that it can easily beat both the market index and the best stock in the market substantially (without or with small transaction costs), and also surpass a variety of state-of-the-art techniques significantly.", "year": 2011, "referenceCount": 49, "citationCount": 106, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics", "Economics"], "authors": [{"authorId": "2185909392", "name": "Bin Li"}, {"authorId": "1741126", "name": "S. Hoi"}, {"authorId": "1744041", "name": "V. Gopalkrishnan"}]}, {"paperId": "f258a0540505b0057b3f5ffc084cebad1554b03c", "url": "https://www.semanticscholar.org/paper/f258a0540505b0057b3f5ffc084cebad1554b03c", "title": "Towards Robot Skill Learning: From Simple Skills to Table Tennis", "abstract": null, "year": 2013, "referenceCount": 9, "citationCount": 39, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145197867", "name": "Jan Peters"}, {"authorId": "145739642", "name": "J. Kober"}, {"authorId": "1759719", "name": "Katharina Muelling"}, {"authorId": "1785853", "name": "Oliver Kroemer"}, {"authorId": "26599977", "name": "G. Neumann"}]}, {"paperId": "509a8ee7cc9edbf24d9a2940ecbbf6362ccb3392", "url": "https://www.semanticscholar.org/paper/509a8ee7cc9edbf24d9a2940ecbbf6362ccb3392", "title": "Machine learning techniques for classification of diabetes and cardiovascular diseases", "abstract": "This paper presents the overview of machine learning techniques in classification of diabetes and cardiovascular diseases (CVD) using Artificial Neural Networks (ANNs) and Bayesian Networks (BNs). The comparative analysis was performed on selected papers that are published in the period from 2008 to 2017. The most commonly used type of ANN in selected papers is multilayer feedforward neural network with Levenberg-Marquardt learning algorithm. On the other hand, the most commonly used type of BN is Na'ive Bayesian network which shown the highest accuracy values for classification of diabetes and CVD, 99.51% and 97.92% retrospectively. Moreover, the calculation of mean accuracy of observed networks has shown better results using ANN, which indicates that higher possibility to obtain more accurate results in diabetes and/or CVD classification is when it is applied to ANN.", "year": 2017, "referenceCount": 39, "citationCount": 83, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "21267873", "name": "Berina Alić"}, {"authorId": "3223231", "name": "Lejla Gurbeta"}, {"authorId": "2600501", "name": "A. Badnjević"}]}, {"paperId": "e326d127fe781abd306367c9c9e99333c0f9a669", "url": "https://www.semanticscholar.org/paper/e326d127fe781abd306367c9c9e99333c0f9a669", "title": "Machine-learned and codified synthesis parameters of oxide materials", "abstract": null, "year": 2017, "referenceCount": 37, "citationCount": 102, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2117008214", "name": "Edward Kim"}, {"authorId": "2112441097", "name": "Kevin Huang"}, {"authorId": "35514778", "name": "Alexander C. Tomala"}, {"authorId": "2057714006", "name": "Sara Matthews"}, {"authorId": "2268272", "name": "Emma Strubell"}, {"authorId": "2071771634", "name": "Adam Saunders"}, {"authorId": "143753639", "name": "A. McCallum"}, {"authorId": "46651096", "name": "E. Olivetti"}]}, {"paperId": "529d6782da36a003c59cc6c7418b33dbd6ed7700", "url": "https://www.semanticscholar.org/paper/529d6782da36a003c59cc6c7418b33dbd6ed7700", "title": "Adaptive on-line software aging prediction based on machine learning", "abstract": "The growing complexity of software systems is resulting in an increasing number of software faults. According to the literature, software faults are becoming one of the main sources of unplanned system outages, and have an important impact on company benefits and image. For this reason, a lot of techniques (such as clustering, fail-over techniques, or server redundancy) have been proposed to avoid software failures, and yet they still happen. Many software failures are those due to the software aging phenomena. In this work, we present a detailed evaluation of our chosen machine learning prediction algorithm (M5P) in front of dynamic and non-deterministic software aging. We have tested our prediction model on a three-tier web J2EE application achieving acceptable prediction accuracy against complex scenarios with small training data sets. Furthermore, we have found an interesting approach to help to determine the root cause failure: The model generated by machine learning algorithms.", "year": 2010, "referenceCount": 39, "citationCount": 80, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145377122", "name": "Javier Alonso"}, {"authorId": "144345280", "name": "J. Torres"}, {"authorId": "2658652", "name": "Josep Lluís Berral"}, {"authorId": "1745702", "name": "Ricard Gavaldà"}]}, {"paperId": "9b1e4e897b62085f2f4d731e5c3ec891b76b76cd", "url": "https://www.semanticscholar.org/paper/9b1e4e897b62085f2f4d731e5c3ec891b76b76cd", "title": "Retrosynthetic Reaction Prediction Using Neural Sequence-to-Sequence Models", "abstract": "We describe a fully data driven model that learns to perform a retrosynthetic reaction prediction task, which is treated as a sequence-to-sequence mapping problem. The end-to-end trained model has an encoder–decoder architecture that consists of two recurrent neural networks, which has previously shown great success in solving other sequence-to-sequence prediction tasks such as machine translation. The model is trained on 50,000 experimental reaction examples from the United States patent literature, which span 10 broad reaction types that are commonly used by medicinal chemists. We find that our model performs comparably with a rule-based expert system baseline model, and also overcomes certain limitations associated with rule-based expert systems and with any machine learning approach that contains a rule-based expert system component. Our model provides an important first step toward solving the challenging problem of computational retrosynthetic analysis.", "year": 2017, "referenceCount": 62, "citationCount": 257, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Biology", "Mathematics"], "authors": [{"authorId": "2156641189", "name": "Bowen Liu"}, {"authorId": "2378027", "name": "Bharath Ramsundar"}, {"authorId": "10732277", "name": "Prasad Kawthekar"}, {"authorId": "2109380078", "name": "Jade Shi"}, {"authorId": "145986494", "name": "Joseph Gomes"}, {"authorId": "2057072037", "name": "Quang Luu Nguyen"}, {"authorId": "50311881", "name": "Stephen Ho"}, {"authorId": "40351908", "name": "Jack L. Sloane"}, {"authorId": "2048046", "name": "P. Wender"}, {"authorId": "1806271", "name": "V. Pande"}]}, {"paperId": "36653f8705b56e39642bcd123494eb680cd1636b", "url": "https://www.semanticscholar.org/paper/36653f8705b56e39642bcd123494eb680cd1636b", "title": "Training Confidence-calibrated Classifiers for Detecting Out-of-Distribution Samples", "abstract": "The problem of detecting whether a test sample is from in-distribution (i.e., training distribution by a classifier) or out-of-distribution sufficiently different from it arises in many real-world machine learning applications. However, the state-of-art deep neural networks are known to be highly overconfident in their predictions, i.e., do not distinguish in- and out-of-distributions. Recently, to handle this issue, several threshold-based detectors have been proposed given pre-trained neural classifiers. However, the performance of prior works highly depends on how to train the classifiers since they only focus on improving inference procedures. In this paper, we develop a novel training method for classifiers so that such inference algorithms can work better. In particular, we suggest two additional terms added to the original loss (e.g., cross entropy). The first one forces samples from out-of-distribution less confident by the classifier and the second one is for (implicitly) generating most effective training samples for the first one. In essence, our method jointly trains both classification and generative neural networks for out-of-distribution. We demonstrate its effectiveness using deep convolutional neural networks on various popular image datasets.", "year": 2017, "referenceCount": 39, "citationCount": 556, "influentialCitationCount": 99, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3436470", "name": "Kimin Lee"}, {"authorId": "1697141", "name": "Honglak Lee"}, {"authorId": "2208511", "name": "Kibok Lee"}, {"authorId": "143720148", "name": "Jinwoo Shin"}]}, {"paperId": "6e633b41d93051375ef9135102d54fa097dc8cf8", "url": "https://www.semanticscholar.org/paper/6e633b41d93051375ef9135102d54fa097dc8cf8", "title": "Classification and Regression by randomForest", "abstract": "Recently there has been a lot of interest in “ensemble learning” — methods that generate many classifiers and aggregate their results. Two well-known methods are boosting (see, e.g., Shapire et al., 1998) and bagging Breiman (1996) of classification trees. In boosting, successive trees give extra weight to points incorrectly predicted by earlier predictors. In the end, a weighted vote is taken for prediction. In bagging, successive trees do not depend on earlier trees — each is independently constructed using a bootstrap sample of the data set. In the end, a simple majority vote is taken for prediction. Breiman (2001) proposed random forests, which add an additional layer of randomness to bagging. In addition to constructing each tree using a different bootstrap sample of the data, random forests change how the classification or regression trees are constructed. In standard trees, each node is split using the best split among all variables. In a random forest, each node is split using the best among a subset of predictors randomly chosen at that node. This somewhat counterintuitive strategy turns out to perform very well compared to many other classifiers, including discriminant analysis, support vector machines and neural networks, and is robust against overfitting (Breiman, 2001). In addition, it is very user-friendly in the sense that it has only two parameters (the number of variables in the random subset at each node and the number of trees in the forest), and is usually not very sensitive to their values. The randomForest package provides an R interface to the Fortran programs by Breiman and Cutler (available at http://www.stat.berkeley.edu/ users/breiman/). This article provides a brief introduction to the usage and features of the R functions.", "year": 2007, "referenceCount": 6, "citationCount": 14533, "influentialCitationCount": 831, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2587444", "name": "Andy Liaw"}, {"authorId": "39707890", "name": "M. Wiener"}]}, {"paperId": "06b2a66c86c270e24a2177f816c6bc6e971819ee", "url": "https://www.semanticscholar.org/paper/06b2a66c86c270e24a2177f816c6bc6e971819ee", "title": "Towards Automatically-Tuned Neural Networks", "abstract": "Recent advances in AutoML have led to automated tools that can compete with machine learning experts on supervised learning tasks. However, current AutoML tools do not yet support modern neural networks effectively. In this work, we present a first version of AutoNet, which provides automatically-tuned feed-forward neural networks without any human intervention. We report results on datasets from the recent AutoML challenge showing that ensembling Auto-Net with Auto-sklearn can perform better than either approach alone and report the first results on winning competition datasets against human experts with automatically-tuned neural networks.", "year": 2016, "referenceCount": 32, "citationCount": 166, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2065953606", "name": "Hector Mendoza"}, {"authorId": "145227684", "name": "Aaron Klein"}, {"authorId": "2868444", "name": "Matthias Feurer"}, {"authorId": "2060551", "name": "J. T. Springenberg"}, {"authorId": "144661829", "name": "F. Hutter"}]}, {"paperId": "02f61b8391c840358f4946cb955e0b2bc711fd87", "url": "https://www.semanticscholar.org/paper/02f61b8391c840358f4946cb955e0b2bc711fd87", "title": "Cardiac imaging: working towards fully-automated machine analysis & interpretation", "abstract": "ABSTRACT Introduction: Non-invasive imaging plays a critical role in managing patients with cardiovascular disease. Although subjective visual interpretation remains the clinical mainstay, quantitative analysis facilitates objective, evidence-based management, and advances in clinical research. This has driven developments in computing and software tools aimed at achieving fully automated image processing and quantitative analysis. In parallel, machine learning techniques have been used to rapidly integrate large amounts of clinical and quantitative imaging data to provide highly personalized individual patient-based conclusions. Areas covered: This review summarizes recent advances in automated quantitative imaging in cardiology and describes the latest techniques which incorporate machine learning principles. The review focuses on the cardiac imaging techniques which are in wide clinical use. It also discusses key issues and obstacles for these tools to become utilized in mainstream clinical practice. Expert commentary: Fully-automated processing and high-level computer interpretation of cardiac imaging are becoming a reality. Application of machine learning to the vast amounts of quantitative data generated per scan and integration with clinical data also facilitates a move to more patient-specific interpretation. These developments are unlikely to replace interpreting physicians but will provide them with highly accurate tools to detect disease, risk-stratify, and optimize patient-specific treatment. However, with each technological advance, we move further from human dependence and closer to fully-automated machine interpretation.", "year": 2017, "referenceCount": 137, "citationCount": 83, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Medicine"], "authors": [{"authorId": "3106896", "name": "P. Slomka"}, {"authorId": "2596578", "name": "D. Dey"}, {"authorId": "2314603", "name": "Arkadiusz Sitek"}, {"authorId": "144511973", "name": "M. Motwani"}, {"authorId": "3264955", "name": "D. Berman"}, {"authorId": "145793358", "name": "G. Germano"}]}, {"paperId": "030cb9f6fdc735dcf9455e594e5bfd00daacfcc7", "url": "https://www.semanticscholar.org/paper/030cb9f6fdc735dcf9455e594e5bfd00daacfcc7", "title": "Detection of Alzheimer’s disease by displacement field and machine learning", "abstract": "Aim. Alzheimer’s disease (AD) is a chronic neurodegenerative disease. Recently, computer scientists have developed various methods for early detection based on computer vision and machine learning techniques. Method. In this study, we proposed a novel AD detection method by displacement field (DF) estimation between a normal brain and an AD brain. The DF was treated as the AD-related features, reduced by principal component analysis (PCA), and finally fed into three classifiers: support vector machine (SVM), generalized eigenvalue proximal SVM (GEPSVM), and twin SVM (TSVM). The 10-fold cross validation repeated 50 times. Results. The results showed the “DF + PCA + TSVM” achieved the accuracy of 92.75 ± 1.77, sensitivity of 90.56 ± 1.15, specificity of 93.37 ± 2.05, and precision of 79.61 ± 2.21. This result is better than or comparable with not only the other proposed two methods, but also ten state-of-the-art methods. Besides, our method discovers the AD is related to following brain regions disclosed in recent publications: Angular Gyrus, Anterior Cingulate, Cingulate Gyrus, Culmen, Cuneus, Fusiform Gyrus, Inferior Frontal Gyrus, Inferior Occipital Gyrus, Inferior Parietal Lobule, Inferior Semi-Lunar Lobule, Inferior Temporal Gyrus, Insula, Lateral Ventricle, Lingual Gyrus, Medial Frontal Gyrus, Middle Frontal Gyrus, Middle Occipital Gyrus, Middle Temporal Gyrus, Paracentral Lobule, Parahippocampal Gyrus, Postcentral Gyrus, Posterior Cingulate, Precentral Gyrus, Precuneus, Sub-Gyral, Superior Parietal Lobule, Superior Temporal Gyrus, Supramarginal Gyrus, and Uncus. Conclusion. The displacement filed is effective in detection of AD and related brain-regions.", "year": 2015, "referenceCount": 116, "citationCount": 89, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "121310035", "name": "Yudong Zhang"}, {"authorId": "7488474", "name": "Shuihua Wang"}]}, {"paperId": "67049930a70b1ea731dc9a7a7e1646735d47e113", "url": "https://www.semanticscholar.org/paper/67049930a70b1ea731dc9a7a7e1646735d47e113", "title": "Constructing Diverse Classifier Ensembles using Artificial Training Examples", "abstract": "Ensemble methods like bagging and boosting that combine the decisions of multiple hypotheses are some of the strongest existing machine learning methods. The diversity of the members of an ensemble is known to be an important factor in determining its generalization error. This paper presents a new method for generating ensembles that directly constructs diverse hypotheses using additional artificially-constructed training examples. The technique is a simple, general metalearner that can use any strong learner as a base classifier to build diverse committees. Experimental results using decision-tree induction as a base learner demonstrate that this approach consistently achieves higher predictive accuracy than both the base classifier and bagging (whereas boosting can occasionally decrease accuracy), and also obtains higher accuracy than boosting early in the learning curve when training data is limited.", "year": 2003, "referenceCount": 22, "citationCount": 296, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2780489", "name": "Prem Melville"}, {"authorId": "1797655", "name": "R. Mooney"}]}, {"paperId": "5136ce90046e39091e240a80340861b96545c964", "url": "https://www.semanticscholar.org/paper/5136ce90046e39091e240a80340861b96545c964", "title": "Support Vector Machine Concept-Dependent Active Learning for Image Retrieval", "abstract": "Relevance feedback is a critical component when designing image databases. With these databases it is difficult to specify queries directly and explicitly. Relevance feedback interactively learns a user’s desired output or query concept by asking the user whether certain proposed images are relevant or not. For a learning algorithm to be effective, it must learn a user’s query concept accurately and quickly, while also asking the user to label only a small number of images. In addition, the concept-learning algorithm should consider the complexity a concept in determining its learning strategies. In this paper, we present the use of support vector machines active learning in a concept-dependent way (SVM Active) for conducting relevance feedback. We characterize a concept’s complexity using three measures: hit-rate, isolation and diversity. To reduce concept complexity so as to improve concept learnability, we propose a multimodal learning approach that uses images’ semantic labels to intelligently adjust the sampling strategy and the sampling pool of SVM Active . Our empirical study on several datasets shows that active learning outperforms traditional passive learning, and concept-dependent learning is superior to the traditional conceptindependent relevance-feedback schemes.", "year": 2005, "referenceCount": 70, "citationCount": 62, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "33794424", "name": "E. Chang"}, {"authorId": "2058177533", "name": "Simon Tong"}, {"authorId": "2152340751", "name": "Che-Han Chang"}]}, {"paperId": "5de350b446853b61da1ccd5c89d291f987ef4a8b", "url": "https://www.semanticscholar.org/paper/5de350b446853b61da1ccd5c89d291f987ef4a8b", "title": "PreBIND and Textomy – mining the biomedical literature for protein-protein interactions using a support vector machine", "abstract": null, "year": 2003, "referenceCount": 51, "citationCount": 365, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "21249920", "name": "I. Donaldson"}, {"authorId": "145900862", "name": "Joel D. Martin"}, {"authorId": "2425105", "name": "B. Bruijn"}, {"authorId": "2072762", "name": "Cheryl Wolting"}, {"authorId": "46704148", "name": "V. Lay"}, {"authorId": "7953783", "name": "Brigitte Tuekam"}, {"authorId": "51013287", "name": "Shudong Zhang"}, {"authorId": "2035139", "name": "B. Baskin"}, {"authorId": "144937305", "name": "Gary D Bader"}, {"authorId": "2996998", "name": "K. Michalickova"}, {"authorId": "50999462", "name": "T. Pawson"}, {"authorId": "144221002", "name": "C. Hogue"}]}, {"paperId": "86a03544946f617a1581b389e3c32f2d97867982", "url": "https://www.semanticscholar.org/paper/86a03544946f617a1581b389e3c32f2d97867982", "title": "Distributed Stochastic Gradient MCMC", "abstract": "Probabilistic inference on a big data scale is becoming increasingly relevant to both the machine learning and statistics communities. Here we introduce the first fully distributed MCMC algorithm based on stochastic gradients. We argue that stochastic gradient MCMC algorithms are particularly suited for distributed inference because individual chains can draw mini-batches from their local pool of data for a flexible amount of time before jumping to or syncing with other chains. This greatly reduces communication overhead and allows adaptive load balancing. Our experiments for LDA on Wikipedia and Pubmed show that relative to the state of the art in distributed MCMC we reduce compute time from 27 hours to half an hour in order to reach the same perplexity level.", "year": 2014, "referenceCount": 14, "citationCount": 139, "influentialCitationCount": 53, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3103594", "name": "Sungjin Ahn"}, {"authorId": "2642138", "name": "B. Shahbaba"}, {"authorId": "1678311", "name": "M. Welling"}]}, {"paperId": "5acc6b0e128ae8c1026fa85b79f328d74e18aaba", "url": "https://www.semanticscholar.org/paper/5acc6b0e128ae8c1026fa85b79f328d74e18aaba", "title": "Detecting malicious URLs using machine learning techniques", "abstract": "The World Wide Web supports a wide range of criminal activities such as spam-advertised e-commerce, financial fraud and malware dissemination. Although the precise motivations behind these schemes may differ, the common denominator lies in the fact that unsuspecting users visit their sites. These visits can be driven by email, web search results or links from other web pages. In all cases, however, the user is required to take some action, such as clicking on a desired Uniform Resource Locator (URL). In order to identify these malicious sites, the web security community has developed blacklisting services. These blacklists are in turn constructed by an array of techniques including manual reporting, honeypots, and web crawlers combined with site analysis heuristics. Inevitably, many malicious sites are not blacklisted either because they are too recent or were never or incorrectly evaluated. In this paper, we address the detection of malicious URLs as a binary classification problem and study the performance of several well-known classifiers, namely Naïve Bayes, Support Vector Machines, Multi-Layer Perceptron, Decision Trees, Random Forest and k-Nearest Neighbors. Furthermore, we adopted a public dataset comprising 2.4 million URLs (instances) and 3.2 million features. The numerical simulations have shown that most classification methods achieve acceptable prediction rates without requiring either advanced feature selection techniques or the involvement of a domain expert. In particular, Random Forest and Multi-Layer Perceptron attain the highest accuracy.", "year": 2016, "referenceCount": 33, "citationCount": 62, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9036690", "name": "Frank Vanhoenshoven"}, {"authorId": "2486393", "name": "G. Nápoles"}, {"authorId": "145292060", "name": "R. Falcon"}, {"authorId": "2212083", "name": "K. Vanhoof"}, {"authorId": "1754837", "name": "M. Köppen"}]}, {"paperId": "88cd352a02b017f8190686271594b62ca464b638", "url": "https://www.semanticscholar.org/paper/88cd352a02b017f8190686271594b62ca464b638", "title": "Cyber security meets artificial intelligence: a survey", "abstract": "There is a wide range of interdisciplinary intersections between cyber security and artificial intelligence (AI). On one hand, AI technologies, such as deep learning, can be introduced into cyber security to construct smart models for implementing malware classification and intrusion detection and threating intelligence sensing. On the other hand, AI models will face various cyber threats, which will disturb their sample, learning, and decisions. Thus, AI models need specific cyber security defense and protection technologies to combat adversarial machine learning, preserve privacy in machine learning, secure federated learning, etc. Based on the above two aspects, we review the intersection of AI and cyber security. First, we summarize existing research efforts in terms of combating cyber attacks using AI, including adopting traditional machine learning methods and existing deep learning solutions. Then, we analyze the counterattacks from which AI itself may suffer, dissect their characteristics, and classify the corresponding defense methods. Finally, from the aspects of constructing encrypted neural network and realizing a secure federated deep learning, we expatiate the existing research on how to build a secure AI system.", "year": 2018, "referenceCount": 69, "citationCount": 68, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2116452692", "name": "Jian-hua Li"}]}, {"paperId": "56f59b1f721e32700a638e77fff29ac18a0e0feb", "url": "https://www.semanticscholar.org/paper/56f59b1f721e32700a638e77fff29ac18a0e0feb", "title": "Foundations of Support Constraint Machines", "abstract": "Abstract The mathematical foundations of a new theory for the design of intelligent agents are presented. The proposed learning paradigm is centered around the concept of constraint, representing the interactions with the environment, and the parsimony principle. The classical regularization framework of kernel machines is naturally extended to the case in which the agents interact with a richer environment, where abstract granules of knowledge, compactly described by different linguistic formalisms, can be translated into the unified notion of constraint for defining the hypothesis set. Constrained variational calculus is exploited to derive general representation theorems that provide a description of the optimal body of the agent (i.e., the functional structure of the optimal solution to the learning problem), which is the basis for devising new learning algorithms. We show that regardless of the kind of constraints, the optimal body of the agent is a support constraint machine (SCM) based on representer theorems that extend classical results for kernel machines and provide new representations. In a sense, the expressiveness of constraints yields a semantic-based regularization theory, which strongly restricts the hypothesis set of classical regularization. Some guidelines to unify continuous and discrete computational mechanisms are given so as to accommodate in the same framework various kinds of stimuli, for example, supervised examples and logic predicates. The proposed view of learning from constraints incorporates classical learning from examples and extends naturally to the case in which the examples are subsets of the input space, which is related to learning propositional logic clauses.", "year": 2015, "referenceCount": 111, "citationCount": 45, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2264182", "name": "G. Gnecco"}, {"authorId": "145467467", "name": "M. Gori"}, {"authorId": "1760309", "name": "S. Melacci"}, {"authorId": "145993481", "name": "M. Sanguineti"}]}, {"paperId": "7075ed16cc3a6b82936ae9d18b848fbec4fddafd", "url": "https://www.semanticscholar.org/paper/7075ed16cc3a6b82936ae9d18b848fbec4fddafd", "title": "Support Kernel Machines for Object Recognition", "abstract": "Kernel classifiers based on Support Vector Machines (SVM) have recently achieved state-of-the art results on several popular datasets like Caltech or Pascal. This was possible by combining the advantages of SVM - convexity and the availability of efficient optimizers, with 'hyperkernels' - linear combinations of kernels computed at multiple levels of image encoding. The use of hyperkernels faces the challenge of choosing the kernel weights, the use of possibly irrelevant, poorly performing kernels, and an increased number of parameters that can lead to overfitting. In this paper we advocate the transition from SVMs to Support Kernel Machines (SKM) - models that estimate both the parameters of a sparse linear combination of kernels, and the parameters of a discriminative classifier. We exploit recent kernel learning techniques, not previously used in computer vision, that show how learning SKMs can be formulated as a convex optimization problem, which can be solved efficiently using Sequential Minimal Optimization. We study kernel learning for several multi-level image encodings for supervised object recognition and report competitive results on several datasets, including INRIA pedestrian, Caltech 101 and the newly created Caltech 256.", "year": 2007, "referenceCount": 19, "citationCount": 83, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2119321914", "name": "Ankita Kumar"}, {"authorId": "1781120", "name": "C. Sminchisescu"}]}, {"paperId": "611e0bd5d466668989df04d642104428d03eaeb6", "url": "https://www.semanticscholar.org/paper/611e0bd5d466668989df04d642104428d03eaeb6", "title": "Deep Learning Inference in Facebook Data Centers: Characterization, Performance Optimizations and Hardware Implications", "abstract": "The application of deep learning techniques resulted in remarkable improvement of machine learning models. In this paper provides detailed characterizations of deep learning models used in many Facebook social network services. We present computational characteristics of our models, describe high performance optimizations targeting existing systems, point out their limitations and make suggestions for the future general-purpose/accelerated inference hardware. Also, we highlight the need for better co-design of algorithms, numerics and computing platforms to address the challenges of workloads often run in data centers.", "year": 2018, "referenceCount": 72, "citationCount": 125, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1686843", "name": "Jongsoo Park"}, {"authorId": "144685269", "name": "M. Naumov"}, {"authorId": "33071717", "name": "P. Basu"}, {"authorId": "46193056", "name": "Summer Deng"}, {"authorId": "2552318", "name": "A. Kalaiah"}, {"authorId": "1724652", "name": "D. Khudia"}, {"authorId": "2057766961", "name": "James Law"}, {"authorId": "2398587", "name": "Parth Malani"}, {"authorId": "143682293", "name": "Andrey Malevich"}, {"authorId": "143758120", "name": "N. Satish"}, {"authorId": "145503806", "name": "J. Pino"}, {"authorId": "2741461", "name": "Martin D. Schatz"}, {"authorId": "2059694687", "name": "Alexander Sidorov"}, {"authorId": "145422368", "name": "V. Sivakumar"}, {"authorId": "3609856", "name": "Andrew Tulloch"}, {"authorId": "2108429236", "name": "Xiaodong Wang"}, {"authorId": "2115877352", "name": "Yiming Wu"}, {"authorId": "30891915", "name": "Hector Yuen"}, {"authorId": "40863835", "name": "Utku Diril"}, {"authorId": "40858378", "name": "Dmytro Dzhulgakov"}, {"authorId": "1775500", "name": "Kim M. Hazelwood"}, {"authorId": "33920592", "name": "Bill Jia"}, {"authorId": "39978391", "name": "Yangqing Jia"}, {"authorId": "2065508882", "name": "Lin Qiao"}, {"authorId": "2066758688", "name": "Vijay Rao"}, {"authorId": "3121592", "name": "Nadav Rotem"}, {"authorId": "1808405", "name": "S. Yoo"}, {"authorId": "1711231", "name": "M. Smelyanskiy"}]}, {"paperId": "f53c468b875a1535c6e381f29817fe46c36ef018", "url": "https://www.semanticscholar.org/paper/f53c468b875a1535c6e381f29817fe46c36ef018", "title": "Hierarchical Extreme Learning Machine for unsupervised representation learning", "abstract": "Learning representations from massive unlabeled data is a hot topic for high-level tasks in many applications. The recent great improvements on benchmark data sets, which are achieved by increasingly complex unsupervised learning methods and deep learning models with lots of parameters, usually require many tedious tricks and much expertise to tune. However, filters learned by these complex architectures are quite similar to standard hand-crafted features visually, and training the deep models costs quite long time to fine-tune their weights. In this paper, Extreme Learning Machine-Autoencoder (ELM-AE) is employed as the learning unit to learn local receptive fields at each layer, and the lower layer responses are transferred to the last layer (trans-layer) to form a more complete representation to retain more information. In addition, some beneficial methods in deep learning architectures such as local contrast normalization and whitening are added to the proposed hierarchical Extreme Learning Machine networks to further boost the performance. The obtained trans-layer representations are followed by block histograms with binary hashing to learn translation and rotation invariant representations, which are utilized to do high-level tasks such as recognition and detection. Compared to traditional deep learning methods, the proposed trans-layer representation method with ELM-AE based learning of local receptive filters has much faster learning speed and is validated in several typical experiments, such as digit recognition on MNIST and MNIST variations, object recognition on Caltech 101. State-of-the-art performances are achieved on both Caltech 101 15 samples per class task and 4 of 6 MNIST variations data sets, and highly impressive results are obtained on MNIST data set and other tasks.", "year": 2015, "referenceCount": 45, "citationCount": 52, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50017718", "name": "Wentao Zhu"}, {"authorId": "145235303", "name": "Jun Miao"}, {"authorId": "2343895", "name": "Laiyun Qing"}, {"authorId": "145678691", "name": "G. Huang"}]}, {"paperId": "89ad71ca978f0f906841f014397cd19c029e9738", "url": "https://www.semanticscholar.org/paper/89ad71ca978f0f906841f014397cd19c029e9738", "title": "Automated Image Analysis for High-Content Screening and Analysis", "abstract": "The field of high-content screening and analysis consists of a set of methodologies for automated discovery in cell biology and drug development using large amounts of image data. In most cases, imaging is carried out by automated microscopes, often assisted by automated liquid handling and cell culture. Image processing, computer vision, and machine learning are used to automatically process high-dimensional image data into meaningful cell biological results. The key is creating automated analysis pipelines typically consisting of 4 basic steps: (1) image processing (normalization, segmentation, tracing, tracking), (2) spatial transformation to bring images to a common reference frame (registration), (3) computation of image features, and (4) machine learning for modeling and interpretation of data. An overview of these image analysis tools is presented here, along with brief descriptions of a few applications.", "year": 2010, "referenceCount": 62, "citationCount": 125, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1800874", "name": "A. Shariff"}, {"authorId": "1769837", "name": "Joshua D Kangas"}, {"authorId": "1755926", "name": "Luis Pedro Coelho"}, {"authorId": "2070168207", "name": "Shannon Quinn"}, {"authorId": "34088891", "name": "R. Murphy"}]}, {"paperId": "1157ebabb1db9fb81b1004a8ee9cb6fc6c4f6171", "url": "https://www.semanticscholar.org/paper/1157ebabb1db9fb81b1004a8ee9cb6fc6c4f6171", "title": "Confidence Bands for ROC Curves: Methods and an Empirical Study", "abstract": "In this paper we study techniques for generat- ing and evaluating condence bands on ROC curves. ROC curve evaluation is rapidly becoming a commonly used eval- uation metric in machine learning, although evaluating ROC curves has thus far been limited to studying the area under the curve (AUC) or generation of one-dimensional condence intervals by freezing one variable|the false-positive rate, or threshold on the classication scoring function. Researchers in the medical eld have long been using ROC curves and have many well-studied methods for analyzing such curves, includ- ing generating condence intervals as well as simultaneous condence bands. In this paper we introduce these techniques to the machine learning community and show their empirical tness on the Covertype data set|a standard machine learn- ing benchmark from the UCI repository. We show how some of these methods work remarkably well, others are too loose, and that existing machine learning methods for generation of 1-dimensional condence intervals do not translate well to generation of simultanous bands|their bands are too tight.", "year": 2004, "referenceCount": 30, "citationCount": 91, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2749262", "name": "Sofus A. Macskassy"}, {"authorId": "1752722", "name": "F. Provost"}]}, {"paperId": "a243a08e094e17283c3edd5ae30c24f148536096", "url": "https://www.semanticscholar.org/paper/a243a08e094e17283c3edd5ae30c24f148536096", "title": "Informed Machine Learning - Towards a Taxonomy of Explicit Integration of Knowledge into Machine Learning", "abstract": "Despite the great successes of machine learning, it can have its limits when dealing with insufficient training data.A potential solution is to incorporate additional knowledge into the training process which leads to the idea of informed machine learning. We present a research survey and structured overview of various approaches in this field. We aim to establish a taxonomy which can serve as a classification framework that considers the kind of additional knowledge, its representation,and its integration into the machine learning pipeline. The evaluation of numerous papers on the bases of the taxonomy uncovers key methods in this field.", "year": 2019, "referenceCount": 141, "citationCount": 39, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "7440202", "name": "Laura von Rueden"}, {"authorId": "145001529", "name": "S. Mayer"}, {"authorId": "2279864", "name": "J. Garcke"}, {"authorId": "1692283", "name": "C. Bauckhage"}, {"authorId": "51246494", "name": "J. Schücker"}]}, {"paperId": "3ef03001691a875ba5d11bdd2886bc962d94033e", "url": "https://www.semanticscholar.org/paper/3ef03001691a875ba5d11bdd2886bc962d94033e", "title": "A Review of Domain Adaptation without Target Labels", "abstract": "Domain adaptation has become a prominent problem setting in machine learning and related fields. This review asks the question: How can a classifier learn from a source domain and generalize to a target domain? We present a categorization of approaches, divided into, what we refer to as, sample-based, feature-based, and inference-based methods. Sample-based methods focus on weighting individual observations during training based on their importance to the target domain. Feature-based methods revolve around on mapping, projecting, and representing features such that a source classifier performs well on the target domain and inference-based methods incorporate adaptation into the parameter estimation procedure, for instance through constraints on the optimization procedure. Additionally, we review a number of conditions that allow for formulating bounds on the cross-domain generalization error. Our categorization highlights recurring ideas and raises questions important to further research.", "year": 2019, "referenceCount": 227, "citationCount": 195, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "3191461", "name": "Wouter M. Kouw"}, {"authorId": "143888579", "name": "M. Loog"}]}, {"paperId": "b0f649f091000567ff07541e81f658b2ec3166e7", "url": "https://www.semanticscholar.org/paper/b0f649f091000567ff07541e81f658b2ec3166e7", "title": "A machine-learning apprentice for the completion of repetitive forms", "abstract": "The authors have developed a software environment in which workers can complete repetitive forms, and a machine-learning and prediction system that works within it. The nonintrusive assistant or apprentice provides viable default values for blank fields in a form, saving users up to 87 percent in keystroke effort and correctly predicting nearly 90 percent of the form's values. The system and prediction methods are active, yet not intrusive. Default predictions are always displayed, yet the user can override them easily with normal editing commands.<<ETX>>", "year": 1994, "referenceCount": 4, "citationCount": 82, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3059399", "name": "L. A. Hermens"}, {"authorId": "2620923", "name": "J. C. Schlimmer"}]}, {"paperId": "76d9ab5822fce4d1eca85f9e816242dc632d88f4", "url": "https://www.semanticscholar.org/paper/76d9ab5822fce4d1eca85f9e816242dc632d88f4", "title": "Real-Time Machine Learning: The Missing Pieces", "abstract": "Machine learning applications are increasingly deployed not only to serve predictions using static models, but also as tightly-integrated components of feedback loops involving dynamic, real-time decision making. These applications pose a new set of requirements, none of which are difficult to achieve in isolation, but the combination of which creates a challenge for existing distributed execution frameworks: computation with millisecond latency at high throughput, adaptive construction of arbitrary task graphs, and execution of heterogeneous kernels over diverse sets of resources. We assert that a new distributed execution framework is needed for such ML applications and propose a candidate approach with a proof-of-concept architecture that achieves a 63x performance improvement over a state-of-the-art execution framework for a representative application.", "year": 2017, "referenceCount": 22, "citationCount": 52, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34994156", "name": "Robert Nishihara"}, {"authorId": "29912342", "name": "Philipp Moritz"}, {"authorId": "2117867", "name": "Stephanie Wang"}, {"authorId": "144312193", "name": "Alexey Tumanov"}, {"authorId": "2058356165", "name": "William Paul"}, {"authorId": "1389954462", "name": "Johann Schleier-Smith"}, {"authorId": "3393220", "name": "Richard Liaw"}, {"authorId": "1694621", "name": "Michael I. Jordan"}, {"authorId": "144467753", "name": "I. Stoica"}]}, {"paperId": "a593ca898a60c6d5562c7ae994a3ad04ef7c1982", "url": "https://www.semanticscholar.org/paper/a593ca898a60c6d5562c7ae994a3ad04ef7c1982", "title": "Applications of Machine Learning Approaches in Emergency Medicine; a Review Article", "abstract": "Using artificial intelligence and machine learning techniques in different medical fields, especially emergency medicine is rapidly growing. In this paper, studies conducted in the recent years on using artificial intelligence in emergency medicine have been collected and assessed. These studies belonged to three categories: prediction and detection of disease; prediction of need for admission, discharge and also mortality; and machine learning based triage systems. In each of these categories, the most important studies have been chosen and accuracy and results of the algorithms have been briefly evaluated by mentioning machine learning techniques and used datasets.", "year": 2019, "referenceCount": 48, "citationCount": 44, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1395595670", "name": "Negin Shafaf"}, {"authorId": "2022611", "name": "H. Malek"}]}, {"paperId": "8c6f55ed786db03b347ba1b55219a07da737160c", "url": "https://www.semanticscholar.org/paper/8c6f55ed786db03b347ba1b55219a07da737160c", "title": "Linear programmable nanophotonic processors", "abstract": "Advances in photonic integrated circuits have recently enabled electrically reconfigurable optical systems that can implement universal linear optics transformations on spatial mode sets. This review paper covers progress in such “programmable nanophotonic processors” as well as emerging applications of the technology to problems including classical and quantum information processing and machine learning.", "year": 2018, "referenceCount": 91, "citationCount": 153, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39853151", "name": "N. Harris"}, {"authorId": "48228088", "name": "J. Carolan"}, {"authorId": "51034522", "name": "D. Bunandar"}, {"authorId": "47891703", "name": "M. Prabhu"}, {"authorId": "143685694", "name": "M. Hochberg"}, {"authorId": "1389938612", "name": "T. Baehr‐Jones"}, {"authorId": "40530125", "name": "M. Fanto"}, {"authorId": "153087724", "name": "A. M. Smith"}, {"authorId": "32277657", "name": "C. Tison"}, {"authorId": "1938518", "name": "P. Alsing"}, {"authorId": "3399114", "name": "D. Englund"}]}, {"paperId": "1d9a60654715867df367ffe5ed300e01086bf97b", "url": "https://www.semanticscholar.org/paper/1d9a60654715867df367ffe5ed300e01086bf97b", "title": "Discrimination of mesophilic and thermophilic proteins using machine learning algorithms", "abstract": "Discriminating thermophilic proteins from their mesophilic counterparts is a challenging task and it would help to design stable proteins. In this work, we have systematically analyzed the amino acid compositions of 3075 mesophilic and 1609 thermophilic proteins belonging to 9 and 15 families, respectively. We found that the charged residues Lys, Arg, and Glu as well as the hydrophobic residues, Val and Ile have higher occurrence in thermophiles than mesophiles. Further, we have analyzed the performance of different methods, based on Bayes rules, logistic functions, neural networks, support vector machines, decision trees and so forth for discriminating mesophilic and thermophilic proteins. We found that most of the machine learning techniques discriminate these classes of proteins with similar accuracy. The neural network‐based method could discriminate the thermophiles from mesophiles at the five‐fold cross‐validation accuracy of 89% in a dataset of 4684 proteins. Moreover, this method is tested with 325 mesophiles in Xylella fastidosa and 382 thermophiles in Aquifex aeolicus and it could successfully discriminate them with the accuracy of 91%. These accuracy levels are better than other methods in the literature and we suggest that this method could be effectively used to discriminate mesophilic and thermophilic proteins. Proteins 2008. © 2007 Wiley‐Liss, Inc.", "year": 2007, "referenceCount": 39, "citationCount": 86, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "144989362", "name": "M. Gromiha"}, {"authorId": "144671388", "name": "M. X. Suresh"}]}, {"paperId": "a6355b13e74d2a11aba4bad75464bf721d7b61d4", "url": "https://www.semanticscholar.org/paper/a6355b13e74d2a11aba4bad75464bf721d7b61d4", "title": "Machine Learning Algorithms for Characterization of EMG Signals", "abstract": "—In the last decades, the researchers of the human arm prosthesis are using different types of machine learning algorithms. This review article firstly gives a brief explanation about type of machine learning methods. Secondly, some recent applications of myoelectric control of human arm prosthesis by using machine learning algorithms are compared. This study presents two different comparisons based on feature extraction methods which are time series modeling and wavelet transform of EMG signal. Finally, of characterization of EMG for of human arm prosthesis have been and discussed.", "year": 2014, "referenceCount": 63, "citationCount": 42, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47702999", "name": "B. Karlik"}]}, {"paperId": "dcf482414d4dd8a79ad801d27f280d2a94e0d5b3", "url": "https://www.semanticscholar.org/paper/dcf482414d4dd8a79ad801d27f280d2a94e0d5b3", "title": "Fault Tolerance in Iterative-Convergent Machine Learning", "abstract": "Machine learning (ML) training algorithms often possess an inherent self-correcting behavior due to their iterative-convergent nature. Recent systems exploit this property to achieve adaptability and efficiency in unreliable computing environments by relaxing the consistency of execution and allowing calculation errors to be self-corrected during training. However, the behavior of such systems are only well understood for specific types of calculation errors, such as those caused by staleness, reduced precision, or asynchronicity, and for specific types of training algorithms, such as stochastic gradient descent. In this paper, we develop a general framework to quantify the effects of calculation errors on iterative-convergent algorithms and use this framework to design new strategies for checkpoint-based fault tolerance. Our framework yields a worst-case upper bound on the iteration cost of arbitrary perturbations to model parameters during training. Our system, SCAR, employs strategies which reduce the iteration cost upper bound due to perturbations incurred when recovering from checkpoints. We show that SCAR can reduce the iteration cost of partial failures by 78% - 95% when compared with traditional checkpoint-based fault tolerance across a variety of ML models and training algorithms.", "year": 2018, "referenceCount": 66, "citationCount": 20, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1762117", "name": "Aurick Qiao"}, {"authorId": "2050920", "name": "Bryon Aragam"}, {"authorId": "1745132", "name": "Bingjing Zhang"}, {"authorId": "143977260", "name": "E. Xing"}]}, {"paperId": "326d1e2121354eb0527bc48472f69397a8b9f04b", "url": "https://www.semanticscholar.org/paper/326d1e2121354eb0527bc48472f69397a8b9f04b", "title": "Fast Bundle Algorithm for Multiple-Instance Learning", "abstract": "We present a bundle algorithm for multiple-instance classification and ranking. These frameworks yield improved models on many problems possessing special structure. Multiple-instance loss functions are typically nonsmooth and nonconvex, and current algorithms convert these to smooth nonconvex optimization problems that are solved iteratively. Inspired by the latest linear-time subgradient-based methods for support vector machines, we optimize the objective directly using a nonconvex bundle method. Computational results show this method is linearly scalable, while not sacrificing generalization accuracy, permitting modeling on new and larger data sets in computational chemistry and other applications. This new implementation facilitates modeling with kernels.", "year": 2012, "referenceCount": 40, "citationCount": 70, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "1705847", "name": "Charles Bergeron"}, {"authorId": "39147837", "name": "Gregory M. Moore"}, {"authorId": "3339016", "name": "Jed Zaretzki"}, {"authorId": "1729971", "name": "C. Breneman"}, {"authorId": "2065549778", "name": "Kristin P. Bennett"}]}, {"paperId": "007464b4564d2fff325bfb85b2a2ee8c20e3fd3e", "url": "https://www.semanticscholar.org/paper/007464b4564d2fff325bfb85b2a2ee8c20e3fd3e", "title": "EEG-based emotion classification using deep belief networks", "abstract": "In recent years, there are many great successes in using deep architectures for unsupervised feature learning from data, especially for images and speech. In this paper, we introduce recent advanced deep learning models to classify two emotional categories (positive and negative) from EEG data. We train a deep belief network (DBN) with differential entropy features extracted from multichannel EEG as input. A hidden markov model (HMM) is integrated to accurately capture a more reliable emotional stage switching. We also compare the performance of the deep models to KNN, SVM and Graph regularized Extreme Learning Machine (GELM). The average accuracies of DBN-HMM, DBN, GELM, SVM, and KNN in our experiments are 87.62%, 86.91%, 85.67%, 84.08%, and 69.66%, respectively. Our experimental results show that the DBN and DBN-HMM models improve the accuracy of EEG-based emotion classification in comparison with the state-of-the-art methods.", "year": 2014, "referenceCount": 9, "citationCount": 230, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3108302", "name": "Wei-Long Zheng"}, {"authorId": "2682019", "name": "Jia-Yi Zhu"}, {"authorId": "2110679289", "name": "Yong Peng"}, {"authorId": "1715839", "name": "Bao-Liang Lu"}]}, {"paperId": "a62005bbbbc59793552407530e0dda13b3ae65e1", "url": "https://www.semanticscholar.org/paper/a62005bbbbc59793552407530e0dda13b3ae65e1", "title": "Machine learning in an auction environment", "abstract": "We consider a model of repeated online auctions in which an ad with an uncertain click-through rate faces a random distribution of competing bids in each auction and there is discounting of payoffs. We formulate the optimal solution to this explore/exploit problem as a dynamic programming problem and show that efficiency is maximized by making a bid for each advertiser equal to the advertiser's expected value for the advertising opportunity plus a term proportional to the variance in this value divided by the number of impressions the advertiser has received thus far. We then use this result to illustrate that the value of incorporating active exploration into a machine learning system in an auction environment is exceedingly small.", "year": 2014, "referenceCount": 55, "citationCount": 20, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38509196", "name": "Patrick Hummel"}, {"authorId": "144155315", "name": "R. McAfee"}]}, {"paperId": "a6edac478d02762022d772445a2ff72c3a7da0f3", "url": "https://www.semanticscholar.org/paper/a6edac478d02762022d772445a2ff72c3a7da0f3", "title": "A robust state estimator for medium voltage distribution networks", "abstract": "A closed-loop robust distribution state estimator was investigated. An approach that is suitable for medium voltage distribution networks which are either under-determined with limited real-time measurements or over-determined but with delayed information from smart meters was developed. The state estimator was designed to be robust against the effect of measurement errors, the type, location and accuracy of measurements, as well as temporary failure of the smart metering communication system. A machine learning function provides reliable input information to a robust state estimation algorithm. The output of the state estimator is then fed back to the machine learning function creating a closed-loop information flow which improves the performance of the state estimator. Test results and analysis on a 33-node system are provided.", "year": 2013, "referenceCount": 24, "citationCount": 127, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "1714535", "name": "Jianzhong Wu"}, {"authorId": "2145998519", "name": "Yan He"}, {"authorId": "48756182", "name": "N. Jenkins"}]}, {"paperId": "158dffe3378e7e22180293a8f24a2754a9afc373", "url": "https://www.semanticscholar.org/paper/158dffe3378e7e22180293a8f24a2754a9afc373", "title": "Application of machine learning techniques in predicting MHC binders.", "abstract": null, "year": 2007, "referenceCount": 11, "citationCount": 47, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "49815157", "name": "S. Lata"}, {"authorId": "2067734", "name": "M. Bhasin"}, {"authorId": "144114265", "name": "Gajendra P.S. Raghava"}]}, {"paperId": "b48d01865e0f2cf330309e43186b2e4e3b6d334d", "url": "https://www.semanticscholar.org/paper/b48d01865e0f2cf330309e43186b2e4e3b6d334d", "title": "Performance of machine-learning scoring functions in structure-based virtual screening", "abstract": null, "year": 2017, "referenceCount": 57, "citationCount": 183, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "1395859221", "name": "Maciej Wójcikowski"}, {"authorId": "9998035", "name": "P. Ballester"}, {"authorId": "34672905", "name": "P. Siedlecki"}]}, {"paperId": "06a3a7ded1cf4915dc69f9f7d2ae30b7b135fc99", "url": "https://www.semanticscholar.org/paper/06a3a7ded1cf4915dc69f9f7d2ae30b7b135fc99", "title": "Learning classifier systems: a complete introduction, review, and roadmap", "abstract": "If complexity is your problem, learning classifier systems (LCSs) may offer a solution. These rule-based, multifaceted, machine learning algorithms originated and have evolved in the cradle of evolutionary biology and artificial intelligence. The LCS concept has inspired a multitude of implementations adapted to manage the different problem domains to which it has been applied (e.g., autonomous robotics, classification, knowledge discovery, and modeling). One field that is taking increasing notice of LCS is epidemiology, where there is a growing demand for powerful tools to facilitate etiological discovery. Unfortunately, implementation optimization is nontrivial, and a cohesive encapsulation of implementation alternatives seems to be lacking. This paper aims to provide an accessible foundation for researchers of different backgrounds interested in selecting or developing their own LCS. Included is a simple yet thorough introduction, a historical review, and a roadmap of algorithmic components, emphasizing differences in alternative LCS implementations.", "year": 2009, "referenceCount": 259, "citationCount": 267, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1800213", "name": "R. Urbanowicz"}, {"authorId": "152512193", "name": "J. Moore"}]}, {"paperId": "9144853e11640ce1c777ac0742f4924e3d3dfcf9", "url": "https://www.semanticscholar.org/paper/9144853e11640ce1c777ac0742f4924e3d3dfcf9", "title": "Examining the Ability of Artificial Neural Networks Machine Learning Models to Accurately Predict Complications Following Posterior Lumbar Spine Fusion", "abstract": "Study Design. A cross-sectional database study. Objective. The aim of this study was to train and validate machine learning models to identify risk factors for complications following posterior lumbar spine fusion. Summary of Background Data. Machine learning models such as artificial neural networks (ANNs) are valuable tools for analyzing and interpreting large and complex datasets. ANNs have yet to be used for risk factor analysis in orthopedic surgery. Methods. The American College of Surgeons National Surgical Quality Improvement Program (ACS-NSQIP) database was queried for patients who underwent posterior lumbar spine fusion. This query returned 22,629 patients, 70% of whom were used to train our models, and 30% were used to evaluate the models. The predictive variables used included sex, age, ethnicity, diabetes, smoking, steroid use, coagulopathy, functional status, American Society for Anesthesiology (ASA) class ≥3, body mass index (BMI), pulmonary comorbidities, and cardiac comorbidities. The models were used to predict cardiac complications, wound complications, venous thromboembolism (VTE), and mortality. Using ASA class as a benchmark for prediction, area under receiver operating curves (AUC) was used to determine the accuracy of our machine learning models. Results. On the basis of AUC values, ANN and LR both outperformed ASA class for predicting all four types of complications. ANN was the most accurate for predicting cardiac complications, and LR was most accurate for predicting wound complications, VTE, and mortality, though ANN and LR had comparable AUC values for predicting all types of complications. ANN had greater sensitivity than LR for detecting wound complications and mortality. Conclusion. Machine learning in the form of logistic regression and ANNs were more accurate than benchmark ASA scores for identifying risk factors of developing complications following posterior lumbar spine fusion, suggesting they are potentially great tools for risk factor analysis in spine surgery. Level of Evidence: 3", "year": 2017, "referenceCount": 26, "citationCount": 84, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "8901068", "name": "Jun S. Kim"}, {"authorId": "6366723", "name": "R. Merrill"}, {"authorId": "50002911", "name": "Varun Arvind"}, {"authorId": "40389063", "name": "Deepak A Kaji"}, {"authorId": "48536171", "name": "S. Pasik"}, {"authorId": "26678074", "name": "C. Nwachukwu"}, {"authorId": "36874725", "name": "Luilly Vargas"}, {"authorId": "46919615", "name": "Nebiyu S. Osman"}, {"authorId": "4682692", "name": "E. Oermann"}, {"authorId": "36158302", "name": "J. Caridi"}, {"authorId": "144527577", "name": "Samuel K. Cho"}]}, {"paperId": "b6a0779ab51cece45961abe520b4acaaa3c88c55", "url": "https://www.semanticscholar.org/paper/b6a0779ab51cece45961abe520b4acaaa3c88c55", "title": "Applying Machine Learning Toward an Automatic Classification of It", "abstract": "In the majority of cases, the pronoun it' illustrates nominal anaphora, tending to refer back to another noun phrase in the text. However, in a significant minority of cases, the pronoun is used in exceptional ways that fail to demonstrate strict nominal anaphora. The identification of these uses of it' is important in all fields where pronoun resolution has an impact. After a survey of previous treatments of the pronoun it in the literature, some features of instances of it' are proposed that can be used in a novel memory-based learning method to automatically classify those instances. On evaluating the method, it is found that the implemented system performs comparably well with respect to a rule-based system, and with an extended training set it is expected that the accuracy of the system will improve, offering greater coverage than rule-based methods.", "year": 2001, "referenceCount": 31, "citationCount": 105, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115603849", "name": "R. Evans"}]}, {"paperId": "a07dd42643b17c08ee3821cce19318e66349805f", "url": "https://www.semanticscholar.org/paper/a07dd42643b17c08ee3821cce19318e66349805f", "title": "Cross-Document Coreference Resolution: A Key Technology for Learning by Reading", "abstract": "Automatic knowledge base population from text is an important technology for a broad range of approaches to learning by reading. Effective automated knowledge base population depends critically upon coreference resolution of entities across sources. Use of a wide range of features, both those that capture evidence for entity merging and those that argue against merging, can significantly improve machine learning-based cross-document coreference resolution. Results from the Global Entity Detection and Recognition task of the NIST Automated Content Extraction (ACE) 2008 evaluation support this conclusion.", "year": 2009, "referenceCount": 17, "citationCount": 57, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145510552", "name": "J. Mayfield"}, {"authorId": "2052587540", "name": "David Alexander"}, {"authorId": "1752326", "name": "B. Dorr"}, {"authorId": "145043214", "name": "Jason Eisner"}, {"authorId": "143928505", "name": "T. Elsayed"}, {"authorId": "144121212", "name": "Timothy W. Finin"}, {"authorId": "145523489", "name": "Clayton Fink"}, {"authorId": "2052513135", "name": "Marjorie Freedman"}, {"authorId": "2465794", "name": "Nikesh Garera"}, {"authorId": "145324163", "name": "P. McNamee"}, {"authorId": "143880621", "name": "Saif M. Mohammad"}, {"authorId": "1737250", "name": "D. Oard"}, {"authorId": "1718753", "name": "C. Piatko"}, {"authorId": "145017437", "name": "A. Sayeed"}, {"authorId": "39955233", "name": "Zareen Syed"}, {"authorId": "1732071", "name": "R. Weischedel"}, {"authorId": "48874091", "name": "Tan Xu"}, {"authorId": "1693517", "name": "David Yarowsky"}]}, {"paperId": "cff455c26532b361e0aa8fc5703b57f173daa168", "url": "https://www.semanticscholar.org/paper/cff455c26532b361e0aa8fc5703b57f173daa168", "title": "Linguistic Structure Prediction", "abstract": "A major part of natural language processing now depends on the use of text data to build linguistic analyzers. We consider statistical, computational approaches to modeling linguistic structure. We seek to unify across many approaches and many kinds of linguistic structures. Assuming a basic understanding of natural language processing and/or machine learning, we seek to bridge the gap between the two fields. Approaches to decoding (i.e., carrying out linguistic structure prediction) and supervised and unsupervised learning of models that predict discrete structures as outputs are the focus. We also survey natural language processing problems to which these methods are being applied, and we address related topics in probabilistic inference, optimization, and experimental methodology. Table of Contents: Representations and Linguistic Data / Decoding: Making Predictions / Learning Structure from Annotated Data / Learning Structure from Incomplete Data / Beyond Decoding: Inference", "year": 2011, "referenceCount": 269, "citationCount": 157, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144365875", "name": "Noah A. Smith"}]}, {"paperId": "4c88cd9075eac2ae6e93c2be08487ec2d040cd63", "url": "https://www.semanticscholar.org/paper/4c88cd9075eac2ae6e93c2be08487ec2d040cd63", "title": "A universal nonlinear filter, predictor and simulator which optimizes itself by a learning process", "abstract": "A machine is described consisting of a universal non-linear filter, which is a highly adaptable analogue computer, together with a training device. The analogue machine has 18 input quantities from which it can compute in about 2 millisec 94 terms of a polynomial, each term containing products and powers of the input quantities, with adjustable coefficients, and can form their sum. The input quantities may be, for instance, 18 past samples of the values of a stochastic variable which is fed into the machine, and the result of the computation is an output function which contains 94 free variables. The training device optimizes the output by successive adjustment of the variable coefficients, until it has approached a target function as closely as can be achieved with a polynomial of 94 terms, by the criterion of the least mean-square error. This is done by repeatedly feeding into the machine a record of the stochastic process, long enough to be representative, and adjusting the variable coefficients, one at a time after each run, by a strategy which ensures that the error will monotonically decrease from run to run.In order to make the machine an optimum filter it is trained on a record of a noisy process, together with a target record which contains the signal only. It is taught as a predictor by taking as the target function a value of the stochastic process advanced by a certain time interval beyond the last value which goes into the input. It is trained as a simulator, for instance of an unknown mechanism, by feeding it with the input of the mechanism to be simulated at one end and presenting it at the other with its output as target function. The machine will then make itself into a model of the device to be simulated and the non-linear transfer function of the device can be read off from the final setting of the coefficients, as nearly as it can be represented by a 94-term polynomial. The machine is not confined to single-input systems.The machine incorporates 80 analogue multipliers of a novel ‘piezomagnetic’ type which, in its present form, can perform over 1000 multiplications per second with an error of 0.5% or less.A few examples of the first test applications of the machine are described.", "year": 1961, "referenceCount": 2, "citationCount": 138, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "16298171", "name": "D. Gabor"}, {"authorId": "1403509947", "name": "W. Wildes"}, {"authorId": "46363985", "name": "R. Woodcock"}]}, {"paperId": "6fb8b967dad742eb390a3090f094a12f2d909538", "url": "https://www.semanticscholar.org/paper/6fb8b967dad742eb390a3090f094a12f2d909538", "title": "A Survey on The Expressive Power of Graph Neural Networks", "abstract": "Graph neural networks (GNNs) are effective machine learning models for various graph learning problems. Despite their empirical successes, the theoretical limitations of GNNs have been revealed recently. Consequently, many GNN models have been proposed to overcome these limitations. In this survey, we provide a comprehensive overview of the expressive power of GNNs and provably powerful variants of GNNs.", "year": 2020, "referenceCount": 105, "citationCount": 89, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "51442285", "name": "R. Sato"}]}, {"paperId": "39374fcd9146cf66bcbc1b1f9a3db54bc607fa88", "url": "https://www.semanticscholar.org/paper/39374fcd9146cf66bcbc1b1f9a3db54bc607fa88", "title": "Short-term load forecasting of Australian National Electricity Market by an ensemble model of extreme learning machine", "abstract": "Artificial Neural Network (ANN) has been recognized as a powerful method for short-term load forecasting (STLF) of power systems. However, traditional ANNs are mostly trained by gradient-based learning algorithms which usually suffer from excessive training and tuning burden as well as unsatisfactory generalization performance. Based on the ensemble learning strategy, this paper develops an ensemble model of a promising novel learning technology called extreme learning machine (ELM) for high-quality STLF of Australian National Electricity Market (NEM). The model consists of a series of single ELMs. During the training, the ensemble model generalizes the randomness of single ELMs by selecting not only random input parameters but also random hidden nodes within a pre-defined range. The forecast result is taken as the median value the single ELM outputs. Owing to the very fast training/tuning speed of ELM, the model can be efficiently updated to on-line track the variation trend of the electricity load and maintain the accuracy. The developed model is tested with the NEM historical load data and its performance is compared with some state-of-the-art learning algorithms. The results show that the training efficiency and the forecasting accuracy of the developed model are superior over the competitive algorithms.", "year": 2013, "referenceCount": 23, "citationCount": 156, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "49775519", "name": "Rui Zhang"}, {"authorId": "144402926", "name": "Z. Dong"}, {"authorId": "2118040272", "name": "Yan Xu"}, {"authorId": "145734483", "name": "K. Meng"}, {"authorId": "144568755", "name": "K. Wong"}]}, {"paperId": "061a3b79f51007fc12b133761683b03687d73c74", "url": "https://www.semanticscholar.org/paper/061a3b79f51007fc12b133761683b03687d73c74", "title": "Feature Engineering for Machine Learning and Data Analytics", "abstract": null, "year": 2018, "referenceCount": 0, "citationCount": 109, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153827249", "name": "G. Dong"}, {"authorId": "2146397025", "name": "Huan Liu"}]}, {"paperId": "29ac5dd37d1247acd706c8f07ee366dcb6b91e18", "url": "https://www.semanticscholar.org/paper/29ac5dd37d1247acd706c8f07ee366dcb6b91e18", "title": "Learning Cumulatively to Become More Knowledgeable", "abstract": "In classic supervised learning, a learning algorithm takes a fixed training data of several classes to build a classifier. In this paper, we propose to study a new problem, i.e., building a learning system that learns cumulatively. As time goes by, the system sees and learns more and more classes of data and becomes more and more knowledgeable. We believe that this is similar to human learning. We humans learn continuously, retaining the learned knowledge, identifying and learning new things, and updating the existing knowledge with new experiences. Over time, we cumulate more and more knowledge. A learning system should be able to do the same. As algorithmic learning matures, it is time to tackle this cumulative machine learning (or simply cumulative learning) problem, which is a kind of lifelong machine learning problem. It presents two major challenges. First, the system must be able to detect data from unseen classes in the test set. Classic supervised learning, however, assumes all classes in testing are known or seen at the training time. Second, the system needs to be able to selectively update its models whenever a new class of data arrives without re-training the whole system using the entire past and present training data. This paper proposes a novel approach and system to tackle these challenges. Experimental results on two datasets with learning from 2 classes to up to 100 classes show that the proposed approach is highly promising in terms of both classification accuracy and computational efficiency.", "year": 2016, "referenceCount": 47, "citationCount": 80, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2193585", "name": "Geli Fei"}, {"authorId": "1717480", "name": "Shuai Wang"}, {"authorId": "145321667", "name": "B. Liu"}]}, {"paperId": "8e8c43ee90da55382f51c8ac5c452f17783d9a70", "url": "https://www.semanticscholar.org/paper/8e8c43ee90da55382f51c8ac5c452f17783d9a70", "title": "Stock Closing Price Prediction using Machine Learning Techniques", "abstract": null, "year": 2020, "referenceCount": 16, "citationCount": 113, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1729583465", "name": "Mehar Vijh"}, {"authorId": "9323578", "name": "Deeksha Chandola"}, {"authorId": "9221453", "name": "V. Tikkiwal"}, {"authorId": "2119303389", "name": "Arun Kumar"}]}, {"paperId": "18e577d46fbc85ae6d63e9b85d81e491a5cd31c1", "url": "https://www.semanticscholar.org/paper/18e577d46fbc85ae6d63e9b85d81e491a5cd31c1", "title": "Deploying Machine and Deep Learning Models for Efficient Data-Augmented Detection of COVID-19 Infections", "abstract": "This generation faces existential threats because of the global assault of the novel Corona virus 2019 (i.e., COVID-19). With more than thirteen million infected and nearly 600000 fatalities in 188 countries/regions, COVID-19 is the worst calamity since the World War II. These misfortunes are traced to various reasons, including late detection of latent or asymptomatic carriers, migration, and inadequate isolation of infected people. This makes detection, containment, and mitigation global priorities to contain exposure via quarantine, lockdowns, work/stay at home, and social distancing that are focused on “flattening the curve”. While medical and healthcare givers are at the frontline in the battle against COVID-19, it is a crusade for all of humanity. Meanwhile, machine and deep learning models have been revolutionary across numerous domains and applications whose potency have been exploited to birth numerous state-of-the-art technologies utilised in disease detection, diagnoses, and treatment. Despite these potentials, machine and, particularly, deep learning models are data sensitive, because their effectiveness depends on availability and reliability of data. The unavailability of such data hinders efforts of engineers and computer scientists to fully contribute to the ongoing assault against COVID-19. Faced with a calamity on one side and absence of reliable data on the other, this study presents two data-augmentation models to enhance learnability of the Convolutional Neural Network (CNN) and the Convolutional Long Short-Term Memory (ConvLSTM)-based deep learning models (DADLMs) and, by doing so, boost the accuracy of COVID-19 detection. Experimental results reveal improvement in terms of accuracy of detection, logarithmic loss, and testing time relative to DLMs devoid of such data augmentation. Furthermore, average increases of 4% to 11% in COVID-19 detection accuracy are reported in favour of the proposed data-augmented deep learning models relative to the machine learning techniques. Therefore, the proposed algorithm is effective in performing a rapid and consistent Corona virus diagnosis that is primarily aimed at assisting clinicians in making accurate identification of the virus.", "year": 2020, "referenceCount": 53, "citationCount": 103, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1409351746", "name": "Ahmed Sedik"}, {"authorId": "2044071", "name": "Abdullah M. Iliyasu"}, {"authorId": "1832292912", "name": "Basma Abd El-Rahiem"}, {"authorId": "1717703395", "name": "Mohammed E Abdel Samea"}, {"authorId": "1581470784", "name": "Asmaa Abdel-Raheem"}, {"authorId": "2113211703", "name": "Mohamed Hammad"}, {"authorId": "2715913", "name": "Jialiang Peng"}, {"authorId": "1403694220", "name": "F. A. Abd El-Samie"}, {"authorId": "1405770563", "name": "A. A. Abd El-Latif"}]}, {"paperId": "0d1c6071e851f479177f671d2b3f0fd2123757f5", "url": "https://www.semanticscholar.org/paper/0d1c6071e851f479177f671d2b3f0fd2123757f5", "title": "Bayesian network based extreme learning machine for subjectivity detection", "abstract": null, "year": 2017, "referenceCount": 45, "citationCount": 117, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2204726", "name": "I. Chaturvedi"}, {"authorId": "7146947", "name": "E. Ragusa"}, {"authorId": "1906359", "name": "P. Gastaldo"}, {"authorId": "145140641", "name": "R. Zunino"}, {"authorId": "49943757", "name": "E. Cambria"}]}, {"paperId": "911fa24c082df78d8d6acd86925a95b14c3a492d", "url": "https://www.semanticscholar.org/paper/911fa24c082df78d8d6acd86925a95b14c3a492d", "title": "Manifold Learning Theory and Applications", "abstract": "Trained to extract actionable information from large volumes of high-dimensional data, engineers and scientists often have trouble isolating meaningful low-dimensional structures hidden in their high-dimensional observations. Manifold learning, a groundbreaking technique designed to tackle these issues of dimensionality reduction, finds widespread application in machine learning, neural networks, pattern recognition, image processing, and computer vision. Filling a void in the literature, Manifold Learning Theory and Applications incorporates state-of-the-art techniques in manifold learning with a solid theoretical and practical treatment of the subject. Comprehensive in its coverage, this pioneering work explores this novel modality from algorithm creation to successful implementationoffering examples of applications in medical, biometrics, multimedia, and computer vision. Emphasizing implementation, it highlights the various permutations of manifold learning in industry including manifold optimization, large scale manifold learning, semidefinite programming for embedding, manifold models for signal acquisition, compression and processing, and multi scale manifold. Beginning with an introduction to manifold learning theories and applications, the book includes discussions on the relevance to nonlinear dimensionality reduction, clustering, graph-based subspace learning, spectral learning and embedding, extensions, and multi-manifold modeling. It synergizes cross-domain knowledge for interdisciplinary instructions, offers a rich set of specialized topics contributed by expert professionals and researchers from a variety of fields. Finally, the book discusses specific algorithms and methodologies using case studies to apply manifold learning for real-world problems.", "year": 2011, "referenceCount": 0, "citationCount": 177, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2363386", "name": "Yunqian Ma"}, {"authorId": "145692782", "name": "Yun Fu"}]}, {"paperId": "2512228ada8b379f9571eba648cec950cd08ec48", "url": "https://www.semanticscholar.org/paper/2512228ada8b379f9571eba648cec950cd08ec48", "title": "Turning 30: New Ideas in Inductive Logic Programming", "abstract": "Common criticisms of state-of-the-art machine learning include poor generalisation, a lack of interpretability, and a need for large amounts of training data. We survey recent work in inductive logic programming (ILP), a form of machine learning that induces logic programs from data, which has shown promise at addressing these limitations. We focus on new methods for learning recursive programs that generalise from few examples, a shift from using hand-crafted background knowledge to learning background knowledge, and the use of different technologies, notably answer set programming and neural networks. As ILP approaches 30, we also discuss directions for future research.", "year": 2020, "referenceCount": 69, "citationCount": 60, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1986234", "name": "Andrew Cropper"}, {"authorId": "3422854", "name": "Sebastijan Dumancic"}, {"authorId": "145147566", "name": "S. Muggleton"}]}, {"paperId": "01955ed924c0851cbb793f2344644cf5b51ca751", "url": "https://www.semanticscholar.org/paper/01955ed924c0851cbb793f2344644cf5b51ca751", "title": "Predicting future hourly residential electrical consumption: A machine learning case study", "abstract": null, "year": 2012, "referenceCount": 38, "citationCount": 298, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "36064147", "name": "R. Edwards"}, {"authorId": "1707963", "name": "J. New"}, {"authorId": "9371012", "name": "L. Parker"}]}, {"paperId": "dde6c11693ad4989e8dd5e4882a7eebef2897803", "url": "https://www.semanticscholar.org/paper/dde6c11693ad4989e8dd5e4882a7eebef2897803", "title": "Breast cancer detection by leveraging Machine Learning", "abstract": null, "year": 2020, "referenceCount": 11, "citationCount": 67, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1742228309", "name": "Anji Reddy Vaka"}, {"authorId": "48363943", "name": "B. Soni"}, {"authorId": "2006011740", "name": "K. SudheerReddy"}]}, {"paperId": "a136ed2525f8d2572fb8675e528ad06933042346", "url": "https://www.semanticscholar.org/paper/a136ed2525f8d2572fb8675e528ad06933042346", "title": "Text-learning and related intelligent agentsDunja", "abstract": "Analysis of text data using intelligent information retrieval, machine learning, natural language processing or other related methods is becoming an important issue for the development of intelligent agents. There are two frequently used approaches to the development of intelligent agents using machine learning techniques: a content-based and a collaborative approach. In the rst approach, the content (eg., text) plays an important role, while in the second approach, the existence of several knowledge sources (eg., several users) is required. We can say that the usage of machine learning techniques on text databases (usually referred to as text-learning) is an important part of the content-based approach. Examples are agents for locating information on World Wide Web and Usenet news ltering agents. There are diierent research questions important for the development of text-learning intelligent agents. We focus on three of them: what representation is used for documents, how is the high number of features dealt with and which learning algorithm is used. These questions are addressed in an overview of the existing approaches to text classiication. For illustration we give a brief description of the content-based personal intelligent agent named Personal WebWatcher that uses text-learning for user customized Web browsing.", "year": 1999, "referenceCount": 100, "citationCount": 70, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "66515963", "name": "D. Mladení"}]}, {"paperId": "9f68cb5f9e948d2a1b2793dfb2d81d68c31f3171", "url": "https://www.semanticscholar.org/paper/9f68cb5f9e948d2a1b2793dfb2d81d68c31f3171", "title": "Improved base calling for the Illumina Genome Analyzer using machine learning strategies", "abstract": null, "year": 2009, "referenceCount": 12, "citationCount": 276, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "6534571", "name": "Martin Kircher"}, {"authorId": "2661364", "name": "U. Stenzel"}, {"authorId": "144288817", "name": "J. Kelso"}]}, {"paperId": "649dd1fcd3f375ccd1a485af88b3dd8d0d289ee6", "url": "https://www.semanticscholar.org/paper/649dd1fcd3f375ccd1a485af88b3dd8d0d289ee6", "title": "A systematic review shows no performance benefit of machine learning over logistic regression for clinical prediction models.", "abstract": null, "year": 2019, "referenceCount": 132, "citationCount": 657, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Mathematics"], "authors": [{"authorId": "51248761", "name": "E. Christodoulou"}, {"authorId": "2166755241", "name": "Jie Ma"}, {"authorId": "2003566", "name": "G. Collins"}, {"authorId": "144517928", "name": "E. Steyerberg"}, {"authorId": "2726910", "name": "J. Verbakel"}, {"authorId": "10108730", "name": "B. van Calster"}]}, {"paperId": "faef31f1696806c59b67a7894f46aa056c6ee264", "url": "https://www.semanticscholar.org/paper/faef31f1696806c59b67a7894f46aa056c6ee264", "title": "A machine learning system for automated whole-brain seizure detection", "abstract": null, "year": 2016, "referenceCount": 91, "citationCount": 111, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1894272", "name": "P. Fergus"}, {"authorId": "145463079", "name": "A. Hussain"}, {"authorId": "3082797", "name": "David Hignett"}, {"authorId": "1398585056", "name": "D. Al-Jumeily"}, {"authorId": "1429717605", "name": "K. Abdel-Aziz"}, {"authorId": "49161000", "name": "H. Hamdan"}]}, {"paperId": "5ea5c792f914bfb43364981db303c91cad48485d", "url": "https://www.semanticscholar.org/paper/5ea5c792f914bfb43364981db303c91cad48485d", "title": "A Machine Learning Approach for Predicting Defluorination of Per- and Polyfluoroalkyl Substances (PFAS) for Their Efficient Treatment and Removal", "abstract": "We\npresent the first application of machine learning on per- and polyfluoroalkyl substances (PFAS) for predicting and rationalizing carbon-fluorine (C–F)\nbond dissociation energies to aid in their efficient treatment and removal. Using\na variety of machine learning algorithms (including Random Forest, Least\nAbsolute Shrinkage and Selection Operator Regression, and Feed-forward Neural\nNetworks), we were able to obtain extremely accurate predictions for C–F bond dissociation energies (with\ndeviations less than 0.70 kcal/mol) that are within chemical accuracy of\nthe PFAS reference data. In addition, we show that our machine learning\napproach is extremely efficient (requiring less than 10 minutes to train the\ndata and less than a second to predict the C–F bond dissociation energy of a\nnew compound) and only needs knowledge\nof the simple chemical connectivity in a PFAS structure to yield reliable\nresults – without recourse to a computationally expensive quantum\nmechanical calculation or a three-dimensional structure. Finally, we present an\nunsupervised machine learning algorithm that can automatically classify and\nrationalize chemical trends in PFAS structures that would otherwise have been\ndifficult to humanly visualize/process manually. Collectively, these studies (1)\ncomprise the first application\nof machine learning techniques for PFAS structures to predict/rationalize C–F bond dissociation energies and (2) show immense\npromise for assisting experimentalists in the targeted defluorination of\nspecific bonds in PFAS structures (or other unknown environmental contaminants)\nof increasing complexity.", "year": 2019, "referenceCount": 43, "citationCount": 49, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "153356727", "name": "Akber Raza"}, {"authorId": "32200979", "name": "Sharmistha Bardhan"}, {"authorId": "2112184745", "name": "Lihua Xu"}, {"authorId": "15568778", "name": "Sharma S R K C Yamijala"}, {"authorId": "49488783", "name": "C. Lian"}, {"authorId": "4216770", "name": "Hyunah Kwon"}, {"authorId": "144898084", "name": "Bryan M. Wong"}]}, {"paperId": "9fbc6d2a105fa3ea9ede00ff21f9dd440c3e8beb", "url": "https://www.semanticscholar.org/paper/9fbc6d2a105fa3ea9ede00ff21f9dd440c3e8beb", "title": "Even Faster Accelerated Coordinate Descent Using Non-Uniform Sampling", "abstract": "Accelerated coordinate descent is widely used in optimization due to its cheap per-iteration cost and scalability to large-scale problems. Up to a primal-dual transformation, it is also the same as accelerated stochastic gradient descent that is one of the central methods used in machine learning. \nIn this paper, we improve the best known running time of accelerated coordinate descent by a factor up to $\\sqrt{n}$. Our improvement is based on a clean, novel non-uniform sampling that selects each coordinate with a probability proportional to the square root of its smoothness parameter. Our proof technique also deviates from the classical estimation sequence technique used in prior work. Our speed-up applies to important problems such as empirical risk minimization and solving linear systems, both in theory and in practice.", "year": 2015, "referenceCount": 41, "citationCount": 141, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "13319052", "name": "Z. Zhu"}, {"authorId": "38862887", "name": "Zheng Qu"}, {"authorId": "2662221", "name": "Peter Richtárik"}, {"authorId": "145155436", "name": "Yang Yuan"}]}]}