{"total": 5814519, "offset": 700, "next": 800, "data": [{"paperId": "a54657b8de38a18f30fd154d713f9522f705166c", "url": "https://www.semanticscholar.org/paper/a54657b8de38a18f30fd154d713f9522f705166c", "title": "Computational complexity of machine learning", "abstract": "This thesis is a study of the computational complexity of machine learning from examples in the distribution-free model introduced by L. G. Valiant (V84). In the distribution-free model, a learning algorithm receives positive and negative examples of an unknown target set (or concept) that is chosen from some known class of sets (or concept class). These examples are generated randomly according to a fixed but unknown probability distribution representing Nature, and the goal of the learning algorithm is to infer an hypothesis concept that closely approximates the target concept with respect to the unknown distribution. This thesis is concerned with proving theorems about learning in this formal mathematical model. \nWe are interested in the phenomenon of efficient learning in the distribution-free model, in the standard polynomial-time sense. Our results include general tools for determining the polynomial-time learnability of a concept class, an extensive study of efficient learning when errors are present in the examples, and lower bounds on the number of examples required for learning in our model. A centerpiece of the thesis is a series of results demonstrating the computational difficulty of learning a number of well-studied concept classes. These results are obtained by reducing some apparently hard number-theoretic problems from cryptography to the learning problems. The hard-to-learn concept classes include the sets represented by Boolean formulae, deterministic finite automata and a simplified form of neural networks. We also give algorithms for learning powerful concept classes under the uniform distribution, and give equivalences between natural models of efficient learnability. \nThis thesis also includes detailed definitions and motivation for the distribution-free model, a chapter discussing past research in this model and related models, and a short list of important open problems.", "year": 1990, "referenceCount": 64, "citationCount": 244, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2056642528", "name": "M. Kearns"}]}, {"paperId": "d1e5263787d888da20a28254fd7bd581618e3a06", "url": "https://www.semanticscholar.org/paper/d1e5263787d888da20a28254fd7bd581618e3a06", "title": "An Overview of Machine Learning", "abstract": null, "year": 1983, "referenceCount": 34, "citationCount": 277, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143712374", "name": "J. Carbonell"}, {"authorId": "2421006", "name": "R. Michalski"}, {"authorId": "40975594", "name": "Tom Michael Mitchell"}]}, {"paperId": "451f86130daf5632b87cd4c0f417b245c6ebb582", "url": "https://www.semanticscholar.org/paper/451f86130daf5632b87cd4c0f417b245c6ebb582", "title": "Does Machine Learning Really Work?", "abstract": "Does machine learning really work? Yes. Over the past decade, machine learning has evolved from a field of laboratory demonstrations to a field of significant commercial value. Machine-learning algorithms have now learned to detect credit card fraud by mining data on past transactions, learned to steer vehicles driving autonomously on public highways at 70 miles an hour, and learned the reading interests of many individuals to assemble personally customized electronic newsAbstracts. A new computational theory of learning is beginning to shed light on fundamental issues, such as the trade-off among the number of training examples available, the number of hypotheses considered, and the likely accuracy of the learned hypothesis. Newer research is beginning to explore issues such as long-term learning of new representations, the integration of Bayesian inference and induction, and life-long cumulative learning. This article, based on the keynote talk presented at the Thirteenth National Conference on Artificial Intelligence, samples a number of recent accomplishments in machine learning and looks at where the field might be headed. [Copyright restrictions preclude electronic publication of this article.]", "year": 1997, "referenceCount": 19, "citationCount": 172, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40975594", "name": "Tom Michael Mitchell"}]}, {"paperId": "9820a5eeada755155f246f26ea0959e0d50dd57b", "url": "https://www.semanticscholar.org/paper/9820a5eeada755155f246f26ea0959e0d50dd57b", "title": "A review of machine learning in scheduling", "abstract": "This paper has two primary purposes: to motivate the need for machine learning in scheduling systems and to survey work on machine learning in scheduling. In order to motivate the need for machine learning in scheduling, we briefly motivate the need for systems employing artificial intelligence methods for scheduling. This leads to a need for incorporating adaptive methods-learning. >", "year": 1994, "referenceCount": 27, "citationCount": 135, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1738159", "name": "H. Aytug"}, {"authorId": "2242928", "name": "S. Bhattacharyya"}, {"authorId": "1707873", "name": "G. J. Koehler"}, {"authorId": "39326638", "name": "J. Snowdon"}]}, {"paperId": "ad58594194155af8b48eaf3ab9525a1fafd24e58", "url": "https://www.semanticscholar.org/paper/ad58594194155af8b48eaf3ab9525a1fafd24e58", "title": "Estimating Probabilities: A Crucial Task in Machine Learning", "abstract": null, "year": 1990, "referenceCount": 0, "citationCount": 588, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2476128", "name": "B. Cestnik"}]}, {"paperId": "65df2d9b3c656ca85e4d66c327cfd8c8d1182df3", "url": "https://www.semanticscholar.org/paper/65df2d9b3c656ca85e4d66c327cfd8c8d1182df3", "title": "Machine Learning: Neural Networks, Genetic Algorithms, and Fuzzy Systems", "abstract": "Perceptron Learning with a Hidden Layer An Object-Oriented Backpropagation Learning Model Concurrent Backpropagation Learning Algorithms An Adaptive Conjugate Gradient Learning Algorithm for Efficient Training of Neural Networks A Concurrent Adaptive Conjugate Gradient Learning Algorithm on MIMD Shared Memory Machines A Concurrent Genetic/Neural Network Learning Algorithm for MIMD Shared Memory Machines A Hybrid Learning Algorithm for Distributed Memory Multicomputers A Fuzzy Neural Network Learning Model Appendices References Index.", "year": 1994, "referenceCount": 0, "citationCount": 506, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1750050", "name": "H. Adeli"}, {"authorId": "2830443", "name": "S. Hung"}]}, {"paperId": "88c8a70562e0a722e6b17fc65c80633b9d34ec18", "url": "https://www.semanticscholar.org/paper/88c8a70562e0a722e6b17fc65c80633b9d34ec18", "title": "Optimization for Machine Learning", "abstract": "This is a draft containing only sra chapter.tex and an abbreviated front matter. Please check that the formatting and small changes have been performed correctly. Please verify the affiliation. Please use this version for sending us future modifications.", "year": 1995, "referenceCount": 93, "citationCount": 515, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "3015507", "name": "Jean-Yves Audibert"}]}, {"paperId": "22faafeba7d7443da14c1e23e549b94e40d7d6ee", "url": "https://www.semanticscholar.org/paper/22faafeba7d7443da14c1e23e549b94e40d7d6ee", "title": "“Memo” Functions and Machine Learning", "abstract": null, "year": 1968, "referenceCount": 3, "citationCount": 507, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145878706", "name": "D. Michie"}]}, {"paperId": "fe78338ee1ce7e202b4b901943f59d16090ae4f3", "url": "https://www.semanticscholar.org/paper/fe78338ee1ce7e202b4b901943f59d16090ae4f3", "title": "Machine learning and data mining", "abstract": "Over the past decade many organizations have begun to routinely capture huge volumes of historical data describing their operations, their products, and their customers. At the same time, scientists and engineers in many elds nd themselves capturing increasingly complex experimental datasets, such as the gigabytes of functional MRI data that describe brain activity in humans. The eld of data mining addresses the question of how best to use this historical data to discover general regularities and to improve future decisions.", "year": 1999, "referenceCount": 19, "citationCount": 389, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40975594", "name": "Tom Michael Mitchell"}]}, {"paperId": "025d7241e095ebc7f1d615fb9d178a1098f33cb0", "url": "https://www.semanticscholar.org/paper/025d7241e095ebc7f1d615fb9d178a1098f33cb0", "title": "Machine Learning and Data Mining", "abstract": null, "year": 2002, "referenceCount": 53, "citationCount": 346, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "153634846", "name": "J. Palous"}]}, {"paperId": "72282cfbb493c487f9f43a6270b5bd9d94b57d94", "url": "https://www.semanticscholar.org/paper/72282cfbb493c487f9f43a6270b5bd9d94b57d94", "title": "Machine Learning: ECML-98", "abstract": null, "year": 1998, "referenceCount": 0, "citationCount": 389, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2838186", "name": "C. Nédellec"}, {"authorId": "2321708", "name": "C. Rouveirol"}]}, {"paperId": "2097ff87df3cb9427c7388bc7b997ed56907d45b", "url": "https://www.semanticscholar.org/paper/2097ff87df3cb9427c7388bc7b997ed56907d45b", "title": "Optimization and Machine Learning", "abstract": "Problem 1 (20%) Consider the function f(x1, x2) = (x1 + x 2 2) 2 At the point xk = [1, 0] T , find (a) the gradient descent direction (b) xk+1 by exact line search on the gradient descent direction (c) the Newton direction (d) xk+1 by exact line search on the Newton direction Problem 2 (40%) Consider the following quadratic function: f(x) = 1 2 xQx− bx Assume Q is symmetric and positive definite. (a) What’s the gradient of f(x)?", "year": 2022, "referenceCount": 0, "citationCount": 348, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1715339", "name": "D. Goldberg"}]}, {"paperId": "fc09717ba476ae2408c454e5557276a9fc4d093d", "url": "https://www.semanticscholar.org/paper/fc09717ba476ae2408c454e5557276a9fc4d093d", "title": "Machine Learning: A Theoretical Approach", "abstract": "Chapter 1 Introduction Chapter 2 Learning Concept on Countable Domains Chapter 3 Time Complexity of Concept Learning Chapter 4 Learning Concepts on Uncoutable Domains Chapter 5 Learning Functions Chapter 6 Finite Automata Chapter 7 Neural Networks Chapter 8 Generalizing the Learning Model Chapter 9 Conclusion", "year": 1992, "referenceCount": 0, "citationCount": 252, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "39419622", "name": "B. Natarajan"}]}, {"paperId": "0e032db22bfd6a607eda2185715e8ab0772cbd67", "url": "https://www.semanticscholar.org/paper/0e032db22bfd6a607eda2185715e8ab0772cbd67", "title": "Evaluating Learning Algorithms: A Classification Perspective", "abstract": "The field of machine learning has matured to the point where many sophisticated learning approaches can be applied to practical applications. Thus it is of critical importance that researchers have the proper tools to evaluate learning approaches and understand the underlying issues. This book examines various aspects of the evaluation process with an emphasis on classification algorithms. The authors describe several techniques for classifier performance assessment, error estimation and resampling, obtaining statistical significance as well as selecting appropriate domains for evaluation. They also present a unified evaluation framework and highlight how different components of evaluation are both significantly interrelated and interdependent. The techniques presented in the book are illustrated using R and WEKA facilitating better practical insight as well as implementation.Aimed at researchers in the theory and applications of machine learning, this book offers a solid basis for conducting performance evaluations of algorithms in practical settings.", "year": 2011, "referenceCount": 169, "citationCount": 832, "influentialCitationCount": 70, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1743642", "name": "N. Japkowicz"}, {"authorId": "40225085", "name": "Mohak Shah"}]}, {"paperId": "4a6a88fcd374e4fdf2120f65b82c1382bdccfa2d", "url": "https://www.semanticscholar.org/paper/4a6a88fcd374e4fdf2120f65b82c1382bdccfa2d", "title": "Genetic Algorithms in Machine Learning", "abstract": null, "year": 2001, "referenceCount": 32, "citationCount": 87, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2113093", "name": "J. Shapiro"}]}, {"paperId": "26e85b438135f6defa1326d73db147e8bd51ae41", "url": "https://www.semanticscholar.org/paper/26e85b438135f6defa1326d73db147e8bd51ae41", "title": "Learning machine learning", "abstract": null, "year": 1991, "referenceCount": 0, "citationCount": 134, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "1711036", "name": "A. V. Lamsweerde"}]}, {"paperId": "43d563584f118e9047f072093d25af94dd323958", "url": "https://www.semanticscholar.org/paper/43d563584f118e9047f072093d25af94dd323958", "title": "Learning Thermodynamics with Boltzmann Machines", "abstract": "A Boltzmann machine is a stochastic neural network that has been extensively used in the layers of deep architectures for modern machine learning applications. In this paper, we develop a Boltzmann machine that is capable of modeling thermodynamic observables for physical systems in thermal equilibrium. Through unsupervised learning, we train the Boltzmann machine on data sets constructed with spin configurations importance sampled from the partition function of an Ising Hamiltonian at different temperatures using Monte Carlo (MC) methods. The trained Boltzmann machine is then used to generate spin states, for which we compare thermodynamic observables to those computed by direct MC sampling. We demonstrate that the Boltzmann machine can faithfully reproduce the observables of the physical system. Further, we observe that the number of neurons required to obtain accurate results increases as the system is brought close to criticality.", "year": 2016, "referenceCount": 16, "citationCount": 178, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Computer Science"], "authors": [{"authorId": "3422999", "name": "G. Torlai"}, {"authorId": "3422513", "name": "R. Melko"}]}, {"paperId": "9a24a993288119c9fd94cf2b43e394ad72dd59ee", "url": "https://www.semanticscholar.org/paper/9a24a993288119c9fd94cf2b43e394ad72dd59ee", "title": "Efficient Learning Machines", "abstract": null, "year": 2015, "referenceCount": 0, "citationCount": 210, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144707373", "name": "M. Awad"}, {"authorId": "49862773", "name": "R. Khanna"}]}, {"paperId": "884895a86fe15cb9601df4a15a1475c07f28da3c", "url": "https://www.semanticscholar.org/paper/884895a86fe15cb9601df4a15a1475c07f28da3c", "title": "Boosting for transfer learning", "abstract": "Traditional machine learning makes a basic assumption: the training and test data should be under the same distribution. However, in many cases, this identical-distribution assumption does not hold. The assumption might be violated when a task from one new domain comes, while there are only labeled data from a similar old domain. Labeling the new data can be costly and it would also be a waste to throw away all the old data. In this paper, we present a novel transfer learning framework called TrAdaBoost, which extends boosting-based learning algorithms (Freund & Schapire, 1997). TrAdaBoost allows users to utilize a small amount of newly labeled data to leverage the old data to construct a high-quality classification model for the new data. We show that this method can allow us to learn an accurate model using only a tiny amount of new data and a large amount of old data, even when the new data are not sufficient to train a model alone. We show that TrAdaBoost allows knowledge to be effectively transferred from the old data to the new. The effectiveness of our algorithm is analyzed theoretically and empirically to show that our iterative algorithm can converge well to an accurate model.", "year": 2007, "referenceCount": 29, "citationCount": 1542, "influentialCitationCount": 191, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1752769", "name": "Wenyuan Dai"}, {"authorId": "152290618", "name": "Qiang Yang"}, {"authorId": "1701421", "name": "Gui-Rong Xue"}, {"authorId": "1811427", "name": "Yong Yu"}]}, {"paperId": "b3852f0113fcf8a3913c55ae92393ae6ccde347e", "url": "https://www.semanticscholar.org/paper/b3852f0113fcf8a3913c55ae92393ae6ccde347e", "title": "Self-taught learning: transfer learning from unlabeled data", "abstract": "We present a new machine learning framework called \"self-taught learning\" for using unlabeled data in supervised classification tasks. We do not assume that the unlabeled data follows the same class labels or generative distribution as the labeled data. Thus, we would like to use a large number of unlabeled images (or audio samples, or text documents) randomly downloaded from the Internet to improve performance on a given image (or audio, or text) classification task. Such unlabeled data is significantly easier to obtain than in typical semi-supervised or transfer learning settings, making self-taught learning widely applicable to many practical learning problems. We describe an approach to self-taught learning that uses sparse coding to construct higher-level features using the unlabeled data. These features form a succinct input representation and significantly improve classification performance. When using an SVM for classification, we further show how a Fisher kernel can be learned for this representation.", "year": 2007, "referenceCount": 25, "citationCount": 1674, "influentialCitationCount": 117, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2979876", "name": "R. Raina"}, {"authorId": "2078284037", "name": "Alexis Battle"}, {"authorId": "1697141", "name": "Honglak Lee"}, {"authorId": "1409971380", "name": "Ben Packer"}, {"authorId": "34699434", "name": "A. Ng"}]}, {"paperId": "48e752c719d33ff55b3b3bec3538727f8ce69399", "url": "https://www.semanticscholar.org/paper/48e752c719d33ff55b3b3bec3538727f8ce69399", "title": "Ontology Learning for the Semantic Web", "abstract": "The Semantic Web relies heavily on formal ontologies to structure data for comprehensive and transportable machine understanding. Thus, the proliferation of ontologies factors largely in the Semantic Web's success. The authors present an ontology learning framework that extends typical ontology engineering environments by using semiautomatic ontology construction tools. The framework encompasses ontology import, extraction, pruning, refinement and evaluation.", "year": 2002, "referenceCount": 37, "citationCount": 2228, "influentialCitationCount": 99, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1806905", "name": "A. Maedche"}, {"authorId": "1752093", "name": "Steffen Staab"}]}, {"paperId": "66f44806cd46a27f02ceb74bdfd9ad6e77e044ca", "url": "https://www.semanticscholar.org/paper/66f44806cd46a27f02ceb74bdfd9ad6e77e044ca", "title": "Toward an Online Anomaly Intrusion Detection System Based on Deep Learning", "abstract": "In the past twenty years, progress in intrusion detection has been steady but slow. The biggest challenge is to detect new attacks in real time. In this work, a deep learning approach for anomaly detection using a Restricted Boltzmann Machine (RBM) and a deep belief network are implemented. Our method uses a one-hidden layer RBM to perform unsupervised feature reduction. The resultant weights from this RBM are passed to another RBM producing a deep belief network. The pre-trained weights are passed into a fine tuning layer consisting of a Logistic Regression (LR) classifier with multi-class soft-max. We have implemented the deep learning architecture in C++ in Microsoft Visual Studio 2013 and we use the DARPA KDDCUP'99 dataset to evaluate its performance. Our architecture outperforms previous deep learning methods implemented by Li and Salama in both detection speed and accuracy. We achieve a detection rate of 97.9% on the total 10% KDDCUP'99 test dataset. By improving the training process of the simulation, we are also able to produce a low false negative rate of 2.47%. Although the deficiencies in the KDDCUP'99 dataset are well understood, it still presents machine learning approaches for predicting attacks with a reasonable challenge. Our future work will include applying our machine learning strategy to larger and more challenging datasets, which include larger classes of attacks.", "year": 2016, "referenceCount": 22, "citationCount": 165, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8837455", "name": "Khaled Alrawashdeh"}, {"authorId": "145554708", "name": "C. Purdy"}]}, {"paperId": "02e68b069d9cf13c082049429ffed18a5ca5f6d0", "url": "https://www.semanticscholar.org/paper/02e68b069d9cf13c082049429ffed18a5ca5f6d0", "title": "Support Vector Machines for Multiple-Instance Learning", "abstract": "This paper presents two new formulations of multiple-instance learning as a maximum margin problem. The proposed extensions of the Support Vector Machine (SVM) learning approach lead to mixed integer quadratic programs that can be solved heuristic ally. Our generalization of SVMs makes a state-of-the-art classification technique, including non-linear classification via kernels, available to an area that up to now has been largely dominated by special purpose methods. We present experimental results on a pharmaceutical data set and on applications in automated image indexing and document categorization.", "year": 2002, "referenceCount": 13, "citationCount": 1505, "influentialCitationCount": 358, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2054883307", "name": "Stuart Andrews"}, {"authorId": "1765700", "name": "Ioannis Tsochantaridis"}, {"authorId": "143936663", "name": "Thomas Hofmann"}]}, {"paperId": "89b22325e7d72d11c5bad8f3893d45d0e184fa9b", "url": "https://www.semanticscholar.org/paper/89b22325e7d72d11c5bad8f3893d45d0e184fa9b", "title": "Neural Networks and Statistical Learning", "abstract": null, "year": 2013, "referenceCount": 0, "citationCount": 268, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144623096", "name": "Ke-Lin Du"}, {"authorId": "143949858", "name": "M. Swamy"}]}, {"paperId": "e2d4321c99b74859b8aa57daac7df4f1c11291cb", "url": "https://www.semanticscholar.org/paper/e2d4321c99b74859b8aa57daac7df4f1c11291cb", "title": "The children's machine: rethinking school in the age of the computer", "abstract": "Yearners and Schoolers Personal Thinking School: Change and Resistance to Change Teachers A World for Learning An Anthology of Learning Stories Instructionism versus Constructionism Computerists Yearners and Schoolers Cybernetics What can be done?", "year": 1993, "referenceCount": 0, "citationCount": 1893, "influentialCitationCount": 112, "isOpenAccess": false, "fieldsOfStudy": ["Psychology"], "authors": [{"authorId": "145008014", "name": "S. Papert"}]}, {"paperId": "1695dbabf8e905db0b391ff522c323db5fc8b958", "url": "https://www.semanticscholar.org/paper/1695dbabf8e905db0b391ff522c323db5fc8b958", "title": "Learning to select and generalize striking movements in robot table tennis", "abstract": "Learning new motor tasks from physical interactions is an important goal for both robotics and machine learning. However, when moving beyond basic skills, most monolithic machine learning approaches fail to scale. For more complex skills, methods that are tailored for the domain of skill learning are needed. In this paper, we take the task of learning table tennis as an example and present a new framework that allows a robot to learn cooperative table tennis from physical interaction with a human. The robot first learns a set of elementary table tennis hitting movements from a human table tennis teacher by kinesthetic teach-in, which is compiled into a set of motor primitives represented by dynamical systems. The robot subsequently generalizes these movements to a wider range of situations using our mixture of motor primitives approach. The resulting policy enables the robot to select appropriate motor primitives as well as to generalize between them. Finally, the robot plays with a human table tennis partner and learns online to improve its behavior. We show that the resulting setup is capable of playing table tennis using an anthropomorphic robot arm.", "year": 2012, "referenceCount": 69, "citationCount": 378, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "1759719", "name": "Katharina Muelling"}, {"authorId": "145739642", "name": "J. Kober"}, {"authorId": "1785853", "name": "Oliver Kroemer"}, {"authorId": "145197867", "name": "Jan Peters"}]}, {"paperId": "58740a751f399d634c0542ccecefba7c2dea15be", "url": "https://www.semanticscholar.org/paper/58740a751f399d634c0542ccecefba7c2dea15be", "title": "Machine Learning", "abstract": null, "year": 1986, "referenceCount": 0, "citationCount": 0, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "25294406", "name": "R. Forsyth"}]}, {"paperId": "0d7ee3f200a044b594606c9067bbcd1638ec32e3", "url": "https://www.semanticscholar.org/paper/0d7ee3f200a044b594606c9067bbcd1638ec32e3", "title": "Semi-supervised learning for peptide identification from shotgun proteomics datasets", "abstract": null, "year": 2007, "referenceCount": 27, "citationCount": 1605, "influentialCitationCount": 82, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "2440976", "name": "L. Käll"}, {"authorId": "32437457", "name": "J. Canterbury"}, {"authorId": "145183709", "name": "J. Weston"}, {"authorId": "144458655", "name": "William Stafford Noble"}, {"authorId": "2167765", "name": "M. MacCoss"}]}, {"paperId": "27609ed3fda10c0f35eaac014f42640ebff3df8d", "url": "https://www.semanticscholar.org/paper/27609ed3fda10c0f35eaac014f42640ebff3df8d", "title": "Evolutionary extreme learning machine", "abstract": null, "year": 2005, "referenceCount": 5, "citationCount": 714, "influentialCitationCount": 33, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50736254", "name": "Q. Zhu"}, {"authorId": "145587600", "name": "A. K. Qin"}, {"authorId": "1688355", "name": "P. Suganthan"}, {"authorId": "145678691", "name": "G. Huang"}]}, {"paperId": "85d727b119304dde458bcd8cf5cb87a906fb41ba", "url": "https://www.semanticscholar.org/paper/85d727b119304dde458bcd8cf5cb87a906fb41ba", "title": "Using AUC and accuracy in evaluating learning algorithms", "abstract": "The area under the ROC (receiver operating characteristics) curve, or simply AUC, has been traditionally used in medical diagnosis since the 1970s. It has recently been proposed as an alternative single-number measure for evaluating the predictive ability of learning algorithms. However, no formal arguments were given as to why AUC should be preferred over accuracy. We establish formal criteria for comparing two different measures for learning algorithms and we show theoretically and empirically that AUC is a better measure (defined precisely) than accuracy. We then reevaluate well-established claims in machine learning based on accuracy using AUC and obtain interesting and surprising new results. For example, it has been well-established and accepted that Naive Bayes and decision trees are very similar in predictive accuracy. We show, however, that Naive Bayes is significantly better than decision trees in AUC. The conclusions drawn in this paper may make a significant impact on machine learning and data mining applications.", "year": 2005, "referenceCount": 44, "citationCount": 1423, "influentialCitationCount": 140, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2110151928", "name": "Jin Huang"}, {"authorId": "1688204", "name": "C. Ling"}]}, {"paperId": "944e1a7b2c5c62e952418d7684e3cade89c76f87", "url": "https://www.semanticscholar.org/paper/944e1a7b2c5c62e952418d7684e3cade89c76f87", "title": "A Framework for Learning Predictive Structures from Multiple Tasks and Unlabeled Data", "abstract": "One of the most important issues in machine learning is whether one can improve the performance of a supervised learning algorithm by including unlabeled data. Methods that use both labeled and unlabeled data are generally referred to as semi-supervised learning. Although a number of such methods are proposed, at the current stage, we still don't have a complete understanding of their effectiveness. This paper investigates a closely related problem, which leads to a novel approach to semi-supervised learning. Specifically we consider learning predictive structures on hypothesis spaces (that is, what kind of classifiers have good predictive power) from multiple learning tasks. We present a general framework in which the structural learning problem can be formulated and analyzed theoretically, and relate it to learning with unlabeled data. Under this framework, algorithms for structural learning will be proposed, and computational issues will be investigated. Experiments will be given to demonstrate the effectiveness of the proposed algorithms in the semi-supervised learning setting.", "year": 2005, "referenceCount": 28, "citationCount": 1451, "influentialCitationCount": 121, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38070424", "name": "R. Ando"}, {"authorId": "2117881943", "name": "Tong Zhang"}]}, {"paperId": "5ed59f49c1bb7de06cfa2a9467d5efb535103277", "url": "https://www.semanticscholar.org/paper/5ed59f49c1bb7de06cfa2a9467d5efb535103277", "title": "Temporal difference learning and TD-Gammon", "abstract": "Ever since the days of Shannon's proposal for a chess-playing algorithm [12] and Samuel's checkers-learning program [10] the domain of complex board games such as Go, chess, checkers, Othello, and backgammon has been widely regarded as an ideal testing ground for exploring a variety of concepts and approaches in artificial intelligence and machine learning. Such board games offer the challenge of tremendous complexity and sophistication required to play at expert level. At the same time, the problem inputs and performance measures are clear-cut and well defined, and the game environment is readily automated in that it is easy to simulate the board, the rules of legal play, and the rules regarding when the game is over and determining the outcome.", "year": 1995, "referenceCount": 10, "citationCount": 1890, "influentialCitationCount": 106, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1699108", "name": "G. Tesauro"}]}, {"paperId": "fae8bbf868681b83d91b2fec6c840d4d2b32005b", "url": "https://www.semanticscholar.org/paper/fae8bbf868681b83d91b2fec6c840d4d2b32005b", "title": "Intrinsic Motivation and Reinforcement Learning", "abstract": null, "year": 2013, "referenceCount": 115, "citationCount": 195, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Psychology"], "authors": [{"authorId": "1730590", "name": "A. Barto"}]}, {"paperId": "09cb062324960b44b3e1b7956b11127ceed92a5f", "url": "https://www.semanticscholar.org/paper/09cb062324960b44b3e1b7956b11127ceed92a5f", "title": "Information Theoretic Learning - Renyi's Entropy and Kernel Perspectives", "abstract": null, "year": 2010, "referenceCount": 0, "citationCount": 778, "influentialCitationCount": 110, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "143961030", "name": "J. Príncipe"}]}, {"paperId": "a8582979cc4337bd6349d55ac6a7112a07add3a5", "url": "https://www.semanticscholar.org/paper/a8582979cc4337bd6349d55ac6a7112a07add3a5", "title": "Single-machine scheduling with learning considerations", "abstract": null, "year": 1999, "referenceCount": 22, "citationCount": 665, "influentialCitationCount": 148, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3353406", "name": "D. Biskup"}]}, {"paperId": "b5028fb7d55d3045cda0c290ded57c4c0b3cfdc9", "url": "https://www.semanticscholar.org/paper/b5028fb7d55d3045cda0c290ded57c4c0b3cfdc9", "title": "Foundations of Rule Learning", "abstract": null, "year": 2012, "referenceCount": 151, "citationCount": 282, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1747752", "name": "Johannes Fürnkranz"}, {"authorId": "1767339", "name": "D. Gamberger"}, {"authorId": "1730104", "name": "N. Lavrac"}]}, {"paperId": "2c8ac3e1f0edeed1fbd76813e61efdc384c319c7", "url": "https://www.semanticscholar.org/paper/2c8ac3e1f0edeed1fbd76813e61efdc384c319c7", "title": "Learning Question Classifiers", "abstract": "In order to respond correctly to a free form factual question given a large collection of texts, one needs to understand the question to a level that allows determining some of the constraints the question imposes on a possible answer. These constraints may include a semantic classification of the sought after answer and may even suggest using different strategies when looking for and verifying a candidate answer.This paper presents a machine learning approach to question classification. We learn a hierarchical classifier that is guided by a layered semantic hierarchy of answer types, and eventually classifies questions into fine-grained classes. We show accurate results on a large collection of free-form questions used in TREC 10.", "year": 2002, "referenceCount": 20, "citationCount": 1242, "influentialCitationCount": 197, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2153901204", "name": "Xin Li"}, {"authorId": "144590225", "name": "D. Roth"}]}, {"paperId": "7b2dd79083a74699e4e0509ac3f0a8a302b4eabe", "url": "https://www.semanticscholar.org/paper/7b2dd79083a74699e4e0509ac3f0a8a302b4eabe", "title": "On the mathematical foundations of learning", "abstract": "(1) A main theme of this report is the relationship of approximation to learning and the primary role of sampling (inductive inference). We try to emphasize relations of the theory of learning to the mainstream of mathematics. In particular, there are large roles for probability theory, for algorithms such as least squares, and for tools and ideas from linear algebra and linear analysis. An advantage of doing this is that communication is facilitated and the power of core mathematics is more easily brought to bear. We illustrate what we mean by learning theory by giving some instances. (a) The understanding of language acquisition by children or the emergence of languages in early human cultures. (b) In Manufacturing Engineering, the design of a new wave of machines is anticipated which uses sensors to sample properties of objects before, during, and after treatment. The information gathered from these samples is to be analyzed by the machine to decide how to better deal with new input objects (see [43]). (c) Pattern recognition of objects ranging from handwritten letters of the alphabet to pictures of animals, to the human voice. Understanding the laws of learning plays a large role in disciplines such as (Cognitive) Psychology, Animal Behavior, Economic Decision Making, all branches of Engineering, Computer Science, and especially the study of human thought processes (how the brain works). Mathematics has already played a big role towards the goal of giving a universal foundation of studies in these disciplines. We mention as examples the theory of Neural Networks going back to McCulloch and Pitts [25] and Minsky and Papert [27], the PAC learning of Valiant [40], Statistical Learning Theory as developed by Vapnik [42], and the use of reproducing kernels as in [17] among many other mathematical developments. We are heavily indebted to these developments. Recent discussions with a number of mathematicians have also been helpful. In", "year": 2001, "referenceCount": 52, "citationCount": 1504, "influentialCitationCount": 166, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1755208", "name": "F. Cucker"}, {"authorId": "34911188", "name": "S. Smale"}]}, {"paperId": "6fdb77260fc83dff91c44fea0f31a2cb8ed13d04", "url": "https://www.semanticscholar.org/paper/6fdb77260fc83dff91c44fea0f31a2cb8ed13d04", "title": "Scaling learning algorithms towards AI", "abstract": "One long-term goal of machine learning research is to produce methods that are applicable to highly complex tasks, such as perception (vision, audition), reasoning, intelligent control, and other artificially intelligent behaviors. We argue that in order to progress toward this goal, the Machine Learning community must endeavor to discover algorithms that can learn highly complex functions, with minimal need for prior knowledge, and with minimal human intervention. We present mathematical and empirical evidence suggesting that many popular approaches to non-parametric learning, particularly kernel methods, are fundamentally limited in their ability to learn complex high-dimensional functions. Our analysis focuses on two problems. First, kernel machines are shallow architectures, in which one large layer of simple template matchers is followed by a single layer of trainable coefficients. We argue that shallow architectures can be very inefficient in terms of required number of computational elements and examples. Second, we analyze a limitation of kernel machines with a local kernel, linked to the curse of dimensionality, that applies to supervised, unsupervised (manifold learning) and semi-supervised kernel machines. Using empirical results on invariant image recognition tasks, kernel methods are compared with deep architectures, in which lower-level features or concepts are progressively combined into more abstract and higher-level representations. We argue that deep architectures have the potential to generalize in non-local ways, i.e., beyond immediate neighbors, and that this is crucial in order to make progress on the kind of complex tasks required for artificial intelligence.", "year": 2007, "referenceCount": 53, "citationCount": 1174, "influentialCitationCount": 50, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1751762", "name": "Yoshua Bengio"}, {"authorId": "1688882", "name": "Yann LeCun"}]}, {"paperId": "2a1724427b9c473e73f6abff648e7416269d3a68", "url": "https://www.semanticscholar.org/paper/2a1724427b9c473e73f6abff648e7416269d3a68", "title": "Cooperative Multi-Agent Learning: The State of the Art", "abstract": null, "year": 2005, "referenceCount": 420, "citationCount": 1252, "influentialCitationCount": 69, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1703826", "name": "Liviu Panait"}, {"authorId": "1706276", "name": "S. Luke"}]}, {"paperId": "0ca26f9a98dda0abb737692f72ffa682df14cb2f", "url": "https://www.semanticscholar.org/paper/0ca26f9a98dda0abb737692f72ffa682df14cb2f", "title": "Sparse Bayesian learning for basis selection", "abstract": "Sparse Bayesian learning (SBL) and specifically relevance vector machines have received much attention in the machine learning literature as a means of achieving parsimonious representations in the context of regression and classification. The methodology relies on a parameterized prior that encourages models with few nonzero weights. In this paper, we adapt SBL to the signal processing problem of basis selection from overcomplete dictionaries, proving several results about the SBL cost function that elucidate its general behavior and provide solid theoretical justification for this application. Specifically, we have shown that SBL retains a desirable property of the /spl lscr//sub 0/-norm diversity measure (i.e., the global minimum is achieved at the maximally sparse solution) while often possessing a more limited constellation of local minima. We have also demonstrated that the local minima that do exist are achieved at sparse solutions. Later, we provide a novel interpretation of SBL that gives us valuable insight into why it is successful in producing sparse representations. Finally, we include simulation studies comparing sparse Bayesian learning with basis pursuit and the more recent FOCal Underdetermined System Solver (FOCUSS) class of basis selection algorithms. These results indicate that our theoretical insights translate directly into improved performance.", "year": 2004, "referenceCount": 38, "citationCount": 1164, "influentialCitationCount": 162, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2242717", "name": "D. Wipf"}, {"authorId": "144876925", "name": "B. Rao"}]}, {"paperId": "177944150565195ee9c3e28dc6b032200cfda059", "url": "https://www.semanticscholar.org/paper/177944150565195ee9c3e28dc6b032200cfda059", "title": "Collaborative Learning: Cognitive and Computational Approaches", "abstract": "Acknowledgement. Contributors. Introduction: what do you mean by 'collaborative learning'? (P. Dillenbourg). Learning together: understanding the processes of computer-based collaborative learning (K. Littleton, P. Hakkinen). The role of grounding in collaborative learning tasks (M. Baker et al.). What is \"multi\" in multi-agent learning? (G. Weiss, P. Dillenbourg). Comparing human-human and robot-robot interactions (R. Joiner et al.). Learning by explaining to oneself and to others (R. Ploetzner et al.). Knowledge transformations in agents and interactions: a comparison of machine learning and dialogue operators (E. Mephu Nguifo et al.). Can analytic models support learning in groups? (H.U. Hoppe, R. Ploetzner). Using telematics for collaborative knowledge construction (T. Hansen et al.). The productive agency that drives collaborative learning (D. Schwatrtz). References. Index.", "year": 1999, "referenceCount": 0, "citationCount": 1335, "influentialCitationCount": 74, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1799133", "name": "P. Dillenbourg"}, {"authorId": "1799133", "name": "P. Dillenbourg"}, {"authorId": "1605198613", "name": "Dillenbourg"}]}, {"paperId": "abe0bd94e134c7ac0b1c78922ed17cf3bec08d5e", "url": "https://www.semanticscholar.org/paper/abe0bd94e134c7ac0b1c78922ed17cf3bec08d5e", "title": "A stochastic model of human-machine interaction for learning dialog strategies", "abstract": "We propose a quantitative model for dialog systems that can be used for learning the dialog strategy. We claim that the problem of dialog design can be formalized as an optimization problem with an objective function reflecting different dialog dimensions relevant for a given application. We also show that any dialog system can be formally described as a sequential decision process in terms of its state space, action set, and strategy. With additional assumptions about the state transition probabilities and cost assignment, a dialog system can be mapped to a stochastic model known as Markov decision process (MDP). A variety of data driven algorithms for finding the optimal strategy (i.e., the one that optimizes the criterion) is available within the MDP framework, based on reinforcement learning. For an effective use of the available training data we propose a combination of supervised and reinforcement learning: the supervised learning is used to estimate a model of the user, i.e., the MDP parameters that quantify the user's behavior. Then a reinforcement learning algorithm is used to estimate the optimal strategy while the system interacts with the simulated user. This approach is tested for learning the strategy in an air travel information system (ATIS) task. The experimental results we present in this paper show that it is indeed possible to find a simple criterion, a state space representation, and a simulated user parameterization in order to automatically learn a relatively complex dialog behavior, similar to one that was heuristically designed by several research groups.", "year": 2000, "referenceCount": 36, "citationCount": 588, "influentialCitationCount": 45, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8992604", "name": "E. Levin"}, {"authorId": "2115311", "name": "R. Pieraccini"}, {"authorId": "31717617", "name": "W. Eckert"}]}, {"paperId": "a13efb90f0b56417bf5dd5b6219681c4259ff355", "url": "https://www.semanticscholar.org/paper/a13efb90f0b56417bf5dd5b6219681c4259ff355", "title": "The Cerebellum: A Neuronal Learning Machine?", "abstract": "Comparison of two seemingly quite different behaviors yields a surprisingly consistent picture of the role of the cerebellum in motor learning. Behavioral and physiological data about classical conditioning of the eyelid response and motor learning in the vestibulo-ocular reflex suggest that (i) plasticity is distributed between the cerebellar cortex and the deep cerebellar nuclei; (ii) the cerebellar cortex plays a special role in learning the timing of movement; and (iii) the cerebellar cortex guides learning in the deep nuclei, which may allow learning to be transferred from the cortex to the deep nuclei. Because many of the similarities in the data from the two systems typify general features of cerebellar organization, the cerebellar mechanisms of learning in these two systems may represent principles that apply to many motor systems.", "year": 1996, "referenceCount": 67, "citationCount": 618, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "144545670", "name": "J. Raymond"}, {"authorId": "2486944", "name": "S. Lisberger"}, {"authorId": "3002354", "name": "M. Mauk"}]}, {"paperId": "73e1c4a1152a75ec7310adfb4b8daea16d627bc7", "url": "https://www.semanticscholar.org/paper/73e1c4a1152a75ec7310adfb4b8daea16d627bc7", "title": "Learning to learn with the informative vector machine", "abstract": "This paper describes an efficient method for learning the parameters of a Gaussian process (GP). The parameters are learned from multiple tasks which are assumed to have been drawn independently from the same GP prior. An efficient algorithm is obtained by extending the informative vector machine (IVM) algorithm to handle the multi-task learning case. The multi-task IVM (MTIVM) saves computation by greedily selecting the most informative examples from the separate tasks. The MT-IVM is also shown to be more efficient than random sub-sampling on an artificial data-set and more effective than the traditional IVM in a speaker dependent phoneme recognition task.", "year": 2004, "referenceCount": 11, "citationCount": 359, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145306271", "name": "Neil D. Lawrence"}, {"authorId": "144189092", "name": "John C. Platt"}]}, {"paperId": "efbeedfbf13db70878618553f0c4a0fec6f493fe", "url": "https://www.semanticscholar.org/paper/efbeedfbf13db70878618553f0c4a0fec6f493fe", "title": "Learning Collaborative Information Filters", "abstract": "Predicting items a user would like on the basis of other users’ ratings for these items has become a well-established strategy adopted by many recommendation services on the Internet. Although this can be seen as a classification problem, algorithms proposed thus far do not draw on results from the machine learning literature. We propose a representation for collaborative filtering tasks that allows the application of virtually any machine learning algorithm. We identify the shortcomings of current collaborative filtering techniques and propose the use of learning algorithms paired with feature extraction techniques that specifically address the limitations of previous approaches. Our best-performing algorithm is based on the singular value decomposition of an initial matrix of user ratings, exploiting latent structure that essentially eliminates the need for users to rate common items in order to become predictors for one another's preferences. We evaluate the proposed algorithm on a large database of user ratings for motion pictures and find that our approach significantly outperforms current collaborative filtering algorithms.", "year": 1998, "referenceCount": 13, "citationCount": 1239, "influentialCitationCount": 98, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1691741", "name": "Daniel Billsus"}, {"authorId": "1694780", "name": "M. Pazzani"}]}, {"paperId": "70ee44786510db7c361aeaab6f37cc008bc9701e", "url": "https://www.semanticscholar.org/paper/70ee44786510db7c361aeaab6f37cc008bc9701e", "title": "The elements of statistical learning: data mining, inference and prediction", "abstract": null, "year": 2005, "referenceCount": 0, "citationCount": 989, "influentialCitationCount": 112, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145170400", "name": "J. Franklin"}]}, {"paperId": "af3f67b6639a50fd094e1467a2f3b6b8fef7c7c2", "url": "https://www.semanticscholar.org/paper/af3f67b6639a50fd094e1467a2f3b6b8fef7c7c2", "title": "Transformers: State-of-the-Art Natural Language Processing", "abstract": "Recent progress in natural language processing has been driven by advances in both model architecture and model pretraining. Transformer architectures have facilitated building higher-capacity models and pretraining has made it possible to effectively utilize this capacity for a wide variety of tasks. Transformers is an open-source library with the goal of opening up these advances to the wider machine learning community. The library consists of carefully engineered state-of-the art Transformer architectures under a unified API. Backing this library is a curated collection of pretrained models made by and available for the community. Transformers is designed to be extensible by researchers, simple for practitioners, and fast and robust in industrial deployments. The library is available at https://github.com/huggingface/transformers.", "year": 2019, "referenceCount": 42, "citationCount": 3391, "influentialCitationCount": 131, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50335211", "name": "Thomas Wolf"}, {"authorId": "1380459402", "name": "Lysandre Debut"}, {"authorId": "51918868", "name": "Victor Sanh"}, {"authorId": "40811585", "name": "Julien Chaumond"}, {"authorId": "40899333", "name": "Clement Delangue"}, {"authorId": "1382164294", "name": "Anthony Moi"}, {"authorId": "1382164165", "name": "Pierric Cistac"}, {"authorId": "1382164170", "name": "T. Rault"}, {"authorId": "2185329", "name": "Rémi Louf"}, {"authorId": "97662964", "name": "Morgan Funtowicz"}, {"authorId": "1383218348", "name": "Jamie Brew"}]}, {"paperId": "e65ff1c44144d89684d089b5bad5405dc373fe30", "url": "https://www.semanticscholar.org/paper/e65ff1c44144d89684d089b5bad5405dc373fe30", "title": "Fully complex extreme learning machine", "abstract": null, "year": 2005, "referenceCount": 14, "citationCount": 329, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3201321", "name": "Ming-Bin Li"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "1800678", "name": "P. Saratchandran"}, {"authorId": "145411276", "name": "N. Sundararajan"}]}, {"paperId": "605402e235bd62437baf3c9ebefe77fb4d92ee95", "url": "https://www.semanticscholar.org/paper/605402e235bd62437baf3c9ebefe77fb4d92ee95", "title": "The Helmholtz Machine", "abstract": "Discovering the structure inherent in a set of patterns is a fundamental aim of statistical inference or learning. One fruitful approach is to build a parameterized stochastic generative model, independent draws from which are likely to produce the patterns. For all but the simplest generative models, each pattern can be generated in exponentially many ways. It is thus intractable to adjust the parameters to maximize the probability of the observed patterns. We describe a way of finessing this combinatorial explosion by maximizing an easily computed lower bound on the probability of the observations. Our method can be viewed as a form of hierarchical self-supervised learning that may relate to the function of bottom-up and top-down cortical processing pathways.", "year": 1995, "referenceCount": 38, "citationCount": 1217, "influentialCitationCount": 77, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine", "Mathematics"], "authors": [{"authorId": "1790646", "name": "P. Dayan"}, {"authorId": "1695689", "name": "Geoffrey E. Hinton"}, {"authorId": "1764325", "name": "Radford M. Neal"}, {"authorId": "1804104", "name": "R. Zemel"}]}, {"paperId": "2ebdfa3852e4ad68a0cfde9f0f69b95953d69178", "url": "https://www.semanticscholar.org/paper/2ebdfa3852e4ad68a0cfde9f0f69b95953d69178", "title": "On-Line Sequential Extreme Learning Machine", "abstract": "The primitive Extreme Learning Machine (ELM) [1, 2, 3] with additive neurons and RBF kernels was implemented in batch mode. In this paper, its sequential modification based on recursive least-squares (RLS) algorithm, which referred as Online Sequential Extreme Learning Machine (OS-ELM), is introduced. Based on OS-ELM, Online Sequential Fuzzy Extreme Learning Machine (Fuzzy-ELM) is also introduced to implement zero order TSK model and first order TSK model. The performance of OS-ELM and Fuzzy-ELM are evaluated and compared with other popular sequential learning algorithms, and experimental results on some real benchmark regression problems show that the proposedOnlineSequentialExtreme Learning Machine (OS-ELM) produces better generalization performance at very fast learning speed.", "year": 2005, "referenceCount": 14, "citationCount": 194, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145678691", "name": "G. Huang"}, {"authorId": "2972859", "name": "Nan-Ying Liang"}, {"authorId": "2774247", "name": "Hai-Jun Rong"}, {"authorId": "1800678", "name": "P. Saratchandran"}, {"authorId": "145411276", "name": "N. Sundararajan"}]}, {"paperId": "12cac86b9cb5557d7f75b6fbcab0bac40b5f7995", "url": "https://www.semanticscholar.org/paper/12cac86b9cb5557d7f75b6fbcab0bac40b5f7995", "title": "Explainable Artificial Intelligence (XAI)", "abstract": "The field of explainable artificial intelligence (XAI) advances techniques, processes, and strategies that provide explanations for the predictions, recommendations, and decisions of opaque and complex machine learning systems. Increasingly academic libraries are providing library users with systems, services, and collections created and delivered by machine learning. Academic libraries should adopt XAI as a tool set to verify and validate these resources, and advocate for public policy regarding XAI that serves libraries, the academy, and the public interest.", "year": 2022, "referenceCount": 14, "citationCount": 529, "influentialCitationCount": 43, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "48279064", "name": "M. Ridley"}]}, {"paperId": "41fef1a197fab9684a4608b725d3ae72e1ab4b39", "url": "https://www.semanticscholar.org/paper/41fef1a197fab9684a4608b725d3ae72e1ab4b39", "title": "Sparse Feature Learning for Deep Belief Networks", "abstract": "Unsupervised learning algorithms aim to discover the structure hidden in the data, and to learn representations that are more suitable as input to a supervised machine than the raw input. Many unsupervised methods are based on reconstructing the input from the representation, while constraining the representation to have certain desirable properties (e.g. low dimension, sparsity, etc). Others are based on approximating density by stochastically reconstructing the input from the representation. We describe a novel and efficient algorithm to learn sparse representations, and compare it theoretically and experimentally with a similar machine trained probabilistically, namely a Restricted Boltzmann Machine. We propose a simple criterion to compare and select different unsupervised machines based on the trade-off between the reconstruction error and the information content of the representation. We demonstrate this method by extracting features from a dataset of handwritten numerals, and from a dataset of natural image patches. We show that by stacking multiple levels of such machines and by training sequentially, high-order dependencies between the input observed variables can be captured.", "year": 2007, "referenceCount": 26, "citationCount": 859, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1706809", "name": "Marc'Aurelio Ranzato"}, {"authorId": "90841478", "name": "Y-Lan Boureau"}, {"authorId": "1688882", "name": "Yann LeCun"}]}, {"paperId": "81a4fd3004df0eb05d6c1cef96ad33d5407820df", "url": "https://www.semanticscholar.org/paper/81a4fd3004df0eb05d6c1cef96ad33d5407820df", "title": "A Comprehensive Survey on Graph Neural Networks", "abstract": "Deep learning has revolutionized many machine learning tasks in recent years, ranging from image classification and video processing to speech recognition and natural language understanding. The data in these tasks are typically represented in the Euclidean space. However, there is an increasing number of applications, where data are generated from non-Euclidean domains and are represented as graphs with complex relationships and interdependency between objects. The complexity of graph data has imposed significant challenges on the existing machine learning algorithms. Recently, many studies on extending deep learning approaches for graph data have emerged. In this article, we provide a comprehensive overview of graph neural networks (GNNs) in data mining and machine learning fields. We propose a new taxonomy to divide the state-of-the-art GNNs into four categories, namely, recurrent GNNs, convolutional GNNs, graph autoencoders, and spatial–temporal GNNs. We further discuss the applications of GNNs across various domains and summarize the open-source codes, benchmark data sets, and model evaluation of GNNs. Finally, we propose potential research directions in this rapidly growing field.", "year": 2019, "referenceCount": 193, "citationCount": 3542, "influentialCitationCount": 266, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "2109557884", "name": "Zonghan Wu"}, {"authorId": "2585415", "name": "Shirui Pan"}, {"authorId": "31370754", "name": "Fengwen Chen"}, {"authorId": "2062835", "name": "Guodong Long"}, {"authorId": "32076894", "name": "Chengqi Zhang"}, {"authorId": "144019071", "name": "Philip S. Yu"}]}, {"paperId": "b36a5bb1707bb9c70025294b3a310138aae8327a", "url": "https://www.semanticscholar.org/paper/b36a5bb1707bb9c70025294b3a310138aae8327a", "title": "Automatic differentiation in PyTorch", "abstract": "In this article, we describe an automatic differentiation module of PyTorch — a library designed to enable rapid research on machine learning models. It builds upon a few projects, most notably Lua Torch, Chainer, and HIPS Autograd [4], and provides a high performance environment with easy access to automatic differentiation of models executed on different devices (CPU and GPU). To make prototyping easier, PyTorch does not follow the symbolic approach used in many other deep learning frameworks, but focuses on differentiation of purely imperative programs, with a focus on extensibility and low overhead. Note that this preprint is a draft of certain sections from an upcoming paper covering all PyTorch features.", "year": 2017, "referenceCount": 6, "citationCount": 11413, "influentialCitationCount": 1329, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3407277", "name": "Adam Paszke"}, {"authorId": "39793298", "name": "S. Gross"}, {"authorId": "2127604", "name": "Soumith Chintala"}, {"authorId": "114250963", "name": "Gregory Chanan"}, {"authorId": "2052812305", "name": "E. Yang"}, {"authorId": "2375710", "name": "Zach DeVito"}, {"authorId": "3370429", "name": "Zeming Lin"}, {"authorId": "3050846", "name": "Alban Desmaison"}, {"authorId": "3029482", "name": "L. Antiga"}, {"authorId": "1977806", "name": "Adam Lerer"}]}, {"paperId": "81600fd653a828d69f6160705be6814dd101beb7", "url": "https://www.semanticscholar.org/paper/81600fd653a828d69f6160705be6814dd101beb7", "title": "From local explanations to global understanding with explainable AI for trees", "abstract": null, "year": 2020, "referenceCount": 46, "citationCount": 1589, "influentialCitationCount": 171, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "23451726", "name": "Scott M. Lundberg"}, {"authorId": "6579861", "name": "G. Erion"}, {"authorId": "2616600", "name": "Hugh Chen"}, {"authorId": "50731529", "name": "A. DeGrave"}, {"authorId": "3869000", "name": "J. Prutkin"}, {"authorId": "2447936", "name": "B. Nair"}, {"authorId": "2740105", "name": "R. Katz"}, {"authorId": "3538555", "name": "J. Himmelfarb"}, {"authorId": "34451449", "name": "N. Bansal"}, {"authorId": "2180463", "name": "Su-In Lee"}]}, {"paperId": "3a288c63576fc385910cb5bc44eaea75b442e62e", "url": "https://www.semanticscholar.org/paper/3a288c63576fc385910cb5bc44eaea75b442e62e", "title": "UMAP: Uniform Manifold Approximation and Projection for Dimension Reduction", "abstract": "UMAP (Uniform Manifold Approximation and Projection) is a novel manifold learning technique for dimension reduction. UMAP is constructed from a theoretical framework based in Riemannian geometry and algebraic topology. The result is a practical scalable algorithm that applies to real world data. The UMAP algorithm is competitive with t-SNE for visualization quality, and arguably preserves more of the global structure with superior run time performance. Furthermore, UMAP has no computational restrictions on embedding dimension, making it viable as a general purpose dimension reduction technique for machine learning.", "year": 2018, "referenceCount": 62, "citationCount": 4541, "influentialCitationCount": 837, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "31785573", "name": "Leland McInnes"}, {"authorId": "2062756303", "name": "John Healy"}]}, {"paperId": "34f25a8704614163c4095b3ee2fc969b60de4698", "url": "https://www.semanticscholar.org/paper/34f25a8704614163c4095b3ee2fc969b60de4698", "title": "Dropout: a simple way to prevent neural networks from overfitting", "abstract": "Deep neural nets with a large number of parameters are very powerful machine learning systems. However, overfitting is a serious problem in such networks. Large networks are also slow to use, making it difficult to deal with overfitting by combining the predictions of many different large neural nets at test time. Dropout is a technique for addressing this problem. The key idea is to randomly drop units (along with their connections) from the neural network during training. This prevents units from co-adapting too much. During training, dropout samples from an exponential number of different \"thinned\" networks. At test time, it is easy to approximate the effect of averaging the predictions of all these thinned networks by simply using a single unthinned network that has smaller weights. This significantly reduces overfitting and gives major improvements over other regularization methods. We show that dropout improves the performance of neural networks on supervised learning tasks in vision, speech recognition, document classification and computational biology, obtaining state-of-the-art results on many benchmark data sets.", "year": 2014, "referenceCount": 39, "citationCount": 30823, "influentialCitationCount": 2516, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2897313", "name": "Nitish Srivastava"}, {"authorId": "1695689", "name": "Geoffrey E. Hinton"}, {"authorId": "2064160", "name": "A. Krizhevsky"}, {"authorId": "1701686", "name": "Ilya Sutskever"}, {"authorId": "145124475", "name": "R. Salakhutdinov"}]}, {"paperId": "bee044c8e8903fb67523c1f8c105ab4718600cdb", "url": "https://www.semanticscholar.org/paper/bee044c8e8903fb67523c1f8c105ab4718600cdb", "title": "Explaining and Harnessing Adversarial Examples", "abstract": "Several machine learning models, including neural networks, consistently misclassify adversarial examples---inputs formed by applying small but intentionally worst-case perturbations to examples from the dataset, such that the perturbed input results in the model outputting an incorrect answer with high confidence. Early attempts at explaining this phenomenon focused on nonlinearity and overfitting. We argue instead that the primary cause of neural networks' vulnerability to adversarial perturbation is their linear nature. This explanation is supported by new quantitative results while giving the first explanation of the most intriguing fact about them: their generalization across architectures and training sets. Moreover, this view yields a simple and fast method of generating adversarial examples. Using this approach to provide examples for adversarial training, we reduce the test set error of a maxout network on the MNIST dataset.", "year": 2014, "referenceCount": 19, "citationCount": 11648, "influentialCitationCount": 3170, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "153440022", "name": "Ian J. Goodfellow"}, {"authorId": "1789737", "name": "Jonathon Shlens"}, {"authorId": "2574060", "name": "Christian Szegedy"}]}, {"paperId": "899defb6a100af509547b8d74bb626533ee87da4", "url": "https://www.semanticscholar.org/paper/899defb6a100af509547b8d74bb626533ee87da4", "title": "Measuring the VC-Dimension of a Learning Machine", "abstract": "A method for measuring the capacity of learning machines is described. The method is based on fitting a theoretically derived function to empirical measurements of the maximal difference between the error rates on two separate data sets of varying sizes. Experimental measurements of the capacity of various types of linear classifiers are presented.", "year": 1994, "referenceCount": 12, "citationCount": 359, "influentialCitationCount": 35, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "50560492", "name": "V. Vapnik"}, {"authorId": "8992604", "name": "E. Levin"}, {"authorId": "1688882", "name": "Yann LeCun"}]}, {"paperId": "26bc9195c6343e4d7f434dd65b4ad67efe2be27a", "url": "https://www.semanticscholar.org/paper/26bc9195c6343e4d7f434dd65b4ad67efe2be27a", "title": "XGBoost: A Scalable Tree Boosting System", "abstract": "Tree boosting is a highly effective and widely used machine learning method. In this paper, we describe a scalable end-to-end tree boosting system called XGBoost, which is used widely by data scientists to achieve state-of-the-art results on many machine learning challenges. We propose a novel sparsity-aware algorithm for sparse data and weighted quantile sketch for approximate tree learning. More importantly, we provide insights on cache access patterns, data compression and sharding to build a scalable tree boosting system. By combining these insights, XGBoost scales beyond billions of examples using far fewer resources than existing systems.", "year": 2016, "referenceCount": 26, "citationCount": 16834, "influentialCitationCount": 2343, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1913774", "name": "Tianqi Chen"}, {"authorId": "1730156", "name": "Carlos Guestrin"}]}, {"paperId": "5091316bb1c6db6c6a813f4391911a5c311fdfe0", "url": "https://www.semanticscholar.org/paper/5091316bb1c6db6c6a813f4391911a5c311fdfe0", "title": "“Why Should I Trust You?”: Explaining the Predictions of Any Classifier", "abstract": "Despite widespread adoption, machine learning models remain mostly black boxes. Understanding the reasons behind predictions is, however, quite important in assessing trust, which is fundamental if one plans to take action based on a prediction, or when choosing whether to deploy a new model. Such understanding also provides insights into the model, which can be used to transform an untrustworthy model or prediction into a trustworthy one. In this work, we propose LIME, a novel explanation technique that explains the predictions of any classifier in an interpretable and faithful manner, by learning an interpretable model locally varound the prediction. We also propose a method to explain models by presenting representative individual predictions and their explanations in a non-redundant way, framing the task as a submodular optimization problem. We demonstrate the flexibility of these methods by explaining different models for text (e.g. random forests) and image classification (e.g. neural networks). We show the utility of explanations via novel experiments, both simulated and with human subjects, on various scenarios that require trust: deciding if one should trust a prediction, choosing between models, improving an untrustworthy classifier, and identifying why a classifier should not be trusted.", "year": 2016, "referenceCount": 41, "citationCount": 8857, "influentialCitationCount": 1299, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "78846919", "name": "Marco Tulio Ribeiro"}, {"authorId": "34650964", "name": "Sameer Singh"}, {"authorId": "1730156", "name": "Carlos Guestrin"}]}, {"paperId": "3e708b0cd19818e0c7408765dd922835661f8a24", "url": "https://www.semanticscholar.org/paper/3e708b0cd19818e0c7408765dd922835661f8a24", "title": "Classification and regression trees", "abstract": "Classification and regression trees are machine‐learning methods for constructing prediction models from data. The models are obtained by recursively partitioning the data space and fitting a simple prediction model within each partition. As a result, the partitioning can be represented graphically as a decision tree. Classification trees are designed for dependent variables that take a finite number of unordered values, with prediction error measured in terms of misclassification cost. Regression trees are for dependent variables that take continuous or ordered discrete values, with prediction error typically measured by the squared difference between the observed and predicted values. This article gives an introduction to the subject by reviewing some widely available algorithms and comparing their capabilities, strengths, and weakness in two examples. © 2011 John Wiley & Sons, Inc. WIREs Data Mining Knowl Discov 2011 1 14‐23 DOI: 10.1002/widm.8", "year": 2011, "referenceCount": 67, "citationCount": 21043, "influentialCitationCount": 1685, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1887059", "name": "W. Loh"}]}, {"paperId": "273dfbcb68080251f5e9ff38b4413d7bd84b10a1", "url": "https://www.semanticscholar.org/paper/273dfbcb68080251f5e9ff38b4413d7bd84b10a1", "title": "LIBSVM: A library for support vector machines", "abstract": "LIBSVM is a library for Support Vector Machines (SVMs). We have been actively developing this package since the year 2000. The goal is to help users to easily apply SVM to their applications. LIBSVM has gained wide popularity in machine learning and many other areas. In this article, we present all implementation details of LIBSVM. Issues such as solving SVM optimization problems theoretical convergence multiclass classification probability estimates and parameter selection are discussed in detail.", "year": 2011, "referenceCount": 59, "citationCount": 41249, "influentialCitationCount": 3913, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": null, "name": "Chih-Chung Chang"}, {"authorId": "1711460", "name": "Chih-Jen Lin"}]}, {"paperId": "46bed4c578e96e05fa3e5704620c4ffa0746d78f", "url": "https://www.semanticscholar.org/paper/46bed4c578e96e05fa3e5704620c4ffa0746d78f", "title": "A Learning Machine: Part I", "abstract": "Machines would be more useful if they could learn to perform tasks for which they were not given precise methods. Difficulties that attend giving a machine this ability are discussed. It is proposed that the program of a stored-program computer be gradually improved by a learning procedure which tries many programs and chooses, from the instructions that may occupy a given location, the one most often associated with a successful result. An experimental test of this principle is described in detail. Preliminary results, which show limited success, are reported and interpreted. Further results and conclusions will appear in the second part of the paper.", "year": 1958, "referenceCount": 0, "citationCount": 420, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40425341", "name": "R. Friedberg"}]}, {"paperId": "38f23fe236b152cd4983c8f30d305a568afd0d3e", "url": "https://www.semanticscholar.org/paper/38f23fe236b152cd4983c8f30d305a568afd0d3e", "title": "A Survey on Explainable Artificial Intelligence (XAI): Toward Medical XAI", "abstract": "Recently, artificial intelligence and machine learning in general have demonstrated remarkable performances in many tasks, from image processing to natural language processing, especially with the advent of deep learning (DL). Along with research progress, they have encroached upon many different fields and disciplines. Some of them require high level of accountability and thus transparency, for example, the medical sector. Explanations for machine decisions and predictions are thus needed to justify their reliability. This requires greater interpretability, which often means we need to understand the mechanism underlying the algorithms. Unfortunately, the blackbox nature of the DL is still unresolved, and many machine decisions are still poorly understood. We provide a review on interpretabilities suggested by different research works and categorize them. The different categories show different dimensions in interpretability research, from approaches that provide “obviously” interpretable information to the studies of complex patterns. By applying the same categorization to interpretability in medical research, it is hoped that: 1) clinicians and practitioners can subsequently approach these methods with caution; 2) insight into interpretability will be born with more considerations for medical practices; and 3) initiatives to push forward data-based, mathematically grounded, and technically grounded medical education are encouraged.", "year": 2019, "referenceCount": 179, "citationCount": 501, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "71352570", "name": "Erico Tjoa"}, {"authorId": "145836900", "name": "Cuntai Guan"}]}, {"paperId": "554f3b32b956035fbfabba730c6f0300d6955dce", "url": "https://www.semanticscholar.org/paper/554f3b32b956035fbfabba730c6f0300d6955dce", "title": "Learning logical definitions from relations", "abstract": null, "year": 1990, "referenceCount": 49, "citationCount": 937, "influentialCitationCount": 129, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145341779", "name": "J. R. Quinlan"}]}, {"paperId": "8592e46a5435d18bba70557846f47290b34c1aa5", "url": "https://www.semanticscholar.org/paper/8592e46a5435d18bba70557846f47290b34c1aa5", "title": "Learning and relearning in Boltzmann machines", "abstract": "This chapter contains sections titled: Relaxation Searches, Easy and Hard Learning, The Boltzmann Machine Learning Algorithm, An Example of Hard Learning, Achieving Reliable Computation with Unreliable Hardware, An Example of the Effects of Damage, Conclusion, Acknowledgments, Appendix: Derivation of the Learning Algorithm, References", "year": 1986, "referenceCount": 0, "citationCount": 1363, "influentialCitationCount": 54, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1695689", "name": "Geoffrey E. Hinton"}, {"authorId": "1714528", "name": "T. Sejnowski"}]}, {"paperId": "085589ca53509ad27edd95827f7198b3ce107024", "url": "https://www.semanticscholar.org/paper/085589ca53509ad27edd95827f7198b3ce107024", "title": "A framework for variation discovery and genotyping using next-generation DNA sequencing data", "abstract": null, "year": 2011, "referenceCount": 42, "citationCount": 9187, "influentialCitationCount": 1031, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "2446263", "name": "M. DePristo"}, {"authorId": "145139019", "name": "E. Banks"}, {"authorId": "48663822", "name": "R. Poplin"}, {"authorId": "122006112", "name": "K. Garimella"}, {"authorId": "47191470", "name": "J. Maguire"}, {"authorId": "46573761", "name": "C. Hartl"}, {"authorId": "2545706", "name": "A. Philippakis"}, {"authorId": "5675200", "name": "G. Del Angel"}, {"authorId": "145764939", "name": "M. Rivas"}, {"authorId": "153576909", "name": "M. Hanna"}, {"authorId": "143965654", "name": "A. McKenna"}, {"authorId": "49209642", "name": "T. Fennell"}, {"authorId": "2425814", "name": "A. Kernytsky"}, {"authorId": "2147191", "name": "A. Sivachenko"}, {"authorId": "3251272", "name": "K. Cibulskis"}, {"authorId": "34428249", "name": "S. Gabriel"}, {"authorId": "1399529321", "name": "D. Altshuler"}, {"authorId": "144524355", "name": "M. Daly"}]}, {"paperId": "82635fb63640ae95f90ee9bdc07832eb461ca881", "url": "https://www.semanticscholar.org/paper/82635fb63640ae95f90ee9bdc07832eb461ca881", "title": "The Pascal Visual Object Classes (VOC) Challenge", "abstract": null, "year": 2010, "referenceCount": 62, "citationCount": 12846, "influentialCitationCount": 1954, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3056091", "name": "M. Everingham"}, {"authorId": "1681236", "name": "L. Gool"}, {"authorId": "145715698", "name": "Christopher K. I. Williams"}, {"authorId": "33652486", "name": "J. Winn"}, {"authorId": "1688869", "name": "Andrew Zisserman"}]}, {"paperId": "41f762a455ff8c26aa99be58fe6398722864f06e", "url": "https://www.semanticscholar.org/paper/41f762a455ff8c26aa99be58fe6398722864f06e", "title": "Learning from Data", "abstract": "This chapter contains sections titled: Learning Machine Statistical Learning Theory Types of Learning Methods Common Learning Tasks Model Estimation Review Questions and Problems References for further study", "year": 2011, "referenceCount": 0, "citationCount": 375, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9377104", "name": "M. Kantardzic"}]}, {"paperId": "5151d6cb3a4eaec14a56944d58338251fca344ab", "url": "https://www.semanticscholar.org/paper/5151d6cb3a4eaec14a56944d58338251fca344ab", "title": "Overcoming catastrophic forgetting in neural networks", "abstract": "Significance Deep neural networks are currently the most successful machine-learning technique for solving a variety of tasks, including language translation, image classification, and image generation. One weakness of such models is that, unlike humans, they are unable to learn multiple tasks sequentially. In this work we propose a practical solution to train such models sequentially by protecting the weights important for previous tasks. This approach, inspired by synaptic consolidation in neuroscience, enables state of the art results on multiple reinforcement learning problems experienced sequentially. The ability to learn tasks in a sequential fashion is crucial to the development of artificial intelligence. Until now neural networks have not been capable of this and it has been widely thought that catastrophic forgetting is an inevitable feature of connectionist models. We show that it is possible to overcome this limitation and train networks that can maintain expertise on tasks that they have not experienced for a long time. Our approach remembers old tasks by selectively slowing down learning on the weights important for those tasks. We demonstrate our approach is scalable and effective by solving a set of classification tasks based on a hand-written digit dataset and by learning several Atari 2600 games sequentially.", "year": 2016, "referenceCount": 47, "citationCount": 3277, "influentialCitationCount": 715, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "2066516991", "name": "J. Kirkpatrick"}, {"authorId": "1996134", "name": "Razvan Pascanu"}, {"authorId": "3422052", "name": "Neil C. Rabinowitz"}, {"authorId": "144056327", "name": "J. Veness"}, {"authorId": "2755582", "name": "Guillaume Desjardins"}, {"authorId": "2228824", "name": "Andrei A. Rusu"}, {"authorId": "8181864", "name": "K. Milan"}, {"authorId": "34660073", "name": "John Quan"}, {"authorId": "34505275", "name": "Tiago Ramalho"}, {"authorId": "1398898827", "name": "Agnieszka Grabska-Barwinska"}, {"authorId": "48987704", "name": "D. Hassabis"}, {"authorId": "2388737", "name": "C. Clopath"}, {"authorId": "2106164", "name": "D. Kumaran"}, {"authorId": "2315504", "name": "R. Hadsell"}]}, {"paperId": "b544ca32b66b4c9c69bcfa00d63ee4b799d8ab6b", "url": "https://www.semanticscholar.org/paper/b544ca32b66b4c9c69bcfa00d63ee4b799d8ab6b", "title": "Adversarial examples in the physical world", "abstract": "Most existing machine learning classifiers are highly vulnerable to adversarial examples. An adversarial example is a sample of input data which has been modified very slightly in a way that is intended to cause a machine learning classifier to misclassify it. In many cases, these modifications can be so subtle that a human observer does not even notice the modification at all, yet the classifier still makes a mistake. Adversarial examples pose security concerns because they could be used to perform an attack on machine learning systems, even if the adversary has no access to the underlying model. Up to now, all previous work have assumed a threat model in which the adversary can feed data directly into the machine learning classifier. This is not always the case for systems operating in the physical world, for example those which are using signals from cameras and other sensors as an input. This paper shows that even in such physical world scenarios, machine learning systems are vulnerable to adversarial examples. We demonstrate this by feeding adversarial images obtained from cell-phone camera to an ImageNet Inception classifier and measuring the classification accuracy of the system. We find that a large fraction of adversarial examples are classified incorrectly even when perceived through the camera.", "year": 2016, "referenceCount": 16, "citationCount": 3787, "influentialCitationCount": 730, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145714153", "name": "A. Kurakin"}, {"authorId": "153440022", "name": "Ian J. Goodfellow"}, {"authorId": "1751569", "name": "Samy Bengio"}]}, {"paperId": "a0858dd960c635c3e6294908b794fae52f66e42f", "url": "https://www.semanticscholar.org/paper/a0858dd960c635c3e6294908b794fae52f66e42f", "title": "Spark: Cluster Computing with Working Sets", "abstract": "MapReduce and its variants have been highly successful in implementing large-scale data-intensive applications on commodity clusters. However, most of these systems are built around an acyclic data flow model that is not suitable for other popular applications. This paper focuses on one such class of applications: those that reuse a working set of data across multiple parallel operations. This includes many iterative machine learning algorithms, as well as interactive data analysis tools. We propose a new framework called Spark that supports these applications while retaining the scalability and fault tolerance of MapReduce. To achieve these goals, Spark introduces an abstraction called resilient distributed datasets (RDDs). An RDD is a read-only collection of objects partitioned across a set of machines that can be rebuilt if a partition is lost. Spark can outperform Hadoop by 10x in iterative machine learning jobs, and can be used to interactively query a 39 GB dataset with sub-second response time.", "year": 2010, "referenceCount": 28, "citationCount": 5050, "influentialCitationCount": 923, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143834867", "name": "M. Zaharia"}, {"authorId": "2579531", "name": "M. Chowdhury"}, {"authorId": "143666627", "name": "M. Franklin"}, {"authorId": "143838343", "name": "S. Shenker"}, {"authorId": "144467753", "name": "I. Stoica"}]}, {"paperId": "5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "url": "https://www.semanticscholar.org/paper/5ded2b8c64491b4a67f6d39ce473d4b9347a672e", "title": "A Broad-Coverage Challenge Corpus for Sentence Understanding through Inference", "abstract": "This paper introduces the Multi-Genre Natural Language Inference (MultiNLI) corpus, a dataset designed for use in the development and evaluation of machine learning models for sentence understanding. At 433k examples, this resource is one of the largest corpora available for natural language inference (a.k.a. recognizing textual entailment), improving upon available resources in both its coverage and difficulty. MultiNLI accomplishes this by offering data from ten distinct genres of written and spoken English, making it possible to evaluate systems on nearly the full complexity of the language, while supplying an explicit setting for evaluating cross-genre domain adaptation. In addition, an evaluation using existing machine learning models designed for the Stanford NLI corpus shows that it represents a substantially more difficult task than does that corpus, despite the two showing similar levels of inter-annotator agreement.", "year": 2017, "referenceCount": 55, "citationCount": 2424, "influentialCitationCount": 575, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "81840293", "name": "Adina Williams"}, {"authorId": "10666396", "name": "Nikita Nangia"}, {"authorId": "3644767", "name": "Samuel R. Bowman"}]}, {"paperId": "13d4c2f76a7c1a4d0a71204e1d5d263a3f5a7986", "url": "https://www.semanticscholar.org/paper/13d4c2f76a7c1a4d0a71204e1d5d263a3f5a7986", "title": "Random Forests", "abstract": null, "year": 2001, "referenceCount": 19, "citationCount": 70525, "influentialCitationCount": 5386, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2423230", "name": "L. Breiman"}]}, {"paperId": "dc6ea0e30e46163b706f2f8bdc9c67ca87f83d63", "url": "https://www.semanticscholar.org/paper/dc6ea0e30e46163b706f2f8bdc9c67ca87f83d63", "title": "Rapid object detection using a boosted cascade of simple features", "abstract": "This paper describes a machine learning approach for visual object detection which is capable of processing images extremely rapidly and achieving high detection rates. This work is distinguished by three key contributions. The first is the introduction of a new image representation called the \"integral image\" which allows the features used by our detector to be computed very quickly. The second is a learning algorithm, based on AdaBoost, which selects a small number of critical visual features from a larger set and yields extremely efficient classifiers. The third contribution is a method for combining increasingly more complex classifiers in a \"cascade\" which allows background regions of the image to be quickly discarded while spending more computation on promising object-like regions. The cascade can be viewed as an object specific focus-of-attention mechanism which unlike previous approaches provides statistical guarantees that discarded regions are unlikely to contain the object of interest. In the domain of face detection the system yields detection rates comparable to the best previous systems. Used in real-time applications, the detector runs at 15 frames per second without resorting to image differencing or skin color detection.", "year": 2001, "referenceCount": 17, "citationCount": 18473, "influentialCitationCount": 1862, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1731948", "name": "Paul A. Viola"}, {"authorId": "145319478", "name": "Michael J. Jones"}]}, {"paperId": "98f8a0055bb28133efcff359a92937324d0e6f51", "url": "https://www.semanticscholar.org/paper/98f8a0055bb28133efcff359a92937324d0e6f51", "title": "A Perspective View and Survey of Meta-Learning", "abstract": null, "year": 2002, "referenceCount": 92, "citationCount": 920, "influentialCitationCount": 35, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34706692", "name": "R. Vilalta"}, {"authorId": "2089204999", "name": "Youssef Drissi"}]}, {"paperId": "04b23f577c20d1a0e2a67aadda555f58e6d23d6e", "url": "https://www.semanticscholar.org/paper/04b23f577c20d1a0e2a67aadda555f58e6d23d6e", "title": "Support Vector Machines", "abstract": "This book explains the principles that make support vector machines (SVMs) a successful modelling and prediction tool for a variety of applications. The authors present the basic ideas of SVMs together with the latest developments and current research questions in a unified style. They identify three reasons for the success of SVMs: their ability to learn well with only a very small number of free parameters, their robustness against several types of model violations and outliers, and their computational efficiency compared to several other methods. Since their appearance in the early nineties, support vector machines and related kernel-based methods have been successfully applied in diverse fields of application such as bioinformatics, fraud detection, construction of insurance tariffs, direct marketing, and data and text mining. As a consequence, SVMs now play an important role in statistical machine learning and are used not only by statisticians, mathematicians, and computer scientists, but also by engineers and data analysts. The book provides a unique in-depth treatment of both fundamental and recent material on SVMs that so far has been scattered in the literature. The book can thus serve as both a basis for graduate courses and an introduction for statisticians, mathematicians, and computer scientists. It further provides a valuable reference for researchers working in the field. The book covers all important topics concerning support vector machines such as: loss functions and their role in the learning process; reproducing kernel Hilbert spaces and their properties; a thorough statistical analysis that uses both traditional uniform bounds and more advanced localized techniques based on Rademacher averages and Talagrand's inequality; a detailed treatment of classification and regression; a detailed robustness analysis; and a description of some of the most recent implementation techniques. To make the book self-contained, an extensive appendix is added which provides the reader with the necessary background from statistics, probability theory, functional analysis, convex analysis, and topology.", "year": 2008, "referenceCount": 51, "citationCount": 5182, "influentialCitationCount": 785, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1782193", "name": "Ingo Steinwart"}, {"authorId": "2534678", "name": "A. Christmann"}]}, {"paperId": "09879f7956dddc2a9328f5c1472feeb8402bcbcf", "url": "https://www.semanticscholar.org/paper/09879f7956dddc2a9328f5c1472feeb8402bcbcf", "title": "Density estimation using Real NVP", "abstract": "Unsupervised learning of probabilistic models is a central yet challenging problem in machine learning. Specifically, designing models with tractable learning, sampling, inference and evaluation is crucial in solving this task. We extend the space of such models using real-valued non-volume preserving (real NVP) transformations, a set of powerful invertible and learnable transformations, resulting in an unsupervised learning algorithm with exact log-likelihood computation, exact sampling, exact inference of latent variables, and an interpretable latent space. We demonstrate its ability to model natural images on four datasets through sampling, log-likelihood evaluation and latent variable manipulations.", "year": 2016, "referenceCount": 78, "citationCount": 2116, "influentialCitationCount": 506, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "46573521", "name": "Laurent Dinh"}, {"authorId": "1407546424", "name": "Jascha Narain Sohl-Dickstein"}, {"authorId": "1751569", "name": "Samy Bengio"}]}, {"paperId": "b84276fe751ca4f1389549281383b151a746107b", "url": "https://www.semanticscholar.org/paper/b84276fe751ca4f1389549281383b151a746107b", "title": "Statistical language learning", "abstract": "From the Publisher: \nEugene Charniak breaks new ground in artificial intelligence research by presenting statistical language processing from an artificial intelligence point of view in a text for researchers and scientists with a traditional computer science background. \nNew, exacting empirical methods are needed to break the deadlock in such areas of artificial intelligence as robotics, knowledge representation, machine learning, machine translation, and natural language processing (NLP). It is time, Charniak observes, to switch paradigms. This text introduces statistical language processing techniques -- word tagging, parsing with probabilistic context free grammars, grammar induction, syntactic disambiguation, semantic word classes, word-sense disambiguation -- along with the underlying mathematics and chapter exercises. \nCharniak points out that as a method of attacking NLP problems, the statistical approach has several advantages. It is grounded in real text and therefore promises to produce usable results, and it offers an obvious way to approach learning: \"one simply gathers statistics.\" \nLanguage, Speech, and Communication", "year": 1997, "referenceCount": 63, "citationCount": 1149, "influentialCitationCount": 62, "isOpenAccess": false, "fieldsOfStudy": ["Psychology", "Mathematics", "Computer Science"], "authors": [{"authorId": "1749837", "name": "Eugene Charniak"}]}, {"paperId": "d516daff247f7157fccde6649ace91d969cd1973", "url": "https://www.semanticscholar.org/paper/d516daff247f7157fccde6649ace91d969cd1973", "title": "The Mythos of Model Interpretability", "abstract": "Supervised machine-learning models boast remarkable predictive capabilities. But can you trust your model? Will it work in deployment? What else can it tell you about the world?", "year": 2016, "referenceCount": 38, "citationCount": 2291, "influentialCitationCount": 179, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "32219137", "name": "Zachary Chase Lipton"}]}, {"paperId": "e044a4b5be1563fccc46e8f7552935b99365f90a", "url": "https://www.semanticscholar.org/paper/e044a4b5be1563fccc46e8f7552935b99365f90a", "title": "Learning with Support Vector Machines", "abstract": "Support Vectors Machines have become a well established tool within machine learning. They work well in practice and have now been used across a wide range of applications from recognizing hand-written digits, to face identification, text categorisation, bioinformatics, and database marketing. In this book we give an introductory overview of this subject. We start with a simple Support Vector Machine for performing binary classification before considering multi-class classification and learning in the presence of noise. We show that this framework can be extended to many other scenarios such as prediction with real-valued outputs, novelty detection and the handling of complex output structures such as parse trees. Finally, we give an overview of the main types of kernels which are used in practice and how to learn and make predictions from multiple types of input data. Table of Contents: Support Vector Machines for Classification / Kernel-based Models / Learning with Kernels", "year": 2011, "referenceCount": 73, "citationCount": 255, "influentialCitationCount": 30, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145990261", "name": "C. Campbell"}, {"authorId": "144359603", "name": "Yiming Ying"}]}, {"paperId": "8f1408d33858a78f90f9000a34856664fc639ae4", "url": "https://www.semanticscholar.org/paper/8f1408d33858a78f90f9000a34856664fc639ae4", "title": "Statistical Comparisons of Classifiers over Multiple Data Sets", "abstract": "While methods for comparing two learning algorithms on a single data set have been scrutinized for quite some time already, the issue of statistical tests for comparisons of more algorithms on multiple data sets, which is even more essential to typical machine learning studies, has been all but ignored. This article reviews the current practice and then theoretically and empirically examines several suitable tests. Based on that, we recommend a set of simple, yet safe and robust non-parametric tests for statistical comparisons of classifiers: the Wilcoxon signed ranks test for comparison of two classifiers and the Friedman test with the corresponding post-hoc tests for comparison of more classifiers over multiple data sets. Results of the latter can also be neatly presented with the newly introduced CD (critical difference) diagrams.", "year": 2006, "referenceCount": 43, "citationCount": 9791, "influentialCitationCount": 1006, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2701105", "name": "J. Demšar"}]}, {"paperId": "68c1bfe375dde46777fe1ac8f3636fb651e3f0f8", "url": "https://www.semanticscholar.org/paper/68c1bfe375dde46777fe1ac8f3636fb651e3f0f8", "title": "Experiments with a New Boosting Algorithm", "abstract": "In an earlier paper, we introduced a new \"boosting\" algorithm called AdaBoost which, theoretically, can be used to significantly reduce the error of any learning algorithm that con- sistently generates classifiers whose performance is a little better than random guessing. We also introduced the related notion of a \"pseudo-loss\" which is a method for forcing a learning algorithm of multi-label concepts to concentrate on the labels that are hardest to discriminate. In this paper, we describe experiments we carried out to assess how well AdaBoost with and without pseudo-loss, performs on real learning problems. We performed two sets of experiments. The first set compared boosting to Breiman's \"bagging\" method when used to aggregate various classifiers (including decision trees and single attribute- value tests). We compared the performance of the two methods on a collection of machine-learning benchmarks. In the second set of experiments, we studied in more detail the performance of boosting using a nearest-neighbor classifier on an OCR problem.", "year": 1996, "referenceCount": 21, "citationCount": 8905, "influentialCitationCount": 817, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1703537", "name": "Y. Freund"}, {"authorId": "1716301", "name": "R. Schapire"}]}, {"paperId": "f216444d4f2959b4520c61d20003fa30a199670a", "url": "https://www.semanticscholar.org/paper/f216444d4f2959b4520c61d20003fa30a199670a", "title": "Siamese Neural Networks for One-Shot Image Recognition", "abstract": "The process of learning good features for machine learning applications can be very computationally expensive and may prove difficult in cases where little data is available. A prototypical example of this is the one-shot learning setting, in which we must correctly make predictions given only a single example of each new class. In this paper, we explore a method for learning siamese neural networks which employ a unique structure to naturally rank similarity between inputs. Once a network has been tuned, we can then capitalize on powerful discriminative features to generalize the predictive power of the network not just to new data, but to entirely new classes from unknown distributions. Using a convolutional architecture, we are able to achieve strong results which exceed those of other deep learning models with near state-of-the-art performance on one-shot classification tasks.", "year": 2015, "referenceCount": 32, "citationCount": 2821, "influentialCitationCount": 258, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2054250597", "name": "Gregory R. Koch"}]}, {"paperId": "0b2a2ed870d9e947aca41daf751d987ab3163d74", "url": "https://www.semanticscholar.org/paper/0b2a2ed870d9e947aca41daf751d987ab3163d74", "title": "Introduction to Statistical Pattern Recognition", "abstract": "Annotation : Pattern recognition problem is briefly characterized as a process of machine learning. Its main stages (dimensionality reduction and classifier design) are stated. Statistical approach is given priority here. Two approaches to dimensionality reduction, namely feature selection (FS) and feature extraction (FE) are specified. Though FS is a special case of FE, they are very different from a practical viewpoint and thus must be considered separately.", "year": 2006, "referenceCount": 6, "citationCount": 3908, "influentialCitationCount": 473, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1701197", "name": "P. Pudil"}, {"authorId": "3176394", "name": "P. Somol"}, {"authorId": "1765024", "name": "M. Haindl"}]}, {"paperId": "88816ae492956f3004daa41357166f1181c0c1bf", "url": "https://www.semanticscholar.org/paper/88816ae492956f3004daa41357166f1181c0c1bf", "title": "Laplacian Eigenmaps for Dimensionality Reduction and Data Representation", "abstract": "One of the central problems in machine learning and pattern recognition is to develop appropriate representations for complex data. We consider the problem of constructing a representation for data lying on a low-dimensional manifold embedded in a high-dimensional space. Drawing on the correspondence between the graph Laplacian, the Laplace Beltrami operator on the manifold, and the connections to the heat equation, we propose a geometrically motivated algorithm for representing the high-dimensional data. The algorithm provides a computationally efficient approach to nonlinear dimensionality reduction that has locality-preserving properties and a natural connection to clustering. Some potential applications and illustrative examples are discussed.", "year": 2003, "referenceCount": 62, "citationCount": 7289, "influentialCitationCount": 713, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145520115", "name": "Mikhail Belkin"}, {"authorId": "1770745", "name": "P. Niyogi"}]}, {"paperId": "7bb6bdf4ed609e5e72d4206d1b308323e73dceec", "url": "https://www.semanticscholar.org/paper/7bb6bdf4ed609e5e72d4206d1b308323e73dceec", "title": "An Introduction to Genetic Algorithms.", "abstract": "An Introduction to Genetic Algorithms is one of the rare examples of a book in which every single page is worth reading. The author, Melanie Mitchell, manages to describe in depth many fascinating examples as well as important theoretical issues, yet the book is concise (200 pages) and readable. Although Mitchell explicitly states that her aim is not a complete survey, the essentials of genetic algorithms (GAs) are contained: theory and practice, problem solving and scientific models, a \"Brief History\" and \"Future Directions.\" Her book is both an introduction for novices interested in GAs and a collection of recent research, including hot topics such as coevolution (interspecies and intraspecies), diploidy and dominance, encapsulation, hierarchical regulation, adaptive encoding, interactions of learning and evolution, self-adapting GAs, and more. Nevertheless, the book focused more on machine learning, artificial life, and modeling evolution than on optimization and engineering.", "year": 1997, "referenceCount": 0, "citationCount": 8897, "influentialCitationCount": 667, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1403108392", "name": "D. Heiss-Czedik"}]}, {"paperId": "5a05b9d5de7d1d11d1aa03826ded577d4acf4f49", "url": "https://www.semanticscholar.org/paper/5a05b9d5de7d1d11d1aa03826ded577d4acf4f49", "title": "Genetic Algorithms + Data Structures = Evolution Programs", "abstract": null, "year": 1996, "referenceCount": 131, "citationCount": 11132, "influentialCitationCount": 497, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1728743", "name": "Z. Michalewicz"}]}, {"paperId": "bd1f14e7531220c39fad8f86985cce7b283f035d", "url": "https://www.semanticscholar.org/paper/bd1f14e7531220c39fad8f86985cce7b283f035d", "title": "Kernel Methods for Pattern Analysis", "abstract": "Kernel methods provide a powerful and unified framework for pattern discovery, motivating algorithms that can act on general types of data (e.g. strings, vectors or text) and look for general types of relations (e.g. rankings, classifications, regressions, clusters). The application areas range from neural networks and pattern recognition to machine learning and data mining. This book, developed from lectures and tutorials, fulfils two major roles: firstly it provides practitioners with a large toolkit of algorithms, kernels and solutions ready to use for standard pattern discovery problems in fields such as bioinformatics, text analysis, image analysis. Secondly it provides an easy introduction for students and researchers to the growing field of kernel-based pattern analysis, demonstrating with examples how to handcraft an algorithm or a kernel for a new specific application, and covering all the necessary conceptual and mathematical tools to do so.", "year": 2003, "referenceCount": 184, "citationCount": 6714, "influentialCitationCount": 675, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1404459229", "name": "J. Shawe-Taylor"}, {"authorId": "1685083", "name": "N. Cristianini"}]}, {"paperId": "7a59fde27461a3ef4a21a249cc403d0d96e4a0d7", "url": "https://www.semanticscholar.org/paper/7a59fde27461a3ef4a21a249cc403d0d96e4a0d7", "title": "Random Features for Large-Scale Kernel Machines", "abstract": "To accelerate the training of kernel machines, we propose to map the input data to a randomized low-dimensional feature space and then apply existing fast linear methods. The features are designed so that the inner products of the transformed data are approximately equal to those in the feature space of a user specified shift-invariant kernel. We explore two sets of random features, provide convergence bounds on their ability to approximate various radial basis kernels, and show that in large-scale classification and regression tasks linear machine learning algorithms applied to these features outperform state-of-the-art large-scale kernel machines.", "year": 2007, "referenceCount": 17, "citationCount": 3086, "influentialCitationCount": 619, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "31558848", "name": "A. Rahimi"}, {"authorId": "9229182", "name": "B. Recht"}]}, {"paperId": "6adf016e7531c91100d3cf4a74f5d4c87b26b528", "url": "https://www.semanticscholar.org/paper/6adf016e7531c91100d3cf4a74f5d4c87b26b528", "title": "Distillation as a Defense to Adversarial Perturbations Against Deep Neural Networks", "abstract": "Deep learning algorithms have been shown to perform extremely well on many classical machine learning problems. However, recent studies have shown that deep learning, like other machine learning techniques, is vulnerable to adversarial samples: inputs crafted to force a deep neural network (DNN) to provide adversary-selected outputs. Such attacks can seriously undermine the security of the system supported by the DNN, sometimes with devastating consequences. For example, autonomous vehicles can be crashed, illicit or illegal content can bypass content filters, or biometric authentication systems can be manipulated to allow improper access. In this work, we introduce a defensive mechanism called defensive distillation to reduce the effectiveness of adversarial samples on DNNs. We analytically investigate the generalizability and robustness properties granted by the use of defensive distillation when training DNNs. We also empirically study the effectiveness of our defense mechanisms on two DNNs placed in adversarial settings. The study shows that defensive distillation can reduce effectiveness of sample creation from 95% to less than 0.5% on a studied DNN. Such dramatic gains can be explained by the fact that distillation leads gradients used in adversarial sample creation to be reduced by a factor of 1030. We also find that distillation increases the average minimum number of features that need to be modified to create adversarial samples by about 800% on one of the DNNs we tested.", "year": 2015, "referenceCount": 50, "citationCount": 2336, "influentialCitationCount": 190, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1967156", "name": "Nicolas Papernot"}, {"authorId": "144061974", "name": "P. Mcdaniel"}, {"authorId": "37785191", "name": "Xi Wu"}, {"authorId": "1680133", "name": "S. Jha"}, {"authorId": "144231976", "name": "A. Swami"}]}, {"paperId": "6b570069f14c7588e066f7138e1f21af59d62e61", "url": "https://www.semanticscholar.org/paper/6b570069f14c7588e066f7138e1f21af59d62e61", "title": "Theano: A Python framework for fast computation of mathematical expressions", "abstract": "Theano is a Python library that allows to define, optimize, and evaluate mathematical expressions involving multi-dimensional arrays efficiently. Since its introduction, it has been one of the most used CPU and GPU mathematical compilers - especially in the machine learning community - and has shown steady performance improvements. Theano is being actively and continuously developed since 2008, multiple frameworks have been built on top of it and it has been used to produce many state-of-the-art machine learning models. \nThe present article is structured as follows. Section I provides an overview of the Theano software and its community. Section II presents the principal features of Theano and how to use them, and compares them with other similar projects. Section III focuses on recently-introduced functionalities and improvements. Section IV compares the performance of Theano against Torch7 and TensorFlow on several machine learning models. Section V discusses current limitations of Theano and potential ways of improving it.", "year": 2016, "referenceCount": 34, "citationCount": 2179, "influentialCitationCount": 152, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1388360943", "name": "Rami Al-Rfou"}, {"authorId": "1815021", "name": "Guillaume Alain"}, {"authorId": "2634674", "name": "Amjad Almahairi"}, {"authorId": "2065022368", "name": "Christof Angermüller"}, {"authorId": "3335364", "name": "Dzmitry Bahdanau"}, {"authorId": "2482072", "name": "Nicolas Ballas"}, {"authorId": "3227028", "name": "Frédéric Bastien"}, {"authorId": "145040409", "name": "Justin Bayer"}, {"authorId": "144336979", "name": "A. Belikov"}, {"authorId": "31984932", "name": "A. Belopolsky"}, {"authorId": "1751762", "name": "Yoshua Bengio"}, {"authorId": "47944877", "name": "Arnaud Bergeron"}, {"authorId": "32837403", "name": "J. Bergstra"}, {"authorId": "115295647", "name": "Valentin Bisson"}, {"authorId": "32308836", "name": "Josh Bleecher Snyder"}, {"authorId": "2065828537", "name": "Nicolas Bouchard"}, {"authorId": "1395619597", "name": "Nicolas Boulanger-Lewandowski"}, {"authorId": "2900675", "name": "Xavier Bouthillier"}, {"authorId": "2346028", "name": "A. D. Brébisson"}, {"authorId": "1967465", "name": "Olivier Breuleux"}, {"authorId": "153921980", "name": "P. Carrier"}, {"authorId": "1979489", "name": "Kyunghyun Cho"}, {"authorId": "2292403", "name": "J. Chorowski"}, {"authorId": "145791315", "name": "P. Christiano"}, {"authorId": "2348758", "name": "Tim Cooijmans"}, {"authorId": "40638665", "name": "Marc-Alexandre Côté"}, {"authorId": "39977229", "name": "Myriam Côté"}, {"authorId": "1760871", "name": "Aaron C. Courville"}, {"authorId": "2921469", "name": "Yann Dauphin"}, {"authorId": "2460212", "name": "Olivier Delalleau"}, {"authorId": "32604218", "name": "Julien Demouth"}, {"authorId": "2755582", "name": "Guillaume Desjardins"}, {"authorId": "48373216", "name": "S. Dieleman"}, {"authorId": "46573521", "name": "Laurent Dinh"}, {"authorId": "2812151", "name": "Mélanie Ducoffe"}, {"authorId": "3074927", "name": "Vincent Dumoulin"}, {"authorId": "3127597", "name": "S. Kahou"}, {"authorId": "1761978", "name": "D. Erhan"}, {"authorId": "2113846121", "name": "Ziye Fan"}, {"authorId": "2345617", "name": "Orhan Firat"}, {"authorId": "39844381", "name": "M. Germain"}, {"authorId": "3119801", "name": "Xavier Glorot"}, {"authorId": "153440022", "name": "Ian J. Goodfellow"}, {"authorId": "152130795", "name": "M. Graham"}, {"authorId": "1854385", "name": "Çaglar Gülçehre"}, {"authorId": "144563741", "name": "P. Hamel"}, {"authorId": "1405640115", "name": "Iban Harlouchet"}, {"authorId": "114956664", "name": "J. Heng"}, {"authorId": "2507883", "name": "Balázs Hidasi"}, {"authorId": "25056820", "name": "Sina Honari"}, {"authorId": "49147969", "name": "Arjun Jain"}, {"authorId": "152857609", "name": "Sébastien Jean"}, {"authorId": "49104216", "name": "Kai Jia"}, {"authorId": "2065766621", "name": "Mikhail Korobov"}, {"authorId": "144592382", "name": "Vivek Kulkarni"}, {"authorId": "49071560", "name": "Alex Lamb"}, {"authorId": "3087941", "name": "Pascal Lamblin"}, {"authorId": "2065712703", "name": "Eric Larsen"}, {"authorId": "40201308", "name": "César Laurent"}, {"authorId": "98258814", "name": "S. Lee"}, {"authorId": "118224452", "name": "S. Lefrançois"}, {"authorId": "2066378869", "name": "S. Lemieux"}, {"authorId": "2065623360", "name": "Nicholas Léonard"}, {"authorId": "3146592", "name": "Zhouhan Lin"}, {"authorId": "3245814", "name": "J. Livezey"}, {"authorId": "40532172", "name": "C. Lorenz"}, {"authorId": "102472217", "name": "J. Lowin"}, {"authorId": "2087919644", "name": "Qianli Ma"}, {"authorId": "1798462", "name": "Pierre-Antoine Manzagol"}, {"authorId": "3422889", "name": "Olivier Mastropietro"}, {"authorId": "144431879", "name": "R. McGibbon"}, {"authorId": "1710604", "name": "R. Memisevic"}, {"authorId": "3158246", "name": "Bart van Merrienboer"}, {"authorId": "1748421", "name": "Vincent Michalski"}, {"authorId": "153583218", "name": "Mehdi Mirza"}, {"authorId": "40479190", "name": "A. Orlandi"}, {"authorId": "1972076", "name": "C. Pal"}, {"authorId": "1996134", "name": "Razvan Pascanu"}, {"authorId": "145507036", "name": "M. Pezeshki"}, {"authorId": "2402716", "name": "Colin Raffel"}, {"authorId": "49577546", "name": "D. Renshaw"}, {"authorId": "3146111", "name": "M. Rocklin"}, {"authorId": "144290131", "name": "Adriana Romero"}, {"authorId": "2059592992", "name": "Markus Roth"}, {"authorId": "47696458", "name": "Peter Sadowski"}, {"authorId": "3373139", "name": "J. Salvatier"}, {"authorId": "47918629", "name": "F. Savard"}, {"authorId": "50764319", "name": "Jan Schlüter"}, {"authorId": "47971768", "name": "J. Schulman"}, {"authorId": "40116153", "name": "Gabriel Schwartz"}, {"authorId": "35224828", "name": "Iulian Serban"}, {"authorId": "1862138", "name": "Dmitriy Serdyuk"}, {"authorId": "3197429", "name": "Samira Shabanian"}, {"authorId": "2060864166", "name": "Étienne Simon"}, {"authorId": "11115628", "name": "Sigurd Spieckermann"}, {"authorId": "82487166", "name": "S. Subramanyam"}, {"authorId": "3407592", "name": "Jakub Sygnowski"}, {"authorId": "66454233", "name": "Jérémie Tanguay"}, {"authorId": "51256193", "name": "Gijs van Tulder"}, {"authorId": "153160559", "name": "Joseph P. Turian"}, {"authorId": "19555508", "name": "S. Urban"}, {"authorId": "120247189", "name": "Pascal Vincent"}, {"authorId": "2077146", "name": "Francesco Visin"}, {"authorId": "153559313", "name": "Harm de Vries"}, {"authorId": "1393680089", "name": "David Warde-Farley"}, {"authorId": "27358391", "name": "Dustin J. Webb"}, {"authorId": "117876053", "name": "M. Willson"}, {"authorId": "36303818", "name": "Kelvin Xu"}, {"authorId": "2954189", "name": "Lijun Xue"}, {"authorId": "2106357903", "name": "Li Yao"}, {"authorId": "35097114", "name": "Saizheng Zhang"}, {"authorId": "2153392903", "name": "Ying Zhang"}]}, {"paperId": "34d405eaecab40a932108a7ff97e92fb8fd1ae4e", "url": "https://www.semanticscholar.org/paper/34d405eaecab40a932108a7ff97e92fb8fd1ae4e", "title": "A review of feature selection techniques in bioinformatics", "abstract": "Feature selection techniques have become an apparent need in many bioinformatics applications. In addition to the large pool of techniques that have already been developed in the machine learning and data mining fields, specific applications in bioinformatics have led to a wealth of newly proposed techniques. In this article, we make the interested reader aware of the possibilities of feature selection, providing a basic taxonomy of feature selection techniques, and discussing their use, variety and potential in a number of both common as well as upcoming bioinformatics applications.", "year": 2007, "referenceCount": 142, "citationCount": 4562, "influentialCitationCount": 160, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1989271", "name": "Y. Saeys"}, {"authorId": "1788277", "name": "Iñaki Inza"}, {"authorId": "144999310", "name": "P. Larrañaga"}]}, {"paperId": "7365f887c938ca21a6adbef08b5a520ebbd4638f", "url": "https://www.semanticscholar.org/paper/7365f887c938ca21a6adbef08b5a520ebbd4638f", "title": "Model Cards for Model Reporting", "abstract": "Trained machine learning models are increasingly used to perform high-impact tasks in areas such as law enforcement, medicine, education, and employment. In order to clarify the intended use cases of machine learning models and minimize their usage in contexts for which they are not well suited, we recommend that released models be accompanied by documentation detailing their performance characteristics. In this paper, we propose a framework that we call model cards, to encourage such transparent model reporting. Model cards are short documents accompanying trained machine learning models that provide benchmarked evaluation in a variety of conditions, such as across different cultural, demographic, or phenotypic groups (e.g., race, geographic location, sex, Fitzpatrick skin type [15]) and intersectional groups (e.g., age and race, or sex and Fitzpatrick skin type) that are relevant to the intended application domains. Model cards also disclose the context in which models are intended to be used, details of the performance evaluation procedures, and other relevant information. While we focus primarily on human-centered machine learning models in the application fields of computer vision and natural language processing, this framework can be used to document any trained machine learning model. To solidify the concept, we provide cards for two supervised models: One trained to detect smiling faces in images, and one trained to detect toxic comments in text. We propose model cards as a step towards the responsible democratization of machine learning and related artificial intelligence technology, increasing transparency into how well artificial intelligence technology works. We hope this work encourages those releasing trained machine learning models to accompany model releases with similar detailed evaluation numbers and other relevant documentation.", "year": 2018, "referenceCount": 39, "citationCount": 806, "influentialCitationCount": 42, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49501003", "name": "Margaret Mitchell"}, {"authorId": "81120201", "name": "Simone Wu"}, {"authorId": "2064225225", "name": "Andrew Zaldivar"}, {"authorId": "80940648", "name": "Parker Barnes"}, {"authorId": "145177877", "name": "Lucy Vasserman"}, {"authorId": "2083807", "name": "B. Hutchinson"}, {"authorId": "79542084", "name": "Elena Spitzer"}, {"authorId": "81316798", "name": "Inioluwa Deborah Raji"}, {"authorId": "2076288", "name": "Timnit Gebru"}]}, {"paperId": "ba10b8f9ee40b68053af9e6c2383aa2c6e39e9be", "url": "https://www.semanticscholar.org/paper/ba10b8f9ee40b68053af9e6c2383aa2c6e39e9be", "title": "Text Classification Algorithms: A Survey", "abstract": "In recent years, there has been an exponential growth in the number of complex documentsand texts that require a deeper understanding of machine learning methods to be able to accuratelyclassify texts in many applications. Many machine learning approaches have achieved surpassingresults in natural language processing. The success of these learning algorithms relies on their capacityto understand complex models and non-linear relationships within data. However, finding suitablestructures, architectures, and techniques for text classification is a challenge for researchers. In thispaper, a brief overview of text classification algorithms is discussed. This overview covers differenttext feature extractions, dimensionality reduction methods, existing algorithms and techniques, andevaluations methods. Finally, the limitations of each technique and their application in real-worldproblems are discussed.", "year": 2019, "referenceCount": 322, "citationCount": 649, "influentialCitationCount": 54, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2060243", "name": "Kamran Kowsari"}, {"authorId": "26417934", "name": "K. Meimandi"}, {"authorId": "26408890", "name": "Mojtaba Heidarysafa"}, {"authorId": "51266150", "name": "Sanjana Mendu"}, {"authorId": "1771388", "name": "Laura E. Barnes"}, {"authorId": "2115530197", "name": "Donald E. Brown"}]}, {"paperId": "08b43d84e6747e370ef307e2ada50675b414514a", "url": "https://www.semanticscholar.org/paper/08b43d84e6747e370ef307e2ada50675b414514a", "title": "Survey of clustering algorithms", "abstract": "Data analysis plays an indispensable role for understanding various phenomena. Cluster analysis, primitive exploration with little or no prior knowledge, consists of research developed across a wide variety of communities. The diversity, on one hand, equips us with many tools. On the other hand, the profusion of options causes confusion. We survey clustering algorithms for data sets appearing in statistics, computer science, and machine learning, and illustrate their applications in some benchmark data sets, the traveling salesman problem, and bioinformatics, a new field attracting intensive efforts. Several tightly related topics, proximity measure, and cluster validation, are also discussed.", "year": 2005, "referenceCount": 345, "citationCount": 5612, "influentialCitationCount": 266, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144996246", "name": "R. Xu"}, {"authorId": "145033828", "name": "D. Wunsch"}]}, {"paperId": "b54bcfca3fddc26b8889739a247a25e445818149", "url": "https://www.semanticscholar.org/paper/b54bcfca3fddc26b8889739a247a25e445818149", "title": "Speech and language processing - an introduction to natural language processing, computational linguistics, and speech recognition", "abstract": "From the Publisher: \nThis book takes an empirical approach to language processing, based on applying statistical and other machine-learning algorithms to large corpora.Methodology boxes are included in each chapter. Each chapter is built around one or more worked examples to demonstrate the main idea of the chapter. Covers the fundamental algorithms of various fields, whether originally proposed for spoken or written language to demonstrate how the same algorithm can be used for speech recognition and word-sense disambiguation. Emphasis on web and other practical applications. Emphasis on scientific evaluation. Useful as a reference for professionals in any of the areas of speech and language processing.", "year": 2000, "referenceCount": 260, "citationCount": 3928, "influentialCitationCount": 285, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1746807", "name": "Dan Jurafsky"}, {"authorId": "10796472", "name": "James H. Martin"}]}, {"paperId": "a1874aafa8730bdd4b28f29d025141c13ee28b58", "url": "https://www.semanticscholar.org/paper/a1874aafa8730bdd4b28f29d025141c13ee28b58", "title": "From Data Mining to Knowledge Discovery in Databases", "abstract": "■ Data mining and knowledge discovery in databases have been attracting a significant amount of research, industry, and media attention of late. What is all the excitement about? This article provides an overview of this emerging field, clarifying how data mining and knowledge discovery in databases are related both to each other and to related fields, such as machine learning, statistics, and databases. The article mentions particular real-world applications, specific data-mining techniques, challenges involved in real-world applications of knowledge discovery, and current and future research directions in the field.", "year": 1996, "referenceCount": 56, "citationCount": 5233, "influentialCitationCount": 389, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1695784", "name": "U. Fayyad"}, {"authorId": "1398381803", "name": "G. Piatetsky-Shapiro"}, {"authorId": "50860274", "name": "Padhraic Smyth"}]}]}