{"total": 5120627, "offset": 1000, "next": 1100, "data": [{"paperId": "37b0dcf6dbb57074e7e7f0f81ca684be0fe9533c", "url": "https://www.semanticscholar.org/paper/37b0dcf6dbb57074e7e7f0f81ca684be0fe9533c", "title": "Benchmarking Least Squares Support Vector Machine Classifiers", "abstract": null, "year": 2004, "referenceCount": 62, "citationCount": 506, "influentialCitationCount": 23, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1738575", "name": "T. V. Gestel"}, {"authorId": "1744439", "name": "J. Suykens"}, {"authorId": "1720683", "name": "B. Baesens"}, {"authorId": "1712216", "name": "S. Viaene"}, {"authorId": "1790055", "name": "J. Vanthienen"}, {"authorId": "1740627", "name": "G. Dedene"}, {"authorId": "143750713", "name": "B. Moor"}, {"authorId": "1704135", "name": "J. Vandewalle"}]}, {"paperId": "b5be3165d56580b60e29ad1a4a08b124d6cb8264", "url": "https://www.semanticscholar.org/paper/b5be3165d56580b60e29ad1a4a08b124d6cb8264", "title": "Scaling up machine learning: parallel and distributed approaches", "abstract": "This tutorial gives a broad view of modern approaches for scaling up machine learning and data mining methods on parallel/distributed platforms. Demand for scaling up machine learning is task-specific: for some tasks it is driven by the enormous dataset sizes, for others by model complexity or by the requirement for real-time prediction. Selecting a task-appropriate parallelization platform and algorithm requires understanding their benefits, trade-offs and constraints. This tutorial focuses on providing an integrated overview of state-of-the-art platforms and algorithm choices. These span a range of hardware options (from FPGAs and GPUs to multi-core systems and commodity clusters), programming frameworks (including CUDA, MPI, MapReduce, and DryadLINQ), and learning settings (e.g., semi-supervised and online learning). The tutorial is example-driven, covering a number of popular algorithms (e.g., boosted trees, spectral clustering, belief propagation) and diverse applications (e.g., recommender systems and object recognition in vision).\n The tutorial is based on (but not limited to) the material from our upcoming Cambridge U. Press edited book which is currently in production.\n Visit the tutorial website at http://hunch.net/~large_scale_survey/", "year": 2011, "referenceCount": 6, "citationCount": 386, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1988453", "name": "R. Bekkerman"}, {"authorId": "47695762", "name": "M. Bilenko"}, {"authorId": "144162125", "name": "J. Langford"}]}, {"paperId": "56703e0ccba03378962f5006f299cd98d48198f9", "url": "https://www.semanticscholar.org/paper/56703e0ccba03378962f5006f299cd98d48198f9", "title": "Smart Machining Process Using Machine Learning: A Review and Perspective on Machining Industry", "abstract": null, "year": 2018, "referenceCount": 124, "citationCount": 144, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47182192", "name": "Dong-Hyeon Kim"}, {"authorId": "46760092", "name": "T. J. Y. Kim"}, {"authorId": "2108072972", "name": "Xinlin Wang"}, {"authorId": "123446787", "name": "Min-Cheol Kim"}, {"authorId": "13640537", "name": "Ying-Jun Quan"}, {"authorId": "49321942", "name": "Jin Woo Oh"}, {"authorId": "6464425", "name": "S. Min"}, {"authorId": "2277348", "name": "Hyungjung Kim"}, {"authorId": "80598184", "name": "B. Bhandari"}, {"authorId": "2064802297", "name": "Insoon Yang"}, {"authorId": "6578920", "name": "Sung-hoon Ahn"}]}, {"paperId": "008abebf4a9404db9050c9d2fbca769f4faf3ca6", "url": "https://www.semanticscholar.org/paper/008abebf4a9404db9050c9d2fbca769f4faf3ca6", "title": "Learning by Transduction", "abstract": "We describe a method for predicting a classification of an object given classifications of the objects in the training set, assuming that the pairs object/classification are generated by an i.i.d. process from a continuous probability distribution. Our method is a modification of Vapnik's support-vector machine; its main novelty is that it gives not only the prediction itself but also a practicable measure of the evidence found in support of that prediction. We also describe a procedure for assigning degrees of confidence to predictions made by the support vector machine. Some experimental results are presented, and possible extensions of the algorithms are discussed.", "year": 1998, "referenceCount": 10, "citationCount": 421, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1793317", "name": "A. Gammerman"}, {"authorId": "145675281", "name": "V. Vovk"}, {"authorId": "50560492", "name": "V. Vapnik"}]}, {"paperId": "4a77a2ed53529431d816c42ec4554364e80ee18b", "url": "https://www.semanticscholar.org/paper/4a77a2ed53529431d816c42ec4554364e80ee18b", "title": "Machine learning of molecular electronic properties in chemical compound space", "abstract": "The combination of modern scientific computing with electronic structure theory can lead to an unprecedented amount of data amenable to intelligent data analysis for the identification of meaningful, novel and predictive structure–property relationships. Such relationships enable high-throughput screening for relevant properties in an exponentially growing pool of virtual compounds that are synthetically accessible. Here, we present a machine learning model, trained on a database of ab initio calculation results for thousands of organic molecules, that simultaneously predicts multiple electronic ground- and excited-state properties. The properties include atomization energy, polarizability, frontier orbital eigenvalues, ionization potential, electron affinity and excitation energies. The machine learning model is based on a deep multi-task artificial neural network, exploiting the underlying correlations between various molecular properties. The input is identical to ab initio methods, i.e. nuclear charges and Cartesian coordinates of all atoms. For small organic molecules, the accuracy of such a ‘quantum machine’ is similar, and sometimes superior, to modern quantum-chemical methods—at negligible computational cost.", "year": 2013, "referenceCount": 74, "citationCount": 478, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "144535526", "name": "G. Montavon"}, {"authorId": "48041657", "name": "M. Rupp"}, {"authorId": "49302932", "name": "Vivekanand V Gobre"}, {"authorId": "1397645825", "name": "Á. Vázquez-Mayagoitia"}, {"authorId": "39960184", "name": "K. Hansen"}, {"authorId": "2462983", "name": "A. Tkatchenko"}, {"authorId": "2113612432", "name": "Klaus-Robert Müller"}, {"authorId": "12643877", "name": "O. Anatole von Lilienfeld"}]}, {"paperId": "daf468f001c3a5c6f9e667417becb94fa83efb2f", "url": "https://www.semanticscholar.org/paper/daf468f001c3a5c6f9e667417becb94fa83efb2f", "title": "Exploiting machine learning for end-to-end drug discovery and development", "abstract": null, "year": 2019, "referenceCount": 112, "citationCount": 231, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "1887610", "name": "S. Ekins"}, {"authorId": "39778181", "name": "A. C. Puhl"}, {"authorId": "67164018", "name": "Kimberley M. Zorn"}, {"authorId": "50556284", "name": "T. Lane"}, {"authorId": "8903363", "name": "Daniel P. Russo"}, {"authorId": "143722544", "name": "Jennifer J Klein"}, {"authorId": "2053197", "name": "A. Hickey"}, {"authorId": "143961624", "name": "A. Clark"}]}, {"paperId": "46d0aa6b357c5427f46c7f8ff7053617c4309649", "url": "https://www.semanticscholar.org/paper/46d0aa6b357c5427f46c7f8ff7053617c4309649", "title": "Linguistic Input Features Improve Neural Machine Translation", "abstract": "Neural machine translation has recently achieved impressive results, while using little in the way of external linguistic information. In this paper we show that the strong learning capability of neural MT models does not make linguistic features redundant; they can be easily incorporated to provide further improvements in performance. We generalize the embedding layer of the encoder in the attentional encoder--decoder architecture to support the inclusion of arbitrary features, in addition to the baseline word feature. We add morphological features, part-of-speech tags, and syntactic dependency labels as input features to English German, and English->Romanian neural machine translation systems. In experiments on WMT16 training and test sets, we find that linguistic input features improve model quality according to three metrics: perplexity, BLEU and CHRF3. An open-source implementation of our neural MT system is available, as are sample files and configurations.", "year": 2016, "referenceCount": 37, "citationCount": 346, "influentialCitationCount": 46, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2082372", "name": "Rico Sennrich"}, {"authorId": "2259100", "name": "B. Haddow"}]}, {"paperId": "7d89abfe87ed7d1b40391d37364560656d208117", "url": "https://www.semanticscholar.org/paper/7d89abfe87ed7d1b40391d37364560656d208117", "title": "Learning Memory Access Patterns", "abstract": "The explosion in workload complexity and the recent slow-down in Moore's law scaling call for new approaches towards efficient computing. Researchers are now beginning to use recent advances in machine learning in software optimizations, augmenting or replacing traditional heuristics and data structures. However, the space of machine learning for computer hardware architecture is only lightly explored. In this paper, we demonstrate the potential of deep learning to address the von Neumann bottleneck of memory performance. We focus on the critical problem of learning memory access patterns, with the goal of constructing accurate and efficient memory prefetchers. We relate contemporary prefetching strategies to n-gram models in natural language processing, and show how recurrent neural networks can serve as a drop-in replacement. On a suite of challenging benchmark datasets, we find that neural networks consistently demonstrate superior performance in terms of precision and recall. This work represents the first step towards practical neural-network based prefetching, and opens a wide range of exciting directions for machine learning in computer architecture research.", "year": 2018, "referenceCount": 50, "citationCount": 122, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "33798741", "name": "Milad Hashemi"}, {"authorId": "1754860", "name": "Kevin Swersky"}, {"authorId": "2119124568", "name": "Jamie A. Smith"}, {"authorId": "46369381", "name": "Grant Ayers"}, {"authorId": "2655459", "name": "Heiner Litz"}, {"authorId": "1698747", "name": "Jichuan Chang"}, {"authorId": "1700331", "name": "C. Kozyrakis"}, {"authorId": "1770926", "name": "P. Ranganathan"}]}, {"paperId": "86e5827087e11dc929d592ee7b3d7581fc48265e", "url": "https://www.semanticscholar.org/paper/86e5827087e11dc929d592ee7b3d7581fc48265e", "title": "Generating Adversarial Malware Examples for Black-Box Attacks Based on GAN", "abstract": "Machine learning has been used to detect new malware in recent years, while malware authors have strong motivation to attack such algorithms. Malware authors usually have no access to the detailed structures and parameters of the machine learning models used by malware detection systems, and therefore they can only perform black-box attacks. This paper proposes a generative adversarial network (GAN) based algorithm named MalGAN to generate adversarial malware examples, which are able to bypass black-box machine learning based detection models. MalGAN uses a substitute detector to fit the black-box malware detection system. A generative network is trained to minimize the generated adversarial examples' malicious probabilities predicted by the substitute detector. The superiority of MalGAN over traditional gradient based adversarial example generation algorithms is that MalGAN is able to decrease the detection rate to nearly zero and make the retraining based defensive method against adversarial examples hard to work.", "year": 2017, "referenceCount": 32, "citationCount": 383, "influentialCitationCount": 45, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2146241447", "name": "Weiwei Hu"}, {"authorId": "143692919", "name": "Ying Tan"}]}, {"paperId": "0bf08d3dcc1f4a3b7b4f9a68f9c980c0a3f4ed2a", "url": "https://www.semanticscholar.org/paper/0bf08d3dcc1f4a3b7b4f9a68f9c980c0a3f4ed2a", "title": "A review of automatic selection methods for machine learning algorithms and hyper-parameter values", "abstract": null, "year": 2016, "referenceCount": 86, "citationCount": 188, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144050855", "name": "Gang Luo"}]}, {"paperId": "dffb3a5cf8d7cfa687eaf2fb0070c3c9e7389bc2", "url": "https://www.semanticscholar.org/paper/dffb3a5cf8d7cfa687eaf2fb0070c3c9e7389bc2", "title": "Enhanced random search based incremental extreme learning machine", "abstract": null, "year": 2008, "referenceCount": 27, "citationCount": 850, "influentialCitationCount": 46, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "145678691", "name": "G. Huang"}, {"authorId": "2146071327", "name": "Lei Chen"}]}, {"paperId": "b02fa50b958dd4b4e5711fdb55f661436a49e6a8", "url": "https://www.semanticscholar.org/paper/b02fa50b958dd4b4e5711fdb55f661436a49e6a8", "title": "Extreme Learning Machine 기반 퍼지 패턴 분류기 설계", "abstract": "본 논문에서는 인공 신경망의 일종인 Extreme Learning Machine의 학습 알고리즘을 기반으로 하여 노이즈에 강한 특성을 보이는 퍼지 집합 이론을 이용한 새로운 패턴 분류기를 제안 한다. 기존 인공 신경망에 비해 학습속도가 매우 빠르며, 모델의 일반화 성능이 우수하다고 알려진 Extreme Learning Machine의 학습 알고리즘을 퍼지 패턴 분류기에 적용하여 퍼지 패턴 분류기의 학습 속도와 패턴 분류 일반화 성능을 개선 한다. 제안된 퍼지 패턴 분류기의 학습 속도와 일반화 성능을 평가하기 위하여, 다양한 머신 러닝 데이터 집합을 사용한다.", "year": 2015, "referenceCount": 0, "citationCount": 571, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "52371059", "name": "안태천"}, {"authorId": "52357311", "name": "노석범"}, {"authorId": "52432389", "name": "황국연"}, {"authorId": "52322279", "name": "王繼紅"}, {"authorId": "70296566", "name": "김용수"}]}, {"paperId": "9664778568004b26d3a51db03c2d2a0a865a136b", "url": "https://www.semanticscholar.org/paper/9664778568004b26d3a51db03c2d2a0a865a136b", "title": "Hierarchical document categorization with support vector machines", "abstract": "Automatically categorizing documents into pre-defined topic hierarchies or taxonomies is a crucial step in knowledge and content management. Standard machine learning techniques like Support Vector Machines and related large margin methods have been successfully applied for this task, albeit the fact that they ignore the inter-class relationships. In this paper, we propose a novel hierarchical classification method that generalizes Support Vector Machine learning and that is based on discriminant functions that are structured in a way that mirrors the class hierarchy. Our method can work with arbitrary, not necessarily singly connected taxonomies and can deal with task-specific loss functions. All parameters are learned jointly by optimizing a common objective function corresponding to a regularized upper bound on the empirical loss. We present experimental results on the WIPO-alpha patent collection to show the competitiveness of our approach.", "year": 2004, "referenceCount": 26, "citationCount": 422, "influentialCitationCount": 45, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3050583", "name": "Lijuan Cai"}, {"authorId": "143936663", "name": "Thomas Hofmann"}]}, {"paperId": "b5ae39d8bf8a06ae91b236ef115fdab8921e6455", "url": "https://www.semanticscholar.org/paper/b5ae39d8bf8a06ae91b236ef115fdab8921e6455", "title": "Optimization method based extreme learning machine for classification", "abstract": null, "year": 2010, "referenceCount": 31, "citationCount": 810, "influentialCitationCount": 44, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "145678691", "name": "G. Huang"}, {"authorId": "3210833", "name": "Xiaojian Ding"}, {"authorId": "2986982", "name": "Hongming Zhou"}]}, {"paperId": "31e12b8d558a7515f3a1e3337551f5f30e466cde", "url": "https://www.semanticscholar.org/paper/31e12b8d558a7515f3a1e3337551f5f30e466cde", "title": "Unified representation of molecules and crystals for machine learning", "abstract": "Accurate simulations of atomistic systems from first principles are limited by computational cost. In high-throughput settings, machine learning can reduce these costs significantly by accurately interpolating between reference calculations. For this, kernel learning approaches crucially require a representation that accommodates arbitrary atomistic systems. We introduce a many-body tensor representation that is invariant to translations, rotations, and nuclear permutations of same elements, unique, differentiable, can represent molecules and crystals, and is fast to compute. Empirical evidence for competitive energy and force prediction errors is presented for changes in molecular structure, crystal chemistry, and molecular dynamics using kernel regression and symmetric gradient-domain machine learning as models. Applicability is demonstrated for phase diagrams of Pt-group/transition-metal binary systems.", "year": 2017, "referenceCount": 98, "citationCount": 121, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Chemistry"], "authors": [{"authorId": "94267262", "name": "Haoyan Huo"}, {"authorId": "48041657", "name": "M. Rupp"}]}, {"paperId": "66f44806cd46a27f02ceb74bdfd9ad6e77e044ca", "url": "https://www.semanticscholar.org/paper/66f44806cd46a27f02ceb74bdfd9ad6e77e044ca", "title": "Toward an Online Anomaly Intrusion Detection System Based on Deep Learning", "abstract": "In the past twenty years, progress in intrusion detection has been steady but slow. The biggest challenge is to detect new attacks in real time. In this work, a deep learning approach for anomaly detection using a Restricted Boltzmann Machine (RBM) and a deep belief network are implemented. Our method uses a one-hidden layer RBM to perform unsupervised feature reduction. The resultant weights from this RBM are passed to another RBM producing a deep belief network. The pre-trained weights are passed into a fine tuning layer consisting of a Logistic Regression (LR) classifier with multi-class soft-max. We have implemented the deep learning architecture in C++ in Microsoft Visual Studio 2013 and we use the DARPA KDDCUP'99 dataset to evaluate its performance. Our architecture outperforms previous deep learning methods implemented by Li and Salama in both detection speed and accuracy. We achieve a detection rate of 97.9% on the total 10% KDDCUP'99 test dataset. By improving the training process of the simulation, we are also able to produce a low false negative rate of 2.47%. Although the deficiencies in the KDDCUP'99 dataset are well understood, it still presents machine learning approaches for predicting attacks with a reasonable challenge. Our future work will include applying our machine learning strategy to larger and more challenging datasets, which include larger classes of attacks.", "year": 2016, "referenceCount": 22, "citationCount": 165, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8837455", "name": "Khaled Alrawashdeh"}, {"authorId": "145554708", "name": "C. Purdy"}]}, {"paperId": "016fb4a9312b8b7fcf4fe1d96b85054cc52cc5cb", "url": "https://www.semanticscholar.org/paper/016fb4a9312b8b7fcf4fe1d96b85054cc52cc5cb", "title": "Weka-A Machine Learning Workbench for Data Mining", "abstract": null, "year": 2005, "referenceCount": 13, "citationCount": 465, "influentialCitationCount": 31, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1767318", "name": "Eibe Frank"}, {"authorId": "118860642", "name": "M. Hall"}, {"authorId": "144189431", "name": "G. Holmes"}, {"authorId": "11469550", "name": "Richard Kirkby"}, {"authorId": "1737420", "name": "B. Pfahringer"}, {"authorId": "9419406", "name": "I. Witten"}, {"authorId": "33614647", "name": "Leonard E. Trigg"}]}, {"paperId": "087874409722c38bbb643e3c7328e86a49a1aac6", "url": "https://www.semanticscholar.org/paper/087874409722c38bbb643e3c7328e86a49a1aac6", "title": "Multi-Agent Machine Learning: A Reinforcement Approach", "abstract": "multi agent machine learning a reinforcement approach multi-agent machine learning: a reinforcement approach by multi agent machine learning a reinforcement approach multi agent machine learning a reinforcement approach user crowd simulation via multi-agent reinforcement learning multi-agent machine learning: a reinforcement approach by multi-agent reinforcement learning for planning and multi-agent machine download.e-bookshelf multi-agent machine learning buch cooperative multi-agent learning: the state of the art learning to communicate with deep multi-agent a modular approach to multi-agent reinforcement learning multi agent machine learning a reinforcement approach multi-agent machine learning: a reinforcement approach by multi-agent machine learning: a reinforcement approach multi agent machine learning a reinforcement approach interactive machine learning 2015w, se, 2.0 3.0 ects 45 06 online learning for multi-agent local navigation learning to communicate with deep multi-agent a mas reinforcement learning approach for indeterministic safe, multi-agent, reinforcement learning for arxiv multi-agent inverse reinforcement learning combining machine learning and multi-agent approach for robocup soccer simulation: a reinforcement learning approach multi-agent relational reinforcement learning a generic multi-agent reinforcement learning approach for supervised rule learning and reinforcement learning in a multi-agent reinforcement learning simulation for multi iensemble: a framework for committee machine based on simulation and investigation of multi-agent reinforcement hierarchical reinforcement learning in multi-agent environment learning to cooperate in multi-agent systems by combining traf?c light control by multiagent reinforcement learning multi-agent relational reinforcement learning cooperative reinforcement learning in topology-based multi multi-agent case-based reasoning for cooperative cooperative coevolution of multi-agent systems conditional random fields for multi-agent reinforcement", "year": 2014, "referenceCount": 5, "citationCount": 91, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8488870", "name": "H. Schwartz"}]}, {"paperId": "a450156bd8a1e3b808f93e959ae9e79983c5751b", "url": "https://www.semanticscholar.org/paper/a450156bd8a1e3b808f93e959ae9e79983c5751b", "title": "Controlling an organic synthesis robot with machine learning to search for new reactivity", "abstract": null, "year": 2018, "referenceCount": 29, "citationCount": 317, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "143833570", "name": "J. Granda"}, {"authorId": "51094241", "name": "Liva Donina"}, {"authorId": "8624338", "name": "Vincenza Dragone"}, {"authorId": "144520265", "name": "D. Long"}, {"authorId": "144141592", "name": "L. Cronin"}]}, {"paperId": "796d70a6eb0428ae19f1187ae1c81185d4ae6701", "url": "https://www.semanticscholar.org/paper/796d70a6eb0428ae19f1187ae1c81185d4ae6701", "title": "Automating Biomedical Data Science Through Tree-Based Pipeline Optimization", "abstract": null, "year": 2016, "referenceCount": 25, "citationCount": 253, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3297552", "name": "Randal S. Olson"}, {"authorId": "1800213", "name": "R. Urbanowicz"}, {"authorId": "33828310", "name": "Peter C. Andrews"}, {"authorId": "2173303", "name": "Nicole A. Lavender"}, {"authorId": "40217217", "name": "L. C. Kidd"}, {"authorId": "152512193", "name": "J. Moore"}]}, {"paperId": "f986968735459e789890f24b6b277b0920a9725d", "url": "https://www.semanticscholar.org/paper/f986968735459e789890f24b6b277b0920a9725d", "title": "Places: A 10 Million Image Database for Scene Recognition", "abstract": "The rise of multi-million-item dataset initiatives has enabled data-hungry machine learning algorithms to reach near-human semantic classification performance at tasks such as visual object and scene recognition. Here we describe the Places Database, a repository of 10 million scene photographs, labeled with scene semantic categories, comprising a large and diverse list of the types of environments encountered in the world. Using the state-of-the-art Convolutional Neural Networks (CNNs), we provide scene classification CNNs (Places-CNNs) as baselines, that significantly outperform the previous approaches. Visualization of the CNNs trained on Places shows that object detectors emerge as an intermediate representation of scene classification. With its high-coverage and high-diversity of exemplars, the Places Database along with the Places-CNNs offer a novel resource to guide future progress on scene recognition problems.", "year": 2018, "referenceCount": 46, "citationCount": 2414, "influentialCitationCount": 491, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "145291669", "name": "Bolei Zhou"}, {"authorId": "2677488", "name": "À. Lapedriza"}, {"authorId": "2556428", "name": "A. Khosla"}, {"authorId": "143868587", "name": "A. Oliva"}, {"authorId": "143805211", "name": "A. Torralba"}]}, {"paperId": "54648b90b4bc3c94fdb9340598161993a13ecbc8", "url": "https://www.semanticscholar.org/paper/54648b90b4bc3c94fdb9340598161993a13ecbc8", "title": "Introduction to Machine Learning and R", "abstract": null, "year": 2018, "referenceCount": 3, "citationCount": 76, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2544242", "name": "K. Ramasubramanian"}, {"authorId": "2110052761", "name": "Abhishek Singh"}]}, {"paperId": "16ea21723cbc1dcafec799072d47ef202b9fb172", "url": "https://www.semanticscholar.org/paper/16ea21723cbc1dcafec799072d47ef202b9fb172", "title": "Machine Learning and Law", "abstract": "This Article explores the application of machine learning techniques within the practice of law. Broadly speaking “machine learning” refers to computer algorithms that have the ability to “learn” or improve in performance over time on some task. In general, machine learning algorithms are designed to detect patterns in data and then apply these patterns going forward to new data in order to automate particular tasks. Outside of law, machine learning techniques have been successfully applied to automate tasks that were once thought to necessitate human intelligence — for example language translation, fraud-detection, driving automobiles, facial recognition, and data-mining. If performing well, machine learning algorithms can produce automated results that approximate those that would have been made by a similarly situated person.This Article begins by explaining some basic principles underlying machine learning methods, in a manner accessible to non-technical audiences. The second part explores a broader puzzle: legal practice is thought to require advanced cognitive abilities, but such higher-order cognition remains outside the capability of current machine-learning technology. This part identifies a core principle: how certain tasks that are normally thought to require human intelligence can sometimes be automated through the use of non-intelligent computational techniques that employ heuristics or proxies (e.g., statistical correlations) capable of producing useful, “intelligent” results. The third part applies this principle to the practice of law, discussing machine-learning automation in the context of certain legal tasks currently performed by attorneys: including predicting the outcomes of legal cases, finding hidden relationships in legal documents and data, electronic discovery, and the automated organization of documents.", "year": 2014, "referenceCount": 2, "citationCount": 111, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2363337", "name": "Harry Surden"}]}, {"paperId": "373f58aa40b174e828d931395253905f724ce799", "url": "https://www.semanticscholar.org/paper/373f58aa40b174e828d931395253905f724ce799", "title": "Diffuse large B-cell lymphoma outcome prediction by gene-expression profiling and supervised machine learning", "abstract": null, "year": 2002, "referenceCount": 61, "citationCount": 2419, "influentialCitationCount": 121, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "4262091", "name": "M. Shipp"}, {"authorId": "145518187", "name": "K. Ross"}, {"authorId": "144085315", "name": "P. Tamayo"}, {"authorId": "2037679", "name": "A. Weng"}, {"authorId": "4661510", "name": "J. Kutok"}, {"authorId": "145391395", "name": "R. Aguiar"}, {"authorId": "2363402", "name": "M. Gaasenbeek"}, {"authorId": "27370905", "name": "Michael Angelo"}, {"authorId": "48940636", "name": "Michael Reich"}, {"authorId": "4586840", "name": "G. Pinkus"}, {"authorId": "2066732340", "name": "Tane S. Ray"}, {"authorId": "2134890916", "name": "Margaret A. Koval"}, {"authorId": "49508811", "name": "K. Last"}, {"authorId": "46778305", "name": "A. Norton"}, {"authorId": "2095398338", "name": "T. A. Lister"}, {"authorId": "1727782", "name": "J. Mesirov"}, {"authorId": "31916893", "name": "D. Neuberg"}, {"authorId": "9311320", "name": "E. Lander"}, {"authorId": "4788009", "name": "J. Aster"}, {"authorId": "2900051", "name": "T. Golub"}]}, {"paperId": "09622b0c84bf812814af5b64b0c83dce796899c4", "url": "https://www.semanticscholar.org/paper/09622b0c84bf812814af5b64b0c83dce796899c4", "title": "Content-based book recommending using learning for text categorization", "abstract": "Recommender systems improve access to relevant products and information by making personalized suggestions based on previous examples of a user's likes and dislikes. Most existing recommender systems use collaborative filtering methods that base recommendations on other users' preferences. By contrast,content-based methods use information about an item itself to make suggestions.This approach has the advantage of being able to recommend previously unrated items to users with unique interests and to provide explanations for its recommendations. We describe a content-based book recommending system that utilizes information extraction and a machine-learning algorithm for text categorization. Initial experimental results demonstrate that this approach can produce accurate recommendations.", "year": 1999, "referenceCount": 73, "citationCount": 1553, "influentialCitationCount": 64, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1797655", "name": "R. Mooney"}, {"authorId": "143747945", "name": "Loriene Roy"}]}, {"paperId": "e3d8a9d35232d7967780019f0fa93626ca1373cb", "url": "https://www.semanticscholar.org/paper/e3d8a9d35232d7967780019f0fa93626ca1373cb", "title": "Beyond Accuracy, F-Score and ROC: A Family of Discriminant Measures for Performance Evaluation", "abstract": null, "year": 2006, "referenceCount": 44, "citationCount": 1221, "influentialCitationCount": 87, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145368345", "name": "Marina Sokolova"}, {"authorId": "1743642", "name": "N. Japkowicz"}, {"authorId": "66114340", "name": "S. Szpakowicz"}]}, {"paperId": "33e46a618fdb22d46951f548d6ceeb384e7f1687", "url": "https://www.semanticscholar.org/paper/33e46a618fdb22d46951f548d6ceeb384e7f1687", "title": "Pedestrian Detection via Classification on Riemannian Manifolds", "abstract": "We present a new algorithm to detect pedestrian in still images utilizing covariance matrices as object descriptors. Since the descriptors do not form a vector space, well known machine learning techniques are not well suited to learn the classifiers. The space of d-dimensional nonsingular covariance matrices can be represented as a connected Riemannian manifold. The main contribution of the paper is a novel approach for classifying points lying on a connected Riemannian manifold using the geometry of the space. The algorithm is tested on INRIA and DaimlerChrysler pedestrian datasets where superior detection rates are observed over the previous approaches.", "year": 2008, "referenceCount": 62, "citationCount": 965, "influentialCitationCount": 86, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "authors": [{"authorId": "2577513", "name": "Oncel Tuzel"}, {"authorId": "29905643", "name": "F. Porikli"}, {"authorId": "145776090", "name": "P. Meer"}]}, {"paperId": "562a596836f42714d81e1f861671959ba12e0246", "url": "https://www.semanticscholar.org/paper/562a596836f42714d81e1f861671959ba12e0246", "title": "Machine Learning Methods for Predicting Failures in Hard Drives: A Multiple-Instance Application", "abstract": "We compare machine learning methods applied to a difficult real-world problem: predicting computer hard-drive failure using attributes monitored internally by individual drives. The problem is one of detecting rare events in a time series of noisy and nonparametrically-distributed data. We develop a new algorithm based on the multiple-instance learning framework and the naive Bayesian classifier (mi-NB) which is specifically designed for the low false-alarm case, and is shown to have promising performance. Other methods compared are support vector machines (SVMs), unsupervised clustering, and non-parametric statistical tests (rank-sum and reverse arrangements). The failure-prediction performance of the SVM, rank-sum and mi-NB algorithm is considerably better than the threshold method currently implemented in drives, while maintaining low false alarm rates. Our results suggest that nonparametric statistical tests should be considered for learning problems involving detecting rare events in time series data. An appendix details the calculation of rank-sum significance probabilities in the case of discrete, tied observations, and we give new recommendations about when the exact calculation should be used instead of the commonly-used normal approximation. These normal approximations may be particularly inaccurate for rare event problems like hard drive failures.", "year": 2005, "referenceCount": 51, "citationCount": 255, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31052092", "name": "J. Murray"}, {"authorId": "2066539", "name": "G. Hughes"}, {"authorId": "1395421758", "name": "K. Kreutz-Delgado"}]}, {"paperId": "2fd16119232846ff99e0583f4790f2083382bda0", "url": "https://www.semanticscholar.org/paper/2fd16119232846ff99e0583f4790f2083382bda0", "title": "Hidden physics models: Machine learning of nonlinear partial differential equations", "abstract": null, "year": 2017, "referenceCount": 70, "citationCount": 731, "influentialCitationCount": 24, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145401977", "name": "M. Raissi"}, {"authorId": "1720124", "name": "G. Karniadakis"}]}, {"paperId": "d6aa631d44a7f2cbb3ab07f3b993f4e5c5c4150b", "url": "https://www.semanticscholar.org/paper/d6aa631d44a7f2cbb3ab07f3b993f4e5c5c4150b", "title": "Technical Update: Least-Squares Temporal Difference Learning", "abstract": null, "year": 2002, "referenceCount": 23, "citationCount": 344, "influentialCitationCount": 59, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3214276", "name": "J. Boyan"}]}, {"paperId": "a39398f68ae7e042f2ef5009e31b4e6a20fd5736", "url": "https://www.semanticscholar.org/paper/a39398f68ae7e042f2ef5009e31b4e6a20fd5736", "title": "Learning Deep Transformer Models for Machine Translation", "abstract": "Transformer is the state-of-the-art model in recent machine translation evaluations. Two strands of research are promising to improve models of this kind: the first uses wide networks (a.k.a. Transformer-Big) and has been the de facto standard for development of the Transformer system, and the other uses deeper language representation but faces the difficulty arising from learning deep networks. Here, we continue the line of research on the latter. We claim that a truly deep Transformer model can surpass the Transformer-Big counterpart by 1) proper use of layer normalization and 2) a novel way of passing the combination of previous layers to the next. On WMT’16 English-German and NIST OpenMT’12 Chinese-English tasks, our deep system (30/25-layer encoder) outperforms the shallow Transformer-Big/Base baseline (6-layer encoder) by 0.4-2.4 BLEU points. As another bonus, the deep model is 1.6X smaller in size and 3X faster in training than Transformer-Big.", "year": 2019, "referenceCount": 36, "citationCount": 316, "influentialCitationCount": 40, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2183631046", "name": "Qiang Wang"}, {"authorId": "49730090", "name": "Bei Li"}, {"authorId": "1391183811", "name": "Tong Xiao"}, {"authorId": "1728004", "name": "Jingbo Zhu"}, {"authorId": "2348067", "name": "Changliang Li"}, {"authorId": "1758353", "name": "Derek F. Wong"}, {"authorId": "1774304", "name": "Lidia S. Chao"}]}, {"paperId": "bf5cf36407ece2569f0717f2b5593c4bd2140ebb", "url": "https://www.semanticscholar.org/paper/bf5cf36407ece2569f0717f2b5593c4bd2140ebb", "title": "Machine Learning for Predictive Maintenance: A Multiple Classifier Approach", "abstract": "In this paper, a multiple classifier machine learning (ML) methodology for predictive maintenance (PdM) is presented. PdM is a prominent strategy for dealing with maintenance issues given the increasing need to minimize downtime and associated costs. One of the challenges with PdM is generating the so-called “health factors,” or quantitative indicators, of the status of a system associated with a given maintenance issue, and determining their relationship to operating costs and failure risk. The proposed PdM methodology allows dynamical decision rules to be adopted for maintenance management, and can be used with high-dimensional and censored data problems. This is achieved by training multiple classification modules with different prediction horizons to provide different performance tradeoffs in terms of frequency of unexpected breaks and unexploited lifetime, and then employing this information in an operating cost-based maintenance decision system to minimize expected costs. The effectiveness of the methodology is demonstrated using a simulated example and a benchmark semiconductor manufacturing maintenance problem.", "year": 2015, "referenceCount": 31, "citationCount": 446, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "3126083", "name": "Gian Antonio Susto"}, {"authorId": "2979820", "name": "A. Schirru"}, {"authorId": "2383035", "name": "S. Pampuri"}, {"authorId": "48147378", "name": "S. McLoone"}, {"authorId": "1744705", "name": "A. Beghi"}]}, {"paperId": "2ebdfa3852e4ad68a0cfde9f0f69b95953d69178", "url": "https://www.semanticscholar.org/paper/2ebdfa3852e4ad68a0cfde9f0f69b95953d69178", "title": "On-Line Sequential Extreme Learning Machine", "abstract": "The primitive Extreme Learning Machine (ELM) [1, 2, 3] with additive neurons and RBF kernels was implemented in batch mode. In this paper, its sequential modification based on recursive least-squares (RLS) algorithm, which referred as Online Sequential Extreme Learning Machine (OS-ELM), is introduced. Based on OS-ELM, Online Sequential Fuzzy Extreme Learning Machine (Fuzzy-ELM) is also introduced to implement zero order TSK model and first order TSK model. The performance of OS-ELM and Fuzzy-ELM are evaluated and compared with other popular sequential learning algorithms, and experimental results on some real benchmark regression problems show that the proposedOnlineSequentialExtreme Learning Machine (OS-ELM) produces better generalization performance at very fast learning speed.", "year": 2005, "referenceCount": 14, "citationCount": 194, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145678691", "name": "G. Huang"}, {"authorId": "2972859", "name": "Nan-Ying Liang"}, {"authorId": "2774247", "name": "Hai-Jun Rong"}, {"authorId": "1800678", "name": "P. Saratchandran"}, {"authorId": "145411276", "name": "N. Sundararajan"}]}, {"paperId": "8ed390c98912ab8d27a398ab583d358c5a41fee9", "url": "https://www.semanticscholar.org/paper/8ed390c98912ab8d27a398ab583d358c5a41fee9", "title": "Machine learning for science and society", "abstract": null, "year": 2013, "referenceCount": 36, "citationCount": 85, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48395540", "name": "C. Rudin"}, {"authorId": "6541629", "name": "K. Wagstaff"}]}, {"paperId": "005efab1573f982a2c53dafc6305342f71cd228a", "url": "https://www.semanticscholar.org/paper/005efab1573f982a2c53dafc6305342f71cd228a", "title": "Machine Learning in Medical Imaging.", "abstract": null, "year": 2018, "referenceCount": 50, "citationCount": 219, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "144692532", "name": "M. Giger"}]}, {"paperId": "86d7ef18644c45f9417239907daeba1b61dc8185", "url": "https://www.semanticscholar.org/paper/86d7ef18644c45f9417239907daeba1b61dc8185", "title": "Machine Learning and Data Mining Methods in Diabetes Research", "abstract": null, "year": 2017, "referenceCount": 204, "citationCount": 721, "influentialCitationCount": 29, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2386640", "name": "Ioannis Kavakiotis"}, {"authorId": "3459938", "name": "O. Tsave"}, {"authorId": "3459934", "name": "A. Salifoglou"}, {"authorId": "144338063", "name": "N. Maglaveras"}, {"authorId": "1697941", "name": "I. Vlahavas"}, {"authorId": "1935587", "name": "I. Chouvarda"}]}, {"paperId": "5939ac3b5a9d64d8371ee179751351d7698637df", "url": "https://www.semanticscholar.org/paper/5939ac3b5a9d64d8371ee179751351d7698637df", "title": "Using Machine Learning to Advance Personality Assessment and Theory", "abstract": "Machine learning has led to important advances in society. One of the most exciting applications of machine learning in psychological science has been the development of assessment tools that can powerfully predict human behavior and personality traits. Thus far, machine learning approaches to personality assessment have focused on the associations between social media and other digital records with established personality measures. The goal of this article is to expand the potential of machine learning approaches to personality assessment by embedding it in a more comprehensive construct validation framework. We review recent applications of machine learning to personality assessment, place machine learning research in the broader context of fundamental principles of construct validation, and provide recommendations for how to use machine learning to advance our understanding of personality.", "year": 2019, "referenceCount": 68, "citationCount": 117, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Psychology"], "authors": [{"authorId": "5199283", "name": "W. Bleidorn"}, {"authorId": "2066036", "name": "C. Hopwood"}]}, {"paperId": "3b0c8c67d17634f6f1f7a74d43b46e1782c1271e", "url": "https://www.semanticscholar.org/paper/3b0c8c67d17634f6f1f7a74d43b46e1782c1271e", "title": "The class imbalance problem: A systematic study", "abstract": "In machine learning problems, differences in prior class probabilities -- or class imbalances -- have been reported to hinder the performance of some standard classifiers, such as decision trees. T...", "year": 2002, "referenceCount": 0, "citationCount": 504, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1644084993", "name": "JapkowiczNathalie"}, {"authorId": "1644085000", "name": "StephenShaju"}]}, {"paperId": "15c10b24ef645d83ff4059affd86945c33e00328", "url": "https://www.semanticscholar.org/paper/15c10b24ef645d83ff4059affd86945c33e00328", "title": "Snips Voice Platform: an embedded Spoken Language Understanding system for private-by-design voice interfaces", "abstract": "This paper presents the machine learning architecture of the Snips Voice Platform, a software solution to perform Spoken Language Understanding on microprocessors typical of IoT devices. The embedded inference is fast and accurate while enforcing privacy by design, as no personal user data is ever collected. Focusing on Automatic Speech Recognition and Natural Language Understanding, we detail our approach to training high-performance Machine Learning models that are small enough to run in real-time on small devices. Additionally, we describe a data generation procedure that provides sufficient, high-quality training data without compromising user privacy.", "year": 2018, "referenceCount": 59, "citationCount": 489, "influentialCitationCount": 120, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3478709", "name": "A. Coucke"}, {"authorId": "16927419", "name": "Alaa Saade"}, {"authorId": "46190149", "name": "Adrien Ball"}, {"authorId": "3387810", "name": "Théodore Bluche"}, {"authorId": "8228681", "name": "A. Caulier"}, {"authorId": "2064189593", "name": "David Leroy"}, {"authorId": "46231361", "name": "Clément Doumouro"}, {"authorId": "2977214", "name": "Thibault Gisselbrecht"}, {"authorId": "2905619", "name": "F. Caltagirone"}, {"authorId": "46183616", "name": "Thibaut Lavril"}, {"authorId": "2245637", "name": "Maël Primet"}, {"authorId": "7432502", "name": "J. Dureau"}]}, {"paperId": "8ccdee6826cbc97256bd4d082ebfa8cdfd2c727f", "url": "https://www.semanticscholar.org/paper/8ccdee6826cbc97256bd4d082ebfa8cdfd2c727f", "title": "Hidden fluid mechanics: Learning velocity and pressure fields from flow visualizations", "abstract": "Machine-learning fluid flow Quantifying fluid flow is relevant to disciplines ranging from geophysics to medicine. Flow can be experimentally visualized using, for example, smoke or contrast agents, but extracting velocity and pressure fields from this information is tricky. Raissi et al. developed a machine-learning approach to tackle this problem. Their method exploits the knowledge of Navier-Stokes equations, which govern the dynamics of fluid flow in many scientifically relevant situations. The authors illustrate their approach using examples such as blood flow in an aneurysm. Science, this issue p. 1026 A machine learning approach exploiting the knowledge of Navier-Stokes equations can extract detailed fluid flow information. For centuries, flow visualization has been the art of making fluid motion visible in physical and biological systems. Although such flow patterns can be, in principle, described by the Navier-Stokes equations, extracting the velocity and pressure fields directly from the images is challenging. We addressed this problem by developing hidden fluid mechanics (HFM), a physics-informed deep-learning framework capable of encoding the Navier-Stokes equations into the neural networks while being agnostic to the geometry or the initial and boundary conditions. We demonstrate HFM for several physical and biomedical problems by extracting quantitative information for which direct measurements may not be possible. HFM is robust to low resolution and substantial noise in the observation data, which is important for potential applications.", "year": 2020, "referenceCount": 30, "citationCount": 567, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "145401977", "name": "M. Raissi"}, {"authorId": "37412357", "name": "A. Yazdani"}, {"authorId": "1720124", "name": "G. Karniadakis"}]}, {"paperId": "512182528a76daaafb63cf1a014f98c9beeac9b5", "url": "https://www.semanticscholar.org/paper/512182528a76daaafb63cf1a014f98c9beeac9b5", "title": "Concentration Inequalities", "abstract": null, "year": 2003, "referenceCount": 69, "citationCount": 519, "influentialCitationCount": 62, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1755694", "name": "G. Lugosi"}]}, {"paperId": "62ec643e5415b6ab89f7186d3631f5549fd8a0cc", "url": "https://www.semanticscholar.org/paper/62ec643e5415b6ab89f7186d3631f5549fd8a0cc", "title": "Support Vector Machines and Kernel Methods: The New Generation of Learning Machines", "abstract": "Kernel methods, a new generation of learning algorithms, utilize techniques from optimization, statistics, and functional analysis to achieve maximal generality, flexibility, and performance. These algorithms are different from earlier techniques used in machine learning in many respects: For example, they are explicitly based on a theoretical model of learning rather than on loose analogies with natural learning systems or other heuristics. They come with theoretical guarantees about their performance and have a modular design that makes it possible to separately implement and analyze their components. They are not affected by the problem of local minima because their training amounts to convex optimization. In the last decade, a sizable community of theoreticians and practitioners has formed around these methods, and a number of practical applications have been realized. Although the research is not concluded, already now kernel methods are considered the state of the art in several machine learning tasks. Their ease of use, theoretical appeal, and remarkable performance have made them the system of choice for many learning problems. Successful applications range from text categorization to handwriting recognition to classification of gene-expression data.", "year": 2002, "referenceCount": 11, "citationCount": 210, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1685083", "name": "N. Cristianini"}, {"authorId": "1707625", "name": "B. Schölkopf"}]}, {"paperId": "1574d71de4270c65e2bff693ed126f480daf10e2", "url": "https://www.semanticscholar.org/paper/1574d71de4270c65e2bff693ed126f480daf10e2", "title": "Job shop scheduling with a genetic algorithm and machine learning", "abstract": "Dynamic job shop scheduling has been proven to be an intractable problem for analytical procedures. Recent advances in computing technology, especially in artificial intelligence, have alleviated this problem by intelligently restricting the search space considered, thus opening the possibility of obtaining better results. Researchers have used various techniques that were developed under the general rubric of artificial intelligence to solve job shop scheduling problems. The most common of these have been expert systems, genetic algorithms and machine learning. Of these, we identify machine learning and genetic algorithms to be promising for scheduling applications in a job shop. In this paper, we propose to combine complementarily the strengths of genetic algorithms and induced decision trees, a machine learning technique, to develop a job shop scheduling system. Empirical results, using machine learning for releasing jobs into the shop floor and a genetic algorithm to dispatch jobs at each machine, are...", "year": 1997, "referenceCount": 0, "citationCount": 166, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144220988", "name": "Chung-Yee Lee"}, {"authorId": "1730130", "name": "S. Piramuthu"}, {"authorId": "143798211", "name": "Y. Tsai"}]}, {"paperId": "1699e5c56f9fa8e34b2b5b8fdbca4bb74cee0ca3", "url": "https://www.semanticscholar.org/paper/1699e5c56f9fa8e34b2b5b8fdbca4bb74cee0ca3", "title": "Learning from natural instructions", "abstract": null, "year": 2011, "referenceCount": 52, "citationCount": 104, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2877164", "name": "Dan Goldwasser"}, {"authorId": "144590225", "name": "D. Roth"}]}, {"paperId": "5151d6cb3a4eaec14a56944d58338251fca344ab", "url": "https://www.semanticscholar.org/paper/5151d6cb3a4eaec14a56944d58338251fca344ab", "title": "Overcoming catastrophic forgetting in neural networks", "abstract": "Significance Deep neural networks are currently the most successful machine-learning technique for solving a variety of tasks, including language translation, image classification, and image generation. One weakness of such models is that, unlike humans, they are unable to learn multiple tasks sequentially. In this work we propose a practical solution to train such models sequentially by protecting the weights important for previous tasks. This approach, inspired by synaptic consolidation in neuroscience, enables state of the art results on multiple reinforcement learning problems experienced sequentially. The ability to learn tasks in a sequential fashion is crucial to the development of artificial intelligence. Until now neural networks have not been capable of this and it has been widely thought that catastrophic forgetting is an inevitable feature of connectionist models. We show that it is possible to overcome this limitation and train networks that can maintain expertise on tasks that they have not experienced for a long time. Our approach remembers old tasks by selectively slowing down learning on the weights important for those tasks. We demonstrate our approach is scalable and effective by solving a set of classification tasks based on a hand-written digit dataset and by learning several Atari 2600 games sequentially.", "year": 2016, "referenceCount": 47, "citationCount": 3277, "influentialCitationCount": 715, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "2066516991", "name": "J. Kirkpatrick"}, {"authorId": "1996134", "name": "Razvan Pascanu"}, {"authorId": "3422052", "name": "Neil C. Rabinowitz"}, {"authorId": "144056327", "name": "J. Veness"}, {"authorId": "2755582", "name": "Guillaume Desjardins"}, {"authorId": "2228824", "name": "Andrei A. Rusu"}, {"authorId": "8181864", "name": "K. Milan"}, {"authorId": "34660073", "name": "John Quan"}, {"authorId": "34505275", "name": "Tiago Ramalho"}, {"authorId": "1398898827", "name": "Agnieszka Grabska-Barwinska"}, {"authorId": "48987704", "name": "D. Hassabis"}, {"authorId": "2388737", "name": "C. Clopath"}, {"authorId": "2106164", "name": "D. Kumaran"}, {"authorId": "2315504", "name": "R. Hadsell"}]}, {"paperId": "7e910b031e703caf683d44d7417d702a5aba2e95", "url": "https://www.semanticscholar.org/paper/7e910b031e703caf683d44d7417d702a5aba2e95", "title": "Handbook Of Research On Machine Learning Applications and Trends: Algorithms, Methods and Techniques (2 Volumes)", "abstract": "The machine learning approach provides a useful tool when the amount of data is very large and a model is not available to explain the generation and relation of the data set. The Handbook of Research on Machine Learning Applications and Trends: Algorithms, Methods, and Techniques provides a set of practical applications for solving problems and applying various techniques in automatic data extraction and setting. A defining collection of field advancements, this Handbook of Research fills the gap between theory and practice, providing a strong reference for academicians, researchers, and practitioners.", "year": 2009, "referenceCount": 83, "citationCount": 368, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2060576305", "name": "E. S. Olivas"}, {"authorId": "103992067", "name": "J. D. M. Guerrero"}, {"authorId": "71631370", "name": "M. M. Sober"}, {"authorId": "35119570", "name": "J. Benedito"}, {"authorId": "152692443", "name": "A. López"}]}, {"paperId": "93436a26d744e0417e21df10abdfce2cc74b1e58", "url": "https://www.semanticscholar.org/paper/93436a26d744e0417e21df10abdfce2cc74b1e58", "title": "BOHB: Robust and Efficient Hyperparameter Optimization at Scale", "abstract": "Modern deep learning methods are very sensitive to many hyperparameters, and, due to the long training times of state-of-the-art models, vanilla Bayesian hyperparameter optimization is typically computationally infeasible. On the other hand, bandit-based configuration evaluation approaches based on random search lack guidance and do not converge to the best configurations as quickly. Here, we propose to combine the benefits of both Bayesian optimization and bandit-based methods, in order to achieve the best of both worlds: strong anytime performance and fast convergence to optimal configurations. We propose a new practical state-of-the-art hyperparameter optimization method, which consistently outperforms both Bayesian optimization and Hyperband on a wide range of problem types, including high-dimensional toy functions, support vector machines, feed-forward neural networks, Bayesian neural networks, deep reinforcement learning, and convolutional neural networks. Our method is robust and versatile, while at the same time being conceptually simple and easy to implement.", "year": 2018, "referenceCount": 58, "citationCount": 632, "influentialCitationCount": 121, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2154062", "name": "S. Falkner"}, {"authorId": "145227684", "name": "Aaron Klein"}, {"authorId": "144661829", "name": "F. Hutter"}]}, {"paperId": "8a8576d0184b48fabb5dbe76ce04213ee50a8986", "url": "https://www.semanticscholar.org/paper/8a8576d0184b48fabb5dbe76ce04213ee50a8986", "title": "Theoretical Models of Learning to Learn", "abstract": null, "year": 1998, "referenceCount": 10, "citationCount": 144, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "47392513", "name": "Jonathan Baxter"}]}, {"paperId": "ffaa313b8da3695627cd9915ca46b8bed24a9f4a", "url": "https://www.semanticscholar.org/paper/ffaa313b8da3695627cd9915ca46b8bed24a9f4a", "title": "Probability Product Kernels", "abstract": "The advantages of discriminative learning algorithms and kernel machines are combined with generative modeling using a novel kernel between distributions. In the probability product kernel, data points in the input space are mapped to distributions over the sample space and a general inner product is then evaluated as the integral of the product of pairs of distributions. The kernel is straightforward to evaluate for all exponential family models such as multinomials and Gaussians and yields interesting nonlinear kernels. Furthermore, the kernel is computable in closed form for latent distributions such as mixture models, hidden Markov models and linear dynamical systems. For intractable models, such as switching linear dynamical systems, structured mean-field approximations can be brought to bear on the kernel evaluation. For general distributions, even if an analytic expression for the kernel is not feasible, we show a straightforward sampling method to evaluate it. Thus, the kernel permits discriminative learning methods, including support vector machines, to exploit the properties, metrics and invariances of the generative models we infer from each datum. Experiments are shown using multinomial models for text, hidden Markov models for biological data sets and linear dynamical systems for time series data.", "year": 2004, "referenceCount": 36, "citationCount": 582, "influentialCitationCount": 58, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1768120", "name": "T. Jebara"}, {"authorId": "2834541", "name": "R. Kondor"}, {"authorId": "2068068778", "name": "Andrew G. Howard"}]}, {"paperId": "7ef26fb13e7b8d7555b6f58af141609535f7e28e", "url": "https://www.semanticscholar.org/paper/7ef26fb13e7b8d7555b6f58af141609535f7e28e", "title": "A review of classification algorithms for EEG-based brain–computer interfaces: a 10 year update", "abstract": "Objective. Most current electroencephalography (EEG)-based brain–computer interfaces (BCIs) are based on machine learning algorithms. There is a large diversity of classifier types that are used in this field, as described in our 2007 review paper. Now, approximately ten years after this review publication, many new algorithms have been developed and tested to classify EEG signals in BCIs. The time is therefore ripe for an updated review of EEG classification algorithms for BCIs. Approach. We surveyed the BCI and machine learning literature from 2007 to 2017 to identify the new classification approaches that have been investigated to design BCIs. We synthesize these studies in order to present such algorithms, to report how they were used for BCIs, what were the outcomes, and to identify their pros and cons. Main results. We found that the recently designed classification algorithms for EEG-based BCIs can be divided into four main categories: adaptive classifiers, matrix and tensor classifiers, transfer learning and deep learning, plus a few other miscellaneous classifiers. Among these, adaptive classifiers were demonstrated to be generally superior to static ones, even with unsupervised adaptation. Transfer learning can also prove useful although the benefits of transfer learning remain unpredictable. Riemannian geometry-based methods have reached state-of-the-art performances on multiple BCI problems and deserve to be explored more thoroughly, along with tensor-based methods. Shrinkage linear discriminant analysis and random forests also appear particularly useful for small training samples settings. On the other hand, deep learning methods have not yet shown convincing improvement over state-of-the-art BCI methods. Significance. This paper provides a comprehensive overview of the modern classification algorithms used in EEG-based BCIs, presents the principles of these methods and guidelines on when and how to use them. It also identifies a number of challenges to further advance EEG classification in BCI.", "year": 2018, "referenceCount": 346, "citationCount": 985, "influentialCitationCount": 71, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine", "Computer Science"], "authors": [{"authorId": "2890785", "name": "F. Lotte"}, {"authorId": "1765001", "name": "L. Bougrain"}, {"authorId": "145683892", "name": "A. Cichocki"}, {"authorId": "48021716", "name": "Maureen Clerc"}, {"authorId": "3276441", "name": "M. Congedo"}, {"authorId": "1792962", "name": "A. Rakotomamonjy"}, {"authorId": "1783082", "name": "F. Yger"}]}, {"paperId": "9be7e7579fbec5d45e3e6ea1c4465258225a183d", "url": "https://www.semanticscholar.org/paper/9be7e7579fbec5d45e3e6ea1c4465258225a183d", "title": "Initializing Bayesian Hyperparameter Optimization via Meta-Learning", "abstract": "\n \n Model selection and hyperparameter optimization is crucial in applying machine learning to a novel dataset. Recently, a subcommunity of machine learning has focused on solving this problem with Sequential Model-based Bayesian Optimization (SMBO), demonstrating substantial successes in many applications. However, for computationally expensive algorithms the overhead of hyperparameter optimization can still be prohibitive. In this paper we mimic a strategy human domain experts use: speed up optimization by starting from promising configurations that performed well on similar datasets. The resulting initialization technique integrates naturally into the generic SMBO framework and can be trivially applied to any SMBO method. To validate our approach, we perform extensive experiments with two established SMBO frameworks (Spearmint and SMAC) with complementary strengths; optimizing two machine learning frameworks on 57 datasets. Our initialization procedure yields mild improvements for low-dimensional hyperparameter optimization and substantially improves the state of the art for the more complex combined algorithm selection and hyperparameter optimization problem.\n \n", "year": 2015, "referenceCount": 41, "citationCount": 350, "influentialCitationCount": 39, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2868444", "name": "Matthias Feurer"}, {"authorId": "2060551", "name": "J. T. Springenberg"}, {"authorId": "144661829", "name": "F. Hutter"}]}, {"paperId": "571929abb1f8dbb244f416ee470c4a30d255cde7", "url": "https://www.semanticscholar.org/paper/571929abb1f8dbb244f416ee470c4a30d255cde7", "title": "Map-Reduce for Machine Learning on Multicore", "abstract": null, "year": 2007, "referenceCount": 0, "citationCount": 341, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1707625", "name": "B. Schölkopf"}, {"authorId": "145039030", "name": "J. Platt"}, {"authorId": "153379696", "name": "T. Hofmann"}]}, {"paperId": "b54c5dd03ca2c0b9b17b9fc1d4ebe4c2b6478982", "url": "https://www.semanticscholar.org/paper/b54c5dd03ca2c0b9b17b9fc1d4ebe4c2b6478982", "title": "MACHINE LEARNING TECHNIQUES FOR BRAIN-COMPUTER INTERFACES", "abstract": "This review discusses machine learning methods and their application to Brain-Computer Interfacing. A particular focus is placed on feature selection. We also point out common flaws when validating machine learning methods in the context of BCI. Finally we provide a brief overview on the Berlin-Brain Computer Interface (BBCI).", "year": 2004, "referenceCount": 53, "citationCount": 201, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "72571095", "name": "K.-R. Muller"}, {"authorId": "1831901", "name": "M. Krauledat"}, {"authorId": "2115772", "name": "G. Dornhege"}, {"authorId": "3073253", "name": "G. Curio"}, {"authorId": "3156886", "name": "B. Blankertz"}]}, {"paperId": "be1496e9620089b377ef631692478f5034ee95b8", "url": "https://www.semanticscholar.org/paper/be1496e9620089b377ef631692478f5034ee95b8", "title": "Machine learning applications in epilepsy", "abstract": "Machine learning leverages statistical and computer science principles to develop algorithms capable of improving performance through interpretation of data rather than through explicit instructions. Alongside widespread use in image recognition, language processing, and data mining, machine learning techniques have received increasing attention in medical applications, ranging from automated imaging analysis to disease forecasting. This review examines the parallel progress made in epilepsy, highlighting applications in automated seizure detection from electroencephalography (EEG), video, and kinetic data, automated imaging analysis and pre‐surgical planning, prediction of medication response, and prediction of medical and surgical outcomes using a wide variety of data sources. A brief overview of commonly used machine learning approaches, as well as challenges in further application of machine learning techniques in epilepsy, is also presented. With increasing computational capabilities, availability of effective machine learning algorithms, and accumulation of larger datasets, clinicians and researchers will increasingly benefit from familiarity with these techniques and the significant progress already made in their application in epilepsy.", "year": 2019, "referenceCount": 114, "citationCount": 139, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "48487599", "name": "B. Abbasi"}, {"authorId": "2423726", "name": "D. Goldenholz"}]}, {"paperId": "6cf1d69e447e9687dbd2d92572f44bddbabd8192", "url": "https://www.semanticscholar.org/paper/6cf1d69e447e9687dbd2d92572f44bddbabd8192", "title": "Deep Anomaly Detection with Outlier Exposure", "abstract": "It is important to detect anomalous inputs when deploying machine learning systems. The use of larger and more complex inputs in deep learning magnifies the difficulty of distinguishing between anomalous and in-distribution examples. At the same time, diverse image and text data are available in enormous quantities. We propose leveraging these data to improve deep anomaly detection by training anomaly detectors against an auxiliary dataset of outliers, an approach we call Outlier Exposure (OE). This enables anomaly detectors to generalize and detect unseen anomalies. In extensive experiments on natural language processing and small- and large-scale vision tasks, we find that Outlier Exposure significantly improves detection performance. We also observe that cutting-edge generative models trained on CIFAR-10 may assign higher likelihoods to SVHN images than to CIFAR-10 images; we use OE to mitigate this issue. We also analyze the flexibility and robustness of Outlier Exposure, and identify characteristics of the auxiliary dataset that improve performance.", "year": 2018, "referenceCount": 51, "citationCount": 751, "influentialCitationCount": 175, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3422872", "name": "Dan Hendrycks"}, {"authorId": "16787428", "name": "Mantas Mazeika"}, {"authorId": "144299726", "name": "Thomas G. Dietterich"}]}, {"paperId": "16bd1fbe3694173eda4ad4338a85f8288d19bf02", "url": "https://www.semanticscholar.org/paper/16bd1fbe3694173eda4ad4338a85f8288d19bf02", "title": "Relational Learning of Pattern-Match Rules for Information Extraction", "abstract": "Information extraction is a form of shallow text processing that locates a specified set of relevant items in a natural-language document. Systems for this task require significant domain-specific knowledge and are time-consuming and difficult to build by hand, making them a good application for machine learning. We present a system, RAPIER, that uses pairs of sample documents and filled templates to induce pattern-match rules that directly extract fillers for the slots in the template. RAPIER employs a bottom-up learning algorithm which incorporates techniques from several inductive logic programming systems and acquires unbounded patterns that include constraints on the words, part-of-speech tags, and semantic classes present in the filler and the surrounding text. We present encouraging experimental results on two domains.", "year": 1999, "referenceCount": 38, "citationCount": 707, "influentialCitationCount": 38, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1967815", "name": "Mary Elaine Califf"}, {"authorId": "1797655", "name": "R. Mooney"}]}, {"paperId": "3a84214cb69ea0b34352285029f368b75718c32b", "url": "https://www.semanticscholar.org/paper/3a84214cb69ea0b34352285029f368b75718c32b", "title": "Understanding of a convolutional neural network", "abstract": "The term Deep Learning or Deep Neural Network refers to Artificial Neural Networks (ANN) with multi layers. Over the last few decades, it has been considered to be one of the most powerful tools, and has become very popular in the literature as it is able to handle a huge amount of data. The interest in having deeper hidden layers has recently begun to surpass classical methods performance in different fields; especially in pattern recognition. One of the most popular deep neural networks is the Convolutional Neural Network (CNN). It take this name from mathematical linear operation between matrixes called convolution. CNN have multiple layers; including convolutional layer, non-linearity layer, pooling layer and fully-connected layer. The convolutional and fully-connected layers have parameters but pooling and non-linearity layers don't have parameters. The CNN has an excellent performance in machine learning problems. Specially the applications that deal with image data, such as largest image classification data set (Image Net), computer vision, and in natural language processing (NLP) and the results achieved were very amazing. In this paper we will explain and define all the elements and important issues related to CNN, and how these elements work. In addition, we will also state the parameters that effect CNN efficiency. This paper assumes that the readers have adequate knowledge about both machine learning and artificial neural network.", "year": 2017, "referenceCount": 14, "citationCount": 1314, "influentialCitationCount": 100, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "147999774", "name": "Saad Albawi"}, {"authorId": "37517325", "name": "T. Mohammed"}, {"authorId": "1410550919", "name": "Saad Al-Zawi"}]}, {"paperId": "d12864a8acbab1830be755bfb9cb177e31ca5e20", "url": "https://www.semanticscholar.org/paper/d12864a8acbab1830be755bfb9cb177e31ca5e20", "title": "On-Line and Off-Line Handwriting Recognition: A Comprehensive Survey", "abstract": "Handwriting has continued to persist as a means of communication and recording information in day-to-day life even with the introduction of new technologies. Given its ubiquity in human transactions, machine recognition of handwriting has practical significance, as in reading handwritten notes in a PDA, in postal addresses on envelopes, in amounts in bank checks, in handwritten fields in forms, etc. This overview describes the nature of handwritten language, how it is transduced into electronic data, and the basic concepts behind written language recognition algorithms. Both the online case (which pertains to the availability of trajectory data during writing) and the off-line case (which pertains to scanned images) are considered. Algorithms for preprocessing, character and word recognition, and performance with practical systems are indicated. Other fields of application, like signature verification, writer authentification, handwriting learning tools are also considered.", "year": 2000, "referenceCount": 715, "citationCount": 2785, "influentialCitationCount": 93, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144586498", "name": "R. Plamondon"}, {"authorId": "1696384", "name": "S. Srihari"}]}, {"paperId": "bcb46edd9262251da16f7442a170471f2a81a6bd", "url": "https://www.semanticscholar.org/paper/bcb46edd9262251da16f7442a170471f2a81a6bd", "title": "Machine Learning in Materials Science", "abstract": null, "year": 2016, "referenceCount": 182, "citationCount": 212, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46199341", "name": "Tim Mueller"}, {"authorId": "4833974", "name": "A. Kusne"}, {"authorId": "4063724", "name": "R. Ramprasad"}]}, {"paperId": "5b918ae410569af12be0f4ce3055d28d5ec3cab0", "url": "https://www.semanticscholar.org/paper/5b918ae410569af12be0f4ce3055d28d5ec3cab0", "title": "Interactive machine learning: letting users build classifiers", "abstract": "Abstract According to standard procedure, building a classifier using machine learning is a fully automated process that follows the preparation of training data by a domain expert. In contrast, interactive machine learning engages users in actually generating the classifier themselves. This offers a natural way of integrating background knowledge into the modelling stage—as long as interactive tools can be designed that support efficient and effective communication. This paper shows that appropriate techniques can empower users to create models that compete with classifiers built by state-of-the-art learning algorithms. It demonstrates that users—even users who are not domain experts—can often construct good classifiers, without any help from a learning algorithm, using a simple two-dimensional visual interface. Experiments on real data demonstrate that, not surprisingly, success hinges on the domain: if a few attributes can support good predictions, users generate accurate classifiers, whereas domains with many high-order attribute interactions favour standard machine learning techniques. We also present an artificial example where domain knowledge allows an “expert user” to create a much more accurate model than automatic learning algorithms. These results indicate that our system has the potential to produce highly accurate classifiers in the hands of a domain expert who has a strong interest in the domain and therefore some insights into how to partition the data. Moreover, small expert-defined models offer the additional advantage that they will generally be more intelligible than those generated by automatic techniques.", "year": 2002, "referenceCount": 10, "citationCount": 195, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "70564156", "name": "Malcolm Ware"}, {"authorId": "143713826", "name": "Eibe Frank"}, {"authorId": "144282963", "name": "G. Holmes"}, {"authorId": "118860642", "name": "M. Hall"}, {"authorId": "9419406", "name": "I. Witten"}]}, {"paperId": "c0927ffb79810318daab8821068629975cab67ad", "url": "https://www.semanticscholar.org/paper/c0927ffb79810318daab8821068629975cab67ad", "title": "Deep Learning for Classification of Malware System Call Sequences", "abstract": null, "year": 2016, "referenceCount": 43, "citationCount": 375, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2582104", "name": "Bojan Kolosnjaji"}, {"authorId": "2403031", "name": "Apostolis Zarras"}, {"authorId": "1396893935", "name": "George D. Webster"}, {"authorId": "49601001", "name": "C. Eckert"}]}, {"paperId": "d4de528645fdfc6d954364a8e6eeeed9480ccfa2", "url": "https://www.semanticscholar.org/paper/d4de528645fdfc6d954364a8e6eeeed9480ccfa2", "title": "Machine Learning for Networking: Workflow, Advances and Opportunities", "abstract": "Recently, machine learning has been used in every possible field to leverage its amazing power. For a long time, the networking and distributed computing system is the key infrastructure to provide efficient computational resources for machine learning. Networking itself can also benefit from this promising technology. This article focuses on the application of MLN, which can not only help solve the intractable old network questions but also stimulate new network applications. In this article, we summarize the basic workflow to explain how to apply machine learning technology in the networking domain. Then we provide a selective survey of the latest representative advances with explanations of their design principles and benefits. These advances are divided into several network design objectives and the detailed information of how they perform in each step of MLN workflow is presented. Finally, we shed light on the new opportunities in networking design and community building of this new inter-discipline. Our goal is to provide a broad research guideline on networking with machine learning to help motivate researchers to develop innovative algorithms, standards and frameworks.", "year": 2017, "referenceCount": 18, "citationCount": 280, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109018752", "name": "Mowei Wang"}, {"authorId": "143905357", "name": "Yong Cui"}, {"authorId": "2153687403", "name": "Xin Wang"}, {"authorId": "1994540", "name": "Shihan Xiao"}, {"authorId": "1727978", "name": "Junchen Jiang"}]}, {"paperId": "2b9bb3482f6ca2f7ca9d6bd764d689eae7bd1e00", "url": "https://www.semanticscholar.org/paper/2b9bb3482f6ca2f7ca9d6bd764d689eae7bd1e00", "title": "Single Machine Scheduling with Learning Effect Considerations", "abstract": null, "year": 2000, "referenceCount": 22, "citationCount": 298, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143984237", "name": "T. Cheng"}, {"authorId": "122337039", "name": "Guoqing Wang"}]}, {"paperId": "a8e3a1871f50ebd5e3c457bbe1a0c72c4655cee9", "url": "https://www.semanticscholar.org/paper/a8e3a1871f50ebd5e3c457bbe1a0c72c4655cee9", "title": "Layered learning in multiagent systems - a winning approach to robotic soccer", "abstract": "From the Publisher: \nThis book looks at multiagent systems that consist of teams of autonomous agents acting in real-time, noisy, collaborative, and adversarial environments. The book makes four main contributions to the fields of machine learning and multiagent systems. \nFirst, it describes an architecture within which a flexible team structure allows member agents to decompose a task into flexible roles and to switch roles while acting. Second, it presents layered learning, a general-purpose machine-learning method for complex domains in which learning a mapping directly from agents' sensors to their actuators is intractable with existing machine-learning methods. Third, the book introduces a new multiagent reinforcement learning algorithm--team-partitioned, opaque-transition reinforcement learning (TPOT-RL)--designed for domains in which agents cannot necessarily observe the state-changes caused by other agents' actions. The final contribution is a fully functioning multiagent system that incorporates learning in a real-time, noisy domain with teammates and adversaries--a computer-simulated robotic soccer team. \nPeter Stone's work is the basis for the CMUnited Robotic Soccer Team, which has dominated recent RoboCup competitions. RoboCup not only helps roboticists to prove their theories in a realistic situation, but has drawn considerable public and professional attention to the field of intelligent robotics. The CMUnited team won the 1999 Stockholm simulator competition, outscoring its opponents by the rather impressive cumulative score of 110-0.", "year": 2000, "referenceCount": 0, "citationCount": 342, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "144848112", "name": "P. Stone"}]}, {"paperId": "77233d2f6fd10465a574ca33b869707822bf0c0b", "url": "https://www.semanticscholar.org/paper/77233d2f6fd10465a574ca33b869707822bf0c0b", "title": "A brief survey of machine learning methods and their sensor and IoT applications", "abstract": "This paper provides a brief survey of the basic concepts and algorithms used for Machine Learning and its applications. We begin with a broader definition of machine learning and then introduce various learning modalities including supervised and unsupervised methods and deep learning paradigms. In the rest of the paper, we discuss applications of machine learning algorithms in various fields including pattern recognition, sensor networks, anomaly detection, Internet of Things (IoT) and health monitoring. In the final sections, we present some of the software tools and an extensive bibliography.", "year": 2017, "referenceCount": 222, "citationCount": 156, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40692862", "name": "U. Shanthamallu"}, {"authorId": "144924839", "name": "A. Spanias"}, {"authorId": "1755611", "name": "C. Tepedelenlioğlu"}, {"authorId": "147607265", "name": "M. Stanley"}]}, {"paperId": "531e3a7b7768f199fdd401b266504db245ca039a", "url": "https://www.semanticscholar.org/paper/531e3a7b7768f199fdd401b266504db245ca039a", "title": "On Detecting Adversarial Perturbations", "abstract": "Machine learning and deep learning in particular has advanced tremendously on perceptual tasks in recent years. However, it remains vulnerable against adversarial perturbations of the input that have been crafted specifically to fool the system while being quasi-imperceptible to a human. In this work, we propose to augment deep neural networks with a small \"detector\" subnetwork which is trained on the binary classification task of distinguishing genuine data from data containing adversarial perturbations. Our method is orthogonal to prior work on addressing adversarial perturbations, which has mostly focused on making the classification network itself more robust. We show empirically that adversarial perturbations can be detected surprisingly well even though they are quasi-imperceptible to humans. Moreover, while the detectors have been trained to detect only a specific adversary, they generalize to similar and weaker adversaries. In addition, we propose an adversarial attack that fools both the classifier and the detector and a novel training procedure for the detector that counteracts this attack.", "year": 2017, "referenceCount": 23, "citationCount": 757, "influentialCitationCount": 52, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2708564", "name": "J. H. Metzen"}, {"authorId": "3081854", "name": "Tim Genewein"}, {"authorId": "47092548", "name": "Volker Fischer"}, {"authorId": "3452473", "name": "B. Bischoff"}]}, {"paperId": "79dbd8d9859ffae752ab332ee8a8e3a0bd298ee1", "url": "https://www.semanticscholar.org/paper/79dbd8d9859ffae752ab332ee8a8e3a0bd298ee1", "title": "Genetic programming as a means for programming computers by natural selection", "abstract": null, "year": 1994, "referenceCount": 75, "citationCount": 728, "influentialCitationCount": 38, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1732302", "name": "J. Koza"}]}, {"paperId": "77826df024f97583eb05700a28e11056a4aab848", "url": "https://www.semanticscholar.org/paper/77826df024f97583eb05700a28e11056a4aab848", "title": "Latent Intention Dialogue Models", "abstract": "Developing a dialogue agent that is capable of making autonomous decisions and communicating by natural language is one of the long-term goals of machine learning research. Traditional approaches either rely on hand-crafting a small state-action set for applying reinforcement learning that is not scalable or constructing deterministic models for learning dialogue sentences that fail to capture natural conversational variability. In this paper, we propose a Latent Intention Dialogue Model (LIDM) that employs a discrete latent variable to learn underlying dialogue intentions in the framework of neural variational inference. In a goal-oriented dialogue scenario, these latent intentions can be interpreted as actions guiding the generation of machine responses, which can be further refined autonomously by reinforcement learning. The experimental evaluation of LIDM shows that the model out-performs published benchmarks for both corpus-based and human evaluation, demonstrating the effectiveness of discrete latent variable models for learning goal-oriented dialogues.", "year": 2017, "referenceCount": 47, "citationCount": 134, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144256365", "name": "Tsung-Hsien Wen"}, {"authorId": "2666898", "name": "Yishu Miao"}, {"authorId": "1685771", "name": "P. Blunsom"}, {"authorId": "145259603", "name": "S. Young"}]}, {"paperId": "21ce0cc1ad63132746f6fbbb8b4f9862a5b1b164", "url": "https://www.semanticscholar.org/paper/21ce0cc1ad63132746f6fbbb8b4f9862a5b1b164", "title": "Introducing Machine Learning Concepts with WEKA", "abstract": null, "year": 2016, "referenceCount": 31, "citationCount": 148, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2111866663", "name": "Tony C. Smith"}, {"authorId": "143713826", "name": "Eibe Frank"}]}, {"paperId": "219355e8c58b78c409e34677da50b49fb4c1eacd", "url": "https://www.semanticscholar.org/paper/219355e8c58b78c409e34677da50b49fb4c1eacd", "title": "AutoML-Zero: Evolving Machine Learning Algorithms From Scratch", "abstract": "Machine learning research has advanced in multiple aspects, including model structures and learning methods. The effort to automate such research, known as AutoML, has also made significant progress. However, this progress has largely focused on the architecture of neural networks, where it has relied on sophisticated expert-designed layers as building blocks---or similarly restrictive search spaces. Our goal is to show that AutoML can go further: it is possible today to automatically discover complete machine learning algorithms just using basic mathematical operations as building blocks. We demonstrate this by introducing a novel framework that significantly reduces human bias through a generic search space. Despite the vastness of this space, evolutionary search can still discover two-layer neural networks trained by backpropagation. These simple neural networks can then be surpassed by evolving directly on tasks of interest, e.g. CIFAR-10 variants, where modern techniques emerge in the top algorithms, such as bilinear interactions, normalized gradients, and weight averaging. Moreover, evolution adapts algorithms to different task types: e.g., dropout-like techniques appear when little data is available. We believe these preliminary successes in discovering machine learning algorithms from scratch indicate a promising new direction for the field.", "year": 2020, "referenceCount": 119, "citationCount": 118, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2892780", "name": "Esteban Real"}, {"authorId": "145246869", "name": "Chen Liang"}, {"authorId": "48165870", "name": "David R. So"}, {"authorId": "2827616", "name": "Quoc V. Le"}]}, {"paperId": "512b8ef0002e0bfd0ecb5ab17d533c1762eb9786", "url": "https://www.semanticscholar.org/paper/512b8ef0002e0bfd0ecb5ab17d533c1762eb9786", "title": "Set Transformer: A Framework for Attention-based Permutation-Invariant Neural Networks", "abstract": "Many machine learning tasks such as multiple instance learning, 3D shape recognition, and few-shot image classification are defined on sets of instances. Since solutions to such problems do not depend on the order of elements of the set, models used to address them should be permutation invariant. We present an attention-based neural network module, the Set Transformer, specifically designed to model interactions among elements in the input set. The model consists of an encoder and a decoder, both of which rely on attention mechanisms. In an effort to reduce computational complexity, we introduce an attention scheme inspired by inducing point methods from sparse Gaussian process literature. It reduces the computation time of self-attention from quadratic to linear in the number of elements in the set. We show that our model is theoretically attractive and we evaluate it on a range of tasks, demonstrating the state-of-the-art performance compared to recent methods for set-structured data.", "year": 2018, "referenceCount": 39, "citationCount": 540, "influentialCitationCount": 129, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2108550899", "name": "Juho Lee"}, {"authorId": "2110392124", "name": "Yoonho Lee"}, {"authorId": "2629559", "name": "Jungtaek Kim"}, {"authorId": "7497792", "name": "Adam R. Kosiorek"}, {"authorId": "3960497", "name": "Seungjin Choi"}, {"authorId": "1725303", "name": "Y. Teh"}]}, {"paperId": "427b168f490b56716f22b129ac93aba5425ea08f", "url": "https://www.semanticscholar.org/paper/427b168f490b56716f22b129ac93aba5425ea08f", "title": "Training linear SVMs in linear time", "abstract": "Linear Support Vector Machines (SVMs) have become one of the most prominent machine learning techniques for high-dimensional sparse data commonly encountered in applications like text classification, word-sense disambiguation, and drug design. These applications involve a large number of examples n as well as a large number of features N, while each example has only s << N non-zero features. This paper presents a Cutting Plane Algorithm for training linear SVMs that provably has training time 0(s,n) for classification problems and o(sn log (n))for ordinal regression problems. The algorithm is based on an alternative, but equivalent formulation of the SVM optimization problem. Empirically, the Cutting-Plane Algorithm is several orders of magnitude faster than decomposition methods like svm light for large datasets.", "year": 2006, "referenceCount": 25, "citationCount": 2147, "influentialCitationCount": 338, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1680188", "name": "T. Joachims"}]}, {"paperId": "f488e4a252c018f9391b0dc90036687a0b361844", "url": "https://www.semanticscholar.org/paper/f488e4a252c018f9391b0dc90036687a0b361844", "title": "Implementing Machine Learning in Radiology Practice and Research.", "abstract": "OBJECTIVE\nThe purposes of this article are to describe concepts that radiologists should understand to evaluate machine learning projects, including common algorithms, supervised as opposed to unsupervised techniques, statistical pitfalls, and data considerations for training and evaluation, and to briefly describe ethical dilemmas and legal risk.\n\n\nCONCLUSION\nMachine learning includes a broad class of computer programs that improve with experience. The complexity of creating, training, and monitoring machine learning indicates that the success of the algorithms will require radiologist involvement for years to come, leading to engagement rather than replacement.", "year": 2017, "referenceCount": 18, "citationCount": 186, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "145744080", "name": "M. Kohli"}, {"authorId": "144477836", "name": "L. Prevedello"}, {"authorId": "3005117", "name": "Ross W. Filice"}, {"authorId": "144304449", "name": "J. R. Geis"}]}, {"paperId": "ad13187dc62e8dd39e767258c7e70767733d54e5", "url": "https://www.semanticscholar.org/paper/ad13187dc62e8dd39e767258c7e70767733d54e5", "title": "The Power of Decision Tables", "abstract": null, "year": 1995, "referenceCount": 82, "citationCount": 843, "influentialCitationCount": 69, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1726733", "name": "Ron Kohavi"}]}, {"paperId": "2bc3644ce4de7fce5812c1455e056649a47c1bbf", "url": "https://www.semanticscholar.org/paper/2bc3644ce4de7fce5812c1455e056649a47c1bbf", "title": "Effective Heart Disease Prediction Using Hybrid Machine Learning Techniques", "abstract": "Heart disease is one of the most significant causes of mortality in the world today. Prediction of cardiovascular disease is a critical challenge in the area of clinical data analysis. Machine learning (ML) has been shown to be effective in assisting in making decisions and predictions from the large quantity of data produced by the healthcare industry. We have also seen ML techniques being used in recent developments in different areas of the Internet of Things (IoT). Various studies give only a glimpse into predicting heart disease with ML techniques. In this paper, we propose a novel method that aims at finding significant features by applying machine learning techniques resulting in improving the accuracy in the prediction of cardiovascular disease. The prediction model is introduced with different combinations of features and several known classification techniques. We produce an enhanced performance level with an accuracy level of 88.7% through the prediction model for heart disease with the hybrid random forest with a linear model (HRFLM).", "year": 2019, "referenceCount": 46, "citationCount": 438, "influentialCitationCount": 26, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "150302778", "name": "Senthilkumar Mohan"}, {"authorId": "9727014", "name": "Chandrasegar Thirumalai"}, {"authorId": "144369609", "name": "Gautam Srivastava"}]}, {"paperId": "bdef059783dd682dbf79b2ae0c1fad470515686c", "url": "https://www.semanticscholar.org/paper/bdef059783dd682dbf79b2ae0c1fad470515686c", "title": "An interpretable mortality prediction model for COVID-19 patients", "abstract": null, "year": 2020, "referenceCount": 21, "citationCount": 619, "influentialCitationCount": 53, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "11457201", "name": "Li Yan"}, {"authorId": "2143789452", "name": "Hai-Tao Zhang"}, {"authorId": "2057298386", "name": "J. Gonçalves"}, {"authorId": "2116643347", "name": "Yang Xiao"}, {"authorId": "2119575354", "name": "Maolin Wang"}, {"authorId": "2023797639", "name": "Yuqi Guo"}, {"authorId": "1752790550", "name": "Chuan Sun"}, {"authorId": "80896191", "name": "Xiuchuan Tang"}, {"authorId": "2113523079", "name": "Liang Jing"}, {"authorId": "2155081555", "name": "Mingyang Zhang"}, {"authorId": "2116999971", "name": "Xiang Huang"}, {"authorId": "48182459", "name": "Ying Xiao"}, {"authorId": "1621401294", "name": "Haosen Cao"}, {"authorId": "2124914699", "name": "Yanyan Chen"}, {"authorId": "153281315", "name": "Tongxin Ren"}, {"authorId": "11357602", "name": "F. Wang"}, {"authorId": "1606091103", "name": "Yaru Xiao"}, {"authorId": "4606939", "name": "Sufang Huang"}, {"authorId": "2112780500", "name": "X. Tan"}, {"authorId": "46177759", "name": "Nian-nian Huang"}, {"authorId": "2065220233", "name": "B. Jiao"}, {"authorId": "2027359212", "name": "Cheng Cheng"}, {"authorId": "2144290701", "name": "Yong Zhang"}, {"authorId": "144939278", "name": "A. Luo"}, {"authorId": "16913401", "name": "L. Mombaerts"}, {"authorId": "3407675", "name": "Junyang Jin"}, {"authorId": "9210977", "name": "ZHIGUO CAO"}, {"authorId": "50341866", "name": "Shusheng Li"}, {"authorId": "47995639", "name": "Hui Xu"}, {"authorId": "2109127657", "name": "Ye Yuan"}]}, {"paperId": "31fbba3638f0d930a678d85247045ea5a1a4ec88", "url": "https://www.semanticscholar.org/paper/31fbba3638f0d930a678d85247045ea5a1a4ec88", "title": "Unsupervised Machine Learning on a Hybrid Quantum Computer", "abstract": "Machine learning techniques have led to broad adoption of a statistical model of computing. The statistical distributions natively available on quantum processors are a superset of those available classically. Harnessing this attribute has the potential to accelerate or otherwise improve machine learning relative to purely classical performance. A key challenge toward that goal is learning to hybridize classical computing resources and traditional learning techniques with the emerging capabilities of general purpose quantum processors. Here, we demonstrate such hybridization by training a 19-qubit gate model processor to solve a clustering problem, a foundational challenge in unsupervised learning. We use the quantum approximate optimization algorithm in conjunction with a gradient-free Bayesian optimization to train the quantum machine. This quantum/classical hybrid algorithm shows robustness to realistic noise, and we find evidence that classical optimization can be used to train around both coherent and incoherent imperfections.", "year": 2017, "referenceCount": 41, "citationCount": 198, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Physics"], "authors": [{"authorId": "51100085", "name": "J. Otterbach"}, {"authorId": "51103214", "name": "R. Manenti"}, {"authorId": "4099324", "name": "N. Alidoust"}, {"authorId": "46970929", "name": "A. Bestwick"}, {"authorId": "35692165", "name": "M. Block"}, {"authorId": "35635287", "name": "B. Bloom"}, {"authorId": "47759624", "name": "S. Caldwell"}, {"authorId": "50623640", "name": "N. Didier"}, {"authorId": "144983451", "name": "E. Fried"}, {"authorId": "2158139650", "name": "S. Hong"}, {"authorId": "35368333", "name": "Peter J. Karalekas"}, {"authorId": "39704765", "name": "C. Osborn"}, {"authorId": "50355079", "name": "A. Papageorge"}, {"authorId": "2059365466", "name": "E. C. Peterson"}, {"authorId": "8560581", "name": "G. Prawiroatmodjo"}, {"authorId": "34743111", "name": "N. Rubin"}, {"authorId": "8134599", "name": "C. Ryan"}, {"authorId": "10731825", "name": "D. Scarabelli"}, {"authorId": "2066443417", "name": "M. Scheer"}, {"authorId": "4243405", "name": "E. A. Sete"}, {"authorId": "34588692", "name": "P. Sivarajah"}, {"authorId": "2119026669", "name": "Robert S. Smith"}, {"authorId": "3974460", "name": "A. Staley"}, {"authorId": "145950540", "name": "N. Tezak"}, {"authorId": "40068050", "name": "W. Zeng"}, {"authorId": "2059325411", "name": "A. Hudson"}, {"authorId": "48364846", "name": "Blake R. Johnson"}, {"authorId": "7285332", "name": "M. Reagor"}, {"authorId": "2107711819", "name": "M. Silva"}, {"authorId": "3400516", "name": "C. Rigetti"}]}, {"paperId": "a86171e13f84fe32212dd7fb6a1c31a34a47155f", "url": "https://www.semanticscholar.org/paper/a86171e13f84fe32212dd7fb6a1c31a34a47155f", "title": "Knowledge-based analysis of microarray gene expression data by using support vector machines.", "abstract": "We introduce a method of functionally classifying genes by using gene expression data from DNA microarray hybridization experiments. The method is based on the theory of support vector machines (SVMs). SVMs are considered a supervised computer learning method because they exploit prior knowledge of gene function to identify unknown genes of similar function from expression data. SVMs avoid several problems associated with unsupervised clustering methods, such as hierarchical clustering and self-organizing maps. SVMs have many mathematical features that make them attractive for gene expression analysis, including their flexibility in choosing a similarity function, sparseness of solution when dealing with large data sets, the ability to handle large feature spaces, and the ability to identify outliers. We test several SVMs that use different similarity metrics, as well as some other supervised learning methods, and find that the SVMs best identify sets of genes with a common function using expression data. Finally, we use SVMs to predict functional roles for uncharacterized yeast ORFs based on their expression data.", "year": 2000, "referenceCount": 43, "citationCount": 2381, "influentialCitationCount": 83, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144379841", "name": "M. P. Brown"}, {"authorId": "2361327", "name": "W. Grundy"}, {"authorId": "2116443182", "name": "D. Lin"}, {"authorId": "1685083", "name": "N. Cristianini"}, {"authorId": "2070640", "name": "C. Sugnet"}, {"authorId": "1716986", "name": "T. Furey"}, {"authorId": "145729499", "name": "M. Ares"}, {"authorId": "1733689", "name": "D. Haussler"}]}, {"paperId": "dcf351fb987610c09dbb6aa1353382ae6bbce7e6", "url": "https://www.semanticscholar.org/paper/dcf351fb987610c09dbb6aa1353382ae6bbce7e6", "title": "Data Mining Methods for Knowledge Discovery", "abstract": "Foreword. Preface. 1. Data Mining and Knowledge Discovery. 2. Rough Sets. 3. Fuzzy Sets. 4. Bayesian Methods. 5. Evolutionary Computing. 6. Machine Learning. 7. Neural Networks. 8. Clustering. 9. Preprocessing. Index.", "year": 1998, "referenceCount": 0, "citationCount": 624, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2810659", "name": "K. Cios"}, {"authorId": "1731634", "name": "W. Pedrycz"}, {"authorId": "2939044", "name": "R. Swiniarski"}]}, {"paperId": "227e0591634cef50d0bcfc73fe6c5b34a2256e5f", "url": "https://www.semanticscholar.org/paper/227e0591634cef50d0bcfc73fe6c5b34a2256e5f", "title": "Radio Machine Learning Dataset Generation with GNU Radio", "abstract": "This paper surveys emerging applications of Machine Learning (ML) to the Radio Signal Processing domain.  Provides some brief background on enabling methods and discusses some of the potential advancements for the field.  It discusses the critical importance of good datasets for model learning, testing, and evaluation and introduces several public open source synthetic datasets for various radio machine learning tasks.  These are intended to provide a robust common baselines for those working in the field and to provide a benchmark measure against which many techniques can be rapidly evaluated and compared.", "year": 2016, "referenceCount": 21, "citationCount": 251, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "1388350203", "name": "Tim O'Shea"}, {"authorId": "145028728", "name": "Nathan E. West"}]}, {"paperId": "3bc4736f9b8512043ed47357a81f26b93a1204b6", "url": "https://www.semanticscholar.org/paper/3bc4736f9b8512043ed47357a81f26b93a1204b6", "title": "Semi-supervised learning with graphs", "abstract": "In traditional machine learning approaches to classification, one uses only a labeled set to train the classifier. Labeled instances however are often difficult, expensive, or time consuming to obtain, as they require the efforts of experienced human annotators. Meanwhile unlabeled data may be relatively easy to collect, but there has been few ways to use them. Semi-supervised learning addresses this problem by using large amount of unlabeled data, together with the labeled data, to build better classifiers. Because semi-supervised learning requires less human effort and gives higher accuracy, it is of great interest both in theory and in practice. \nWe present a series of novel semi-supervised learning approaches arising from a graph representation, where labeled and unlabeled instances are represented as vertices, and edges encode the similarity between instances. They address the following questions: How to use unlabeled data? (label propagation); What is the probabilistic interpretation? (Gaussian fields and harmonic functions); What if we can choose labeled data? (active learning); How to construct good graphs? (hyperparameter learning); How to work with kernel machines like SVM? (graph kernels); How to handle complex data like sequences? (kernel conditional random fields); How to handle scalability and induction? (harmonic mixtures). An extensive literature review is included at the end.", "year": 2005, "referenceCount": 136, "citationCount": 636, "influentialCitationCount": 63, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1832364", "name": "Xiaojin Zhu"}, {"authorId": "1739581", "name": "J. Lafferty"}, {"authorId": "145903504", "name": "R. Rosenfeld"}]}, {"paperId": "cc944c3a1b51ff3112840cb147c32c14433b1279", "url": "https://www.semanticscholar.org/paper/cc944c3a1b51ff3112840cb147c32c14433b1279", "title": "Systematic Poisoning Attacks on and Defenses for Machine Learning in Healthcare", "abstract": "Machine learning is being used in a wide range of application domains to discover patterns in large datasets. Increasingly, the results of machine learning drive critical decisions in applications related to healthcare and biomedicine. Such health-related applications are often sensitive, and thus, any security breach would be catastrophic. Naturally, the integrity of the results computed by machine learning is of great importance. Recent research has shown that some machine-learning algorithms can be compromised by augmenting their training datasets with malicious data, leading to a new class of attacks called poisoning attacks. Hindrance of a diagnosis may have life-threatening consequences and could cause distrust. On the other hand, not only may a false diagnosis prompt users to distrust the machine-learning algorithm and even abandon the entire system but also such a false positive classification may cause patient distress. In this paper, we present a systematic, algorithm-independent approach for mounting poisoning attacks across a wide range of machine-learning algorithms and healthcare datasets. The proposed attack procedure generates input data, which, when added to the training set, can either cause the results of machine learning to have targeted errors (e.g., increase the likelihood of classification into a specific class), or simply introduce arbitrary errors (incorrect classification). These attacks may be applied to both fixed and evolving datasets. They can be applied even when only statistics of the training dataset are available or, in some cases, even without access to the training dataset, although at a lower efficacy. We establish the effectiveness of the proposed attacks using a suite of six machine-learning algorithms and five healthcare datasets. Finally, we present countermeasures against the proposed generic attacks that are based on tracking and detecting deviations in various accuracy metrics, and benchmark their effectiveness.", "year": 2015, "referenceCount": 47, "citationCount": 164, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1703366", "name": "Mehran Mozaffari Kermani"}, {"authorId": "1398781979", "name": "S. Sur-Kolay"}, {"authorId": "145291370", "name": "A. Raghunathan"}, {"authorId": "144874163", "name": "N. Jha"}]}, {"paperId": "14d0faa1e9e3e33c400176a33c657992ab332a88", "url": "https://www.semanticscholar.org/paper/14d0faa1e9e3e33c400176a33c657992ab332a88", "title": "Statistical topological data analysis using persistence landscapes", "abstract": "We define a new topological summary for data that we call the persistence landscape. Since this summary lies in a vector space, it is easy to combine with tools from statistics and machine learning, in contrast to the standard topological summaries. Viewed as a random variable with values in a Banach space, this summary obeys a strong law of large numbers and a central limit theorem. We show how a number of standard statistical tests can be used for statistical inference using this summary. We also prove that this summary is stable and that it can be used to provide lower bounds for the bottleneck and Wasserstein distances.", "year": 2012, "referenceCount": 78, "citationCount": 610, "influentialCitationCount": 68, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "3123376", "name": "Peter Bubenik"}]}, {"paperId": "02adea3455cd7b09e1dac9ddf2637a1e7ae84005", "url": "https://www.semanticscholar.org/paper/02adea3455cd7b09e1dac9ddf2637a1e7ae84005", "title": "Inductive learning algorithms and representations for text categorization", "abstract": "1. ABSTRACT Text categorization – the assignment of natural language texts to one or more predefined categories based on their content – is an important component in many information organization and management tasks. We compare the effectiveness of five different automatic learning algorithms for text categorization in terms of learning speed, realtime classification speed, and classification accuracy. We also examine training set size, and alternative document representations. Very accurate text classifiers can be learned automatically from training examples. Linear Support Vector Machines (SVMs) are particularly promising because they are very accurate, quick to train, and quick to evaluate. 1.1", "year": 1998, "referenceCount": 31, "citationCount": 1400, "influentialCitationCount": 66, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1728602", "name": "S. Dumais"}, {"authorId": "144189092", "name": "John C. Platt"}, {"authorId": "1934343", "name": "David Hecherman"}, {"authorId": "1764547", "name": "M. Sahami"}]}, {"paperId": "ae73fa99d777efd07ed5a73cdc695191862f9d9e", "url": "https://www.semanticscholar.org/paper/ae73fa99d777efd07ed5a73cdc695191862f9d9e", "title": "Drug Design by Machine Learning: Support Vector Machines for Pharmaceutical Data Analysis", "abstract": null, "year": 2001, "referenceCount": 52, "citationCount": 600, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2916240", "name": "R. Burbidge"}, {"authorId": "80170770", "name": "M. Trotter"}, {"authorId": "31557997", "name": "B. Buxton"}, {"authorId": "2732041", "name": "S. Holden"}]}, {"paperId": "a9565f70db3a6b5e4ff1df272238b8d7a84a1337", "url": "https://www.semanticscholar.org/paper/a9565f70db3a6b5e4ff1df272238b8d7a84a1337", "title": "Experience with a learning personal assistant", "abstract": "Personal software assistants that help users with tasks like finding information, scheduling calendars, or managing work-flow will require significant customization to each individual user. For example, an assistant that helps schedule a particular user’s calendar will have to know that user’s scheduling preferences. This paper explores the potential of machine learning methods to automatically create and maintain such customized knowledge for personal software assistants. We describe the design of one particular learning assistant: a calendar manager, called CAP (Calendar APprentice), that learns user scheduling preferences from experience. Results are summarized from approximately five user-years of experience, during which CAP has learned an evolving set of several thousand rules that characterize the scheduling preferences of its users. Based on this experience, we suggest that machine learning methods may play an important role in future personal software assistants.", "year": 1994, "referenceCount": 25, "citationCount": 513, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40975594", "name": "Tom Michael Mitchell"}, {"authorId": "145727186", "name": "R. Caruana"}, {"authorId": "1758106", "name": "D. Freitag"}, {"authorId": "14828509", "name": "J. McDermott"}, {"authorId": "39787642", "name": "David Zabowski"}]}, {"paperId": "f4387d52b5c48f386a1fa3e11d529c3a89ee0717", "url": "https://www.semanticscholar.org/paper/f4387d52b5c48f386a1fa3e11d529c3a89ee0717", "title": "Machine learning using intrinsic genomic signatures for rapid classification of novel pathogens: COVID-19 case study", "abstract": "As of February 20, 2020, the 2019 novel coronavirus (renamed to COVID-19) spread to 30 countries with 2130 deaths and more than 75500 confirmed cases. COVID-19 is being compared to the infamous SARS coronavirus, which resulted, between November 2002 and July 2003, in 8098 confirmed cases worldwide with a 9.6% death rate and 774 deaths. Though COVID-19 has a death rate of 2.8% as of 20 February, the 75752 confirmed cases in a few weeks (December 8, 2019 to February 20, 2020) are alarming, with cases likely being under-reported given the comparatively longer incubation period. Such outbreaks demand elucidation of taxonomic classification and origin of the virus genomic sequence, for strategic planning, containment, and treatment. This paper identifies an intrinsic COVID-19 genomic signature and uses it together with a machine learning-based alignment-free approach for an ultra-fast, scalable, and highly accurate classification of whole COVID-19 genomes. The proposed method combines supervised machine learning with digital signal processing for genome analyses, augmented by a decision tree approach to the machine learning component, and a Spearman’s rank correlation coefficient analysis for result validation. These tools are used to analyze a large dataset of over 5000 unique viral genomic sequences, totalling 61.8 million bp. Our results support a hypothesis of a bat origin and classify COVID-19 as Sarbecovirus, within Betacoronavirus. Our method achieves high levels of classification accuracy and discovers the most relevant relationships among over 5,000 viral genomes within a few minutes, ab initio, using raw DNA sequence data alone, and without any specialized biological knowledge, training, gene or genome annotations. This suggests that, for novel viral and pathogen genome sequences, this alignment-free whole-genome machine-learning approach can provide a reliable real-time option for taxonomic classification.", "year": 2020, "referenceCount": 107, "citationCount": 446, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "66763448", "name": "Gurjit S. Randhawa"}, {"authorId": "66202600", "name": "M. P. Soltysiak"}, {"authorId": "1571741100", "name": "Hadi El Roz"}, {"authorId": "50128573", "name": "Camila P. E. de Souza"}, {"authorId": "31640060", "name": "K. Hill"}, {"authorId": "144073818", "name": "L. Kari"}]}, {"paperId": "94ac58d1b6132b07ef66c47af8bd506bdb67e0c3", "url": "https://www.semanticscholar.org/paper/94ac58d1b6132b07ef66c47af8bd506bdb67e0c3", "title": "Investigating statistical machine learning as a tool for software development", "abstract": "As statistical machine learning algorithms and techniques continue to mature, many researchers and developers see statistical machine learning not only as a topic of expert study, but also as a tool for software development. Extensive prior work has studied software development, but little prior work has studied software developers applying statistical machine learning. This paper presents interviews of eleven researchers experienced in applying statistical machine learning algorithms and techniques to human-computer interaction problems, as well as a study of ten participants working during a five-hour study to apply statistical machine learning algorithms and techniques to a realistic problem. We distill three related categories of difficulties that arise in applying statistical machine learning as a tool for software development: (1) difficulty pursuing statistical machine learning as an iterative and exploratory process, (2) difficulty understanding relationships between data and the behavior of statistical machine learning algorithms, and (3) difficulty evaluating the performance of statistical machine learning algorithms and techniques in the context of applications. This paper provides important new insight into these difficulties and the need for development tools that better support the application of statistical machine learning.", "year": 2008, "referenceCount": 32, "citationCount": 110, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39699737", "name": "Kayur Patel"}, {"authorId": "145504534", "name": "J. Fogarty"}, {"authorId": "9522307", "name": "J. Landay"}, {"authorId": "40376159", "name": "B. Harrison"}]}, {"paperId": "adc7bfe0a2c140d9401ea1eae8e8935b1428ccbf", "url": "https://www.semanticscholar.org/paper/adc7bfe0a2c140d9401ea1eae8e8935b1428ccbf", "title": "Horizon Detection Using Machine Learning Techniques", "abstract": "Detecting a horizon in an image is an important part of many image related applications such as detecting ships on the horizon, flight control, and port security. Most of the existing solutions for the problem only use image processing methods to identify a horizon line in an image. This results in good accuracy for many cases and is fast in computation. However, for some images with difficult environmental conditions like a foggy or cloudy sky these image processing methods are inherently inaccurate in identifying the correct horizon. This paper investigates how to detect the horizon line in a set of images using a machine learning approach. The performance of the SVM, J48, and naive Bayes classifiers, used for the problem, has been compared. Accuracy of 90-99% in identifying horizon was achieved on image data set of 20 images", "year": 2006, "referenceCount": 8, "citationCount": 94, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2908158", "name": "Sergiy Fefilatyev"}, {"authorId": "3237672", "name": "Volha Smarodzinava"}, {"authorId": "25887296", "name": "L. Hall"}, {"authorId": "1698267", "name": "D. Goldgof"}]}, {"paperId": "0dc6960a406b6040c8eb9645a89e39bf34226b3e", "url": "https://www.semanticscholar.org/paper/0dc6960a406b6040c8eb9645a89e39bf34226b3e", "title": "Biometrics from Brain Electrical Activity: A Machine Learning Approach", "abstract": "The potential of brain electrical activity generated as a response to a visual stimulus is examined in the context of the identification of individuals. Specifically, a framework for the visual evoked potential (VEP)-based biometrics is established, whereby energy features of the gamma band within VEP signals were of particular interest. A rigorous analysis is conducted which unifies and extends results from our previous studies, in particular, with respect to 1) increased bandwidth, 2) spatial averaging, 3) more robust power spectrum features, and 4) improved classification accuracy. Simulation results on a large group of subject support the analysis", "year": 2007, "referenceCount": 31, "citationCount": 247, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1806913", "name": "R. Palaniappan"}, {"authorId": "9368519", "name": "D. Mandic"}]}, {"paperId": "b87c0cf95208caacb025bf87d9ba451a87aacaca", "url": "https://www.semanticscholar.org/paper/b87c0cf95208caacb025bf87d9ba451a87aacaca", "title": "Machine Health Monitoring Using Local Feature-Based Gated Recurrent Unit Networks", "abstract": "In modern industries, machine health monitoring systems (MHMS) have been applied wildly with the goal of realizing predictive maintenance including failures tracking, downtime reduction, and assets preservation. In the era of big machinery data, data-driven MHMS have achieved remarkable results in the detection of faults after the occurrence of certain failures (diagnosis) and prediction of the future working conditions and the remaining useful life (prognosis). The numerical representation for raw sensory data is the key stone for various successful MHMS. Conventional methods are the labor-extensive as they usually depend on handcrafted features, which require expert knowledge. Inspired by the success of deep learning methods that redefine representation learning from raw data, we propose local feature-based gated recurrent unit (LFGRU) networks. It is a hybrid approach that combines handcrafted feature design with automatic feature learning for machine health monitoring. First, features from windows of input time series are extracted. Then, an enhanced bidirectional GRU network is designed and applied on the generated sequence of local features to learn the representation. A supervised learning layer is finally trained to predict machine condition. Experiments on three machine health monitoring tasks: tool wear prediction, gearbox fault diagnosis, and incipient bearing fault detection verify the effectiveness and generalization of the proposed LFGRU.", "year": 2018, "referenceCount": 41, "citationCount": 417, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "49832912", "name": "Rui Zhao"}, {"authorId": "2047932486", "name": "Dongzhe Wang"}, {"authorId": "35374692", "name": "Ruqiang Yan"}, {"authorId": "144067957", "name": "K. Mao"}, {"authorId": "40592209", "name": "Fei Shen"}, {"authorId": "49605588", "name": "Jinjiang Wang"}]}, {"paperId": "c713251fba147081e532ec6cbdb7bf971fef7aa8", "url": "https://www.semanticscholar.org/paper/c713251fba147081e532ec6cbdb7bf971fef7aa8", "title": "JAABA: interactive machine learning for automatic annotation of animal behavior", "abstract": null, "year": 2013, "referenceCount": 22, "citationCount": 432, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "34837742", "name": "Mayank Kabra"}, {"authorId": "2557555", "name": "A. Robie"}, {"authorId": "1401214040", "name": "M. Rivera-Alba"}, {"authorId": "3251767", "name": "Steve Branson"}, {"authorId": "2424812", "name": "K. Branson"}]}, {"paperId": "41bebd1951e57588e7829e44fab1bac0cc9251d2", "url": "https://www.semanticscholar.org/paper/41bebd1951e57588e7829e44fab1bac0cc9251d2", "title": "Torchvision the machine-vision package of torch", "abstract": "This paper presents Torchvision an open source machine vision package for Torch. Torch is a machine learning library providing a series of the state-of-the-art algorithms such as Neural Networks, Support Vector Machines, Gaussian Mixture Models, Hidden Markov Models and many others. Torchvision provides additional functionalities to manipulate and process images with standard image processing algorithms. Hence, the resulting images can be used directly with the Torch machine learning algorithms as Torchvision is fully integrated with Torch. Both Torch and Torchvision are written in C++ language and are publicly available under the Free-BSD License.", "year": 2010, "referenceCount": 3, "citationCount": 240, "influentialCitationCount": 29, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145607451", "name": "S. Marcel"}, {"authorId": "145835170", "name": "Y. Rodriguez"}]}, {"paperId": "b96a32ceb596a6894fc1a318ce1f8072991c7178", "url": "https://www.semanticscholar.org/paper/b96a32ceb596a6894fc1a318ce1f8072991c7178", "title": "Classifier Systems and the Animat Problem", "abstract": null, "year": 1987, "referenceCount": 37, "citationCount": 106, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2341152", "name": "Stewart W. Wilson"}]}, {"paperId": "5389977ca9f0fa3a628a4182d0f09c8cedef2421", "url": "https://www.semanticscholar.org/paper/5389977ca9f0fa3a628a4182d0f09c8cedef2421", "title": "Learning Machines", "abstract": "This book is about machines that learn to discover hidden relationships in data. A constant sfream of data bombards our senses and millions of sensory channels carry information into our brains. Brains are also learning machines that condition, combine, parse, and store data. Is it possible to learn something about learning by observing the style of computation used by brains? This is the motivation for research into computational devices that today are called \"neural networks.\" Neural networks are nonlinear dynamical systems with many degrees of freedom that can be used to solve computational problems. The mathematical foundations for learning in this class of machines was laid by agroup of researchers in the 1940s and 1950s. The achievement documented in this book is the thorough study of one of the simplest members of this class, feedforward networks with one layer of m w ~ a b l e weights connecting input units to output units. In a sense, these might be called reflex machines. The knee-jerk reflex, for example, is mediated by synaptic connections from the sensory recepton in your knee directly onto rnotoneurons in your spinal cord that in turn activate leg muscles. There are limits to how much computation can be accomplished by such reflexes, and these limits have been carefully delineated in this book. Just as more complex creatures evolved by layering control loops on the primitive reflexes, network models have also evolved in recent years and now have achieved vastly greater capabilities than reflex machines by making use of multilayered architectures with feedback connections. Nonetheless, recent work could not have been accomplished without building on these foundations. vii viil INTRODUCTION INTRODUCTION ix Despite the early promise of research on neural networks, there was a period of about 20 years, from the mid 1960s to the mid 1980s. when interest in neural networks as computational devices and models of human behavior waned in favor of models based on symbol processing. There are many reasons for this, some of them now evident in this book. Still, Learning Machines was an underground classic among the neural network modelers who were active during this \"dark age\" and deserves to be better known to the generation that is \"relearning\" what was once known about statistical learning machines. The intuitive geometric explanations and the mathematical foundations in this monograph are as invaluable today as they were when it was first written. Nilsson is …", "year": 2020, "referenceCount": 87, "citationCount": 104, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2815219", "name": "M. Boman"}, {"authorId": "1689109", "name": "Magnus Sahlgren"}, {"authorId": "1810096", "name": "Olof Görnerup"}, {"authorId": "2338283", "name": "D. Gillblad"}]}, {"paperId": "216b7f26e3ecd1bad785c03d541a7480c7757e17", "url": "https://www.semanticscholar.org/paper/216b7f26e3ecd1bad785c03d541a7480c7757e17", "title": "Spatial prediction models for shallow landslide hazards: a comparative assessment of the efficacy of support vector machines, artificial neural networks, kernel logistic regression, and logistic model tree", "abstract": null, "year": 2016, "referenceCount": 107, "citationCount": 760, "influentialCitationCount": 58, "isOpenAccess": true, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "81205704", "name": "D. Tien Bui"}, {"authorId": "143723820", "name": "T. A. Tuan"}, {"authorId": "82980197", "name": "Harald Klempe"}, {"authorId": "143620129", "name": "B. Pradhan"}, {"authorId": "1970354", "name": "Inge Revhaug"}]}, {"paperId": "b09ad6ef6e63ddf2e1d07faa783adecce0cc2a77", "url": "https://www.semanticscholar.org/paper/b09ad6ef6e63ddf2e1d07faa783adecce0cc2a77", "title": "Coronavirus disease (COVID-19) cases analysis using machine-learning applications", "abstract": null, "year": 2021, "referenceCount": 40, "citationCount": 177, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2100113493", "name": "Ameer Sardar Kwekha-Rashid"}, {"authorId": "66680362", "name": "H. N. Abduljabbar"}, {"authorId": "98174258", "name": "Bilal S. A. Alhayani"}]}, {"paperId": "1242d79573397094c5670f55e58c8333cced0beb", "url": "https://www.semanticscholar.org/paper/1242d79573397094c5670f55e58c8333cced0beb", "title": "Deep Learning: A Primer for Radiologists.", "abstract": "Deep learning is a class of machine learning methods that are gaining success and attracting interest in many domains, including computer vision, speech recognition, natural language processing, and playing games. Deep learning methods produce a mapping from raw inputs to desired outputs (eg, image classes). Unlike traditional machine learning methods, which require hand-engineered feature extraction from inputs, deep learning methods learn these features directly from data. With the advent of large datasets and increased computing power, these methods can produce models with exceptional performance. These models are multilayer artificial neural networks, loosely inspired by biologic neural systems. Weighted connections between nodes (neurons) in the network are iteratively adjusted based on example pairs of inputs and target outputs by back-propagating a corrective error signal through the network. For computer vision tasks, convolutional neural networks (CNNs) have proven to be effective. Recently, several clinical applications of CNNs have been proposed and studied in radiology for classification, detection, and segmentation tasks. This article reviews the key concepts of deep learning for clinical radiologists, discusses technical requirements, describes emerging applications in clinical radiology, and outlines limitations and future directions in this field. Radiologists should become familiar with the principles and potential applications of deep learning in medical imaging. ©RSNA, 2017.", "year": 2017, "referenceCount": 28, "citationCount": 583, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "38162399", "name": "G. Chartrand"}, {"authorId": "34842677", "name": "P. Cheng"}, {"authorId": "37627814", "name": "Eugene Vorontsov"}, {"authorId": "3325894", "name": "M. Drozdzal"}, {"authorId": "3622148", "name": "S. Turcotte"}, {"authorId": "1972076", "name": "C. Pal"}, {"authorId": "1781469", "name": "S. Kadoury"}, {"authorId": "2080173111", "name": "A. Tang"}]}, {"paperId": "c8b5825b8994ce3c4dc7e603423d7d43a5ead15c", "url": "https://www.semanticscholar.org/paper/c8b5825b8994ce3c4dc7e603423d7d43a5ead15c", "title": "Ranking Learning Algorithms: Using IBL and Meta-Learning on Accuracy and Time Results", "abstract": null, "year": 2003, "referenceCount": 59, "citationCount": 430, "influentialCitationCount": 38, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1712908", "name": "P. Brazdil"}, {"authorId": "145726068", "name": "Carlos Soares"}, {"authorId": "144395232", "name": "J. Costa"}]}, {"paperId": "0f910174d2e19101ca8f008909006e79416821fd", "url": "https://www.semanticscholar.org/paper/0f910174d2e19101ca8f008909006e79416821fd", "title": "When Edge Meets Learning: Adaptive Control for Resource-Constrained Distributed Machine Learning", "abstract": "Emerging technologies and applications including Internet of Things (IoT), social networking, and crowd-sourcing generate large amounts of data at the network edge. Machine learning models are often built from the collected data, to enable the detection, classification, and prediction of future events. Due to bandwidth, storage, and privacy concerns, it is often impractical to send all the data to a centralized location. In this paper, we consider the problem of learning model parameters from data distributed across multiple edge nodes, without sending raw data to a centralized place. Our focus is on a generic class of machine learning models that are trained using gradient-descent based approaches. We analyze the convergence rate of distributed gradient descent from a theoretical point of view, based on which we propose a control algorithm that determines the best trade-off between local update and global parameter aggregation to minimize the loss function under a given resource budget. The performance of the proposed algorithm is evaluated via extensive experiments with real datasets, both on a networked prototype system and in a larger-scale simulated environment. The experimentation results show that our proposed approach performs near to the optimum with various machine learning models and different data distributions.", "year": 2018, "referenceCount": 30, "citationCount": 305, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50695457", "name": "Shiqiang Wang"}, {"authorId": "40917131", "name": "Tiffany Tuor"}, {"authorId": "2522394", "name": "Theodoros Salonidis"}, {"authorId": "145353889", "name": "K. Leung"}, {"authorId": "1702283", "name": "C. Makaya"}, {"authorId": "145299837", "name": "T. He"}, {"authorId": "46998035", "name": "K. Chan"}]}]}