{"total": 5120627, "offset": 2200, "next": 2300, "data": [{"paperId": "bf1a1f8f1c51500bb96055957c371825499841c3", "url": "https://www.semanticscholar.org/paper/bf1a1f8f1c51500bb96055957c371825499841c3", "title": "What Can Machines Learn, and What Does It Mean for Occupations and the Economy?", "abstract": "Advances in machine learning (ML) are poised to transform numerous occupations and industries. This raises the question of which tasks will be most affected by ML. We apply the rubric evaluating task potential for ML in Brynjolfsson and Mitchell (2017) to build measures of \"Suitability for Machine Learning\" (SML) and apply it to 18,156 tasks in O*NET. We find that (i) ML affects different occupations than earlier automation waves; (ii) most occupations include at least some SML tasks; (iii) few occupations are fully automatable using ML; and (iv) realizing the potential of ML usually requires redesign of job task content.", "year": 2018, "referenceCount": 20, "citationCount": 206, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2841157", "name": "E. Brynjolfsson"}, {"authorId": "40975594", "name": "Tom Michael Mitchell"}, {"authorId": "144148548", "name": "Daniel Rock"}]}, {"paperId": "789c0aa09ad004400a07074e0c1ecdca207dccf4", "url": "https://www.semanticscholar.org/paper/789c0aa09ad004400a07074e0c1ecdca207dccf4", "title": "Dynamic ensemble extreme learning machine based on sample entropy", "abstract": null, "year": 2012, "referenceCount": 39, "citationCount": 122, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39375300", "name": "Jun-Hai Zhai"}, {"authorId": "2146236373", "name": "Hong-Yu Xu"}, {"authorId": "2154495143", "name": "Xizhao Wang"}]}, {"paperId": "7b6dc4d999d1067ef9d442576264a42574888ed9", "url": "https://www.semanticscholar.org/paper/7b6dc4d999d1067ef9d442576264a42574888ed9", "title": "Machine Learning Interatomic Potentials as Emerging Tools for Materials Science", "abstract": "Atomic‐scale modeling and understanding of materials have made remarkable progress, but they are still fundamentally limited by the large computational cost of explicit electronic‐structure methods such as density‐functional theory. This Progress Report shows how machine learning (ML) is currently enabling a new degree of realism in materials modeling: by “learning” electronic‐structure data, ML‐based interatomic potentials give access to atomistic simulations that reach similar accuracy levels but are orders of magnitude faster. A brief introduction to the new tools is given, and then, applications to some select problems in materials science are highlighted: phase‐change materials for memory devices; nanoparticle catalysts; and carbon‐based electrodes for chemical sensing, supercapacitors, and batteries. It is hoped that the present work will inspire the development and wider use of ML‐based interatomic potentials in diverse areas of materials research.", "year": 2019, "referenceCount": 166, "citationCount": 219, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science", "Medicine"], "authors": [{"authorId": "2432235", "name": "Volker L. Deringer"}, {"authorId": "143629921", "name": "M. Caro"}, {"authorId": "2559761", "name": "Gábor Csányi"}]}, {"paperId": "899db02ba28ef2479b5bea3e51627685be5b3865", "url": "https://www.semanticscholar.org/paper/899db02ba28ef2479b5bea3e51627685be5b3865", "title": "Deep Recurrent Neural Networks for Human Activity Recognition", "abstract": "Adopting deep learning methods for human activity recognition has been effective in extracting discriminative features from raw input sequences acquired from body-worn sensors. Although human movements are encoded in a sequence of successive samples in time, typical machine learning methods perform recognition tasks without exploiting the temporal correlations between input data samples. Convolutional neural networks (CNNs) address this issue by using convolutions across a one-dimensional temporal sequence to capture dependencies among input data. However, the size of convolutional kernels restricts the captured range of dependencies between data samples. As a result, typical models are unadaptable to a wide range of activity-recognition configurations and require fixed-length input windows. In this paper, we propose the use of deep recurrent neural networks (DRNNs) for building recognition models that are capable of capturing long-range dependencies in variable-length input sequences. We present unidirectional, bidirectional, and cascaded architectures based on long short-term memory (LSTM) DRNNs and evaluate their effectiveness on miscellaneous benchmark datasets. Experimental results show that our proposed models outperform methods employing conventional machine learning, such as support vector machine (SVM) and k-nearest neighbors (KNN). Additionally, the proposed models yield better performance than other deep learning techniques, such as deep believe networks (DBNs) and CNNs.", "year": 2017, "referenceCount": 32, "citationCount": 257, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "30050286", "name": "Abdulmajid Murad"}, {"authorId": "1739676", "name": "Jae-Young Pyun"}]}, {"paperId": "4fd5672a30ec6a620556ccf8dc1d9e76fc67a5bf", "url": "https://www.semanticscholar.org/paper/4fd5672a30ec6a620556ccf8dc1d9e76fc67a5bf", "title": "Identification of novel antibacterial peptides by chemoinformatics and machine learning.", "abstract": "The rise of antibiotic resistant pathogens is one of the most pressing global health issues. Discovery of new classes of antibiotics has not kept pace; new agents often suffer from cross-resistance to existing agents of similar structure. Short, cationic peptides with antimicrobial activity are essential to the host defenses of many organisms and represent a promising new class of antimicrobials. This paper reports the successful in silico screening for potent antibiotic peptides using a combination of QSAR and machine learning techniques. On the basis of initial high-throughput measurements of activity of over 1400 random peptides, artificial neural network models were built using QSAR descriptors and subsequently used to screen an in silico library of approximately 100,000 peptides. In vitro validation of the modeling showed 94% accuracy in identifying highly active peptides. The best peptides identified through screening were found to have activities comparable or superior to those of four conventional antibiotics and superior to the peptide most advanced in clinical development against a broad array of multiresistant human pathogens.", "year": 2009, "referenceCount": 32, "citationCount": 242, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "2160852", "name": "C. Fjell"}, {"authorId": "15888696", "name": "H. Jenssen"}, {"authorId": "2458164", "name": "K. Hilpert"}, {"authorId": "2059932271", "name": "Warren A. Cheung"}, {"authorId": "4550592", "name": "N. Panté"}, {"authorId": "143696638", "name": "R. Hancock"}, {"authorId": "145230547", "name": "A. Cherkasov"}]}, {"paperId": "9822fb52af14447c407cd4935024e9b25b8370e6", "url": "https://www.semanticscholar.org/paper/9822fb52af14447c407cd4935024e9b25b8370e6", "title": "Database Schema Matching Using Machine Learning with Feature Selection", "abstract": null, "year": 2002, "referenceCount": 19, "citationCount": 227, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2055559313", "name": "J. Berlin"}, {"authorId": "3115735", "name": "Amihai Motro"}]}, {"paperId": "9a0f57d9be88ff5779a3a9877ce28cc8c61805e7", "url": "https://www.semanticscholar.org/paper/9a0f57d9be88ff5779a3a9877ce28cc8c61805e7", "title": "COVID-19 Future Forecasting Using Supervised Machine Learning Models", "abstract": "Machine learning (ML) based forecasting mechanisms have proved their significance to anticipate in perioperative outcomes to improve the decision making on the future course of actions. The ML models have long been used in many application domains which needed the identification and prioritization of adverse factors for a threat. Several prediction methods are being popularly used to handle forecasting problems. This study demonstrates the capability of ML models to forecast the number of upcoming patients affected by COVID-19 which is presently considered as a potential threat to mankind. In particular, four standard forecasting models, such as linear regression (LR), least absolute shrinkage and selection operator (LASSO), support vector machine (SVM), and exponential smoothing (ES) have been used in this study to forecast the threatening factors of COVID-19. Three types of predictions are made by each of the models, such as the number of newly infected cases, the number of deaths, and the number of recoveries in the next 10 days. The results produced by the study proves it a promising mechanism to use these methods for the current scenario of the COVID-19 pandemic. The results prove that the ES performs best among all the used models followed by LR and LASSO which performs well in forecasting the new confirmed cases, death rate as well as recovery rate, while SVM performs poorly in all the prediction scenarios given the available dataset.", "year": 2020, "referenceCount": 26, "citationCount": 240, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1430656665", "name": "Furqan Rustam"}, {"authorId": "9341675", "name": "A. Reshi"}, {"authorId": "1403306506", "name": "A. Mehmood"}, {"authorId": "48621790", "name": "S. Ullah"}, {"authorId": "1791452", "name": "Byung-Won On"}, {"authorId": "48001308", "name": "W. Aslam"}, {"authorId": "32016133", "name": "G. Choi"}]}, {"paperId": "4ec47080fcb2967cbedf2b9d821d7b458aff8799", "url": "https://www.semanticscholar.org/paper/4ec47080fcb2967cbedf2b9d821d7b458aff8799", "title": "Bayesian Network Refinement Via Machine Learning Approach", "abstract": "An approach to refining Bayesian network structures from new data is developed. Most previous work has only considered the refinement of the network's conditional probability parameters and has not addressed the issue of refining the network's structure. We tackle this problem by a machine learning approach based on a formalism known as the minimum description length (MDL) principle. The MDL principle is well suited to this task since it can perform tradeoffs between the accuracy, simplicity, and closeness to the existent structure. Another salient feature of this refinement approach is the capability of refining a network structure using partially specified data. Moreover, a localization scheme is developed for efficient computation of the description lengths since direct evaluation involves exponential time resources.", "year": 1998, "referenceCount": 25, "citationCount": 59, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144594306", "name": "Wai Lam"}]}, {"paperId": "b01a7ec32097a1f57fb80ef4073bc8a487d241fb", "url": "https://www.semanticscholar.org/paper/b01a7ec32097a1f57fb80ef4073bc8a487d241fb", "title": "Using corpora in machine-learning chatbot systems", "abstract": "A chatbot is a machine conversation system which interacts with human users via natural conversational language. Software to machine-learn conversational patterns from a transcribed dialogue corpus has been used to generate a range of chatbots speaking various languages and sublanguages including varieties of English, as well as French, Arabic and Afrikaans. This paper presents a program to learn from spoken transcripts of the Dialogue Diversity Corpus of English, the Minnesota French Corpus, the Corpus of Spoken Afrikaans, the Qur’an Arabic-English parallel corpus, and the British National Corpus of English; we discuss the problems which arose during learning and testing. Two main goals were achieved from the automation process. One was the ability to generate different versions of the chatbot in different languages, bringing chatbot technology to languages with few if any NLP resources: the corpus-based learning techniques transferred straightforwardly to develop chatbots for Afrikaans and Qur’anic Arabic. The second achievement was the ability to learn a very large number of categories within a short time, saving effort and errors in doing such work manually: we generated more than one million AIML categories or conversation-rules from the BNC corpus, 20 times the size of existing AIML rule-sets, and probably the biggest AI Knowledge-Base ever.", "year": 2005, "referenceCount": 42, "citationCount": 136, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1697090", "name": "B. A. Shawar"}, {"authorId": "144214753", "name": "E. Atwell"}]}, {"paperId": "28d7bc36509e6b0e3f2e890928ec9b1a8c9fb53e", "url": "https://www.semanticscholar.org/paper/28d7bc36509e6b0e3f2e890928ec9b1a8c9fb53e", "title": "Applying an existing machine learning algorithm to text categorization", "abstract": null, "year": 1995, "referenceCount": 18, "citationCount": 52, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1789324", "name": "Isabelle Moulinier"}, {"authorId": "1686738", "name": "J. Ganascia"}]}, {"paperId": "e8aa24d9c64f1215a97e8118905fad0189a53b97", "url": "https://www.semanticscholar.org/paper/e8aa24d9c64f1215a97e8118905fad0189a53b97", "title": "Machine learning and applications in ultrafast photonics", "abstract": null, "year": 2020, "referenceCount": 133, "citationCount": 94, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "32921446", "name": "G. Genty"}, {"authorId": "51042841", "name": "L. Salmela"}, {"authorId": "31295217", "name": "J. Dudley"}, {"authorId": "145711155", "name": "D. Brunner"}, {"authorId": "14218005", "name": "A. Kokhanovskiy"}, {"authorId": "145335010", "name": "S. Kobtsev"}, {"authorId": "2408477", "name": "S. Turitsyn"}]}, {"paperId": "2ae0ab5303cb374e79193da4846c193c666acc67", "url": "https://www.semanticscholar.org/paper/2ae0ab5303cb374e79193da4846c193c666acc67", "title": "Machine Learning a General-Purpose Interatomic Potential for Silicon", "abstract": "The success of first principles electronic structure calculation for predictive modeling in chemistry, solid state physics, and materials science is constrained by the limitations on simulated length and time scales due to computational cost and its scaling. Techniques based on machine learning ideas for interpolating the Born-Oppenheimer potential energy surface without explicitly describing electrons have recently shown great promise, but accurately and efficiently fitting the physically relevant space of configurations has remained a challenging goal. Here we present a Gaussian Approximation Potential for silicon that achieves this milestone, accurately reproducing density functional theory reference results for a wide range of observable properties, including crystal, liquid, and amorphous bulk phases, as well as point, line, and plane defects. We demonstrate that this new potential enables calculations that would be extremely expensive with a first principles electronic structure method, such as finite temperature phase boundary lines, self-diffusivity in the liquid, formation of the amorphous by slow quench, and dynamic brittle fracture. We show that the uncertainty quantification inherent to the Gaussian process regression framework gives a qualitative estimate of the potential's accuracy for a given atomic configuration. The success of this model shows that it is indeed possible to create a useful machine-learning-based interatomic potential that comprehensively describes a material, and serves as a template for the development of such models in the future.", "year": 2018, "referenceCount": 218, "citationCount": 218, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Materials Science"], "authors": [{"authorId": "3938091", "name": "A. Bartók"}, {"authorId": "11724553", "name": "J. Kermode"}, {"authorId": "2105796", "name": "N. Bernstein"}, {"authorId": "2559761", "name": "Gábor Csányi"}]}, {"paperId": "c6a83c4fcc99ba6753109301949c5b7cfa978079", "url": "https://www.semanticscholar.org/paper/c6a83c4fcc99ba6753109301949c5b7cfa978079", "title": "The Alignment Template Approach to Statistical Machine Translation", "abstract": "A phrase-based statistical machine translation approach the alignment template approach is described. This translation approach allows for general many-to-many relations between words. Thereby, the context of words is taken into account in the translation model, and local changes in word order from source to target language can be learned explicitly. The model is described using a log-linear modeling approach, which is a generalization of the often used source-channel approach. Thereby, the model is easier to extend than classical statistical machine translation systems. We describe in detail the process for learning phrasal translations, the feature functions used, and the search algorithm. The evaluation of this approach is performed on three different tasks. For the German-English speech Verbmobil task, we analyze the effect of various system components. On the French-English Canadian Hansards task, the alignment template system obtains significantly better results than a single-word-based translation model. In the Chinese-English 2002 National Institute of Standards and Technology (NIST) machine translation evaluation it yields statistically significantly better NIST scores than all competing research and commercial translation systems.", "year": 2004, "referenceCount": 50, "citationCount": 1053, "influentialCitationCount": 78, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2002316", "name": "F. Och"}, {"authorId": "145322333", "name": "H. Ney"}]}, {"paperId": "463ec74665c9476069591aa8e19c7c2fb93e4681", "url": "https://www.semanticscholar.org/paper/463ec74665c9476069591aa8e19c7c2fb93e4681", "title": "An Explicit Description of the Reproducing Kernel Hilbert Spaces of Gaussian RBF Kernels", "abstract": "Although Gaussian radial basis function (RBF) kernels are one of the most often used kernels in modern machine learning methods such as support vector machines (SVMs), little is known about the structure of their reproducing kernel Hilbert spaces (RKHSs). In this work, two distinct explicit descriptions of the RKHSs corresponding to Gaussian RBF kernels are given and some consequences are discussed. Furthermore, an orthonormal basis for these spaces is presented. Finally, it is discussed how the results can be used for analyzing the learning performance of SVMs", "year": 2006, "referenceCount": 30, "citationCount": 233, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1782193", "name": "Ingo Steinwart"}, {"authorId": "1754328", "name": "D. Hush"}, {"authorId": "143790221", "name": "C. Scovel"}]}, {"paperId": "6dce0d4635c1b84d000c586a635a46d3d4566e4d", "url": "https://www.semanticscholar.org/paper/6dce0d4635c1b84d000c586a635a46d3d4566e4d", "title": "Enabling Cognitive Smart Cities Using Big Data and Machine Learning: Approaches and Challenges", "abstract": "The development of smart cities and their fast-paced deployment is resulting in the generation of large quantities of data at unprecedented rates. Unfortunately, most of the generated data is wasted without extracting potentially useful information and knowledge because of the lack of established mechanisms and standards that benefit from the availability of such data. Moreover, the highly dynamic nature of smart cities calls for a new generation of machine learning approaches that are flexible and adaptable to cope with the dynamicity of data to perform analytics and learn from real-time data. In this article, we shed light on the challenge of underutilizing the big data generated by smart cities from a machine learning perspective. In particular, we present the phenomenon of wasting unlabeled data. We argue that semi-supervision is a must for smart cities to address this challenge. We also propose a three-level learning framework for smart cities that matches the hierarchical nature of big data generated by smart cities with a goal of providing different levels of knowledge abstraction. The proposed framework is scalable to meet the needs of smart city services. Fundamentally, the framework benefits from semi-supervised deep reinforcement learning where a small amount of data that has users' feedback serves as labeled data, while a larger amount without such users' feedback serves as unlabeled data. The framework utilizes a mix of labeled and unlabeled data to converge toward better control policies instead of wasting the unlabeled data. This article also explores how deep reinforcement learning and its shift toward semi-supervision can handle the cognitive side of smart city services and improve their performance by providing several use cases spanning the different domains of smart cities. We also highlight several challenges as well as promising future research directions for incorporating machine learning and high-level intelligence into smart city services.", "year": 2018, "referenceCount": 15, "citationCount": 215, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2151683198", "name": "M. Mohammadi"}, {"authorId": "1389945327", "name": "Ala Al-Fuqaha"}]}, {"paperId": "7864c8cd08ff4da9acc37de2576e9cdbabe03107", "url": "https://www.semanticscholar.org/paper/7864c8cd08ff4da9acc37de2576e9cdbabe03107", "title": "Neural Architecture Search with Bayesian Optimisation and Optimal Transport", "abstract": "Bayesian Optimisation (BO) refers to a class of methods for global optimisation of a function $f$ which is only accessible via point evaluations. It is typically used in settings where $f$ is expensive to evaluate. A common use case for BO in machine learning is model selection, where it is not possible to analytically model the generalisation performance of a statistical model, and we resort to noisy and expensive training and validation procedures to choose the best model. Conventional BO methods have focused on Euclidean and categorical domains, which, in the context of model selection, only permits tuning scalar hyper-parameters of machine learning algorithms. However, with the surge of interest in deep learning, there is an increasing demand to tune neural network \\emph{architectures}. In this work, we develop NASBOT, a Gaussian process based BO framework for neural architecture search. To accomplish this, we develop a distance metric in the space of neural network architectures which can be computed efficiently via an optimal transport program. This distance might be of independent interest to the deep learning community as it may find applications outside of BO. We demonstrate that NASBOT outperforms other alternatives for architecture search in several cross validation based model selection tasks on multi-layer perceptrons and convolutional neural networks.", "year": 2018, "referenceCount": 60, "citationCount": 411, "influentialCitationCount": 35, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1887808", "name": "Kirthevasan Kandasamy"}, {"authorId": "2934259", "name": "W. Neiswanger"}, {"authorId": "1753432", "name": "J. Schneider"}, {"authorId": "1719347", "name": "B. Póczos"}, {"authorId": "143977260", "name": "E. Xing"}]}, {"paperId": "248f27f0b53255e8958afb4bf1a5c20c3e236a4b", "url": "https://www.semanticscholar.org/paper/248f27f0b53255e8958afb4bf1a5c20c3e236a4b", "title": "Predictive analytics in health care using machine learning tools and techniques", "abstract": "When we have a huge data set on which we would like to perform predictive analysis or pattern recognition, machine learning is the way to go. Machine Learning (ML) is the fastest rising arena in computer science, and health informatics is of extreme challenge. The aim of Machine Learning is to develop algorithms which can learn and progress over time and can be used for predictions. Machine Learning practices are widely used in various fields and primarily health care industry has been benefitted a lot through machine learning prediction techniques. It offers a variety of alerting and risk management decision support tools, targeted at improving patients' safety and healthcare quality. With the need to reduce healthcare costs and the movement towards personalized healthcare, the healthcare industry faces challenges in the essential areas like, electronic record management, data integration, and computer aided diagnoses and disease predictions. Machine Learning offers a wide range of tools, techniques, and frameworks to address these challenges. This paper depicts the study on various prediction techniques and tools for Machine Learning in practice. A glimpse on the applications of Machine Learning in various domains are also discussed here by highlighting on its prominence role in health care industry.", "year": 2017, "referenceCount": 25, "citationCount": 74, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144692718", "name": "B. Nithya"}, {"authorId": "2757904", "name": "V. Ilango"}]}, {"paperId": "46d19644912b36942c5193d3e239849281dd0319", "url": "https://www.semanticscholar.org/paper/46d19644912b36942c5193d3e239849281dd0319", "title": "Exponential Machines", "abstract": "Modeling interactions between features improves the performance of machine learning solutions in many domains (e.g. recommender systems or sentiment analysis). In this paper, we introduce Exponential Machines (ExM), a predictor that models all interactions of every order. The key idea is to represent an exponentially large tensor of parameters in a factorized format called Tensor Train (TT). The Tensor Train format regularizes the model and lets you control the number of underlying parameters. To train the model, we develop a stochastic Riemannian optimization procedure, which allows us to fit tensors with 2^160 entries. We show that the model achieves state-of-the-art performance on synthetic data with high-order interactions and that it works on par with high-order factorization machines on a recommender system dataset MovieLens 100K.", "year": 2017, "referenceCount": 35, "citationCount": 76, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2050212830", "name": "Alexander Novikov"}, {"authorId": "103810919", "name": "Mikhail Trofimov"}, {"authorId": "1738205", "name": "I. Oseledets"}]}, {"paperId": "94358f789c1d7fa01127c4b2f06b20cd7a453ff8", "url": "https://www.semanticscholar.org/paper/94358f789c1d7fa01127c4b2f06b20cd7a453ff8", "title": "Learning to Evade Static PE Machine Learning Malware Models via Reinforcement Learning", "abstract": "Machine learning is a popular approach to signatureless malware detection because it can generalize to never-before-seen malware families and polymorphic strains. This has resulted in its practical use for either primary detection engines or for supplementary heuristic detection by anti-malware vendors. Recent work in adversarial machine learning has shown that deep learning models are susceptible to gradient-based attacks, whereas non-differentiable models that report a score can be attacked by genetic algorithms that aim to systematically reduce the score. We propose a more general framework based on reinforcement learning (RL) for attacking static portable executable (PE) anti-malware engines. The general framework does not require a differentiable model nor does it require the engine to produce a score. Instead, an RL agent is equipped with a set of functionality-preserving operations that it may perform on the PE file. Through a series of games played against the anti-malware engine, it learns which sequences of operations are likely to result in evading the detector for any given malware sample. This enables completely black-box attacks against static PE anti-malware, and produces functional evasive malware samples as a direct result. We show in experiments that our method can attack a gradient-boosted machine learning model with evasion rates that are substantial and appear to be strongly dependent on the dataset. We demonstrate that attacks against this model appear to also evade components of publicly hosted antivirus engines. Adversarial training results are also presented: by retraining the model on evasive ransomware samples, a subsequent attack is 33% less effective. However, there are overfitting dangers when adversarial training, which we note. We release code to allow researchers to reproduce and improve this approach.", "year": 2018, "referenceCount": 37, "citationCount": 131, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2639880", "name": "H. Anderson"}, {"authorId": "35665260", "name": "Anant Kharkar"}, {"authorId": "7888676", "name": "Bobby Filar"}, {"authorId": "145685504", "name": "David Evans"}, {"authorId": "153379407", "name": "P. Roth"}]}, {"paperId": "1b7c02e4f07477a5ae2d1aa52db8ac6ddb55f53c", "url": "https://www.semanticscholar.org/paper/1b7c02e4f07477a5ae2d1aa52db8ac6ddb55f53c", "title": "Using Emoticons to Reduce Dependency in Machine Learning Techniques for Sentiment Classification", "abstract": "Sentiment Classification seeks to identify a piece of text according to its author's general feeling toward their subject, be it positive or negative. Traditional machine learning techniques have been applied to this problem with reasonable success, but they have been shown to work well only when there is a good match between the training and test data with respect to topic. This paper demonstrates that match with respect to domain and time is also important, and presents preliminary experiments with training data labeled with emoticons, which has the potential of being independent of domain, topic and time.", "year": 2005, "referenceCount": 9, "citationCount": 629, "influentialCitationCount": 31, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39784208", "name": "J. Read"}]}, {"paperId": "c1a95197e15fa99f55cd0cb2ee14d2f02699a919", "url": "https://www.semanticscholar.org/paper/c1a95197e15fa99f55cd0cb2ee14d2f02699a919", "title": "Balancing Training Data for Automated Annotation of Keywords: a Case Study", "abstract": "There has been an increasing interest in tools for automating the annotation of databases. Machine learning techniques are promising candidates to help curators to, at least, guide the process of annotation which is mostly done manually. Following previous works on automated annotation using symbolic machine learning techniques, the present work deals with a common problem in machine learning: that classes usually have skewed class prior probabilities, i.e., there is a large number of examples of one class compared with just few examples of the other class. This happens due to the fact that a large number of proteins is not annotated for every feature. Thus, we analyze and employ some techniques aiming at balancing the training data. Our experiments show that the classifiers induced from balanced data sampled with our method are more accurate than those induced from the original data.", "year": 2003, "referenceCount": 17, "citationCount": 184, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145666101", "name": "Gustavo E. A. P. A. Batista"}, {"authorId": "1707374", "name": "A. Bazzan"}, {"authorId": "1737677", "name": "M. C. Monard"}]}, {"paperId": "56bbb80a6b7d40038e6ddc3cfda09509147cbc68", "url": "https://www.semanticscholar.org/paper/56bbb80a6b7d40038e6ddc3cfda09509147cbc68", "title": "An improved cluster labeling method for support vector clustering", "abstract": "The support vector clustering (SVC) algorithm is a recently emerged unsupervised learning method inspired by support vector machines. One key step involved in the SVC algorithm is the cluster assignment of each data point. A new cluster labeling method for SVC is developed based on some invariant topological properties of a trained kernel radius function. Benchmark results show that the proposed method outperforms previously reported labeling techniques.", "year": 2005, "referenceCount": 11, "citationCount": 267, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2108480175", "name": "Jaewook Lee"}, {"authorId": "48893531", "name": "Daewon Lee"}]}, {"paperId": "9c1de78b9324855f8a89a58e31335000b8144e4d", "url": "https://www.semanticscholar.org/paper/9c1de78b9324855f8a89a58e31335000b8144e4d", "title": "PAV and the ROC convex hull", "abstract": null, "year": 2007, "referenceCount": 13, "citationCount": 115, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145421658", "name": "Tom Fawcett"}, {"authorId": "1399048849", "name": "Alexandru Niculescu-Mizil"}]}, {"paperId": "a0b2a56c6bca770d6ae1b7c470ce42146b82d3bb", "url": "https://www.semanticscholar.org/paper/a0b2a56c6bca770d6ae1b7c470ce42146b82d3bb", "title": "Recent Advances in Predictive (Machine) Learning", "abstract": null, "year": 2006, "referenceCount": 25, "citationCount": 119, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3056361", "name": "J. Friedman"}]}, {"paperId": "828d61fd204bebf70a506ecc0720e4287bec4fd0", "url": "https://www.semanticscholar.org/paper/828d61fd204bebf70a506ecc0720e4287bec4fd0", "title": "Prediction of Heart Disease Using Machine Learning", "abstract": "with the rampant increase in the heart stroke rates at juvenile ages, we need to put a system in place to be able to detect the symptoms of a heart stroke at an early stage and thus prevent it. It is impractical for a common man to frequently undergo costly tests like the ECG and thus there needs to be a system in place which is handy and at the same time reliable, in predicting the chances of a heart disease. Thus we propose to develop an application which can predict the vulnerability of a heart disease given basic symptoms like age, sex, pulse rate etc. The machine learning algorithm neural networks has proven to be the most accurate and reliable algorithm and hence used in the proposed system.", "year": 2018, "referenceCount": 5, "citationCount": 122, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "19260977", "name": "A. Gavhane"}, {"authorId": "19307299", "name": "Gouthami Kokkula"}, {"authorId": "32222567", "name": "Isha Pandya"}, {"authorId": "51441416", "name": "P. K. Devadkar"}]}, {"paperId": "1b09809b79a7b053391bdd414d4233132747f6ec", "url": "https://www.semanticscholar.org/paper/1b09809b79a7b053391bdd414d4233132747f6ec", "title": "Effective End-User Interaction with Machine Learning", "abstract": "\n \n End-user interactive machine learning is a promising tool for enhancing human productivity and capabilities with large unstructured data sets. Recent work has shown that we can create end-user interactive machine learning systems for specific applications. However, we still lack a generalized understanding of how to design effective end-user interaction with interactive machine learning systems. This work presents three explorations in designing for effective end-user interaction with machine learning in CueFlik, a system developed to support Web image search. These explorations demonstrate that interactions designed to balance the needs of end-users and machine learning algorithms can significantly improve the effectiveness of end-user interactive machine learning.\n \n", "year": 2011, "referenceCount": 9, "citationCount": 59, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1719124", "name": "Saleema Amershi"}, {"authorId": "145504534", "name": "J. Fogarty"}, {"authorId": "2189118", "name": "Ashish Kapoor"}, {"authorId": "1719056", "name": "Desney S. Tan"}]}, {"paperId": "4e84dd37e9898d9655b55d99678da12eeda06615", "url": "https://www.semanticscholar.org/paper/4e84dd37e9898d9655b55d99678da12eeda06615", "title": "Map-reduce-merge: simplified relational data processing on large clusters", "abstract": "Map-Reduce is a programming model that enables easy development of scalable parallel applications to process a vast amount of data on large clusters of commodity machines. Through a simple interface with two functions, map and reduce, this model facilitates parallel implementation of many real-world tasks such as data processing jobs for search engines and machine learning.\n However,this model does not directly support processing multiple related heterogeneous datasets. While processing relational data is a common need, this limitation causes difficulties and/or inefficiency when Map-Reduce is applied on relational operations like joins.\n We improve Map-Reduce into a new model called Map-Reduce-Merge. It adds to Map-Reduce a Merge phase that can efficiently merge data already partitioned and sorted (or hashed) by map and reduce modules. We also demonstrate that this new model can express relational algebra operators as well as implement several join algorithms.", "year": 2007, "referenceCount": 17, "citationCount": 868, "influentialCitationCount": 36, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2124616415", "name": "Hung-chih Yang"}, {"authorId": "1678670", "name": "A. Dasdan"}, {"authorId": "34753868", "name": "R. Hsiao"}, {"authorId": "1694803", "name": "D. S. Parker"}]}, {"paperId": "acba26aa16eb4a7d6b2f5eeba8b60b1ba0193564", "url": "https://www.semanticscholar.org/paper/acba26aa16eb4a7d6b2f5eeba8b60b1ba0193564", "title": "Machine Learning of Phonotactics", "abstract": null, "year": 1998, "referenceCount": 33, "citationCount": 89, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1444426196", "name": "Erik Fajoen Tjong-Kim-Sang"}]}, {"paperId": "a44b5cfc5223e88977667b07e68ce3371f50033d", "url": "https://www.semanticscholar.org/paper/a44b5cfc5223e88977667b07e68ce3371f50033d", "title": "Machine Learning in Orthopedics: A Literature Review", "abstract": "In this paper we present the findings of a systematic literature review covering the articles published in the last two decades in which the authors described the application of a machine learning technique and method to an orthopedic problem or purpose. By searching both in the Scopus and Medline databases, we retrieved, screened and analyzed the content of 70 journal articles, and coded these resources following an iterative method within a Grounded Theory approach. We report the survey findings by outlining the articles' content in terms of the main machine learning techniques mentioned therein, the orthopedic application domains, the source data and the quality of their predictive performance.", "year": 2018, "referenceCount": 118, "citationCount": 112, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3037324", "name": "F. Cabitza"}, {"authorId": "1756869", "name": "A. Locoro"}, {"authorId": "145244821", "name": "G. Banfi"}]}, {"paperId": "823e9af68ff51fd0d4cc4db596f4aa112ed6bf9c", "url": "https://www.semanticscholar.org/paper/823e9af68ff51fd0d4cc4db596f4aa112ed6bf9c", "title": "Machine Learning: Neural Networks", "abstract": "This post is a continuation of the Machine Learning series, which began with the basics and might eventually have more articles. This post assumes an understanding of gradient descent and basic idea of supervised learning, so if those aren’t completely clear, read the previous post as well! In the last post, I talked about machine learning, supervised learning algorithms, and explained how you could use data to create a linear model and learn the parameters of this model via gradient descent. It turns out that we can do the exact same thing with more complex models, which can let us represent much more complex relationships and use highly non-linear and irregular data. One such model is the feed-forward neural network. (There are other types of neural networks, but the feed-forward neural network is the simplest one, so it’s what we’ll be looking at.)", "year": 1994, "referenceCount": 0, "citationCount": 66, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1750050", "name": "H. Adeli"}, {"authorId": "1752340", "name": "S. Hung"}]}, {"paperId": "8563b0765bcc0b3ae02298d3722bff10bbb15cdb", "url": "https://www.semanticscholar.org/paper/8563b0765bcc0b3ae02298d3722bff10bbb15cdb", "title": "Detecting P2P botnets through network behavior analysis and machine learning", "abstract": "Botnets have become one of the major threats on the Internet for serving as a vector for carrying attacks against organizations and committing cybercrimes. They are used to generate spam, carry out DDOS attacks and click-fraud, and steal sensitive information. In this paper, we propose a new approach for characterizing and detecting botnets using network traffic behaviors. Our approach focuses on detecting the bots before they launch their attack. We focus in this paper on detecting P2P bots, which represent the newest and most challenging types of botnets currently available. We study the ability of five different commonly used machine learning techniques to meet online botnet detection requirements, namely adaptability, novelty detection, and early detection. The results of our experimental evaluation based on existing datasets show that it is possible to detect effectively botnets during the botnet Command-and- Control (C&C) phase and before they launch their attacks using traffic behaviors only. However, none of the studied techniques can address all the above requirements at once.", "year": 2011, "referenceCount": 18, "citationCount": 244, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "12906109", "name": "Sherif Saad"}, {"authorId": "143812950", "name": "I. Traoré"}, {"authorId": "1698268", "name": "A. Ghorbani"}, {"authorId": "36733654", "name": "B. Sayed"}, {"authorId": "2110819522", "name": "David Zhao"}, {"authorId": "2153424526", "name": "Wei Lu"}, {"authorId": "2064761645", "name": "J. Felix"}, {"authorId": "49184511", "name": "Payman Hakimian"}]}, {"paperId": "6a5e6ce558edaec2078c3d5a65327fc7aecc3507", "url": "https://www.semanticscholar.org/paper/6a5e6ce558edaec2078c3d5a65327fc7aecc3507", "title": "OpenNMT: Neural Machine Translation Toolkit", "abstract": "OpenNMT is an open-source toolkit for neural machine translation (NMT). The system prioritizes efficiency, modularity, and extensibility with the goal of supporting NMT research into model architectures, feature representations, and source modalities, while maintaining competitive performance and reasonable training requirements. The toolkit consists of modeling and translation support, as well as detailed pedagogical documentation about the underlying techniques. OpenNMT has been used in several production MT systems, modified for numerous research papers, and is implemented across several deep learning frameworks.", "year": 2018, "referenceCount": 36, "citationCount": 89, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39861444", "name": "Guillaume Klein"}, {"authorId": "38367242", "name": "Yoon Kim"}, {"authorId": "2505751", "name": "Yuntian Deng"}, {"authorId": "94051097", "name": "Vincent Nguyen"}, {"authorId": "3053934", "name": "Jean Senellart"}, {"authorId": "2531268", "name": "Alexander M. Rush"}]}, {"paperId": "1c6c0d39d377a465834ed608ae23f48a79ab8eac", "url": "https://www.semanticscholar.org/paper/1c6c0d39d377a465834ed608ae23f48a79ab8eac", "title": "A Very Brief Introduction to Machine Learning With Applications to Communication Systems", "abstract": "Given the unprecedented availability of data and computing resources, there is widespread renewed interest in applying data-driven machine learning methods to problems for which the development of conventional engineering solutions is challenged by modeling or algorithmic deficiencies. This tutorial-style paper starts by addressing the questions of why and when such techniques can be useful. It then provides a high-level introduction to the basics of supervised and unsupervised learning. For both supervised and unsupervised learning, exemplifying applications to communication networks are discussed by distinguishing tasks carried out at the edge and at the cloud segments of the network at different layers of the protocol stack, with an emphasis on the physical layer.", "year": 2018, "referenceCount": 82, "citationCount": 285, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1705869", "name": "O. Simeone"}]}, {"paperId": "8a3d0bdb9f3b7ec2ce8ede1307cc246150e4ad48", "url": "https://www.semanticscholar.org/paper/8a3d0bdb9f3b7ec2ce8ede1307cc246150e4ad48", "title": "Statistical Machine Learning Makes Automatic Control Practical for Internet Datacenters", "abstract": "Horizontally-scalable Internet services on clusters of commodity computers appear to be a great fit for automatic control: there is a target output (service-level agreement), observed output (actual latency), and gain controller (adjusting the number of servers). Yet few datacenters are automated this way in practice, due in part to well-founded skepticism about whether the simple models often used in the research literature can capture complex real-life workload/performance relationships and keep up with changing conditions that might invalidate the models. We argue that these shortcomings can be fixed by importing modeling, control, and analysis techniques from statistics and machine learning. In particular, we apply rich statistical models of the application's performance, simulation-based methods for finding an optimal control policy, and change-point methods to find abrupt changes in performance. Preliminary results running aWeb 2.0 benchmark application driven by real workload traces on Amazon's EC2 cloud show that our method can effectively control the number of servers, even in the face of performance anomalies.", "year": 2009, "referenceCount": 12, "citationCount": 235, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1775084", "name": "P. Bodík"}, {"authorId": "50331526", "name": "R. Griffith"}, {"authorId": "37210858", "name": "Charles Sutton"}, {"authorId": "143608596", "name": "A. Fox"}, {"authorId": "1694621", "name": "Michael I. Jordan"}, {"authorId": "1701130", "name": "D. Patterson"}]}, {"paperId": "1f6b9766374d14d81c225c2ced5bb02fe0bccd43", "url": "https://www.semanticscholar.org/paper/1f6b9766374d14d81c225c2ced5bb02fe0bccd43", "title": "The What-If Tool: Interactive Probing of Machine Learning Models", "abstract": "A key challenge in developing and deploying Machine Learning (ML) systems is understanding their performance across a wide range of inputs. To address this challenge, we created the What-If Tool, an open-source application that allows practitioners to probe, visualize, and analyze ML systems, with minimal coding. The What-If Tool lets practitioners test performance in hypothetical situations, analyze the importance of different data features, and visualize model behavior across multiple models and subsets of input data. It also lets practitioners measure systems according to multiple ML fairness metrics. We describe the design of the tool, and report on real-life usage at different organizations.", "year": 2019, "referenceCount": 30, "citationCount": 225, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "authors": [{"authorId": "49556437", "name": "James Wexler"}, {"authorId": "51478016", "name": "Mahima Pushkarna"}, {"authorId": "2843215", "name": "Tolga Bolukbasi"}, {"authorId": "145233583", "name": "M. Wattenberg"}, {"authorId": "1765169", "name": "F. Viégas"}, {"authorId": "2109357255", "name": "Jimbo Wilson"}]}, {"paperId": "54b7e57ebd7fcf826526664d755f48c8eff9fc40", "url": "https://www.semanticscholar.org/paper/54b7e57ebd7fcf826526664d755f48c8eff9fc40", "title": "Data Analysis, Machine Learning and Applications - Proceedings of the 31st Annual Conference of the Gesellschaft für Klassifikation e.V., Albert-Ludwigs-Universität Freiburg, March 7-9, 2007", "abstract": null, "year": 2008, "referenceCount": 8, "citationCount": 140, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2598724", "name": "Christine Preisach"}, {"authorId": "36736177", "name": "H. Burkhardt"}, {"authorId": "1388781075", "name": "L. Schmidt-Thieme"}, {"authorId": "1741535541", "name": "Reinhold Decker"}]}, {"paperId": "68c4749d9d3f1724aa01778d69a3774c732ca44c", "url": "https://www.semanticscholar.org/paper/68c4749d9d3f1724aa01778d69a3774c732ca44c", "title": "Support Vector Machines: Training and Applications", "abstract": "The Support Vector Machine (SVM) is a new and very promising classification technique developed by Vapnik and his group at AT\\&T Bell Labs. This new learning algorithm can be seen as an alternative training technique for Polynomial, Radial Basis Function and Multi-Layer Perceptron classifiers. An interesting property of this approach is that it is an approximate implementation of the Structural Risk Minimization (SRM) induction principle. The derivation of Support Vector Machines, its relationship with SRM, and its geometrical insight, are discussed in this paper. Training a SVM is equivalent to solve a quadratic programming problem with linear and box constraints in a number of variables equal to the number of data points. When the number of data points exceeds few thousands the problem is very challenging, because the quadratic form is completely dense, so the memory needed to store the problem grows with the square of the number of data points. Therefore, training problems arising in some real applications with large data sets are impossible to load into memory, and cannot be solved using standard non-linear constrained optimization algorithms. We present a decomposition algorithm that can be used to train SVM''s over large data sets. The main idea behind the decomposition is the iterative solution of sub-problems and the evaluation of, and also establish the stopping criteria for the algorithm. We present previous approaches, as well as results and important details of our implementation of the algorithm using a second-order variant of the Reduced Gradient Method as the solver of the sub-problems. As an application of SVM''s, we present preliminary results we obtained applying SVM to the problem of detecting frontal human faces in real images.", "year": 1997, "referenceCount": 25, "citationCount": 852, "influentialCitationCount": 68, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1781874", "name": "E. Osuna"}, {"authorId": "1771659", "name": "R. Freund"}, {"authorId": "1804489", "name": "F. Girosi"}]}, {"paperId": "aa78234335188b27bf7369ae18dfac453359af9e", "url": "https://www.semanticscholar.org/paper/aa78234335188b27bf7369ae18dfac453359af9e", "title": "Applying the Waek Learning Framework to Understand and Improve C4.5", "abstract": "There has long been a chasm between theoretical models of machine learning and practical machine learning algorithms. For instance, empirically successful algorithms such as C4:5 and backpropagation have not met the criteria of the PAC model and its variants. Conversely, the algorithms suggested by computational learning theory are usually too limited in various ways to nd wide application. The theoretical status of decision tree learning algorithms is a case in point: while it has been proven that C4:5 (and all reasonable variants of it) fails to meet the PAC model criteria [2], other recently proposed decision tree algorithms that do have non-trivial performance guarantees unfortunately require membership queries [6, 13]. Two recent developments have narrowed this gap between theory and practice|not for the PAC model, but for the related model known as weak learning or boosting . First, an algorithm called Adaboost was proposed that meets the formal criteria of the boosting model and is also competitive in practice [10]. Second, the basic algorithms underlying the popular C4:5 and CART programs have also very recently been shown to meet the formal criteria of the boosting model [12]. Thus, it seems plausible that the weak learning framework may provide a setting for interaction between formal analysis and machine learning practice that is lacking in other theoretical models. Our aim in this paper is to push this interaction further in light of these recent developments. In particular, we perform experiments suggested by the formal results for Adaboost and C4:5 within the weak learning framework. We concentrate on two particularly intriguing issues. First, the theoretical boosting results for top-down decision tree algorithms such as C4:5 [12] suggest that a new splitting criterion may result in trees that are smaller and more accurate than those obtained using the usual information gain. We con rm this suggestion experimentally. Second, a super cial interpretation of the theoretical results suggests that Adaboost should vastly outperform C4:5. This is not the case in practice, and we argue through experimental results that the theory must be understood in terms of a measure of a boosting algorithm's behavior called its advantage sequence. We compare the advantage sequences for C4:5 and Adaboost in a number of experiments. We nd that these sequences have qualitatively different behavior that explains in large part the discrepancies between empirical performance and the theoretical results. Brie y, we nd that although C4:5 and Adaboost are both boosting algorithms, Adaboost creates successively \\harder\" ltered distributions, while C4:5 creates successively \\easier\" ones, in a sense that will be made precise.", "year": 1996, "referenceCount": 19, "citationCount": 114, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144299726", "name": "Thomas G. Dietterich"}, {"authorId": "2056642528", "name": "M. Kearns"}, {"authorId": "144830983", "name": "Y. Mansour"}]}, {"paperId": "93c85266de43dd7b2ec856db8e3c010c5b34a51c", "url": "https://www.semanticscholar.org/paper/93c85266de43dd7b2ec856db8e3c010c5b34a51c", "title": "Machine learning for chemical discovery", "abstract": null, "year": 2020, "referenceCount": 30, "citationCount": 85, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2462983", "name": "A. Tkatchenko"}]}, {"paperId": "5ce9a19e4ea7d45d60963da66704e61a5634075d", "url": "https://www.semanticscholar.org/paper/5ce9a19e4ea7d45d60963da66704e61a5634075d", "title": "Tikhonov, Ivanov and Morozov regularization for support vector machine learning", "abstract": null, "year": 2016, "referenceCount": 73, "citationCount": 58, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1682762", "name": "L. Oneto"}, {"authorId": "1751728", "name": "S. Ridella"}, {"authorId": "1686031", "name": "D. Anguita"}]}, {"paperId": "f9532d49588dbcdb9a472377fe81d16bb8476c83", "url": "https://www.semanticscholar.org/paper/f9532d49588dbcdb9a472377fe81d16bb8476c83", "title": "Three-objective genetics-based machine learning for linguistic rule extraction", "abstract": null, "year": 2001, "referenceCount": 43, "citationCount": 316, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "10022373", "name": "H. Ishibuchi"}, {"authorId": "72328943", "name": "T. Nakashima"}, {"authorId": "1704824", "name": "T. Murata"}]}, {"paperId": "aae4d93d5d356b858418e360a9d72257f2bb35a5", "url": "https://www.semanticscholar.org/paper/aae4d93d5d356b858418e360a9d72257f2bb35a5", "title": "Monotonic Calibrated Interpolated Look-Up Tables", "abstract": "Real-world machine learning applications may have requirements beyond accuracy, such as fast evaluation times and interpretability. In particular, guaranteed monotonicity of the learned function with respect to some of the inputs can be critical for user confidence. We propose meeting these goals for low-dimensional machine learning problems by learning flexible, monotonic functions using calibrated interpolated look-up tables. We extend the structural risk minimization framework of lattice regression to monotonic functions by adding linear inequality constraints. In addition, we propose jointly learning interpretable calibrations of each feature to normalize continuous features and handle categorical or missing data, at the cost of making the objective non-convex. We address large-scale learning through parallelization, mini-batching, and random sampling of additive regularizer terms. Case studies on real-world problems with up to sixteen features and up to hundreds of millions of training samples demonstrate the proposed monotonic functions can achieve state-of-the-art accuracy in practice while providing greater transparency to users.", "year": 2015, "referenceCount": 78, "citationCount": 101, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2109834931", "name": "Maya R. Gupta"}, {"authorId": "145658292", "name": "Andrew Cotter"}, {"authorId": "5479080", "name": "Jan Pfeifer"}, {"authorId": "2963586", "name": "Konstantin Voevodski"}, {"authorId": "2963430", "name": "K. Canini"}, {"authorId": "1388838667", "name": "Alexander Mangylov"}, {"authorId": "1388838647", "name": "Wojtek Moczydlowski"}, {"authorId": "2529823", "name": "A. V. Esbroeck"}]}, {"paperId": "11c44aa77201cf92ded74c8e38fd4134654145ef", "url": "https://www.semanticscholar.org/paper/11c44aa77201cf92ded74c8e38fd4134654145ef", "title": "Machine learning algorithms for wireless sensor networks: A survey", "abstract": null, "year": 2019, "referenceCount": 251, "citationCount": 316, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "147786874", "name": "Praveen Kumar Donta"}, {"authorId": "3332736", "name": "Tarachand Amgoth"}, {"authorId": "8045679", "name": "Chandra Sekhara Rao Annavarapu"}]}, {"paperId": "db79cc8396c5673af49cc4eec1ade3985f5f056f", "url": "https://www.semanticscholar.org/paper/db79cc8396c5673af49cc4eec1ade3985f5f056f", "title": "Copulas in Machine Learning", "abstract": null, "year": 2013, "referenceCount": 57, "citationCount": 66, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1684677", "name": "G. Elidan"}]}, {"paperId": "b51d606db06e178c5dff1e9d8c1460352bdb85db", "url": "https://www.semanticscholar.org/paper/b51d606db06e178c5dff1e9d8c1460352bdb85db", "title": "Recovering 3D human pose from monocular images", "abstract": "We describe a learning-based method for recovering 3D human body pose from single images and monocular image sequences. Our approach requires neither an explicit body model nor prior labeling of body parts in the image. Instead, it recovers pose by direct nonlinear regression against shape descriptor vectors extracted automatically from image silhouettes. For robustness against local silhouette segmentation errors, silhouette shape is encoded by histogram-of-shape-contexts descriptors. We evaluate several different regression methods: ridge regression, relevance vector machine (RVM) regression, and support vector machine (SVM) regression over both linear and kernel bases. The RVMs provide much sparser regressors without compromising performance, and kernel bases give a small but worthwhile improvement in performance. The loss of depth and limb labeling information often makes the recovery of 3D pose from single silhouettes ambiguous. To handle this, the method is embedded in a novel regressive tracking framework, using dynamics from the previous state estimate together with a learned regression value to disambiguate the pose. We show that the resulting system tracks long sequences stably. For realism and good generalization over a wide range of viewpoints, we train the regressors on images resynthesized from real human motion capture data. The method is demonstrated for several representations of full body pose, both quantitatively on independent but similar test data and qualitatively on real image sequences. Mean angular errors of 4-6/spl deg/ are obtained for a variety of walking motions.", "year": 2006, "referenceCount": 41, "citationCount": 843, "influentialCitationCount": 89, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "authors": [{"authorId": "145984136", "name": "A. Agarwal"}, {"authorId": "1756114", "name": "B. Triggs"}]}, {"paperId": "30e128568200e6777dc629bc6fb2fb95833aa98c", "url": "https://www.semanticscholar.org/paper/30e128568200e6777dc629bc6fb2fb95833aa98c", "title": "Automatic Text Summarization Using a Machine Learning Approach", "abstract": null, "year": 2002, "referenceCount": 32, "citationCount": 218, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2105659", "name": "Joel Larocca Neto"}, {"authorId": "1683199", "name": "A. Freitas"}, {"authorId": "2378317", "name": "Celso A. A. Kaestner"}]}, {"paperId": "b5b98051b65da6b1b3b579862b0407d48c5bef48", "url": "https://www.semanticscholar.org/paper/b5b98051b65da6b1b3b579862b0407d48c5bef48", "title": "Principles and Practice of Explainable Machine Learning", "abstract": "Artificial intelligence (AI) provides many opportunities to improve private and public life. Discovering patterns and structures in large troves of data in an automated manner is a core component of data science, and currently drives applications in diverse areas such as computational biology, law and finance. However, such a highly positive impact is coupled with a significant challenge: how do we understand the decisions suggested by these systems in order that we can trust them? In this report, we focus specifically on data-driven methods—machine learning (ML) and pattern recognition models in particular—so as to survey and distill the results and observations from the literature. The purpose of this report can be especially appreciated by noting that ML models are increasingly deployed in a wide range of businesses. However, with the increasing prevalence and complexity of methods, business stakeholders in the very least have a growing number of concerns about the drawbacks of models, data-specific biases, and so on. Analogously, data science practitioners are often not aware about approaches emerging from the academic literature or may struggle to appreciate the differences between different methods, so end up using industry standards such as SHAP. Here, we have undertaken a survey to help industry practitioners (but also data scientists more broadly) understand the field of explainable machine learning better and apply the right tools. Our latter sections build a narrative around a putative data scientist, and discuss how she might go about explaining her models by asking the right questions. From an organization viewpoint, after motivating the area broadly, we discuss the main developments, including the principles that allow us to study transparent models vs. opaque models, as well as model-specific or model-agnostic post-hoc explainability approaches. We also briefly reflect on deep learning models, and conclude with a discussion about future research directions.", "year": 2020, "referenceCount": 120, "citationCount": 124, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Mathematics"], "authors": [{"authorId": "144893617", "name": "Vaishak Belle"}, {"authorId": "40911590", "name": "I. Papantonis"}]}, {"paperId": "d44ac0a7fd4734187bccafc4a2771027b8bb595e", "url": "https://www.semanticscholar.org/paper/d44ac0a7fd4734187bccafc4a2771027b8bb595e", "title": "Deep learning enables rapid identification of potent DDR1 kinase inhibitors", "abstract": null, "year": 2019, "referenceCount": 32, "citationCount": 489, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "143865664", "name": "A. Zhavoronkov"}, {"authorId": "3792453", "name": "Y. Ivanenkov"}, {"authorId": "4029506", "name": "A. Aliper"}, {"authorId": "5384886", "name": "M. Veselov"}, {"authorId": "11053912", "name": "V. Aladinskiy"}, {"authorId": "2067318599", "name": "Anastasiya V Aladinskaya"}, {"authorId": "91703425", "name": "V. Terentiev"}, {"authorId": "36061519", "name": "Daniil Polykovskiy"}, {"authorId": "2065397580", "name": "Maksim Kuznetsov"}, {"authorId": "40758146", "name": "Arip Asadulaev"}, {"authorId": "2057250573", "name": "Yury Volkov"}, {"authorId": "1416761815", "name": "Artem Zholus"}, {"authorId": "2021173899", "name": "Shayakhmetov Rim"}, {"authorId": "48534186", "name": "Alexander Zhebrak"}, {"authorId": "93487508", "name": "L. I. Minaeva"}, {"authorId": "94394596", "name": "B. Zagribelnyy"}, {"authorId": "1410564330", "name": "Lennart H Lee"}, {"authorId": "40091091", "name": "R. Soll"}, {"authorId": "88209786", "name": "David Madge"}, {"authorId": "2053892942", "name": "Li Xing"}, {"authorId": "2057580513", "name": "Tao Guo"}, {"authorId": "1380248954", "name": "Alán Aspuru-Guzik"}]}, {"paperId": "ca20f8146adf21294f048121f234c449299ef67e", "url": "https://www.semanticscholar.org/paper/ca20f8146adf21294f048121f234c449299ef67e", "title": "Combining Multiple Knowledge Sources for Discourse Segmentation", "abstract": "We predict discourse segment boundaries from linguistic features of utterances, using a corpus of spoken narratives as data. We present two methods for developing segmentation algorithms from training data: hand tuning and machine learning. When multiple types of features are used, results approach human performance on an independent test set (both methods), and using cross-validation (machine learning).", "year": 1995, "referenceCount": 59, "citationCount": 137, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1737616", "name": "D. Litman"}, {"authorId": "1703046", "name": "R. Passonneau"}]}, {"paperId": "814b9ca695a861dea036ae62a56d2d31dcbcb57b", "url": "https://www.semanticscholar.org/paper/814b9ca695a861dea036ae62a56d2d31dcbcb57b", "title": "ML-Schema: Exposing the Semantics of Machine Learning with Schemas and Ontologies", "abstract": "The ML-Schema, proposed by the W3C Machine Learning Schema Community Group, is a top-level ontology that provides a set of classes, properties, and restrictions for representing and interchanging information on machine learning algorithms, datasets, and experiments. It can be easily extended and specialized and it is also mapped to other more domain-specific ontologies developed in the area of machine learning and data mining. In this paper we overview existing state-of-the-art machine learning interchange formats and present the first release of ML-Schema, a canonical format resulted of more than seven years of experience among different research institutions. We argue that exposing semantics of machine learning algorithms, models, and experiments through a canonical format may pave the way to better interpretability and to realistically achieve the full interoperability of experiments regardless of platform or adopted workflow solution.", "year": 2018, "referenceCount": 13, "citationCount": 34, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3489323", "name": "G. Publio"}, {"authorId": "145538480", "name": "Diego Esteves"}, {"authorId": "1975411", "name": "Agnieszka Lawrynowicz"}, {"authorId": "145066785", "name": "P. Panov"}, {"authorId": "3284305", "name": "L. Soldatova"}, {"authorId": "1869895", "name": "Tommaso Soru"}, {"authorId": "1717534", "name": "J. Vanschoren"}, {"authorId": "46195484", "name": "Hamid Zafar"}]}, {"paperId": "c8687ca5543bf32a9718627df5cd0fcabaacc61c", "url": "https://www.semanticscholar.org/paper/c8687ca5543bf32a9718627df5cd0fcabaacc61c", "title": "The stages of event extraction", "abstract": "Event detection and recognition is a complex task consisting of multiple sub-tasks of varying difficulty. In this paper, we present a simple, modular approach to event extraction that allows us to experiment with a variety of machine learning methods for these sub-tasks, as well as to evaluate the impact on performance these sub-tasks have on the overall task.", "year": 2006, "referenceCount": 11, "citationCount": 456, "influentialCitationCount": 30, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145079003", "name": "David Ahn"}]}, {"paperId": "29f6594bd0d99ced609429ed51ac16b639abbcdd", "url": "https://www.semanticscholar.org/paper/29f6594bd0d99ced609429ed51ac16b639abbcdd", "title": "Learning at the knowledge level", "abstract": null, "year": 2004, "referenceCount": 55, "citationCount": 56, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "144299726", "name": "Thomas G. Dietterich"}]}, {"paperId": "8feebb6e160539e3d114ce0b1c851b6f938aa4a9", "url": "https://www.semanticscholar.org/paper/8feebb6e160539e3d114ce0b1c851b6f938aa4a9", "title": "Dynamically Adapting Kernels in Support Vector Machines", "abstract": "The kernel-parameter is one of the few tunable parameters in Support Vector machines, controlling the complexity of the resulting hypothesis. Its choice amounts to model selection and its value is usually found by means of a validation set. We present an algorithm which can automatically perform model selection with little additional computational cost and with no need of a validation set. In this procedure model selection and learning are not separate, but kernels are dynamically adjusted during the learning process to find the kernel parameter which provides the best possible upper bound on the generalisation error. Theoretical results motivating the approach and experimental results confirming its validity are presented.", "year": 1998, "referenceCount": 12, "citationCount": 187, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1685083", "name": "N. Cristianini"}, {"authorId": "145990261", "name": "C. Campbell"}, {"authorId": "1404459229", "name": "J. Shawe-Taylor"}]}, {"paperId": "dc133144d431fc3b75c8de27f6bb21da6eb5bc1b", "url": "https://www.semanticscholar.org/paper/dc133144d431fc3b75c8de27f6bb21da6eb5bc1b", "title": "Knowledge-based recommender systems", "abstract": "1. Introduction Recommender systems provide advice to users about items they might wish to purchase or examine. Recommendations made by such systems can help users navigate through large information spaces of product descriptions, news articles or other items. As on-line information and e-commerce burgeon, recommender systems are an increasingly important tool. A recent survey of recommender systems is found in The most well known type of recommender system is the collaborative-or social-filtering type. These systems aggregate data about customers' purchasing habits or preferences, and make recommendations to other users based on similarity in overall purchasing patterns. For example, in the Ringo music recommender system (Shardanand & Maes, 1995), users express their musical preferences by rating various artists and albums, and get suggestions of groups and recordings that others with similar preferences also liked. Content-based recommender systems are classifier systems derived from machine learning research. For example, the NewsDude news filtering system is a recommender system that suggests news stories the user might like to read (Billsus & Pazzani, 1999). These systems use supervised machine learning to induce a classifier that can discriminate between items likely to be of interest to the user and those likely to be uninteresting. A third type of recommender system is one that uses knowledge about users and products to pursue a knowledge-based approach to generating a recommendation, reasoning about what products meet the user's requirements. The PersonalLogic recom-mender system offers a dialog that effectively walks the user down a discrimination tree of product features.", "year": 2000, "referenceCount": 28, "citationCount": 884, "influentialCitationCount": 58, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1747150", "name": "R. Burke"}]}, {"paperId": "5259755f9c100e220ffaa7e08439c5d34be7757a", "url": "https://www.semanticscholar.org/paper/5259755f9c100e220ffaa7e08439c5d34be7757a", "title": "Reinforcement Learning Neural Turing Machines - Revised", "abstract": "The Neural Turing Machine (NTM) is more expressive than all previously considered models because of its external memory. It can be viewed as a broader effort to use abstract external Interfaces and to learn a parametric model that interacts with them. \nThe capabilities of a model can be extended by providing it with proper Interfaces that interact with the world. These external Interfaces include memory, a database, a search engine, or a piece of software such as a theorem verifier. Some of these Interfaces are provided by the developers of the model. However, many important existing Interfaces, such as databases and search engines, are discrete. \nWe examine feasibility of learning models to interact with discrete Interfaces. We investigate the following discrete Interfaces: a memory Tape, an input Tape, and an output Tape. We use a Reinforcement Learning algorithm to train a neural network that interacts with such Interfaces to solve simple algorithmic tasks. Our Interfaces are expressive enough to make our model Turing complete.", "year": 2015, "referenceCount": 25, "citationCount": 153, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2563432", "name": "Wojciech Zaremba"}, {"authorId": "1701686", "name": "Ilya Sutskever"}]}, {"paperId": "5308b875bc34cd1c22a0df401dcfe38bd819eca2", "url": "https://www.semanticscholar.org/paper/5308b875bc34cd1c22a0df401dcfe38bd819eca2", "title": "Machine Learning for Outcome Prediction of Acute Ischemic Stroke Post Intra-Arterial Therapy", "abstract": "Introduction Stroke is a major cause of death and disability. Accurately predicting stroke outcome from a set of predictive variables may identify high-risk patients and guide treatment approaches, leading to decreased morbidity. Logistic regression models allow for the identification and validation of predictive variables. However, advanced machine learning algorithms offer an alternative, in particular, for large-scale multi-institutional data, with the advantage of easily incorporating newly available data to improve prediction performance. Our aim was to design and compare different machine learning methods, capable of predicting the outcome of endovascular intervention in acute anterior circulation ischaemic stroke. Method We conducted a retrospective study of a prospectively collected database of acute ischaemic stroke treated by endovascular intervention. Using SPSS®, MATLAB®, and Rapidminer®, classical statistics as well as artificial neural network and support vector algorithms were applied to design a supervised machine capable of classifying these predictors into potential good and poor outcomes. These algorithms were trained, validated and tested using randomly divided data. Results We included 107 consecutive acute anterior circulation ischaemic stroke patients treated by endovascular technique. Sixty-six were male and the mean age of 65.3. All the available demographic, procedural and clinical factors were included into the models. The final confusion matrix of the neural network, demonstrated an overall congruency of ∼80% between the target and output classes, with favourable receiving operative characteristics. However, after optimisation, the support vector machine had a relatively better performance, with a root mean squared error of 2.064 (SD: ±0.408). Discussion We showed promising accuracy of outcome prediction, using supervised machine learning algorithms, with potential for incorporation of larger multicenter datasets, likely further improving prediction. Finally, we propose that a robust machine learning system can potentially optimise the selection process for endovascular versus medical treatment in the management of acute stroke.", "year": 2014, "referenceCount": 83, "citationCount": 154, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "145625751", "name": "H. Asadi"}, {"authorId": "49990937", "name": "R. Dowling"}, {"authorId": "143673762", "name": "B. Yan"}, {"authorId": "34880338", "name": "P. Mitchell"}]}, {"paperId": "11ce07e200882977f8e27bbda7842d7925ed6f48", "url": "https://www.semanticscholar.org/paper/11ce07e200882977f8e27bbda7842d7925ed6f48", "title": "Preliminary Study on Wilcoxon Learning Machines", "abstract": "As is well known in statistics, the resulting linear regressors by using the rank-based Wilcoxon approach to linear regression problems are usually robust against (or insensitive to) outliers. This motivates us to introduce in this paper the Wilcoxon approach to the area of machine learning. Specifically, we investigate four new learning machines, namely Wilcoxon neural network (WNN), Wilcoxon generalized radial basis function network (WGRBFN), Wilcoxon fuzzy neural network (WFNN), and kernel-based Wilcoxon regressor (KWR). These provide alternative learning machines when faced with general nonlinear learning problems. Simple weights updating rules based on gradient descent will be derived. Some numerical examples will be provided to compare the robustness against outliers for various learning machines. Simulation results show that the Wilcoxon learning machines proposed in this paper have good robustness against outliers. We firmly believe that the Wilcoxon approach will provide a promising methodology for many machine learning problems.", "year": 2008, "referenceCount": 29, "citationCount": 73, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Medicine", "Computer Science"], "authors": [{"authorId": "2290180", "name": "J. Hsieh"}, {"authorId": "34441450", "name": "Yih-Lon Lin"}, {"authorId": "3328556", "name": "J. Jeng"}]}, {"paperId": "7d7880299cd6e59f72f5c034a2facc7846a4c563", "url": "https://www.semanticscholar.org/paper/7d7880299cd6e59f72f5c034a2facc7846a4c563", "title": "Machine-learning the string landscape", "abstract": null, "year": 2017, "referenceCount": 55, "citationCount": 106, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "2022419", "name": "Yang-Hui He"}]}, {"paperId": "d318c093cb450233dddef5e52833c9371860dc29", "url": "https://www.semanticscholar.org/paper/d318c093cb450233dddef5e52833c9371860dc29", "title": "Locally Weighted Naive Bayes", "abstract": "Despite its simplicity, the naive Bayes classifier has surprised machine learning researchers by exhibiting good performance on a variety of learning problems. Encouraged by these results, researchers have looked to overcome naive Bayes' primary weakness-attribute independence-and improve the performance of the algorithm. This paper presents a locally weighted version of naive Bayes that relaxes the independence assumption by learning local models at prediction time. Experimental results show that locally weighted naive Bayes rarely degrades accuracy compared to standard naive Bayes and, in many cases, improves accuracy dramatically. The main advantage of this method compared to other techniques for enhancing naive Bayes is its conceptual and computational simplicity.", "year": 2002, "referenceCount": 20, "citationCount": 351, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "143713826", "name": "Eibe Frank"}, {"authorId": "118860642", "name": "M. Hall"}, {"authorId": "1737420", "name": "B. Pfahringer"}]}, {"paperId": "470966e6967c1a0932fa388c7ff7e7b07875aacd", "url": "https://www.semanticscholar.org/paper/470966e6967c1a0932fa388c7ff7e7b07875aacd", "title": "Machine Learning for Information Retrieval: Neural Networks, Symbolic Learning, and Genetic Algorithms", "abstract": "Information retrieval using probabilistic techniques has attracted significant attention on the part of researchers in information and computer science over the past few decades. In the 1980s, knowledge-based techniques also made an impressive contribution to “intelligent” information retrieval and indexing. More recently, information science researchers have turned to other newer artificial-intelligence-based inductive learning techniques including neural networks, symbolic learning, and genetic algorithms. These newer techniques, which are grounded on diverse paradigms, have provided great opportunities for researchers to enhance the information processing and retrieval capabilities of current information storage and retrieval systems. In this article, we first provide an overview of these newer techniques and their use in information science research. To familiarize readers with these techniques, we present three popular methods: the connectionist Hopfield network; the symbolic ID3/ID5R; and evolution-based genetic algorithms. We discuss their knowledge representations and algorithms in the context of information retrieval. Sample implementation and testing results from our own research are also provided for each technique. We believe these techniques are promising in their ability to analyze user queries, identify users' information needs, and suggest alternatives for search. With proper user-system interactions, these methods can greatly complement the prevailing full-text, keyword-based, probabilistic, and knowledge-based techniques. © 1995 John Wiley & Sons, Inc.", "year": 1995, "referenceCount": 112, "citationCount": 306, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47666658", "name": "Hsinchun Chen"}]}, {"paperId": "878783964ab23c97052ea82685368099d85c500d", "url": "https://www.semanticscholar.org/paper/878783964ab23c97052ea82685368099d85c500d", "title": "A Comparison of Algorithms for Maximum Entropy Parameter Estimation", "abstract": "Conditional maximum entropy (ME) models provide a general purpose machine learning technique which has been successfully applied to fields as diverse as computer vision and econometrics, and which is used for a wide variety of classification problems in natural language processing. However, the flexibility of ME models is not without cost. While parameter estimation for ME models is conceptually straightforward, in practice ME models for typical natural language tasks are very large, and may well contain many thousands of free parameters. In this paper, we consider a number of algorithms for estimating the parameters of ME models, including iterative scaling, gradient ascent, conjugate gradient, and variable metric methods. Sur-prisingly, the standardly used iterative scaling algorithms perform quite poorly in comparison to the others, and for all of the test problems, a limited-memory variable metric algorithm outperformed the other choices.", "year": 2002, "referenceCount": 39, "citationCount": 759, "influentialCitationCount": 50, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145804005", "name": "Robert Malouf"}]}, {"paperId": "7f002c2059f0714b5423f084913e54a50fe1ac58", "url": "https://www.semanticscholar.org/paper/7f002c2059f0714b5423f084913e54a50fe1ac58", "title": "Deep learning for electroencephalogram (EEG) classification tasks: a review", "abstract": "Objective. Electroencephalography (EEG) analysis has been an important tool in neuroscience with applications in neuroscience, neural engineering (e.g. Brain–computer interfaces, BCI’s), and even commercial applications. Many of the analytical tools used in EEG studies have used machine learning to uncover relevant information for neural classification and neuroimaging. Recently, the availability of large EEG data sets and advances in machine learning have both led to the deployment of deep learning architectures, especially in the analysis of EEG signals and in understanding the information it may contain for brain functionality. The robust automatic classification of these signals is an important step towards making the use of EEG more practical in many applications and less reliant on trained professionals. Towards this goal, a systematic review of the literature on deep learning applications to EEG classification was performed to address the following critical questions: (1) Which EEG classification tasks have been explored with deep learning? (2) What input formulations have been used for training the deep networks? (3) Are there specific deep learning network structures suitable for specific types of tasks? Approach. A systematic literature review of EEG classification using deep learning was performed on Web of Science and PubMed databases, resulting in 90 identified studies. Those studies were analyzed based on type of task, EEG preprocessing methods, input type, and deep learning architecture. Main results. For EEG classification tasks, convolutional neural networks, recurrent neural networks, deep belief networks outperform stacked auto-encoders and multi-layer perceptron neural networks in classification accuracy. The tasks that used deep learning fell into five general groups: emotion recognition, motor imagery, mental workload, seizure detection, event related potential detection, and sleep scoring. For each type of task, we describe the specific input formulation, major characteristics, and end classifier recommendations found through this review. Significance. This review summarizes the current practices and performance outcomes in the use of deep learning for EEG classification. Practical suggestions on the selection of many hyperparameters are provided in the hope that they will promote or guide the deployment of deep learning to EEG datasets in future research.", "year": 2019, "referenceCount": 187, "citationCount": 527, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Medicine", "Computer Science"], "authors": [{"authorId": "1411706241", "name": "Alexander Craik"}, {"authorId": "2517432", "name": "Yongtian He"}, {"authorId": "1398582662", "name": "J. Contreras-Vidal"}]}, {"paperId": "adc61e21eafecfbf6ebecc570f9f913659a2bfb2", "url": "https://www.semanticscholar.org/paper/adc61e21eafecfbf6ebecc570f9f913659a2bfb2", "title": "Deep Learning Based Text Classification: A Comprehensive Review", "abstract": "Deep learning basedmodels have surpassed classical machine learning based approaches in various text classification tasks, including sentiment analysis, news categorization, question answering, and natural language inference. In this paper, we provide a comprehensive review of more than 150 deep learning based models for text classification developed in recent years, and discuss their technical contributions, similarities, and strengths. We also provide a summary of more than 40 popular datasets widely used for text classification. Finally, we provide a quantitative analysis of the performance of different deep learning models on popular benchmarks, and discuss future research directions. Additional", "year": 2021, "referenceCount": 226, "citationCount": 297, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2164604", "name": "Shervin Minaee"}, {"authorId": "49943757", "name": "E. Cambria"}, {"authorId": "48441311", "name": "Jianfeng Gao"}]}, {"paperId": "19a56027227690f7301494e94621f4486225e813", "url": "https://www.semanticscholar.org/paper/19a56027227690f7301494e94621f4486225e813", "title": "Improved Learning of Gaussian-Bernoulli Restricted Boltzmann Machines", "abstract": null, "year": 2011, "referenceCount": 20, "citationCount": 185, "influentialCitationCount": 27, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1979489", "name": "Kyunghyun Cho"}, {"authorId": "145096481", "name": "A. Ilin"}, {"authorId": "2785022", "name": "T. Raiko"}]}, {"paperId": "026a79ea386a75113d06acc0e02016f13c673fc1", "url": "https://www.semanticscholar.org/paper/026a79ea386a75113d06acc0e02016f13c673fc1", "title": "Combining mechanistic and machine learning models for predictive engineering and optimization of tryptophan metabolism", "abstract": null, "year": 2020, "referenceCount": 87, "citationCount": 82, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1970835877", "name": "Jie Zhang"}, {"authorId": "11825708", "name": "Søren D Petersen"}, {"authorId": "5644599", "name": "Tijana Radivojević"}, {"authorId": "50027909", "name": "A. Ramirez"}, {"authorId": "1969206387", "name": "Andrés Pérez-Manríquez"}, {"authorId": "2077208", "name": "Eduardo Abeliuk"}, {"authorId": "49113983", "name": "Benjamín J. Sánchez"}, {"authorId": "47265331", "name": "Zak Costello"}, {"authorId": "2144837188", "name": "Yu Chen"}, {"authorId": "34226913", "name": "M. Fero"}, {"authorId": "2819529", "name": "H. Martín"}, {"authorId": "153455426", "name": "J. Nielsen"}, {"authorId": "144485119", "name": "J. Keasling"}, {"authorId": "2455646", "name": "M. K. Jensen"}]}, {"paperId": "cfd4259d305a00f13d5f08841230389f61322422", "url": "https://www.semanticscholar.org/paper/cfd4259d305a00f13d5f08841230389f61322422", "title": "Optimizing search engines using clickthrough data", "abstract": "This paper presents an approach to automatically optimizing the retrieval quality of search engines using clickthrough data. Intuitively, a good information retrieval system should present relevant documents high in the ranking, with less relevant documents following below. While previous approaches to learning retrieval functions from examples exist, they typically require training data generated from relevance judgments by experts. This makes them difficult and expensive to apply. The goal of this paper is to develop a method that utilizes clickthrough data for training, namely the query-log of the search engine in connection with the log of links the users clicked on in the presented ranking. Such clickthrough data is available in abundance and can be recorded at very low cost. Taking a Support Vector Machine (SVM) approach, this paper presents a method for learning retrieval functions. From a theoretical perspective, this method is shown to be well-founded in a risk minimization framework. Furthermore, it is shown to be feasible even for large sets of queries and features. The theoretical results are verified in a controlled experiment. It shows that the method can effectively adapt the retrieval function of a meta-search engine to a particular group of users, outperforming Google in terms of retrieval quality after only a couple of hundred training examples.", "year": 2002, "referenceCount": 31, "citationCount": 4391, "influentialCitationCount": 688, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1680188", "name": "T. Joachims"}]}, {"paperId": "2698bdb4673caa10e0f5eece28ae80393c5ff94f", "url": "https://www.semanticscholar.org/paper/2698bdb4673caa10e0f5eece28ae80393c5ff94f", "title": "Collaborative Writing Support Tools on the Cloud", "abstract": "Academic writing, individual or collaborative, is an essential skill for today's graduates. Unfortunately, managing writing activities and providing feedback to students is very labor intensive and academics often opt out of including such learning experiences in their teaching. We describe the architecture for a new collaborative writing support environment used to embed such collaborative learning activities in engineering courses. iWrite provides tools for managing collaborative and individual writing assignments in large cohorts. It outsources the writing tools and the storage of student content to third party cloud-computing vendors (i.e., Google). We further describe how using machine learning and NLP techniques, the architecture provides automated feedback, automatic question generation, and process analysis features.", "year": 2011, "referenceCount": 46, "citationCount": 128, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144792845", "name": "R. Calvo"}, {"authorId": "2073202565", "name": "Stephen T. O'Rourke"}, {"authorId": "145869583", "name": "Janet Jones"}, {"authorId": "1763220", "name": "K. Yacef"}, {"authorId": "20779579", "name": "P. Reimann"}]}, {"paperId": "7edde67273c2ad09458d73328628f3385d0df837", "url": "https://www.semanticscholar.org/paper/7edde67273c2ad09458d73328628f3385d0df837", "title": "From Graphs to Manifolds - Weak and Strong Pointwise Consistency of Graph Laplacians", "abstract": null, "year": 2005, "referenceCount": 11, "citationCount": 334, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "143610806", "name": "Matthias Hein"}, {"authorId": "3015507", "name": "Jean-Yves Audibert"}, {"authorId": "1728654", "name": "U. V. Luxburg"}]}, {"paperId": "7f0d3991feb75f6f2fd50d0f2f80d820f20054cc", "url": "https://www.semanticscholar.org/paper/7f0d3991feb75f6f2fd50d0f2f80d820f20054cc", "title": "ZipML: Training Linear Models with End-to-End Low Precision, and a Little Bit of Deep Learning", "abstract": "Recently there has been significant interest in training machine-learning models at low precision: by reducing precision, one can reduce computation and communication by one order of magnitude. We examine training at reduced precision, both from a theoretical and practical perspective, and ask: is it possible to train models at end-to-end low precision with provable guarantees? Can this lead to consistent order-ofmagnitude speedups? We mainly focus on linear models, and the answer is yes for linear models. We develop a simple framework called ZipML based on one simple but novel strategy called double sampling. Our ZipML framework is able to execute training at low precision with no bias, guaranteeing convergence, whereas naive quantization would introduce significant bias. We validate our framework across a range of applications, and show that it enables an FPGA prototype that is up to 6.5× faster than an implementation using full 32-bit precision. We further develop a variance-optimal stochastic quantization strategy and show that it can make a significant difference in a variety of settings. When applied to linear models together with double sampling, we save up to another 1.7× in data movement compared with uniform quantization. When training deep networks with quantized models, we achieve higher accuracy than the state-of-theart XNOR-Net. ETH Zurich, Switzerland Massachusetts Institute of Technology, USA IST Austria, Austria University of Rochester, USA. Correspondence to: Hantian Zhang <hantian.zhang@inf.ethz.ch>, Ce Zhang <ce.zhang@inf.ethz.ch>. Proceedings of the 34 th International Conference on Machine Learning, Sydney, Australia, PMLR 70, 2017. Copyright 2017 by the author(s). (a) Linear Regression (c) 3D Reconstruction 32Bit 12Bit (b) FPGA Speed Up (d) Deep Learning Machine Learning Models Data Movement Channels Speed up because of our techniques Gradient Input Samples Model Linear Models De Sa et la., Alistarh et al., ... 1. Double Sampling 2. Data-Optimal Encoding Stochastic Rounding Very Significant Speed up (Up to 10x) Deep Learning Courbariaux et al., Rastegari et al., ... Data-Optimal Encoding Significant Speed up 0 25 50 75 100 32-bit Full Precision Double Sampling 4-bit #Epochs Tr ai ni ng L os s #Epochs (a) Linear Regression (b) LS-SVM 0 25 50 75 100 .3", "year": 2017, "referenceCount": 24, "citationCount": 154, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2016429687", "name": "Hantian Zhang"}, {"authorId": "2800851", "name": "Jerry Li"}, {"authorId": "34680313", "name": "Kaan Kara"}, {"authorId": "3311387", "name": "Dan Alistarh"}, {"authorId": "40478933", "name": "Ji Liu"}, {"authorId": "1776014", "name": "Ce Zhang"}]}, {"paperId": "c7baa5d9d6e244586eb90929526fa7d4589d8ed2", "url": "https://www.semanticscholar.org/paper/c7baa5d9d6e244586eb90929526fa7d4589d8ed2", "title": "Probabilistic Graphical Models: Principles and Techniques - Adaptive Computation and Machine Learning", "abstract": "Most tasks require a person or an automated system to reasonto reach conclusions based on available information. The framework of probabilistic graphical models, presented in this book, provides a general approach for this task. The approach is model-based, allowing interpretable models to be constructed and then manipulated by reasoning algorithms. These models can also be learned automatically from data, allowing the approach to be used in cases where manually constructing a model is difficult or even impossible. Because uncertainty is an inescapable aspect of most real-world applications, the book focuses on probabilistic models, which make the uncertainty explicit and provide models that are more faithful to reality. Probabilistic Graphical Models discusses a variety of models, spanning Bayesian networks, undirected Markov networks, discrete and continuous models, and extensions to deal with dynamical systems and relational data. For each class of models, the text describes the three fundamental cornerstones: representation, inference, and learning, presenting both basic concepts and advanced techniques. Finally, the book considers the use of the proposed framework for causal reasoning and decision making under uncertainty. The main text in each chapter provides the detailed technical development of the key ideas. Most chapters also include boxes with additional material: skill boxes, which describe techniques; case study boxes, which discuss empirical cases related to the approach described in the text, including applications in computer vision, robotics, natural language understanding, and computational biology; and concept boxes, which present significant concepts drawn from the material in the chapter. Instructors (and readers) can group chapters in various combinations, from core topics to more technically advanced material, to suit their particular needs. Adaptive Computation and Machine Learning series", "year": 2009, "referenceCount": 0, "citationCount": 624, "influentialCitationCount": 73, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1736370", "name": "D. Koller"}, {"authorId": "50785579", "name": "N. Friedman"}]}, {"paperId": "d5a2dc97721844881ba86f61c8c1fdb6c042cecb", "url": "https://www.semanticscholar.org/paper/d5a2dc97721844881ba86f61c8c1fdb6c042cecb", "title": "Rule Extraction from Support Vector Machines", "abstract": null, "year": 2008, "referenceCount": 12, "citationCount": 206, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1715247", "name": "J. Diederich"}]}, {"paperId": "8fb1b96dcc133b170e7e5b340f93c5f230d495ee", "url": "https://www.semanticscholar.org/paper/8fb1b96dcc133b170e7e5b340f93c5f230d495ee", "title": "A streaming ensemble algorithm (SEA) for large-scale classification", "abstract": "Ensemble methods have recently garnered a great deal of attention in the machine learning community. Techniques such as Boosting and Bagging have proven to be highly effective but require repeated resampling of the training data, making them inappropriate in a data mining context. The methods presented in this paper take advantage of plentiful data, building separate classifiers on sequential chunks of training points. These classifiers are combined into a fixed-size ensemble using a heuristic replacement strategy. The result is a fast algorithm for large-scale or streaming data that classifies as well as a single decision tree built on all the data, requires approximately constant memory, and adjusts quickly to concept drift.", "year": 2001, "referenceCount": 21, "citationCount": 1184, "influentialCitationCount": 166, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2562282", "name": "W. N. Street"}, {"authorId": "2117912702", "name": "YongSeog Kim"}]}, {"paperId": "08f6cbd15171b91c900c43e6959aa9eaa97e1137", "url": "https://www.semanticscholar.org/paper/08f6cbd15171b91c900c43e6959aa9eaa97e1137", "title": "On-Line Support Vector Machine Regression", "abstract": null, "year": 2002, "referenceCount": 13, "citationCount": 90, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2110741568", "name": "Mario Martín"}]}, {"paperId": "dd20272cba91c5a47bfd54a9d716a51acd28195f", "url": "https://www.semanticscholar.org/paper/dd20272cba91c5a47bfd54a9d716a51acd28195f", "title": "Machine Learning at Central Banks", "abstract": "We introduce machine learning in the context of central banking and policy analyses. Our aim is to give an overview broad enough to allow the reader to place machine learning within the wider range of statistical modelling and computational analyses, and provide an idea of its scope and limitations. We review the underlying technical sources and the nascent literature applying machine learning to economic and policy problems. We present popular modelling approaches, such as artificial neural networks, tree-based models, support vector machines, recommender systems and different clustering techniques. Important concepts like the bias-variance trade-off, optimal model complexity, regularisation and cross-validation are discussed to enrich the econometrics toolbox in their own right. We present three case studies relevant to central bank policy, financial regulation and economic modelling more widely. First, we model the detection of alerts on the balance sheets of financial institutions in the context of banking supervision. Second, we perform a projection exercise for UK CPI inflation on a medium-term horizon of two years. Here, we introduce a simple training-testing framework for time series analyses. Third, we investigate the funding patterns of technology start-ups with the aim to detect potentially disruptive innovators in financial technology. Machine learning models generally outperform traditional modelling approaches in prediction tasks, while open research questions remain with regard to their causal inference properties.", "year": 2017, "referenceCount": 0, "citationCount": 80, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "3000889", "name": "Chiranjit Chakraborty"}, {"authorId": "47476153", "name": "Andreas Joseph"}]}, {"paperId": "e838ba98e198d2dac047736e77c50c0efa49c2dc", "url": "https://www.semanticscholar.org/paper/e838ba98e198d2dac047736e77c50c0efa49c2dc", "title": "Data augmentation for improving deep learning in image classification problem", "abstract": "These days deep learning is the fastest-growing field in the field of Machine Learning (ML) and Deep Neural Networks (DNN). Among many of DNN structures, the Convolutional Neural Networks (CNN) are currently the main tool used for the image analysis and classification purposes. Although great achievements and perspectives, deep neural networks and accompanying learning algorithms have some relevant challenges to tackle. In this paper, we have focused on the most frequently mentioned problem in the field of machine learning, that is the lack of sufficient amount of the training data or uneven class balance within the datasets. One of the ways of dealing with this problem is so called data augmentation. In the paper we have compared and analyzed multiple methods of data augmentation in the task of image classification, starting from classical image transformations like rotating, cropping, zooming, histogram based methods and finishing at Style Transfer and Generative Adversarial Networks, along with the representative examples. Next, we presented our own method of data augmentation based on image style transfer. The method allows to generate the new images of high perceptual quality that combine the content of a base image with the appearance of another ones. The newly created images can be used to pre-train the given neural network in order to improve the training process efficiency. Proposed method is validated on the three medical case studies: skin melanomas diagnosis, histopathological images and breast magnetic resonance imaging (MRI) scans analysis, utilizing the image classification in order to provide a diagnose. In such kind of problems the data deficiency is one of the most relevant issues. Finally, we discuss the advantages and disadvantages of the methods being analyzed.", "year": 2018, "referenceCount": 45, "citationCount": 694, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "32920239", "name": "Agnieszka Mikołajczyk"}, {"authorId": "31820684", "name": "M. Grochowski"}]}, {"paperId": "f2f0b32444bbb41d198a54e6aeea109c81691f27", "url": "https://www.semanticscholar.org/paper/f2f0b32444bbb41d198a54e6aeea109c81691f27", "title": "Machine learning - applications in expert systems and information retrieval", "abstract": "Thank you very much for downloading machine learning applications in expert systems and information retrieval. Maybe you have knowledge that, people have look numerous times for their chosen books like this machine learning applications in expert systems and information retrieval, but end up in malicious downloads. Rather than enjoying a good book with a cup of tea in the afternoon, instead they cope with some malicious bugs inside their computer.", "year": 1986, "referenceCount": 0, "citationCount": 123, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "25294406", "name": "R. Forsyth"}, {"authorId": "1766712", "name": "R. Rada"}]}, {"paperId": "561c6977d57d33990e4ff840570658d495d37373", "url": "https://www.semanticscholar.org/paper/561c6977d57d33990e4ff840570658d495d37373", "title": "Seismic facies analysis using machine learning", "abstract": "Seismic interpretations are, by definition, subjective and often require significant time and expertise from the interpreter. We are convinced that machine-learning techniques can help address these problems by performing seismic facies analyses in a rigorous, repeatable way. For this purpose, we use state-of-the-art 3D broadband seismic reflection data of the northern North Sea. Our workflow includes five basic steps. First, we extract seismic attributes to highlight features in the data. Second, we perform a manual seismic facies classification on 10,000 examples. Third, we use some of these examples to train a range of models to predict seismic facies. Fourth, we analyze the performance of these models on the remaining examples. Fifth, we select the “best” model (i.e., highest accuracy) and apply it to a seismic section. As such, we highlight that machine-learning techniques can increase the efficiency of seismic facies analyses.", "year": 2018, "referenceCount": 68, "citationCount": 112, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Geology"], "authors": [{"authorId": "46282847", "name": "T. Wrona"}, {"authorId": "2316212", "name": "I. Pan"}, {"authorId": "71764416", "name": "R. Gawthorpe"}, {"authorId": "28974766", "name": "H. Fossen"}]}, {"paperId": "de428a5dc4da94717d64ecad171fd9fa9f60a6b3", "url": "https://www.semanticscholar.org/paper/de428a5dc4da94717d64ecad171fd9fa9f60a6b3", "title": "On optimization based extreme learning machine in primal for regression and classification by functional iterative method", "abstract": null, "year": 2016, "referenceCount": 50, "citationCount": 41, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145933951", "name": "S. Balasundaram"}, {"authorId": "121948183", "name": "D. Gupta"}]}, {"paperId": "bcdc102c04fb0e7d4652e8bcc7edd2983bb9576d", "url": "https://www.semanticscholar.org/paper/bcdc102c04fb0e7d4652e8bcc7edd2983bb9576d", "title": "VADER: A Parsimonious Rule-Based Model for Sentiment Analysis of Social Media Text", "abstract": "\n \n The inherent nature of social media content poses serious challenges to practical applications of sentiment analysis. We present VADER, a simple rule-based model for general sentiment analysis, and compare its effectiveness to eleven typical state-of-practice benchmarks including LIWC, ANEW, the General Inquirer, SentiWordNet, and machine learning oriented techniques relying on Naive Bayes, Maximum Entropy, and Support Vector Machine (SVM) algorithms. Using a combination of qualitative and quantitative methods, we first construct and empirically validate a gold-standard list of lexical features (along with their associated sentiment intensity measures) which are specifically attuned to sentiment in microblog-like contexts. We then combine these lexical features with consideration for five general rules that embody grammatical and syntactical conventions for expressing and emphasizing sentiment intensity. Interestingly, using our parsimonious rule-based model to assess the sentiment of tweets, we find that VADER outperforms individual human raters (F1 Classification Accuracy = 0.96 and 0.84, respectively), and generalizes more favorably across contexts than any of our benchmarks.\n \n", "year": 2014, "referenceCount": 39, "citationCount": 2646, "influentialCitationCount": 400, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40320059", "name": "C. Hutto"}, {"authorId": "145280613", "name": "Eric Gilbert"}]}, {"paperId": "872cdc269f3cb59f8a227818f35041415091545f", "url": "https://www.semanticscholar.org/paper/872cdc269f3cb59f8a227818f35041415091545f", "title": "Learning and Extracting Finite State Automata with Second-Order Recurrent Neural Networks", "abstract": "We show that a recurrent, second-order neural network using a real-time, forward training algorithm readily learns to infer small regular grammars from positive and negative string training samples. We present simulations that show the effect of initial conditions, training set size and order, and neural network architecture. All simulations were performed with random initial weight strengths and usually converge after approximately a hundred epochs of training. We discuss a quantization algorithm for dynamically extracting finite state automata during and after training. For a well-trained neural net, the extracted automata constitute an equivalence class of state machines that are reducible to the minimal machine of the inferred grammar. We then show through simulations that many of the neural net state machines are dynamically stable, that is, they correctly classify many long unseen strings. In addition, some of these extracted automata actually outperform the trained neural network for classification of unseen strings.", "year": 1992, "referenceCount": 25, "citationCount": 491, "influentialCitationCount": 44, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145157784", "name": "C. Lee Giles"}, {"authorId": "153170210", "name": "Clifford B. Miller"}, {"authorId": "2158193072", "name": "Dong Chen"}, {"authorId": "2115401300", "name": "Hsing-Hen Chen"}, {"authorId": "34922532", "name": "Guo-Zheng Sun"}, {"authorId": "2552960", "name": "Yee-Chun Lee"}]}, {"paperId": "0bf71f7b1fa5f95b50d27e3583c81ffe7178e58c", "url": "https://www.semanticscholar.org/paper/0bf71f7b1fa5f95b50d27e3583c81ffe7178e58c", "title": "The Optimality of Naive Bayes", "abstract": "Naive Bayes is one of the most efficient and effective inductive learning algorithms for machine learning and data mining. Its competitive performance in classification is surprising, because the conditional independence assumption on which it is based, is rarely true in realworld applications. An open question is: what is the true reason for the surprisingly good performance of naive Bayes in classification? In this paper, we propose a novel explanation on the superb classification performance of naive Bayes. We show that, essentially, the dependence distribution; i.e., how the local dependence of a node distributes in each class, evenly or unevenly, and how the local dependencies of all nodes work together, consistently (supporting a certain classification) or inconsistently (canceling each other out), plays a crucial role. Therefore, no matter how strong the dependences among attributes are, naive Bayes can still be optimal if the dependences distribute evenly in classes, or if the dependences cancel each other out. We propose and prove a sufficient and necessary conditions for the optimality of naive Bayes. Further, we investigate the optimality of naive Bayes under the Gaussian distribution. We present and prove a sufficient condition for the optimality of naive Bayes, in which the dependence between attributes do exist. This provides evidence that dependence among attributes may cancel out each other. In addition, we explore when naive Bayes works well. Naive Bayes and Augmented Naive Bayes Classification is a fundamental issue in machine learning and data mining. In classification, the goal of a learning algorithm is to construct a classifier given a set of training examples with class labels. Typically, an example E is represented by a tuple of attribute values (x1, x2, , · · · , xn), where xi is the value of attribute Xi. Let C represent the classification variable, and let c be the value of C. In this paper, we assume that there are only two classes: + (the positive class) or − (the negative class). A classifier is a function that assigns a class label to an example. From the probability perspective, according to Bayes Copyright c © 2004, American Association for Artificial Intelligence (www.aaai.org). All rights reserved. Rule, the probability of an example E = (x1, x2, · · · , xn) being class c is p(c|E) = p(E|c)p(c) p(E) . E is classified as the class C = + if and only if fb(E) = p(C = +|E) p(C = −|E) ≥ 1, (1) where fb(E) is called a Bayesian classifier. Assume that all attributes are independent given the value of the class variable; that is, p(E|c) = p(x1, x2, · · · , xn|c) = n ∏", "year": 2004, "referenceCount": 15, "citationCount": 1606, "influentialCitationCount": 97, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2108544384", "name": "Harry Zhang"}]}, {"paperId": "acd6de3ac2a3d9449aae51b87fbb03f6f0020954", "url": "https://www.semanticscholar.org/paper/acd6de3ac2a3d9449aae51b87fbb03f6f0020954", "title": "The Measure and Mismeasure of Fairness: A Critical Review of Fair Machine Learning", "abstract": "The nascent field of fair machine learning aims to ensure that decisions guided by algorithms are equitable. Over the last several years, three formal definitions of fairness have gained prominence: (1) anti-classification, meaning that protected attributes---like race, gender, and their proxies---are not explicitly used to make decisions; (2) classification parity, meaning that common measures of predictive performance (e.g., false positive and false negative rates) are equal across groups defined by the protected attributes; and (3) calibration, meaning that conditional on risk estimates, outcomes are independent of protected attributes. Here we show that all three of these fairness definitions suffer from significant statistical limitations. Requiring anti-classification or classification parity can, perversely, harm the very groups they were designed to protect; and calibration, though generally desirable, provides little guarantee that decisions are equitable. In contrast to these formal fairness criteria, we argue that it is often preferable to treat similarly risky people similarly, based on the most statistically accurate estimates of risk that one can produce. Such a strategy, while not universally applicable, often aligns well with policy objectives; notably, this strategy will typically violate both anti-classification and classification parity. In practice, it requires significant effort to construct suitable risk estimates. One must carefully define and measure the targets of prediction to avoid retrenching biases in the data. But, importantly, one cannot generally address these difficulties by requiring that algorithms satisfy popular mathematical formalizations of fairness. By highlighting these challenges in the foundation of fair machine learning, we hope to help researchers and practitioners productively advance the area.", "year": 2018, "referenceCount": 88, "citationCount": 614, "influentialCitationCount": 55, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1403746185", "name": "S. Corbett-Davies"}, {"authorId": "143802734", "name": "Sharad Goel"}]}, {"paperId": "4b733a188198dbff57cb8bd1ec996044fe272ce5", "url": "https://www.semanticscholar.org/paper/4b733a188198dbff57cb8bd1ec996044fe272ce5", "title": "Machine Learning in Genomic Medicine: A Review of Computational Problems and Data Sets", "abstract": "In this paper, we provide an introduction to machine learning tasks that address important problems in genomic medicine. One of the goals of genomic medicine is to determine how variations in the DNA of individuals can affect the risk of different diseases, and to find causal explanations so that targeted therapies can be designed. Here we focus on how machine learning can help to model the relationship between DNA and the quantities of key molecules in the cell, with the premise that these quantities, which we refer to as cell variables, may be associated with disease risks. Modern biology allows high-throughput measurement of many such cell variables, including gene expression, splicing, and proteins binding to nucleic acids, which can all be treated as training targets for predictive models. With the growing availability of large-scale data sets and advanced computational techniques such as deep learning, researchers can help to usher in a new era of effective genomic medicine.", "year": 2016, "referenceCount": 246, "citationCount": 192, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Computer Science"], "authors": [{"authorId": "2952761", "name": "M. Leung"}, {"authorId": "3203657", "name": "Andrew Delong"}, {"authorId": "48401711", "name": "B. Alipanahi"}, {"authorId": "1749650", "name": "B. Frey"}]}, {"paperId": "bfdad8066d2b8dff3e9bae43715724813ad5dbc3", "url": "https://www.semanticscholar.org/paper/bfdad8066d2b8dff3e9bae43715724813ad5dbc3", "title": "Machine Learning in IoT Security: Current Solutions and Future Challenges", "abstract": "The future Internet of Things (IoT) will have a deep economical, commercial and social impact on our lives. The participating nodes in IoT networks are usually resource-constrained, which makes them luring targets for cyber attacks. In this regard, extensive efforts have been made to address the security and privacy issues in IoT networks primarily through traditional cryptographic approaches. However, the unique characteristics of IoT nodes render the existing solutions insufficient to encompass the entire security spectrum of the IoT networks. Machine Learning (ML) and Deep Learning (DL) techniques, which are able to provide embedded intelligence in the IoT devices and networks, can be leveraged to cope with different security problems. In this paper, we systematically review the security requirements, attack vectors, and the current security solutions for the IoT networks. We then shed light on the gaps in these security solutions that call for ML and DL approaches. Finally, we discuss in detail the existing ML and DL solutions for addressing different security problems in IoT networks. We also discuss several future research directions for ML- and DL-based IoT security.", "year": 2019, "referenceCount": 225, "citationCount": 223, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "73882549", "name": "Fatima Hussain"}, {"authorId": "2225364", "name": "R. Hussain"}, {"authorId": "1682336", "name": "Syed Ali Hassan"}, {"authorId": "144158811", "name": "E. Hossain"}]}, {"paperId": "ae617017e3c5c962c844c665b2dd6b2dda5ea4b3", "url": "https://www.semanticscholar.org/paper/ae617017e3c5c962c844c665b2dd6b2dda5ea4b3", "title": "Dimension Reduction With Extreme Learning Machine", "abstract": "Data may often contain noise or irrelevant information, which negatively affect the generalization capability of machine learning algorithms. The objective of dimension reduction algorithms, such as principal component analysis (PCA), non-negative matrix factorization (NMF), random projection (RP), and auto-encoder (AE), is to reduce the noise or irrelevant information of the data. The features of PCA (eigenvectors) and linear AE are not able to represent data as parts (e.g. nose in a face image). On the other hand, NMF and non-linear AE are maimed by slow learning speed and RP only represents a subspace of original data. This paper introduces a dimension reduction framework which to some extend represents data as parts, has fast learning speed, and learns the between-class scatter subspace. To this end, this paper investigates a linear and non-linear dimension reduction framework referred to as extreme learning machine AE (ELM-AE) and sparse ELM-AE (SELM-AE). In contrast to tied weight AE, the hidden neurons in ELM-AE and SELM-AE need not be tuned, and their parameters (e.g, input weights in additive neurons) are initialized using orthogonal and sparse random weights, respectively. Experimental results on USPS handwritten digit recognition data set, CIFAR-10 object recognition, and NORB object recognition data set show the efficacy of linear and non-linear ELM-AE and SELM-AE in terms of discriminative capability, sparsity, training time, and normalized mean square error.", "year": 2016, "referenceCount": 60, "citationCount": 137, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Medicine", "Computer Science"], "authors": [{"authorId": "2996971", "name": "L. L. C. Kasun"}, {"authorId": "2108850466", "name": "Yan Yang"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "2148905797", "name": "Zhengyou Zhang"}]}, {"paperId": "2dc36b8d0c08613fb213ad419973d379a2264765", "url": "https://www.semanticscholar.org/paper/2dc36b8d0c08613fb213ad419973d379a2264765", "title": "Training algorithms for linear text classifiers", "abstract": "Systems for text retrieval, routing, categorization and other IR tasks rely heavily on linear classifiers. We propose that two machine learning algorithms, the Widrow-Hoff and EG algorithms, be used in training linear text classifiers. In contrast to most IR methods, theoretical analysis provides performance guarantees and guidance on parameter settings for these algorithms. Experimental data is presented showing Widrow-Hoff and EG to be more effective than the widely used Rocchio algorithm on several categorization and routing tasks.", "year": 1996, "referenceCount": 57, "citationCount": 632, "influentialCitationCount": 34, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35153517", "name": "D. Lewis"}, {"authorId": "1716301", "name": "R. Schapire"}, {"authorId": "144987107", "name": "Jamie Callan"}, {"authorId": "47394834", "name": "R. Papka"}]}, {"paperId": "4a3d34c3c23ded529c871150cb1f47d6e09ff0ba", "url": "https://www.semanticscholar.org/paper/4a3d34c3c23ded529c871150cb1f47d6e09ff0ba", "title": "Imaging patterns predict patient survival and molecular subtype in glioblastoma via machine learning techniques.", "abstract": "BACKGROUND\nMRI characteristics of brain gliomas have been used to predict clinical outcome and molecular tumor characteristics. However, previously reported imaging biomarkers have not been sufficiently accurate or reproducible to enter routine clinical practice and often rely on relatively simple MRI measures. The current study leverages advanced image analysis and machine learning algorithms to identify complex and reproducible imaging patterns predictive of overall survival and molecular subtype in glioblastoma (GB).\n\n\nMETHODS\nOne hundred five patients with GB were first used to extract approximately 60 diverse features from preoperative multiparametric MRIs. These imaging features were used by a machine learning algorithm to derive imaging predictors of patient survival and molecular subtype. Cross-validation ensured generalizability of these predictors to new patients. Subsequently, the predictors were evaluated in a prospective cohort of 29 new patients.\n\n\nRESULTS\nSurvival curves yielded a hazard ratio of 10.64 for predicted long versus short survivors. The overall, 3-way (long/medium/short survival) accuracy in the prospective cohort approached 80%. Classification of patients into the 4 molecular subtypes of GB achieved 76% accuracy.\n\n\nCONCLUSIONS\nBy employing machine learning techniques, we were able to demonstrate that imaging patterns are highly predictive of patient survival. Additionally, we found that GB subtypes have distinctive imaging phenotypes. These results reveal that when imaging markers related to infiltration, cell density, microvascularity, and blood-brain barrier compromise are integrated via advanced pattern analysis methods, they form very accurate predictive biomarkers. These predictive markers used solely preoperative images, hence they can significantly augment diagnosis and treatment of GB patients.", "year": 2016, "referenceCount": 43, "citationCount": 237, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "5658385", "name": "L. Macyszyn"}, {"authorId": "1836349", "name": "H. Akbari"}, {"authorId": "4043191", "name": "J. Pisapia"}, {"authorId": "145323531", "name": "X. Da"}, {"authorId": "6683318", "name": "M. Attiah"}, {"authorId": "1919457", "name": "Vadim Pigrish"}, {"authorId": "2706424", "name": "Y. Bi"}, {"authorId": "2908972", "name": "Sharmistha Pal"}, {"authorId": "3285990", "name": "R. Davuluri"}, {"authorId": "4190389", "name": "Laura Roccograndi"}, {"authorId": "4900874", "name": "N. Dahmane"}, {"authorId": "1397753907", "name": "M. Martinez-Lage"}, {"authorId": "2395747", "name": "G. Biros"}, {"authorId": "48750802", "name": "R. Wolf"}, {"authorId": "1981194", "name": "M. Bilello"}, {"authorId": "1390125065", "name": "D. O’Rourke"}, {"authorId": "1740714", "name": "C. Davatzikos"}]}, {"paperId": "b3acf1e4f2e2e5e34f8828fc57e48cb3cb625e4e", "url": "https://www.semanticscholar.org/paper/b3acf1e4f2e2e5e34f8828fc57e48cb3cb625e4e", "title": "Human Activity Recognition Process Using 3-D Posture Data", "abstract": "In this paper, we present a method for recognizing human activities using information sensed by an RGB-D camera, namely the Microsoft Kinect. Our approach is based on the estimation of some relevant joints of the human body by means of the Kinect; three different machine learning techniques, i.e., K-means clustering, support vector machines, and hidden Markov models, are combined to detect the postures involved while performing an activity, to classify them, and to model each activity as a spatiotemporal evolution of known postures. Experiments were performed on Kinect Activity Recognition Dataset, a new dataset, and on CAD-60, a public dataset. Experimental results show that our solution outperforms four relevant works based on RGB-D image fusion, hierarchical Maximum Entropy Markov Model, Markov Random Fields, and Eigenjoints, respectively. The performance we achieved, i.e., precision/recall of 77.3% and 76.7%, and the ability to recognize the activities in real time show promise for applied use.", "year": 2015, "referenceCount": 42, "citationCount": 260, "influentialCitationCount": 36, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50311449", "name": "S. Gaglio"}, {"authorId": "40131930", "name": "G. Re"}, {"authorId": "1735372", "name": "M. Morana"}]}, {"paperId": "09d479e266b76da83deb5e044034d9880fc5c211", "url": "https://www.semanticscholar.org/paper/09d479e266b76da83deb5e044034d9880fc5c211", "title": "A stable multi-scale kernel for topological machine learning", "abstract": "Topological data analysis offers a rich source of valuable information to study vision problems. Yet, so far we lack a theoretically sound connection to popular kernel-based learning techniques, such as kernel SVMs or kernel PCA. In this work, we establish such a connection by designing a multi-scale kernel for persistence diagrams, a stable summary representation of topological features in data. We show that this kernel is positive definite and prove its stability with respect to the 1-Wasserstein distance. Experiments on two benchmark datasets for 3D shape classification/retrieval and texture recognition show considerable performance gains of the proposed method compared to an alternative approach that is based on the recently introduced persistence landscapes.", "year": 2014, "referenceCount": 37, "citationCount": 280, "influentialCitationCount": 29, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2663536", "name": "Jan Reininghaus"}, {"authorId": "47326739", "name": "S. Huber"}, {"authorId": "37119171", "name": "U. Bauer"}, {"authorId": "2132917", "name": "R. Kwitt"}]}, {"paperId": "16691c78b5948b5dd6b4efe42870f47460662c02", "url": "https://www.semanticscholar.org/paper/16691c78b5948b5dd6b4efe42870f47460662c02", "title": "Ten Challenges in Advancing Machine Learning Technologies toward 6G", "abstract": "As the 5G standard is being completed, academia and industry have begun to consider a more developed cellular communication technique, 6G, which is expected to achieve high data rates up to 1 Tb/s and broad frequency bands of 100 GHz to 3 THz. Besides the significant upgrade of the key communication metrics, Artificial Intelligence (AI) has been envisioned by many researchers as the most important feature of 6G, since the state-of-the-art machine learning technique has been adopted as the top solution in many extremely complex scenarios. Network intelligentization will be the new trend to address the challenges of exponentially increasing number of connected heterogeneous devices. However, compared with the application of machine learning in other fields, such as computer games, current research on intelligent networking still has a long way to go to realize the automatically- configured cellular communication systems. Various problems in terms of communication system, machine learning architectures, and computation efficiency should be addressed for the full use of this technique in 6G. In this paper, we analyze machine learning techniques and introduce 10 most critical challenges in advancing the intelligent 6G system.", "year": 2020, "referenceCount": 13, "citationCount": 143, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145842185", "name": "N. Kato"}, {"authorId": "152877793", "name": "Bomin Mao"}, {"authorId": "19282835", "name": "Fengxiao Tang"}, {"authorId": "3246156", "name": "Y. Kawamoto"}, {"authorId": "48211895", "name": "Jiajia Liu"}]}, {"paperId": "18b626df44f1dfc6513fcbe743fe555f6109aeba", "url": "https://www.semanticscholar.org/paper/18b626df44f1dfc6513fcbe743fe555f6109aeba", "title": "A New Approach to the Study of Translationese: Machine-learning the Difference between Original and Translated Text", "abstract": "In this article we describe an approach to the identification of 'translationese' based on monolingual comparable corpora and machine learning techniques for text categorization. The article reports on experiments in which support vector machines (SVMs) are employed to recognize translated text in a corpus of Italian articles from the geopolitical domain. An ensemble of SVMs reaches 86.7% accuracy with 89.3% precision and 83.3% recall on this task. A preliminary analysis of the features used by the SVMs suggests that the distribution of function words and morphosyntactic categories in general, and personal pronouns and adverbs in particular, are among the cues used by the SVMs to perform the discrimination task. A follow-up experiment shows that the performance attained by SVMs is well above the average performance of ten human subjects, including five professional translators, on the same task. Our results offer solid evidence supporting the translationese hypothesis, and our method seems to have promising applications in translation studies and in quantitative style analysis in general. Implications for the machine learning/text categorization community are equally important, both because this is a novel application and especially because we provide explicit evidence that a relatively knowledge-poor machine learning algorithm can outperform human beings in a text classification task.", "year": 2005, "referenceCount": 42, "citationCount": 188, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145283199", "name": "Marco Baroni"}, {"authorId": "46715576", "name": "Silvia Bernardini"}]}, {"paperId": "8d6e18785d75c9a40c3284cfb5726359c0ab0801", "url": "https://www.semanticscholar.org/paper/8d6e18785d75c9a40c3284cfb5726359c0ab0801", "title": "Machine Learning and Its Applications", "abstract": null, "year": 2001, "referenceCount": 112, "citationCount": 108, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "4738873", "name": "G. Paliouras"}, {"authorId": "1745631", "name": "V. Karkaletsis"}, {"authorId": "2124138", "name": "C. Spyropoulos"}]}, {"paperId": "e7924a71ff89f37f66298a6b42bcd26fa7c0f33b", "url": "https://www.semanticscholar.org/paper/e7924a71ff89f37f66298a6b42bcd26fa7c0f33b", "title": "River: machine learning for streaming data in Python", "abstract": "River is a machine learning library for dynamic data streams and continual learning. It provides multiple state-of-the-art learning methods, data generators/transformers, performance metrics and evaluators for different stream learning problems. It is the result from the merger of the two most popular packages for stream learning in Python: Creme and scikit-multiflow. River introduces a revamped architecture based on the lessons learnt from the seminal packages. River's ambition is to be the go-to library for doing machine learning on streaming data. Additionally, this open source package brings under the same umbrella a large community of practitioners and researchers. The source code is available at https://github.com/online-ml/river.", "year": 2020, "referenceCount": 49, "citationCount": 45, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35479220", "name": "Jacob Montiel"}, {"authorId": "104920778", "name": "Max Halford"}, {"authorId": "31757587", "name": "S. M. Mastelini"}, {"authorId": "2034015026", "name": "Geoffrey Bolmier"}, {"authorId": "2034015684", "name": "Raphael Sourty"}, {"authorId": "2034016270", "name": "Robin Vaysse"}, {"authorId": "103370422", "name": "Adil Zouitine"}, {"authorId": "13645563", "name": "Heitor Murilo Gomes"}, {"authorId": "1383995365", "name": "Jesse Read"}, {"authorId": "2831624", "name": "T. Abdessalem"}, {"authorId": "1762931", "name": "A. Bifet"}]}, {"paperId": "74665b24e316cc379f3179e09443f4d23e07a6bc", "url": "https://www.semanticscholar.org/paper/74665b24e316cc379f3179e09443f4d23e07a6bc", "title": "On-line learning in soft committee machines.", "abstract": null, "year": 1995, "referenceCount": 0, "citationCount": 181, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Medicine"], "authors": [{"authorId": "97541485", "name": "Saad"}, {"authorId": "30006126", "name": "Solla"}]}, {"paperId": "05351b3abcca9e535c534c3b4bff0865ba96b3ac", "url": "https://www.semanticscholar.org/paper/05351b3abcca9e535c534c3b4bff0865ba96b3ac", "title": "Confidence-based active learning", "abstract": "This paper proposes a new active learning approach, confidence-based active learning, for training a wide range of classifiers. This approach is based on identifying and annotating uncertain samples. The uncertainty value of each sample is measured by its conditional error. The approach takes advantage of current classifiers' probability preserving and ordering properties. It calibrates the output scores of classifiers to conditional error. Thus, it can estimate the uncertainty value for each input sample according to its output score from a classifier and select only samples with uncertainty value above a user-defined threshold. Even though we cannot guarantee the optimality of the proposed approach, we find it to provide good performance. Compared with existing methods, this approach is robust without additional computational effort. A new active learning method for support vector machines (SVMs) is implemented following this approach. A dynamic bin width allocation method is proposed to accurately estimate sample conditional error and this method adapts to the underlying probabilities. The effectiveness of the proposed approach is demonstrated using synthetic and real data sets and its performance is compared with the widely used least certain active learning method", "year": 2006, "referenceCount": 44, "citationCount": 223, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "49140921", "name": "Mingkun Li"}, {"authorId": "1702517", "name": "I. Sethi"}]}, {"paperId": "b8d9abd1c078573188b13d36c1b1efb7cb2fa865", "url": "https://www.semanticscholar.org/paper/b8d9abd1c078573188b13d36c1b1efb7cb2fa865", "title": "Practical optimization", "abstract": null, "year": 1981, "referenceCount": 20, "citationCount": 7736, "influentialCitationCount": 238, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1744288", "name": "P. Gill"}, {"authorId": "143873253", "name": "W. Murray"}, {"authorId": "1685738", "name": "M. H. Wright"}]}, {"paperId": "232ac2df264fd9d3a1c84e135ade3ba82386bc71", "url": "https://www.semanticscholar.org/paper/232ac2df264fd9d3a1c84e135ade3ba82386bc71", "title": "Experiment databases", "abstract": null, "year": 2012, "referenceCount": 76, "citationCount": 96, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1717534", "name": "J. Vanschoren"}, {"authorId": "1755851", "name": "H. Blockeel"}]}, {"paperId": "90f2339f7c17125e3a55d6f70891d3481a254d5b", "url": "https://www.semanticscholar.org/paper/90f2339f7c17125e3a55d6f70891d3481a254d5b", "title": "Machine-Learning Techniques", "abstract": null, "year": 2012, "referenceCount": 122, "citationCount": 65, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1500394230", "name": "Robert Sullivan"}]}, {"paperId": "edb189b3d0f777525837b3136e109aa0ba01a99a", "url": "https://www.semanticscholar.org/paper/edb189b3d0f777525837b3136e109aa0ba01a99a", "title": "Multicategory Classification Using An Extreme Learning Machine for Microarray Gene Expression Cancer Diagnosis", "abstract": "In this paper, the recently developed Extreme Learning Machine (ELM) is used for directing multicategory classification problems in the cancer diagnosis area. ELM avoids problems like local minima, improper learning rate and overfitting commonly faced by iterative learning methods and completes the training very fast. We have evaluated the multicategory classification performance of ELM on three benchmark microarray data sets for cancer diagnosis, namely, the GCM data set, the Lung data set, and the Lymphoma data set. The results indicate that ELM produces comparable or better classification accuracies with reduced training time and implementation complexity compared to artificial neural networks methods like conventional back-propagation ANN, Linder's SANN, and Support Vector Machine methods like SVM-OVO and Ramaswamy's SVM-OVA. ELM also achieves better accuracies for classification of individual categories.", "year": 2007, "referenceCount": 21, "citationCount": 246, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2190082425", "name": "Runxuan Zhang"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "145411276", "name": "N. Sundararajan"}, {"authorId": "1800678", "name": "P. Saratchandran"}]}, {"paperId": "4b5eb40e45110dffac9ad7be68a294ecedaec1d4", "url": "https://www.semanticscholar.org/paper/4b5eb40e45110dffac9ad7be68a294ecedaec1d4", "title": "A Roadmap for Foundational Research on Artificial Intelligence in Medical Imaging: From the 2018 NIH/RSNA/ACR/The Academy Workshop.", "abstract": "Imaging research laboratories are rapidly creating machine learning systems that achieve expert human performance using open-source methods and tools. These artificial intelligence systems are being developed to improve medical image reconstruction, noise reduction, quality assurance, triage, segmentation, computer-aided detection, computer-aided classification, and radiogenomics. In August 2018, a meeting was held in Bethesda, Maryland, at the National Institutes of Health to discuss the current state of the art and knowledge gaps and to develop a roadmap for future research initiatives. Key research priorities include: 1, new image reconstruction methods that efficiently produce images suitable for human interpretation from source data; 2, automated image labeling and annotation methods, including information extraction from the imaging report, electronic phenotyping, and prospective structured image reporting; 3, new machine learning methods for clinical imaging data, such as tailored, pretrained model architectures, and federated machine learning methods; 4, machine learning methods that can explain the advice they provide to human users (so-called explainable artificial intelligence); and 5, validated methods for image de-identification and data sharing to facilitate wide availability of clinical imaging data sets. This research roadmap is intended to identify and prioritize these needs for academic research laboratories, funding agencies, professional societies, and industry.", "year": 2019, "referenceCount": 97, "citationCount": 190, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2356307", "name": "C. Langlotz"}, {"authorId": "40221223", "name": "Bibb Allen"}, {"authorId": "144917634", "name": "B. Erickson"}, {"authorId": "1401724111", "name": "Jayashree Kalpathy-Cramer"}, {"authorId": "49265987", "name": "K. Bigelow"}, {"authorId": "2066982812", "name": "T. Cook"}, {"authorId": "1864663", "name": "A. Flanders"}, {"authorId": "4204731", "name": "M. Lungren"}, {"authorId": "2064211562", "name": "D. Mendelson"}, {"authorId": "2670463", "name": "J. Rudie"}, {"authorId": "2108296864", "name": "Ge Wang"}, {"authorId": "10234379", "name": "K. Kandarpa"}]}]}