{"total": 5120627, "offset": 2500, "next": 2600, "data": [{"paperId": "043b307af412fc7f9005822e6dabbe4f9d983472", "url": "https://www.semanticscholar.org/paper/043b307af412fc7f9005822e6dabbe4f9d983472", "title": "Mapping parallelism to multi-cores: a machine learning based approach", "abstract": "The efficient mapping of program parallelism to multi-core processors is highly dependent on the underlying architecture. This paper proposes a portable and automatic compiler-based approach to mapping such parallelism using machine learning. It develops two predictors: a data sensitive and a data insensitive predictor to select the best mapping for parallel programs. They predict the number of threads and the scheduling policy for any given program using a model learnt off-line. By using low-cost profiling runs, they predict the mapping for a new unseen program across multiple input data sets. We evaluate our approach by selecting parallelism mapping configurations for OpenMP programs on two representative but different multi-core platforms (the Intel Xeon and the Cell processors). Performance of our technique is stable across programs and architectures. On average, it delivers above 96% performance of the maximum available on both platforms. It achieve, on average, a 37% (up to 17.5 times) performance improvement over the OpenMP runtime default scheme on the Cell platform. Compared to two recent prediction models, our predictors achieve better performance with a significant lower profiling cost.", "year": 2009, "referenceCount": 29, "citationCount": 213, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40072305", "name": "Zheng Wang"}, {"authorId": "1401533251", "name": "M. O’Boyle"}]}, {"paperId": "3e50d6456492d20ad836658220202cbe1c9d7c9f", "url": "https://www.semanticscholar.org/paper/3e50d6456492d20ad836658220202cbe1c9d7c9f", "title": "Machine learning approaches for the prediction of signal peptides and other protein sorting signals.", "abstract": "Prediction of protein sorting signals from the sequence of amino acids has great importance in the field of proteomics today. Recently, the growth of protein databases, combined with machine learning approaches, such as neural networks and hidden Markov models, have made it possible to achieve a level of reliability where practical use in, for example automatic database annotation is feasible. In this review, we concentrate on the present status and future perspectives of SignalP, our neural network-based method for prediction of the most well-known sorting signal: the secretory signal peptide. We discuss the problems associated with the use of SignalP on genomic sequences, showing that signal peptide prediction will improve further if integrated with predictions of start codons and transmembrane helices. As a step towards this goal, a hidden Markov model version of SignalP has been developed, making it possible to discriminate between cleaved signal peptides and uncleaved signal anchors. Furthermore, we show how SignalP can be used to characterize putative signal peptides from an archaeon, Methanococcus jannaschii. Finally, we briefly review a few methods for predicting other protein sorting signals and discuss the future of protein sorting prediction in general.", "year": 1999, "referenceCount": 62, "citationCount": 625, "influentialCitationCount": 42, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "145416108", "name": "H. Nielsen"}, {"authorId": "8169197", "name": "S. Brunak"}, {"authorId": "3300090", "name": "G. von Heijne"}]}, {"paperId": "ac3f8372b9d893dbdb7e4b9cd3df5ed825ffb548", "url": "https://www.semanticscholar.org/paper/ac3f8372b9d893dbdb7e4b9cd3df5ed825ffb548", "title": "Twitter Sentiment Analysis: Lexicon Method, Machine Learning Method and Their Combination", "abstract": "This paper covers the two approaches for sentiment analysis: i) lexicon based method; ii) machine learning method. We describe several techniques to implement these approaches and discuss how they can be adopted for sentiment classification of Twitter messages. We present a comparative study of different lexicon combinations and show that enhancing sentiment lexicons with emoticons, abbreviations and social-media slang expressions increases the accuracy of lexicon-based classification for Twitter. We discuss the importance of feature generation and feature selection processes for machine learning sentiment classification. To quantify the performance of the main sentiment analysis methods over Twitter we run these algorithms on a benchmark Twitter dataset from the SemEval-2013 competition, task 2-B. The results show that machine learning method based on SVM and Naive Bayes classifiers outperforms the lexicon method. We present a new ensemble method that uses a lexicon based sentiment score as input feature for the machine learning approach. The combined method proved to produce more precise classifications. We also show that employing a cost-sensitive classifier for highly unbalanced datasets yields an improvement of sentiment classification performance up to 7%.", "year": 2015, "referenceCount": 84, "citationCount": 131, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1891372", "name": "Olga Kolchyna"}, {"authorId": "2314341", "name": "T. T. P. Souza"}, {"authorId": "1761192", "name": "P. Treleaven"}, {"authorId": "8903071", "name": "T. Aste"}]}, {"paperId": "4f2934870251ba75e80f3b395e56d834d5aadfd4", "url": "https://www.semanticscholar.org/paper/4f2934870251ba75e80f3b395e56d834d5aadfd4", "title": "Learning Intrusion Detection: Supervised or Unsupervised?", "abstract": null, "year": 2005, "referenceCount": 32, "citationCount": 261, "influentialCitationCount": 23, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1754215", "name": "P. Laskov"}, {"authorId": "1869984", "name": "Patrick Düssel"}, {"authorId": "1754319", "name": "C. Schäfer"}, {"authorId": "144825749", "name": "K. Rieck"}]}, {"paperId": "8a9f26a4cee210e51c96f4016737605e31d490ee", "url": "https://www.semanticscholar.org/paper/8a9f26a4cee210e51c96f4016737605e31d490ee", "title": "A data ecosystem to support machine learning in materials science", "abstract": "Facilitating the application of machine learning to materials science problems will require enhancing the data ecosystem to enable discovery and collection of data from many sources, automated dissemination of new data across the ecosystem, and the connecting of data with materials-specific machine learning models. Here, we present two projects, the Materials Data Facility (MDF) and the Data and Learning Hub for Science (DLHub), that address these needs. We use examples to show how MDF and DLHub capabilities can be leveraged to link data with machine learning models and how users can access those capabilities through web and programmatic interfaces.", "year": 2019, "referenceCount": 39, "citationCount": 80, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science", "Physics"], "authors": [{"authorId": "2338072", "name": "B. Blaiszik"}, {"authorId": "47766095", "name": "Logan T. Ward"}, {"authorId": "47549959", "name": "Marcus Schwarting"}, {"authorId": "104220223", "name": "Jonathon Gaff"}, {"authorId": "36319017", "name": "Ryan Chard"}, {"authorId": "72559552", "name": "D. Pike"}, {"authorId": "3091414", "name": "K. Chard"}, {"authorId": "1698701", "name": "Ian T Foster"}]}, {"paperId": "bcc81d8ab4ba6989d3be943540bd3885990c313f", "url": "https://www.semanticscholar.org/paper/bcc81d8ab4ba6989d3be943540bd3885990c313f", "title": "Toward Intelligent Vehicular Networks: A Machine Learning Framework", "abstract": "As wireless networks evolve toward high mobility and providing better support for connected vehicles, a number of new challenges arise due to the resulting high dynamics in vehicular environments and thus motive rethinking of traditional wireless design methodologies. Future intelligent vehicles, which are at the heart of high mobility networks, are increasingly equipped with multiple advanced onboard sensors and keep generating large volumes of data. Machine learning, as an effective approach to artificial intelligence, can provide a rich set of tools to exploit such data for the benefit of the networks. In this paper, we first identify the distinctive characteristics of high mobility vehicular networks and motivate the use of machine learning to address the resulting challenges. After a brief introduction of the major concepts of machine learning, we discuss its applications to learn the dynamics of vehicular networks and make informed decisions to optimize network performance. In particular, we discuss in greater detail the application of reinforcement learning in managing network resources as an alternative to the prevalent optimization approach. Finally, some open issues worth further investigation are highlighted.", "year": 2018, "referenceCount": 92, "citationCount": 143, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144362942", "name": "L. Liang"}, {"authorId": "2089063597", "name": "Hao Ye"}, {"authorId": "1410112765", "name": "Geoffrey Y. Li"}]}, {"paperId": "bd20055d314fa7ffbee9d702dfd5e4fd99257c62", "url": "https://www.semanticscholar.org/paper/bd20055d314fa7ffbee9d702dfd5e4fd99257c62", "title": "Measuring Corporate Culture Using Machine Learning", "abstract": "\n We create a culture dictionary using one of the latest machine learning techniques—the word embedding model—and 209,480 earnings call transcripts. We score the five corporate cultural values of innovation, integrity, quality, respect, and teamwork for 62,664 firm-year observations over the period 2001–2018. We show that an innovative culture is broader than the usual measures of corporate innovation – R&D expenses and the number of patents. Moreover, we show that corporate culture correlates with business outcomes, including operational efficiency, risk-taking, earnings management, executive compensation design, firm value, and deal making, and that the culture-performance link is more pronounced in bad times. Finally, we present suggestive evidence that corporate culture is shaped by major corporate events, such as mergers and acquisitions.", "year": 2020, "referenceCount": 71, "citationCount": 110, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Business"], "authors": [{"authorId": "101769938", "name": "Kai Li"}, {"authorId": "39544108", "name": "Feng Mai"}, {"authorId": "145109025", "name": "R. Shen"}, {"authorId": "1390935916", "name": "Xinyan Yan"}]}, {"paperId": "d30b000d528af946bf93bd45c69324668fa6b17b", "url": "https://www.semanticscholar.org/paper/d30b000d528af946bf93bd45c69324668fa6b17b", "title": "Wheat yield prediction using machine learning and advanced sensing techniques", "abstract": null, "year": 2016, "referenceCount": 33, "citationCount": 281, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2793738", "name": "X. Pantazi"}, {"authorId": "3201660", "name": "D. Moshou"}, {"authorId": "2295693", "name": "T. Alexandridis"}, {"authorId": "2726526", "name": "Rebecca L. Whetton"}, {"authorId": "2798803", "name": "A. Mouazen"}]}, {"paperId": "b646ba235ba49ed545c7903dd033b50e3fa99f34", "url": "https://www.semanticscholar.org/paper/b646ba235ba49ed545c7903dd033b50e3fa99f34", "title": "Machine learning for identifying Randomized Controlled Trials: An evaluation and practitioner's guide", "abstract": "Machine learning (ML) algorithms have proven highly accurate for identifying Randomized Controlled Trials (RCTs) but are not used much in practice, in part because the best way to make use of the technology in a typical workflow is unclear. In this work, we evaluate ML models for RCT classification (support vector machines, convolutional neural networks, and ensemble approaches). We trained and optimized support vector machine and convolutional neural network models on the titles and abstracts of the Cochrane Crowd RCT set. We evaluated the models on an external dataset (Clinical Hedges), allowing direct comparison with traditional database search filters. We estimated area under receiver operating characteristics (AUROC) using the Clinical Hedges dataset.", "year": 2018, "referenceCount": 42, "citationCount": 195, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1808775", "name": "I. Marshall"}, {"authorId": "1401080041", "name": "A. Noel-Storr"}, {"authorId": "37912398", "name": "J. Kuiper"}, {"authorId": "2110226596", "name": "James Thomas"}, {"authorId": "1912476", "name": "Byron C. Wallace"}]}, {"paperId": "7f7925d27da15a877d2991a83085f7ff0bc4badd", "url": "https://www.semanticscholar.org/paper/7f7925d27da15a877d2991a83085f7ff0bc4badd", "title": "Neural and adaptive systems : fundamentals through simulations", "abstract": "Data Fitting with Linear Models. Pattern Recognition. Multilayer Perceptrons. Designing and Training MLPs. Function Approximation with MLPs, Radial Basis Functions, and Support Vector Machines. Hebbian Learning and Principal Component Analysis. Competitive and Kohonen Networks. Principles of Digital Signal Processing. Adaptive Filters. Temporal Processing with Neural Networks. Training and Using Recurrent Networks. Appendices. Glossary. Index.", "year": 2000, "referenceCount": 6, "citationCount": 474, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143961030", "name": "J. Príncipe"}, {"authorId": "2290387", "name": "N. Euliano"}, {"authorId": "145973983", "name": "W. C. Lefebvre"}]}, {"paperId": "5a43cc163f4e570b28617ad8a40872ad9189349c", "url": "https://www.semanticscholar.org/paper/5a43cc163f4e570b28617ad8a40872ad9189349c", "title": "Robust Truncated Hinge Loss Support Vector Machines", "abstract": "The support vector machine (SVM) has been widely applied for classification problems in both machine learning and statistics. Despite its popularity, however, SVM has some drawbacks in certain situations. In particular, the SVM classifier can be very sensitive to outliers in the training sample. Moreover, the number of support vectors (SVs) can be very large in many applications. To circumvent these drawbacks, we propose the robust truncated hinge loss SVM (RSVM), which uses a truncated hinge loss. The RSVM is shown to be more robust to outliers and to deliver more accurate classifiers using a smaller set of SVs than the standard SVM. Our theoretical results show that the RSVM is Fisher-consistent, even when there is no dominating class, a scenario that is particularly challenging for multicategory classification. Similar results are obtained for a class of margin-based classifiers.", "year": 2007, "referenceCount": 33, "citationCount": 336, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "47095791", "name": "Yichao Wu"}, {"authorId": "46399637", "name": "Yufeng Liu"}]}, {"paperId": "4f0a8cad6d6a8d0397ad1bd35acce6458aa7164c", "url": "https://www.semanticscholar.org/paper/4f0a8cad6d6a8d0397ad1bd35acce6458aa7164c", "title": "Contrastive Representation Learning: A Framework and Review", "abstract": "Contrastive Learning has recently received interest due to its success in self-supervised representation learning in the computer vision domain. However, the origins of Contrastive Learning date as far back as the 1990s and its development has spanned across many fields and domains including Metric Learning and natural language processing. In this paper, we provide a comprehensive literature review and we propose a general Contrastive Representation Learning framework that simplifies and unifies many different contrastive learning methods. We also provide a taxonomy for each of the components of contrastive learning in order to summarise it and distinguish it from other forms of machine learning. We then discuss the inductive biases which are present in any contrastive learning system and we analyse our framework under different views from various sub-fields of Machine Learning. Examples of how contrastive learning has been applied in computer vision, natural language processing, audio processing, and others, as well as in Reinforcement Learning are also presented. Finally, we discuss the challenges and some of the most promising future research directions ahead.", "year": 2020, "referenceCount": 122, "citationCount": 188, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1994194269", "name": "Phúc H. Lê Khắc"}, {"authorId": "30978009", "name": "G. Healy"}, {"authorId": "1680223", "name": "A. Smeaton"}]}, {"paperId": "17ebe1eb19655543a6b876f91d41917488e70f55", "url": "https://www.semanticscholar.org/paper/17ebe1eb19655543a6b876f91d41917488e70f55", "title": "Random synaptic feedback weights support error backpropagation for deep learning", "abstract": null, "year": 2016, "referenceCount": 88, "citationCount": 545, "influentialCitationCount": 67, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2542999", "name": "T. Lillicrap"}, {"authorId": "2881754", "name": "D. Cownden"}, {"authorId": "144254941", "name": "D. Tweed"}, {"authorId": "2126637", "name": "C. Akerman"}]}, {"paperId": "e70b9a38fcf8373865dd6e7b45e45cca7ff2eaa9", "url": "https://www.semanticscholar.org/paper/e70b9a38fcf8373865dd6e7b45e45cca7ff2eaa9", "title": "Semi-supervised Knowledge Transfer for Deep Learning from Private Training Data", "abstract": "Some machine learning applications involve training data that is sensitive, such as the medical histories of patients in a clinical trial. A model may inadvertently and implicitly store some of its training data; careful analysis of the model may therefore reveal sensitive information. \nTo address this problem, we demonstrate a generally applicable approach to providing strong privacy guarantees for training data: Private Aggregation of Teacher Ensembles (PATE). The approach combines, in a black-box fashion, multiple models trained with disjoint datasets, such as records from different subsets of users. Because they rely directly on sensitive data, these models are not published, but instead used as \"teachers\" for a \"student\" model. The student learns to predict an output chosen by noisy voting among all of the teachers, and cannot directly access an individual teacher or the underlying data or parameters. The student's privacy properties can be understood both intuitively (since no single teacher and thus no single dataset dictates the student's training) and formally, in terms of differential privacy. These properties hold even if an adversary can not only query the student but also inspect its internal workings. \nCompared with previous work, the approach imposes only weak assumptions on how teachers are trained: it applies to any model, including non-convex models like DNNs. We achieve state-of-the-art privacy/utility trade-offs on MNIST and SVHN thanks to an improved privacy analysis and semi-supervised learning.", "year": 2016, "referenceCount": 42, "citationCount": 685, "influentialCitationCount": 118, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1967156", "name": "Nicolas Papernot"}, {"authorId": "2057642721", "name": "Martín Abadi"}, {"authorId": "1758110", "name": "Ú. Erlingsson"}, {"authorId": "153440022", "name": "Ian J. Goodfellow"}, {"authorId": "35210462", "name": "Kunal Talwar"}]}, {"paperId": "d592544922d2a8849c4ca14867797ab76d0f0953", "url": "https://www.semanticscholar.org/paper/d592544922d2a8849c4ca14867797ab76d0f0953", "title": "Support vector machine techniques for nonlinear equalization", "abstract": "The emerging machine learning technique called support vector machines is proposed as a method for performing nonlinear equalization in communication systems. The support vector machine has the advantage that a smaller number of parameters for the model can be identified in a manner that does not require the extent of prior information or heuristic assumptions that some previous techniques require. Furthermore, the optimization method of a support vector machine is quadratic programming, which is a well-studied and understood mathematical programming technique. Support vector machine simulations are carried out on nonlinear problems previously studied by other researchers using neural networks. This allows initial comparison against other techniques to determine the feasibility of using the proposed method for nonlinear detection. Results show that support vector machines perform as well as neural networks on the nonlinear problems investigated. A method is then proposed to introduce decision feedback processing to support vector machines to address the fact that intersymbol interference (ISI) data generates input vectors having temporal correlation, whereas a standard support vector machine assumes independent input vectors. Presenting the problem from the viewpoint of the pattern space illustrates the utility of a bank of support vector machines. This approach yields a nonlinear processing method that is somewhat different than the nonlinear decision feedback method whereby the linear feedback filter of the decision feedback equalizer is replaced by a Volterra filter. A simulation using a linear system shows that the proposed method performs equally to a conventional decision feedback equalizer for this problem.", "year": 2000, "referenceCount": 40, "citationCount": 300, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1736284", "name": "D. Sebald"}, {"authorId": "1686036", "name": "J. Bucklew"}]}, {"paperId": "a6675bdf12c37e0a70e1d71e0bc52b06b485d45a", "url": "https://www.semanticscholar.org/paper/a6675bdf12c37e0a70e1d71e0bc52b06b485d45a", "title": "AUC: A Better Measure than Accuracy in Comparing Learning Algorithms", "abstract": null, "year": 2003, "referenceCount": 24, "citationCount": 357, "influentialCitationCount": 28, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1688204", "name": "C. Ling"}, {"authorId": "2110151928", "name": "Jin Huang"}, {"authorId": "2108544384", "name": "Harry Zhang"}]}, {"paperId": "bef0912974f272d6951de503c2f3edfa725e899f", "url": "https://www.semanticscholar.org/paper/bef0912974f272d6951de503c2f3edfa725e899f", "title": "SURVEY ON EVOLVING DEEP LEARNING NEURAL NETWORK ARCHITECTURES", "abstract": "The deep learning being a subcategory of the machine learning follows the human instincts of learning by example to produce accurate results. The deep learning performs training to the computer frame work to directly classify the tasks from the documents available either in the form of the text, image, or the sound. Most often the deep learning utilizes the neural network to perform the accurate classification and is referred as the deep neural networks; one of the most common deep neural networks used in a broader range of applications is the convolution neural network that provides an automated way of feature extraction by learning the features directly from the images or the text unlike the machine learning that extracts the features manually. This enables the deep learning neural networks to have a state of art accuracy that mostly expels even the human performance. So the paper is to present the survey on the deep learning neural network architectures utilized in various applications for having an accurate classification with an automated feature extraction.", "year": 2019, "referenceCount": 31, "citationCount": 212, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1423434950", "name": "A. Bashar"}]}, {"paperId": "3883850e09fec66f389697f90d84d468ed8aa062", "url": "https://www.semanticscholar.org/paper/3883850e09fec66f389697f90d84d468ed8aa062", "title": "A Case Study of Incremental Concept Induction", "abstract": "Application of machine induction techniques in complex domains promises to push the computational limits of non-incremental, search intensive induction methods. Learning effectiveness in complex domains requires the development of incremental, cost effective methods. However, discussion of dimensions for comparing the utility of differing incremental methods has been lacking. In this paper we introduce 3 dimensions for characterizing incremental concept induction systems which relate to the cost and quality of learning. The dimensions are used to compare the respective merits of 4 incremental variants of Quinlan's learning from examples program, ID3. This comparison indicates that cost effective induction can be obtained, without significantly detracting from the quality of induced knowledge.", "year": 1986, "referenceCount": 5, "citationCount": 364, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2620923", "name": "J. C. Schlimmer"}, {"authorId": "8993101", "name": "D. Fisher"}]}, {"paperId": "d5344942fbba45b7f1a17a5e16b11d4f53a954ee", "url": "https://www.semanticscholar.org/paper/d5344942fbba45b7f1a17a5e16b11d4f53a954ee", "title": "A Note on the Utility of Incremental Learning", "abstract": "Historically, inductive machine learning has focused on nondincremental learning tasks, i.e., where the training set can be constructed a priori and learning stops once this set has been duly processed. There are, however, a number of areas, such as agents, where learning tasks are incremental. This paper defines the notion of incrementality for learning tasks and algorithms. It then provides some motivation for incremental learning and argues in favour of the design of incremental learning algorithms for solving incremental learning tasks. A number of issues raised by such systems are outlined and the incremental learner ILA is used for illustration.", "year": 2000, "referenceCount": 31, "citationCount": 198, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1398517004", "name": "C. Giraud-Carrier"}]}, {"paperId": "5e6b0cc6b13ed794cc21eed16c896c7c57eb754c", "url": "https://www.semanticscholar.org/paper/5e6b0cc6b13ed794cc21eed16c896c7c57eb754c", "title": "Multi-armed Bandit Algorithms and Empirical Evaluation", "abstract": null, "year": 2005, "referenceCount": 25, "citationCount": 503, "influentialCitationCount": 43, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2827709", "name": "Joannès Vermorel"}, {"authorId": "81080659", "name": "M. Mohri"}]}, {"paperId": "02550ca5b686ba5a95b2782ae1904c98cf402c03", "url": "https://www.semanticscholar.org/paper/02550ca5b686ba5a95b2782ae1904c98cf402c03", "title": "Prototype-based models in machine learning.", "abstract": "An overview is given of prototype-based models in machine learning. In this framework, observations, i.e., data, are stored in terms of typical representatives. Together with a suitable measure of similarity, the systems can be employed in the context of unsupervised and supervised analysis of potentially high-dimensional, complex datasets. We discuss basic schemes of competitive vector quantization as well as the so-called neural gas approach and Kohonen's topology-preserving self-organizing map. Supervised learning in prototype systems is exemplified in terms of learning vector quantization. Most frequently, the familiar Euclidean distance serves as a dissimilarity measure. We present extensions of the framework to nonstandard measures and give an introduction to the use of adaptive distances in relevance learning.", "year": 2016, "referenceCount": 92, "citationCount": 98, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144951109", "name": "Michael Biehl"}, {"authorId": "143684647", "name": "B. Hammer"}, {"authorId": "9320960", "name": "T. Villmann"}]}, {"paperId": "090a3e91629759fb66dd7206c4c3ed4c1fce45c9", "url": "https://www.semanticscholar.org/paper/090a3e91629759fb66dd7206c4c3ed4c1fce45c9", "title": "Experimental realization of a quantum support vector machine.", "abstract": "The fundamental principle of artificial intelligence is the ability of machines to learn from previous experience and do future work accordingly. In the age of big data, classical learning machines often require huge computational resources in many practical cases. Quantum machine learning algorithms, on the other hand, could be exponentially faster than their classical counterparts by utilizing quantum parallelism. Here, we demonstrate a quantum machine learning algorithm to implement handwriting recognition on a four-qubit NMR test bench. The quantum machine learns standard character fonts and then recognizes handwritten characters from a set with two candidates. Because of the wide spread importance of artificial intelligence and its tremendous consumption of computational resources, quantum speedup would be extremely attractive against the challenges of big data.", "year": 2015, "referenceCount": 0, "citationCount": 110, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "5312421", "name": "Zhaokai Li"}, {"authorId": "48032382", "name": "Xiaomei Liu"}, {"authorId": "145203231", "name": "Nanyang Xu"}, {"authorId": "145084594", "name": "Jiangfeng Du"}]}, {"paperId": "29f5ecc324e934d21fe8ddde814fca36cfe8eaea", "url": "https://www.semanticscholar.org/paper/29f5ecc324e934d21fe8ddde814fca36cfe8eaea", "title": "Using Three Machine Learning Techniques for Predicting Breast Cancer Recurrence", "abstract": "Objective: The number and size of medical databases are increasing rapidly but most of these data are not analyzed \nfor finding the valuable and hidden knowledge. Advanced data mining techniques can be used to discover hidden \npatterns and relationships. Models developed from these techniques are useful for medical practitioners to make right \ndecisions. The present research studied the application of data mining techniques to develop predictive models for \nbreast cancer recurrence in patients who were followed-up for two years. \nMethod: The patients were registered in the Iranian Center for Breast Cancer (ICBC) program from 1997 to 2008. \nThe dataset contained 1189 records, 22 predictor variables, and one outcome variable. We implemented machine \nlearning techniques, i.e., Decision Tree (C4.5), Support Vector Machine (SVM), and Artificial Neural Network (ANN) to \ndevelop the predictive models. The main goal of this paper is to compare the performance of these three well-known \nalgorithms on our data through sensitivity, specificity, and accuracy. \nResults and Conclusion: Our analysis shows that accuracy of DT, ANN and SVM are 0.936, 0.947 and 0.957 \nrespectively. The SVM classification model predicts breast cancer recurrence with least error rate and highest accuracy. \nThe predicted accuracy of the DT model is the lowest of all. The results are achieved using 10-fold cross-validation for \nmeasuring the unbiased prediction accuracy of each model.", "year": 2013, "referenceCount": 23, "citationCount": 198, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "71885275", "name": "Ahmad Lg"}, {"authorId": "2992866", "name": "A. T. Eshlaghy"}, {"authorId": "2096356", "name": "A. Poorebrahimi"}, {"authorId": "1380749467", "name": "M. Ebrahimi"}, {"authorId": "72860490", "name": "Razavi Ar"}]}, {"paperId": "5f28fc86937cffcadd349dc97b4c97c028cbe566", "url": "https://www.semanticscholar.org/paper/5f28fc86937cffcadd349dc97b4c97c028cbe566", "title": "A Machine Learning Approach to POS Tagging", "abstract": null, "year": 2000, "referenceCount": 86, "citationCount": 43, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3049328", "name": "Lluís Màrquez i Villodre"}, {"authorId": "1778523", "name": "Lluís Padró"}, {"authorId": "144444054", "name": "H. Rodríguez"}]}, {"paperId": "0b6624f39c549f99422b49e1e7a004492ed3d11c", "url": "https://www.semanticscholar.org/paper/0b6624f39c549f99422b49e1e7a004492ed3d11c", "title": "bartMachine: Machine Learning with Bayesian Additive Regression Trees", "abstract": "We present a new package in R implementing Bayesian additive regression trees (BART). The package introduces many new features for data analysis using BART such as variable selection, interaction detection, model diagnostic plots, incorporation of missing data and the ability to save trees for future prediction. It is significantly faster than the current R implementation, parallelized, and capable of handling both large sample sizes and high-dimensional data.", "year": 2013, "referenceCount": 30, "citationCount": 250, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "50645721", "name": "A. Kapelner"}, {"authorId": "1576051500", "name": "J. Bleich"}]}, {"paperId": "cd444f03cefc14ae5a322c4df9f7c4e361bbb927", "url": "https://www.semanticscholar.org/paper/cd444f03cefc14ae5a322c4df9f7c4e361bbb927", "title": "Atom-density representations for machine learning.", "abstract": "The applications of machine learning techniques to chemistry and materials science become more numerous by the day. The main challenge is to devise representations of atomic systems that are at the same time complete and concise, so as to reduce the number of reference calculations that are needed to predict the properties of different types of materials reliably. This has led to a proliferation of alternative ways to convert an atomic structure into an input for a machine-learning model. We introduce an abstract definition of chemical environments that is based on a smoothed atomic density, using a bra-ket notation to emphasize basis set independence and to highlight the connections with some popular choices of representations for describing atomic systems. The correlations between the spatial distribution of atoms and their chemical identities are computed as inner products between these feature kets, which can be given an explicit representation in terms of the expansion of the atom density on orthogonal basis functions, that is equivalent to the smooth overlap of atomic positions power spectrum, but also in real space, corresponding to n-body correlations of the atom density. This formalism lays the foundations for a more systematic tuning of the behavior of the representations, by introducing operators that represent the correlations between structure, composition, and the target properties. It provides a unifying picture of recent developments in the field and indicates a way forward toward more effective and computationally affordable machine-learning schemes for molecules and materials.", "year": 2018, "referenceCount": 77, "citationCount": 105, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science", "Physics", "Medicine"], "authors": [{"authorId": "11042469", "name": "Michael J. Willatt"}, {"authorId": "34778608", "name": "F. Musil"}, {"authorId": "1917770", "name": "M. Ceriotti"}]}, {"paperId": "5d34a2ea7c847beafc5beac21a8a243017607abc", "url": "https://www.semanticscholar.org/paper/5d34a2ea7c847beafc5beac21a8a243017607abc", "title": "A New Framework for Machine Learning", "abstract": null, "year": 2008, "referenceCount": 26, "citationCount": 106, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1792884", "name": "Charles M. Bishop"}]}, {"paperId": "551a2463db60c3b65074b016de83c0fbd996504d", "url": "https://www.semanticscholar.org/paper/551a2463db60c3b65074b016de83c0fbd996504d", "title": "Learning classifiers for misuse and anomaly detection using a bag of system calls representation", "abstract": "In this paper, we propose a \"bag of system calls\" representation for intrusion detection in system call sequences and describe misuse and anomaly detection results with standard machine learning techniques on University of New Mexico (UNM) and MIT Lincoln Lab (MIT LL) system call sequences with the proposed representation. With the feature representation as input, we compare the performance of several machine learning techniques for misuse detection and show experimental results on anomaly detection. The results show that standard machine learning and clustering techniques on simple \"bag of system calls\" representation of system call sequences is effective and often performs better than those approaches that use foreign contiguous subsequences in detecting intrusive behaviors of compromised processes.", "year": 2005, "referenceCount": 34, "citationCount": 156, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1955615", "name": "Dae-Ki Kang"}, {"authorId": "29616408", "name": "D. Fuller"}, {"authorId": "145513516", "name": "Vasant G Honavar"}]}, {"paperId": "30bc4963e830d7e69ee0f2c1e16520019caebc7f", "url": "https://www.semanticscholar.org/paper/30bc4963e830d7e69ee0f2c1e16520019caebc7f", "title": "Measure Transformer Semantics for Bayesian Machine Learning", "abstract": "The Bayesian approach to machine learning amounts to computing posterior distributions of random variables from a probabilistic model of how the variables are related (that is, a prior distribution ...", "year": 2011, "referenceCount": 67, "citationCount": 106, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1795242", "name": "J. Borgström"}, {"authorId": "144376271", "name": "A. Gordon"}, {"authorId": "2106077623", "name": "Michael Greenberg"}, {"authorId": "94421304", "name": "J. Margetson"}, {"authorId": "1689857", "name": "Jurgen Van Gael"}]}, {"paperId": "6ce7dbba9fd5492acbadbd44a8590571bffa144c", "url": "https://www.semanticscholar.org/paper/6ce7dbba9fd5492acbadbd44a8590571bffa144c", "title": "GeePS: scalable deep learning on distributed GPUs with a GPU-specialized parameter server", "abstract": "Large-scale deep learning requires huge computational resources to train a multi-layer neural network. Recent systems propose using 100s to 1000s of machines to train networks with tens of layers and billions of connections. While the computation involved can be done more efficiently on GPUs than on more traditional CPU cores, training such networks on a single GPU is too slow and training on distributed GPUs can be inefficient, due to data movement overheads, GPU stalls, and limited GPU memory. This paper describes a new parameter server, called GeePS, that supports scalable deep learning across GPUs distributed among multiple machines, overcoming these obstacles. We show that GeePS enables a state-of-the-art single-node GPU implementation to scale well, such as to 13 times the number of training images processed per second on 16 machines (relative to the original optimized single-node code). Moreover, GeePS achieves a higher training throughput with just four GPU machines than that a state-of-the-art CPU-only system achieves with 108 machines.", "year": 2016, "referenceCount": 42, "citationCount": 292, "influentialCitationCount": 32, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1874200", "name": "Henggang Cui"}, {"authorId": "1682058", "name": "H. Zhang"}, {"authorId": "1707164", "name": "G. Ganger"}, {"authorId": "1974678", "name": "Phillip B. Gibbons"}, {"authorId": "143977260", "name": "E. Xing"}]}, {"paperId": "e27bccbf297f11e96ec574273b75bf19871dff40", "url": "https://www.semanticscholar.org/paper/e27bccbf297f11e96ec574273b75bf19871dff40", "title": "Advances in Machine Learning Based Text Categorization", "abstract": "In recent years, there have been extensive studies and rapid progresses in automatic text categorization, which is one of the hotspots and key techniques in the information retrieval and data mining field. Highlighting the state-of-art challenging issues and research trends for content information processing of Internet and other complex applications, this paper presents a survey on the up-to-date development in text categorization based on machine learning, including model, algorithm and evaluation. It is pointed out that problems such as nonlinearity, skewed data distribution, labeling bottleneck, hierarchical categorization, scalability of algorithms and categorization of Web pages are the key problems to the study of text categorization. Possible solutions to these problems are also discussed respectively. Finally, some future directions of research are given.", "year": 2006, "referenceCount": 100, "citationCount": 114, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "101111982", "name": "Su Jinshu"}, {"authorId": "9441976", "name": "Zhang Bo-feng"}, {"authorId": "2054666190", "name": "Xu Xin"}]}, {"paperId": "80e34049beab0e1aae5cc7a15f672d68e4ecf229", "url": "https://www.semanticscholar.org/paper/80e34049beab0e1aae5cc7a15f672d68e4ecf229", "title": "PyStruct: learning structured prediction in python", "abstract": "Structured prediction methods have become a central tool for many machine learning applications. While more and more algorithms are developed, only very few implementations are available. \n \nPyStruct aims at providing a general purpose implementation of standard structured prediction methods, both for practitioners and as a baseline for researchers. It is written in Python and adapts paradigms and types from the scientific Python community for seamless integration with other projects.", "year": 2014, "referenceCount": 24, "citationCount": 88, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2113785713", "name": "Andreas C. Müller"}, {"authorId": "1699019", "name": "Sven Behnke"}]}, {"paperId": "49e263c97948d8177c777a1106e0ab0795effa58", "url": "https://www.semanticscholar.org/paper/49e263c97948d8177c777a1106e0ab0795effa58", "title": "Validation of a Machine Learning Model That Outperforms Clinical Risk Scoring Systems for Upper Gastrointestinal Bleeding.", "abstract": "BACKGROUND & AIMS\nScoring systems are suboptimal for determining risk in patients with gastrointestinal bleeding (UGIB); these might be improved by a machine learning model. We used machine learning to develop a model to calculate risk of hospital-based intervention or death in patients with UGIB and compared its performance with other scoring systems.\n\n\nMETHODS\nWe analyzed data collected from consecutive unselected patients with UGIB from medical centers in 4 countries (United States, Scotland, England, Denmark; n=1958) from March 2014 through March 2015. We used the data to derive and internally validate a gradient-boosting machine learning model to identify patients who met a composite endpoint of hospital-based intervention (transfusion or hemostatic intervention) or death within 30 days. We compared the performance of the machine learning prediction model with validated pre-endoscopic clinical risk scoring systems (the Glasgow-Blatchford score [GBS], admission-Rockall score, and AIMS65). We externally validated the machine learning model using data from 2 Asia-Pacific sites (Singapore and New Zealand; n=399). Performance was measured by area under receiver operating characteristic curve (AUC) analysis.\n\n\nRESULTS\nThe machine learning model identified patients who met the composite endpoint with an AUC of 0.91 in the in the internal validation set; the clinical scoring systems identified patients who met the composite endpoint with AUC values of 0.88 for GBS (P=.001), 0.73 for Rockall score (P<.001), and 0.78 for AIMS65 score (P<.001). In the external validation cohort, the machine learning model identified patients who met the composite endpoint with an AUC of 0.90, the GBS with an AUC of 0.87 (P=.004), the Rockall score with an AUC of 0.66 (P<.001), and the AIMS65 with an AUC of 0.64 (P<.001). At cutoff scores at which the machine learning model and GBS identified patients who met the composite endpoint with 100% sensitivity, the specificity values were 26% with the machine learning model vs 12% with GBS (P<.001).\n\n\nCONCLUSIONS\nWe developed a machine learning model that identifies patients with UGIB who met a composite endpoint of hospital-based intervention or death within 30 days with a greater AUC and higher levels of specificity, at 100% sensitivity, than validated clinical risk scoring systems. This model could increase identification of low-risk patients who can be safely discharged from the emergency department for outpatient management.", "year": 2019, "referenceCount": 66, "citationCount": 83, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "16014130", "name": "D. Shung"}, {"authorId": "144528063", "name": "Benjamin Au"}, {"authorId": "2110665673", "name": "R. Taylor"}, {"authorId": "1752813099", "name": "J. Tay"}, {"authorId": "2803016", "name": "S. Laursen"}, {"authorId": "143725208", "name": "A. Stanley"}, {"authorId": "6875213", "name": "H. Dalton"}, {"authorId": "1388508871", "name": "Jeffrey Ngu"}, {"authorId": "145990737", "name": "M. Schultz"}, {"authorId": "143920164", "name": "L. Laine"}]}, {"paperId": "b95dda2f2e606c91b69f371c1a706248cb5f69bb", "url": "https://www.semanticscholar.org/paper/b95dda2f2e606c91b69f371c1a706248cb5f69bb", "title": "On the Feasibility of Deep Learning in Sensor Network Intrusion Detection", "abstract": "In this letter, we present a comprehensive analysis of the use of machine and deep learning (DL) solutions for IDS systems in wireless sensor networks (WSNs). To accomplish this, we introduce restricted Boltzmann machine-based clustered IDS (RBC-IDS), a potential DL-based IDS methodology for monitoring critical infrastructures by WSNs. We study the performance of RBC-IDS, and compare it to the previously proposed adaptive machine learning-based IDS: the adaptively supervised and clustered hybrid IDS (ASCH-IDS). Numerical results show that RBC-IDS and ASCH-IDS achieve the same detection and accuracy rates, though the detection time of RBC-IDS is approximately twice that of ASCH-IDS.", "year": 2019, "referenceCount": 16, "citationCount": 150, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2823694", "name": "S. Otoum"}, {"authorId": "2497479", "name": "B. Kantarci"}, {"authorId": "144769367", "name": "H. Mouftah"}]}, {"paperId": "d108b5fb580cc7bcee4a19d83ae429d8719f951c", "url": "https://www.semanticscholar.org/paper/d108b5fb580cc7bcee4a19d83ae429d8719f951c", "title": "Interactive Supercomputing on 40,000 Cores for Machine Learning and Data Analysis", "abstract": "Interactive massively parallel computations are critical for machine learning and data analysis. These computations are a staple of the MIT Lincoln Laboratory Supercomputing Center (LLSC) and has required the LLSC to develop unique interactive supercomputing capabilities. Scaling interactive machine learning frameworks, such as TensorFlow, and data analysis environments, such as MATLAB/Octave, to tens of thousands of cores presents many technical challenges – in particular, rapidly dispatching many tasks through a scheduler, such as Slurm, and starting many instances of applications with thousands of dependencies. Careful tuning of launches and prepositioning of applications overcome these challenges and allow the launching of thousands of tasks in seconds on a 40,000-core supercomputer. Specifically, this work demonstrates launching 32,000 TensorFlow processes in 4 seconds and launching 262,000 Octave processes in 40 seconds. These capabilities allow researchers to rapidly explore novel machine learning architecture and data analysis algorithms.", "year": 2018, "referenceCount": 27, "citationCount": 121, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2097629", "name": "A. Reuther"}, {"authorId": "3257323", "name": "J. Kepner"}, {"authorId": "2098646", "name": "C. Byun"}, {"authorId": "2331418", "name": "S. Samsi"}, {"authorId": "3302251", "name": "W. Arcand"}, {"authorId": "2159806", "name": "David Bestor"}, {"authorId": "34001612", "name": "Bill Bergeron"}, {"authorId": "74882299", "name": "V. Gadepally"}, {"authorId": "4121232", "name": "Michael Houle"}, {"authorId": "145238688", "name": "M. Hubbell"}, {"authorId": "2111328084", "name": "Michael Jones"}, {"authorId": "144414765", "name": "Anna Klein"}, {"authorId": "3385550", "name": "Lauren Milechin"}, {"authorId": "143913450", "name": "J. Mullen"}, {"authorId": "2417672", "name": "Andrew Prout"}, {"authorId": "144557576", "name": "Antonio Rosa"}, {"authorId": "145378881", "name": "Charles Yee"}, {"authorId": "1684116", "name": "P. Michaleas"}]}, {"paperId": "2abdca069a95add94f5c0c540c09efb7adeee230", "url": "https://www.semanticscholar.org/paper/2abdca069a95add94f5c0c540c09efb7adeee230", "title": "Reproducibility in machine learning for health research: Still a ways to go", "abstract": "Machine learning applied to health falls short on several reproducibility metrics compared to other machine learning subfields. Machine learning for health must be reproducible to ensure reliable clinical use. We evaluated 511 scientific papers across several machine learning subfields and found that machine learning for health compared poorly to other areas regarding reproducibility metrics, such as dataset and code accessibility. We propose recommendations to address this problem.", "year": 2021, "referenceCount": 27, "citationCount": 56, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "41153596", "name": "Matthew B. A. McDermott"}, {"authorId": "118188980", "name": "Shirly Wang"}, {"authorId": "150247231", "name": "N. Marinsek"}, {"authorId": "2615814", "name": "R. Ranganath"}, {"authorId": "1748978", "name": "L. Foschini"}, {"authorId": "2804918", "name": "M. Ghassemi"}]}, {"paperId": "1fbfe89fbcbbb61fb3ef6e9fb02cbe3bd8ce67ca", "url": "https://www.semanticscholar.org/paper/1fbfe89fbcbbb61fb3ef6e9fb02cbe3bd8ce67ca", "title": "A REVIEW OF STUDIES ON MACHINE LEARNING TECHNIQUES", "abstract": "This paper provides an extensive review of studies related to expert estimation of software development using Machine-Learning Techniques (MLT). Machine learning in this new era, is demonstrating the promise of producing consistently accurate estimates. Machine learning system effectively “learns” how to estimate from training set of completed projects. The main goal and contribution of the review is to support the research on expert estimation, i.e. to ease other researchers for relevant expert estimation studies using machine-learning techniques. This paper presents the most commonly used machine learning techniques such as neural networks, case based reasoning, classification and regression trees, rule induction, genetic algorithm & genetic programming for expert estimation in the field of software development. In each of our study we found that the results of various machine-learning techniques depends on application areas on which they are applied. Our review of study not only suggests that these techniques are competitive with traditional estimators on one data set, but also illustrate that these methods are sensitive to the data on which they are trained.", "year": 2007, "referenceCount": 27, "citationCount": 81, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "144657236", "name": "Y. Singh"}, {"authorId": "1847926", "name": "P. Bhatia"}, {"authorId": "2099912353", "name": "ys"}]}, {"paperId": "79217fc643a2ee73b2d36c12f97dbd3b8d85be45", "url": "https://www.semanticscholar.org/paper/79217fc643a2ee73b2d36c12f97dbd3b8d85be45", "title": "A study of statistical techniques and performance measures for genetics-based machine learning: accuracy and interpretability", "abstract": null, "year": 2009, "referenceCount": 46, "citationCount": 608, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "39558258", "name": "S. García"}, {"authorId": "143741583", "name": "Alberto Fernández"}, {"authorId": "145748883", "name": "J. Luengo"}, {"authorId": "1699069", "name": "F. Herrera"}]}, {"paperId": "fe8db65fe5d94de49777388e40b7951fbea636cf", "url": "https://www.semanticscholar.org/paper/fe8db65fe5d94de49777388e40b7951fbea636cf", "title": "Quantum Entanglement in Deep Learning Architectures.", "abstract": "Modern deep learning has enabled unprecedented achievements in various domains. Nonetheless, employment of machine learning for wave function representations is focused on more traditional architectures such as restricted Boltzmann machines (RBMs) and fully connected neural networks. In this Letter, we establish that contemporary deep learning architectures, in the form of deep convolutional and recurrent networks, can efficiently represent highly entangled quantum systems. By constructing tensor network equivalents of these architectures, we identify an inherent reuse of information in the network operation as a key trait which distinguishes them from standard tensor network-based representations, and which enhances their entanglement capacity. Our results show that such architectures can support volume-law entanglement scaling, polynomially more efficiently than presently employed RBMs. Thus, beyond a quantification of the entanglement capacity of leading deep learning architectures, our analysis formally motivates a shift of trending neural-network-based wave function representations closer to the state-of-the-art in machine learning.", "year": 2018, "referenceCount": 67, "citationCount": 124, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Physics", "Computer Science"], "authors": [{"authorId": "152754428", "name": "Yoav Levine"}, {"authorId": "3074811", "name": "Or Sharir"}, {"authorId": "32289606", "name": "Nadav Cohen"}, {"authorId": "3140335", "name": "A. Shashua"}]}, {"paperId": "107d68e984ec961dff26d4bd74687fef4d1a6564", "url": "https://www.semanticscholar.org/paper/107d68e984ec961dff26d4bd74687fef4d1a6564", "title": "Machine Learning and Pattern Recognition", "abstract": "Learning is needed when there is no human expertise existing or when human beings are unable to explain their expertise. In such a situation, one simply collects all the possible previous information, analyse it and then make a rule for future prediction or taking meaningful decision. When we plan to conclude such a work with the help of a computer by providing it ample amount of data and our past experience with tools and techniques, then the whole process becomes machine learning. Hence, machine learning can be defined as programming computers to optimise a performance criterion using example data and past experience. For example, recognition of spoken speech is being done by human beings seemingly without any difficulty, but cannot explain how they do it. Defence Science Journal, 2010, 60(4), pp.345-347 , DOI:http://dx.doi.org/10.14429/dsj.60.502", "year": 2010, "referenceCount": 5, "citationCount": 72, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49824784", "name": "Shri Kant"}]}, {"paperId": "36b8c88c8b3dd4048ad7583ca41c1b21f6a71ef7", "url": "https://www.semanticscholar.org/paper/36b8c88c8b3dd4048ad7583ca41c1b21f6a71ef7", "title": "Deep Learning: The Good, the Bad, and the Ugly.", "abstract": "Artificial vision has often been described as one of the key remaining challenges to be solved before machines can act intelligently. Recent developments in a branch of machine learning known as deep learning have catalyzed impressive gains in machine vision-giving a sense that the problem of vision is getting closer to being solved. The goal of this review is to provide a comprehensive overview of recent deep learning developments and to critically assess actual progress toward achieving human-level visual intelligence. I discuss the implications of the successes and limitations of modern machine vision algorithms for biological vision and the prospect for neuroscience to inform the design of future artificial vision systems. Expected final online publication date for the Annual Review of Vision Science, Volume 5 is September 16, 2019. Please see http://www.annualreviews.org/page/journal/pubdates for revised estimates.", "year": 2019, "referenceCount": 37, "citationCount": 139, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "152684324", "name": "T. Serre"}]}, {"paperId": "c245ac46b9ed95a78b6c5082c3a4707c5afc5f02", "url": "https://www.semanticscholar.org/paper/c245ac46b9ed95a78b6c5082c3a4707c5afc5f02", "title": "Automatic Short-Term Solar Flare Prediction Using Machine Learning and Sunspot Associations", "abstract": null, "year": 2007, "referenceCount": 73, "citationCount": 139, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "1713102", "name": "Rami Qahwaji"}, {"authorId": "49547430", "name": "T. Colak"}]}, {"paperId": "6409189c1949945e57fa9033c2ec26247cfffb39", "url": "https://www.semanticscholar.org/paper/6409189c1949945e57fa9033c2ec26247cfffb39", "title": "Introduction to Tensor Decompositions and their Applications in Machine Learning", "abstract": "Tensors are multidimensional arrays of numerical values and therefore generalize matrices to multiple dimensions. While tensors first emerged in the psychometrics community in the $20^{\\text{th}}$ century, they have since then spread to numerous other disciplines, including machine learning. Tensors and their decompositions are especially beneficial in unsupervised learning settings, but are gaining popularity in other sub-disciplines like temporal and multi-relational data analysis, too. \nThe scope of this paper is to give a broad overview of tensors, their decompositions, and how they are used in machine learning. As part of this, we are going to introduce basic tensor concepts, discuss why tensors can be considered more rigid than matrices with respect to the uniqueness of their decomposition, explain the most important factorization algorithms and their properties, provide concrete examples of tensor decomposition applications in machine learning, conduct a case study on tensor-based estimation of mixture models, talk about the current state of research, and provide references to available software libraries.", "year": 2017, "referenceCount": 43, "citationCount": 152, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "29938263", "name": "Stephan Rabanser"}, {"authorId": "32724677", "name": "Oleksandr Shchur"}, {"authorId": "3075189", "name": "Stephan Günnemann"}]}, {"paperId": "eb45b073b52040d05aa9b462415cb881595b85fc", "url": "https://www.semanticscholar.org/paper/eb45b073b52040d05aa9b462415cb881595b85fc", "title": "Concept formation knowledge and experience in unsupervised learning", "abstract": "Concept formation lies at the center of learning and cognition. Unlike much work in machine learning and cognitive psychology, research on this topic focuses on the unsupervised and incremental acquisition of conceptual knowledge. Recent work on concept formation addresses a number of important issues. Foremost among these are the principles of similarity that guide concept learning and retrieval in human and machine, including the contribution of surface features, goals, and `deep' features. Another active area of research explores mechanisms for efficiently reorganizing memory in response to the ongoing experiences that confront intelligent agents. Finally, methods for concept formation play an increasing role in work on problem solving and planning, developmental psychology, engineering applications, and constructive induction. This book brings together results on concept formation from cognitive psychology and machine learning, including explanation-based and inductive approaches. Chapters from these differing perspectives are intermingled to highlight the commonality of their research agendas. In addition to cognitive scientists and AI researchers, the book will interest data analysts involved in clustering, philosophers concerned with the nature and origin of concepts, and any researcher dealing with issues of similarity, memory organization, and problem solving.", "year": 1991, "referenceCount": 2, "citationCount": 234, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Psychology"], "authors": [{"authorId": "8993101", "name": "D. Fisher"}, {"authorId": "1694780", "name": "M. Pazzani"}, {"authorId": "1713919", "name": "P. Langley"}]}, {"paperId": "81fc34df88b2293981380454e7259629ff645320", "url": "https://www.semanticscholar.org/paper/81fc34df88b2293981380454e7259629ff645320", "title": "Deep Learning the Ising Model Near Criticality", "abstract": "It is well established that neural networks with deep architectures perform better than shallow networks for many tasks in machine learning. In statistical physics, while there has been recent interest in representing physical data with generative modelling, the focus has been on shallow neural networks. A natural question to ask is whether deep neural networks hold any advantage over shallow networks in representing such data. We investigate this question by using unsupervised, generative graphical models to learn the probability distribution of a two-dimensional Ising system. Deep Boltzmann machines, deep belief networks, and deep restricted Boltzmann networks are trained on thermal spin configurations from this system, and compared to the shallow architecture of the restricted Boltzmann machine. We benchmark the models, focussing on the accuracy of generating energetic observables near the phase transition, where these quantities are most difficult to approximate. Interestingly, after training the generative networks, we observe that the accuracy essentially depends only on the number of neurons in the first hidden layer of the network, and not on other model details such as network depth or model type. This is evidence that shallow networks are more efficient than deep networks at representing physical probability distributions associated with Ising systems near criticality.", "year": 2017, "referenceCount": 31, "citationCount": 73, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "23976374", "name": "A. Morningstar"}, {"authorId": "3422513", "name": "R. Melko"}]}, {"paperId": "55fc39658e9554f81bb29f95905ed8108d4e5f27", "url": "https://www.semanticscholar.org/paper/55fc39658e9554f81bb29f95905ed8108d4e5f27", "title": "Wheel Defect Detection With Machine Learning", "abstract": "Wheel defects on railway wagons have been identified as an important source of damage to the railway infrastructure and rolling stock. They also cause noise and vibration emissions that are costly to mitigate. We propose two machine learning methods to automatically detect these wheel defects, based on the wheel vertical force measured by a permanently installed sensor system on the railway network. Our methods automatically learn different types of wheel defects and predict during normal operation if a wheel has a defect or not. The first method is based on novel features for classifying time series data and it is used for classification with a support vector machine. To evaluate the performance of our method we construct multiple data sets for the following defect types: flat spot, shelling, and non-roundness. We outperform classical defect detection methods for flat spots and demonstrate prediction for the other two defect types for the first time. Motivated by the recent success of artificial neural networks for image classification, we train custom artificial neural networks with convolutional layers on 2-D representations of the measurement time series. The neural network approach improves the performance on wheels with flat spots and non-roundness by explicitly modeling the multi sensor structure of the measurement system through multiple instance learning and shift invariant networks.", "year": 2018, "referenceCount": 35, "citationCount": 109, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "1762319", "name": "Gabriel Krummenacher"}, {"authorId": "1706780", "name": "Cheng Soon Ong"}, {"authorId": "2067087623", "name": "Stefan Koller"}, {"authorId": "51194506", "name": "Seijin Kobayashi"}, {"authorId": "1682548", "name": "J. Buhmann"}]}, {"paperId": "89a0884dc1e456afda244357e45c0ea812869d4d", "url": "https://www.semanticscholar.org/paper/89a0884dc1e456afda244357e45c0ea812869d4d", "title": "Real-time human interaction with supervised learning algorithms for music composition and performance", "abstract": "This thesis examines machine learning through the lens of human-computer interaction in order to address fundamental questions surrounding the application of machine learning to real-life problems, including: Can we make machine learning algorithms more usable and useful? Can we better understand the real-world consequences of algorithm choices and user interface designs for end-user machine learning? How can human interaction play a role in enabling users to efficiently create useful machine learning systems, in enabling successful application of algorithms by machine learning novices, and in ultimately making it possible in practice to apply machine learning to new problems? \nThe scope of the research presented here is the application of supervised learning algorithms to contemporary computer music composition and performance. Computer music is a domain rich with computational problems requiring the modeling of complex phenomena, the construction of real-time interactive systems, and the support of human creativity. Though varied, many of these problems may be addressed using machine learning techniques, including supervised learning in particular. This work endeavors to gain a deeper knowledge of the human factors surrounding the application of supervised learning to these types of problems, to make supervised learning algorithms more usable by musicians, and to study how supervised learning can function as a creative tool. \nThis thesis presents a general-purpose software system for applying standard supervised learning algorithms in music and other real-time problem domains. This system, called the Wekinator, supports human interaction throughout the entire supervised learning process, including the generation of training examples and the application of trained models to real-time inputs. The Wekinator is published as a freely-available, open source software project, and several composers have already employed it in the creation of new musical instruments and compositions. \nThis thesis also presents work utilizing the Wekinator to study human-computer interaction with supervised learning in computer music. Research is presented which includes a participatory design process with practicing composers, pedagogical use with non-expert users in an undergraduate classroom, a study of the design of a gesture recognition system for a sensor-augmented cello bow, and case studies with three composers who have used the system in completed artistic works. \nThe primary contributions of this work include (1) a new software tool allowing real-time human interaction with supervised learning algorithms, which includes a novel “playalong” interaction for generating training data in real-time; (2) a demonstration of the important roles that interaction|encompassing both human-computer control and computer-human feedback|can play in the development of supervised learning systems, and a greater understanding of the differences between interactive and conventional machine learning contexts; (3) a better understanding of the requirements and challenges in the analysis and design of algorithms and interfaces for interactive supervised learning in real-time and creative problem domains; (4) a clearer characterization of composers' goals and priorities for interacting with computers in music composition and instrument design; and (5) a demonstration of the usefulness of interactive supervised learning as a creativity support tool. This work both empowers musicians to create new forms of art and contributes to a broader HCI perspective on machine learning practice.", "year": 2011, "referenceCount": 180, "citationCount": 104, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1716507", "name": "P. Cook"}, {"authorId": "1745615", "name": "R. Fiebrink"}]}, {"paperId": "398ead8535b127521f609828e1cd15f26ce1b4e1", "url": "https://www.semanticscholar.org/paper/398ead8535b127521f609828e1cd15f26ce1b4e1", "title": "Learning Machine Translation", "abstract": "The Internet gives us access to a wealth of information in languages we don't understand. The investigation of automated or semi-automated approaches to translation has become a thriving research field with enormous commercial potential. This volume investigates how machine learning techniques can improve statistical machine translation, currently at the forefront of research in the field. The book looks first at enabling technologiestechnologies that solve problems that are not machine translation proper but are linked closely to the development of a machine translation system. These include the acquisition of bilingual sentence-aligned data from comparable corpora, automatic construction of multilingual name dictionaries, and word alignment. The book then presents new or improved statistical machine translation techniques, including a discriminative training framework for leveraging syntactic information, the use of semi-supervised and kernel-based learning methods, and the combination of multiple machine translation outputs in order to improve overall translation quality. Contributors: Srinivas Bangalore, Nicola Cancedda, Josep M. Crego, Marc Dymetman, Jakob Elming, George Foster, Jess Gimnez, Cyril Goutte, Nizar Habash, Gholamreza Haffari, Patrick Haffner, Hitoshi Isahara, Stephan Kanthak, Alexandre Klementiev, Gregor Leusch, Pierre Mah, Llus Mrquez, Evgeny Matusov, I. Dan Melamed, Ion Muslea, Hermann Ney, Bruno Pouliquen, Dan Roth, Anoop Sarkar, John Shawe-Taylor, Ralf Steinberger, Joseph Turian, Nicola Ueffing, Masao Utiyama, Zhuoran Wang, Benjamin Wellington, Kenji Yamada Neural Information Processing series", "year": 2010, "referenceCount": 4, "citationCount": 69, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2788842", "name": "Cyril Goutte"}, {"authorId": "1683776", "name": "Nicola Cancedda"}, {"authorId": "2954698", "name": "Marc Dymetman"}, {"authorId": "2458308", "name": "George F. Foster"}]}, {"paperId": "54a13bcc9613dcaa76fb25fbe96572f376cfcca9", "url": "https://www.semanticscholar.org/paper/54a13bcc9613dcaa76fb25fbe96572f376cfcca9", "title": "Adafactor: Adaptive Learning Rates with Sublinear Memory Cost", "abstract": "In several recently proposed stochastic optimization methods (e.g. RMSProp, Adam, Adadelta), parameter updates are scaled by the inverse square roots of exponential moving averages of squared past gradients. Maintaining these per-parameter second-moment estimators requires memory equal to the number of parameters. For the case of neural network weight matrices, we propose maintaining only the per-row and per-column sums of these moving averages, and estimating the per-parameter second moments based on these sums. We demonstrate empirically that this method produces similar results to the baseline. Secondly, we show that adaptive methods can produce larger-than-desired updates when the decay rate of the second moment accumulator is too slow. We propose update clipping and a gradually increasing decay rate scheme as remedies. Combining these methods and dropping momentum, we achieve comparable results to the published Adam regime in training the Transformer model on the WMT 2014 English-German machine translation task, while using very little auxiliary storage in the optimizer. Finally, we propose scaling the parameter updates based on the scale of the parameters themselves.", "year": 2018, "referenceCount": 13, "citationCount": 390, "influentialCitationCount": 69, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1846258", "name": "Noam M. Shazeer"}, {"authorId": "144872294", "name": "Mitchell Stern"}]}, {"paperId": "150538d8117b8fb08d9efc340e49c52afd11399a", "url": "https://www.semanticscholar.org/paper/150538d8117b8fb08d9efc340e49c52afd11399a", "title": "Decision tree classifier for network intrusion detection with GA-based feature selection", "abstract": "Machine Learning techniques such as Genetic Algorithms and Decision Trees have been applied to the field of intrusion detection for more than a decade. Machine Learning techniques can learn normal and anomalous patterns from training data and generate classifiers that then are used to detect attacks on computer systems. In general, the input data to classifiers is in a high dimension feature space, but not all of features are relevant to the classes to be classified. In this paper, we use a genetic algorithm to select a subset of input features for decision tree classifiers, with a goal of increasing the detection rate and decreasing the false alarm rate in network intrusion detection. We used the KDDCUP 99 data set to train and test the decision tree classifiers. The experiments show that the resulting decision trees can have better performance than those built with all available features.", "year": 2005, "referenceCount": 33, "citationCount": 319, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50435109", "name": "G. Stein"}, {"authorId": "2146710489", "name": "Bing Chen"}, {"authorId": "2989050", "name": "A. Wu"}, {"authorId": "1730455", "name": "K. Hua"}]}, {"paperId": "81af3058f2df78be332f50ea3813be5aa1f02f58", "url": "https://www.semanticscholar.org/paper/81af3058f2df78be332f50ea3813be5aa1f02f58", "title": "The Hidden Vulnerability of Distributed Learning in Byzantium", "abstract": "While machine learning is going through an era of celebrated success, concerns have been raised about the vulnerability of its backbone: stochastic gradient descent (SGD). Recent approaches have been proposed to ensure the robustness of distributed SGD against adversarial (Byzantine) workers sending poisoned gradients during the training phase. Some of these approaches have been proven Byzantine-resilient: they ensure the convergence of SGD despite the presence of a minority of adversarial workers. \nWe show in this paper that convergence is not enough. In high dimension $d \\gg 1$, an adver\\-sary can build on the loss function's non-convexity to make SGD converge to ineffective models. More precisely, we bring to light that existing Byzantine-resilient schemes leave a margin of poisoning of $\\Omega\\left(f(d)\\right)$, where $f(d)$ increases at least like $\\sqrt{d~}$. Based on this leeway, we build a simple attack, and experimentally show its strong to utmost effectivity on CIFAR-10 and MNIST. \nWe introduce Bulyan, and prove it significantly reduces the attackers leeway to a narrow $O( \\frac{1}{\\sqrt{d~}})$ bound. We empirically show that Bulyan does not suffer the fragility of existing aggregation rules and, at a reasonable cost in terms of required batch size, achieves convergence as if only non-Byzantine gradients had been used to update the model.", "year": 2018, "referenceCount": 34, "citationCount": 293, "influentialCitationCount": 63, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "9623412", "name": "El Mahdi El Mhamdi"}, {"authorId": "1727558", "name": "R. Guerraoui"}, {"authorId": "36055256", "name": "Sébastien Rouault"}]}, {"paperId": "845147f953afe83377b430b7cdc8309cdd2c05fb", "url": "https://www.semanticscholar.org/paper/845147f953afe83377b430b7cdc8309cdd2c05fb", "title": "Extreme learning machines: new trends and applications", "abstract": null, "year": 2015, "referenceCount": 70, "citationCount": 113, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "7175017", "name": "Chenwei Deng"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "1723338", "name": "Jia Xu"}, {"authorId": "2967405", "name": "Jiexiong Tang"}]}, {"paperId": "4c2a642effd543babace0c565b48cadcb6fce14f", "url": "https://www.semanticscholar.org/paper/4c2a642effd543babace0c565b48cadcb6fce14f", "title": "An Empirical Evaluation of Knowledge Sources and Learning Algorithms for Word Sense Disambiguation", "abstract": "In this paper, we evaluate a variety of knowledge sources and supervised learning algorithms for word sense disambiguation on SENSEVAL-2 and SENSEVAL-1 data. Our knowledge sources include the part-of-speech of neighboring words, single words in the surrounding context, local collocations, and syntactic relations. The learning algorithms evaluated include Support Vector Machines (SVM), Naive Bayes, AdaBoost, and decision tree algorithms. We present empirical results showing the relative contribution of the component knowledge sources and the different learning algorithms. In particular, using all of these knowledge sources and SVM (i.e., a single learning algorithm) achieves accuracy higher than the best official scores on both SENSEVAL-2 and SENSEVAL-1 test data.", "year": 2002, "referenceCount": 42, "citationCount": 290, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2110391587", "name": "Yoong Keok Lee"}, {"authorId": "34789794", "name": "H. Ng"}]}, {"paperId": "9392491c8cc9b01a4085d1182ac652a3e86cf899", "url": "https://www.semanticscholar.org/paper/9392491c8cc9b01a4085d1182ac652a3e86cf899", "title": "Incremental extreme learning machine based on deep feature embedded", "abstract": null, "year": 2016, "referenceCount": 28, "citationCount": 44, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2151811677", "name": "Jian Zhang"}, {"authorId": "2066430561", "name": "Shifei Ding"}, {"authorId": "47899254", "name": "Nan Zhang"}, {"authorId": "145000409", "name": "Zhongzhi Shi"}]}, {"paperId": "1f6d30772a94d978c9f81e2f7c1f4b0bdec117dd", "url": "https://www.semanticscholar.org/paper/1f6d30772a94d978c9f81e2f7c1f4b0bdec117dd", "title": "Large Scale Incremental Learning", "abstract": "Modern machine learning suffers from \\textit{catastrophic forgetting} when learning new classes incrementally. The performance dramatically degrades due to the missing data of old classes. Incremental learning methods have been proposed to retain the knowledge acquired from the old classes, by using knowledge distilling and keeping a few exemplars from the old classes. However, these methods struggle to \\textbf{scale up to a large number of classes}. We believe this is because of the combination of two factors: (a) the data imbalance between the old and new classes, and (b) the increasing number of visually similar classes. Distinguishing between an increasing number of visually similar classes is particularly challenging, when the training data is unbalanced. We propose a simple and effective method to address this data imbalance issue. We found that the last fully connected layer has a strong bias towards the new classes, and this bias can be corrected by a linear model. With two bias parameters, our method performs remarkably well on two large datasets: ImageNet (1000 classes) and MS-Celeb-1M (10000 classes), outperforming the state-of-the-art algorithms by 11.1\\% and 13.2\\% respectively.", "year": 2019, "referenceCount": 27, "citationCount": 484, "influentialCitationCount": 128, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2119299240", "name": "Yue Wu"}, {"authorId": "2109306087", "name": "Yinpeng Chen"}, {"authorId": "29957038", "name": "Lijuan Wang"}, {"authorId": "3105254", "name": "Yuancheng Ye"}, {"authorId": "2145253136", "name": "Zicheng Liu"}, {"authorId": "3133575", "name": "Yandong Guo"}, {"authorId": "46956675", "name": "Y. Fu"}]}, {"paperId": "d849873201a042956ae928dc2b09fb87d5fca9fc", "url": "https://www.semanticscholar.org/paper/d849873201a042956ae928dc2b09fb87d5fca9fc", "title": "Machine Learning in Healthcare", "abstract": null, "year": 2017, "referenceCount": 45, "citationCount": 77, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2840689", "name": "A. Callahan"}, {"authorId": "143665076", "name": "N. Shah"}]}, {"paperId": "203392c8269d1ab241c71cd9df1cda829cc8b651", "url": "https://www.semanticscholar.org/paper/203392c8269d1ab241c71cd9df1cda829cc8b651", "title": "Settable Systems: An Extension of Pearl's Causal Model with Optimization, Equilibrium, and Learning", "abstract": "Judea Pearl's Causal Model is a rich framework that provides deep insight into the nature of causal relations. As yet, however, the Pearl Causal Model (PCM) has had a lesser impact on economics or econometrics than on other disciplines. This may be due in part to the fact that the PCM is not as well suited to analyzing structures that exhibit features of central interest to economists and econometricians: optimization, equilibrium, and learning. We offer the settable systems framework as an extension of the PCM that permits causal discourse in systems embodying optimization, equilibrium, and learning. Because these are common features of physical, natural, or social systems, our framework may prove generally useful for machine learning. Important features distinguishing the settable system framework from the PCM are its countable dimensionality and the use of partitioning and partition-specific response functions to accommodate the behavior of optimizing and interacting agents and to eliminate the requirement of a unique fixed point for the system. Refinements of the PCM include the settable systems treatment of attributes, the causal role of exogenous variables, and the dual role of variables as causes and responses. A series of closely related machine learning examples and examples from game theory and machine learning with feedback demonstrates some limitations of the PCM and motivates the distinguishing features of settable systems.", "year": 2009, "referenceCount": 55, "citationCount": 65, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2149702798", "name": "H. White"}, {"authorId": "2605889", "name": "Karim Chalak"}]}, {"paperId": "3c4b8f52f207939b6f959108bb81d008c4f9887d", "url": "https://www.semanticscholar.org/paper/3c4b8f52f207939b6f959108bb81d008c4f9887d", "title": "Missing Data Problems in Machine Learning", "abstract": "Learning, inference, and prediction in the presence of missing data are pervasive problems in machine learning and statistical data analysis. This thesis focuses on the problems of collaborative prediction with non-random missing data and classification with missing features. We begin by presenting and elaborating on the theory of missing data due to Little and Rubin. We place a particular emphasis on the missing at random assumption in the multivariate setting with arbitrary patterns of missing data. We derive inference and prediction methods in the presence of random missing data for a variety of probabilistic models including finite mixture models, Dirichlet process mixture models, and factor analysis. \nBased on this foundation, we develop several novel models and inference procedures for both the collaborative prediction problem and the problem of classification with missing features. We develop models and methods for collaborative prediction with non-random missing data by combining standard models for complete data with models of the missing data process. Using a novel recommender system data set and experimental protocol, we show that each proposed method achieves a substantial increase in rating prediction performance compared to models that assume missing ratings are missing at random. \nWe describe several strategies for classification with missing features including the use of generative classifiers, and the combination of standard discriminative classifiers with single imputation, multiple imputation, classification in subspaces, and an approach based on modifying the classifier input representation to include response indicators. Results on real and synthetic data sets show that in some cases performance gains over baseline methods can be achieved by methods that do not learn a detailed model of the feature space.", "year": 2008, "referenceCount": 87, "citationCount": 116, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1805742", "name": "Benjamin M Marlin"}]}, {"paperId": "916c816f16e4934e41f09a3ff81a10e5fc4bb459", "url": "https://www.semanticscholar.org/paper/916c816f16e4934e41f09a3ff81a10e5fc4bb459", "title": "Multicalibration: Calibration for the (Computationally-Identifiable) Masses", "abstract": "We develop and study multicalibration as a new measure of fairness in machine learning that aims to mitigate inadvertent or malicious discrimination that is introduced at training time (even from ground truth data). Multicalibration guarantees meaningful (calibrated) predictions for every subpopulation that can be identified within a specified class of computations. The specified class can be quite rich; in particular, it can contain many overlapping subgroups of a protected group. We demonstrate that in many settings this strong notion of protection from discrimination is provably attainable and aligned with the goal of accurate predictions. Along the way, we present algorithms for learning a multicalibrated predictor, study the computational complexity of this task, and illustrate tight connections to the agnostic learning model.", "year": 2018, "referenceCount": 34, "citationCount": 142, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1405130584", "name": "Úrsula Hébert-Johnson"}, {"authorId": "2110079050", "name": "Michael P. Kim"}, {"authorId": "1746057", "name": "O. Reingold"}, {"authorId": "2551824", "name": "G. Rothblum"}]}, {"paperId": "c16629bf5286cb30d5ccbee276a5270127a3530e", "url": "https://www.semanticscholar.org/paper/c16629bf5286cb30d5ccbee276a5270127a3530e", "title": "Robust feature selection algorithms", "abstract": "Selecting a set of features which is optimal for a given task is a problem which plays an important role in wide variety of contexts including pattern recognition, adaptive control and machine learning. Experience with traditional feature selection algorithms in the domain of machine learning leads to an appreciation for their computational efficiency and a concern for their brittleness. The authors describe an alternative approach to feature selection which uses genetic algorithms as the primary search component. Results are presented which suggested that genetic algorithms can be used to increase the robustness of feature selection algorithms without a significant decrease in compuational efficiency.", "year": 1993, "referenceCount": 8, "citationCount": 197, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2020670", "name": "H. Vafaie"}, {"authorId": "2069839824", "name": "K. A. Jong"}]}, {"paperId": "0506e3089918a2d9e24043e0919ae2d20f6fd09e", "url": "https://www.semanticscholar.org/paper/0506e3089918a2d9e24043e0919ae2d20f6fd09e", "title": "Metric learning for text documents", "abstract": "Many algorithms in machine learning rely on being given a good distance metric over the input space. Rather than using a default metric such as the Euclidean metric, it is desirable to obtain a metric based on the provided data. We consider the problem of learning a Riemannian metric associated with a given differentiable manifold and a set of points. Our approach to the problem involves choosing a metric from a parametric family that is based on maximizing the inverse volume of a given data set of points. From a statistical perspective, it is related to maximum likelihood under a model that assigns probabilities inversely proportional to the Riemannian volume element. We discuss in detail learning a metric on the multinomial simplex where the metric candidates are pull-back metrics of the Fisher information under a Lie group of transformations. When applied to text document classification the resulting geodesic distance resemble, but outperform, the tfidf cosine similarity measure.", "year": 2006, "referenceCount": 12, "citationCount": 145, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1717932", "name": "G. Lebanon"}]}, {"paperId": "b68e8d2f4d2c709bb5919b82effcb6a7bbd3db37", "url": "https://www.semanticscholar.org/paper/b68e8d2f4d2c709bb5919b82effcb6a7bbd3db37", "title": "Stock Market Forecasting Using Machine Learning Algorithms", "abstract": "Prediction of stock market is a long-time attractive topic to researchers from different fields. In particular, numerous studies have been conducted to predict the movement of stock market using machine learning algorithms such as support vector machine (SVM) and reinforcement learning. In this project, we propose a new prediction algorithm that exploits the temporal correlation among global stock markets and various financial products to predict the next-day stock trend with the aid of SVM. Numerical results indicate a prediction accuracy of 74.4% in NASDAQ, 76% in S&P500 and 77.6% in DJIA. The same algorithm is also applied with different regression algorithms to trace the actual increment in the markets. Finally, a simple trading model is established to study the performance of the proposed prediction algorithm against other benchmarks.", "year": 2012, "referenceCount": 3, "citationCount": 109, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31157189", "name": "S. Shen"}, {"authorId": "2484506", "name": "Haomiao Jiang"}, {"authorId": "2116382", "name": "Tongda Zhang"}]}, {"paperId": "4baee71da9b4e8ea1feec5bbed8249eed670272e", "url": "https://www.semanticscholar.org/paper/4baee71da9b4e8ea1feec5bbed8249eed670272e", "title": "Machine Learning Methods for Property Prediction in Chemoinformatics: Quo Vadis?", "abstract": "This paper is focused on modern approaches to machine learning, most of which are as yet used infrequently or not at all in chemoinformatics. Machine learning methods are characterized in terms of the \"modes of statistical inference\" and \"modeling levels\" nomenclature and by considering different facets of the modeling with respect to input/ouput matching, data types, models duality, and models inference. Particular attention is paid to new approaches and concepts that may provide efficient solutions of common problems in chemoinformatics: improvement of predictive performance of structure-property (activity) models, generation of structures possessing desirable properties, model applicability domain, modeling of properties with functional endpoints (e.g., phase diagrams and dose-response curves), and accounting for multiple molecular species (e.g., conformers or tautomers).", "year": 2012, "referenceCount": 305, "citationCount": 173, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1685042", "name": "A. Varnek"}, {"authorId": "2539452", "name": "I. Baskin"}]}, {"paperId": "01957186c529b6f1efc1ad2a896c25c5d7862a24", "url": "https://www.semanticscholar.org/paper/01957186c529b6f1efc1ad2a896c25c5d7862a24", "title": "Learning Non-Isomorphic Tree Mappings for Machine Translation", "abstract": "Often one may wish to learn a tree-to-tree mapping, training it on unaligned pairs of trees, or on a mixture of trees and strings. Unlike previous statistical formalisms (limited to isomorphic trees), synchronous TSG allows local distortion of the tree topology. We reformulate it to permit dependency trees, and sketch EM/Viterbi algorithms for alignment, training, and decoding.", "year": 2003, "referenceCount": 20, "citationCount": 286, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145043214", "name": "Jason Eisner"}]}, {"paperId": "fbff6e316722053f5233f4c7869cc18e705af2e3", "url": "https://www.semanticscholar.org/paper/fbff6e316722053f5233f4c7869cc18e705af2e3", "title": "Learning to Filter Unsolicited Commercial E-Mail", "abstract": "We present a thorough investigation on using machine learning to construct effective personalized anti-spam filters. The investigation includes four learning algorithms, Naive Bayes, Flexible Bayes, LogitBoost, and Support Vector Machines, and four datasets, constructed from the mailboxes of different users. We discuss the model and search biases of the learning algorithms, along with worst-case computational complexity figures, and observe how the latter relate to experimental measurements. We study how classification accuracy is affected when using attributes that represent sequences of tokens, as opposed to single tokens, and explore the effect of the size of the attribute and training set, all within a cost-sensitive framework. Furthermore, we describe the architecture of a fully implemented learning-based anti-spam filter, and present an analysis of its behavior in real use over a period of seven months. Information is also provided on other available learning-based anti-spam filters, and alternative filtering approaches.", "year": 2006, "referenceCount": 52, "citationCount": 175, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1752430", "name": "Ion Androutsopoulos"}, {"authorId": "4738873", "name": "G. Paliouras"}, {"authorId": "31650939", "name": "E. Michelakis"}, {"authorId": "31650939", "name": "E. Michelakis"}]}, {"paperId": "371f7ac8d33a044b71d392638c81077b72030814", "url": "https://www.semanticscholar.org/paper/371f7ac8d33a044b71d392638c81077b72030814", "title": "ProfilIoT: a machine learning approach for IoT device identification based on network traffic analysis", "abstract": "In this work we apply machine learning algorithms on network traffic data for accurate identification of IoT devices connected to a network. To train and evaluate the classifier, we collected and labeled network traffic data from nine distinct IoT devices, and PCs and smartphones. Using supervised learning, we trained a multi-stage meta classifier; in the first stage, the classifier can distinguish between traffic generated by IoT and non-IoT devices. In the second stage, each IoT device is associated a specific IoT device class. The overall IoT classification accuracy of our model is 99.281+.", "year": 2017, "referenceCount": 13, "citationCount": 261, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "11034542", "name": "Yair Meidan"}, {"authorId": "11055183", "name": "Michael Bohadana"}, {"authorId": "1720589", "name": "A. Shabtai"}, {"authorId": "144953724", "name": "J. Guarnizo"}, {"authorId": "145010553", "name": "Martín Ochoa"}, {"authorId": "2225170", "name": "Nils Ole Tippenhauer"}, {"authorId": "1724372", "name": "Y. Elovici"}]}, {"paperId": "c141b7c4ccb4a0e5d2a327aa260b318c7c3bcfbb", "url": "https://www.semanticscholar.org/paper/c141b7c4ccb4a0e5d2a327aa260b318c7c3bcfbb", "title": "Real-Time Adaptive Image Compression", "abstract": "We present a machine learning-based approach to lossy image compression which outperforms all existing codecs, while running in real-time. \nOur algorithm typically produces files 2.5 times smaller than JPEG and JPEG 2000, 2 times smaller than WebP, and 1.7 times smaller than BPG on datasets of generic images across all quality levels. At the same time, our codec is designed to be lightweight and deployable: for example, it can encode or decode the Kodak dataset in around 10ms per image on GPU. \nOur architecture is an autoencoder featuring pyramidal analysis, an adaptive coding module, and regularization of the expected codelength. We also supplement our approach with adversarial training specialized towards use in a compression setting: this enables us to produce visually pleasing reconstructions for very low bitrates.", "year": 2017, "referenceCount": 24, "citationCount": 424, "influentialCitationCount": 53, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1757324", "name": "Oren Rippel"}, {"authorId": "1769383", "name": "Lubomir D. Bourdev"}]}, {"paperId": "314913e088d254f49890e1feb32f3b70c92170a4", "url": "https://www.semanticscholar.org/paper/314913e088d254f49890e1feb32f3b70c92170a4", "title": "Learning Program Behavior Profiles for Intrusion Detection", "abstract": "Profiling the behavior of programs can be a useful reference for detecting potential intrusions against systems. This paper presents three anomaly detection techniques for profiling program behavior that evolve from memorization to generalization. The goal of monitoring program behavior is to be able to detect potential intrusions by noting irregularities in program behavior. The techniques start from a simple equality matching algorithm for determining anomalous behavior, and evolve to a feed-forward backpropagation neural network for learning program behavior, and finally to an Elman network for recognizing recurrent features in program execution traces. In order to detect future attacks against systems, intrusion detection systems must be able to generalize from past observed behavior. The goal of this research is to employ machine learning techniques that can generalize from past observed behavior to the problem of intrusion detection. The performance of these systems is compared by testing them with data provided by the DARPA Intrusion Detection Evaluation program.", "year": 1999, "referenceCount": 35, "citationCount": 510, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144034315", "name": "Anup K. Ghosh"}, {"authorId": "38901901", "name": "A. Schwartzbard"}, {"authorId": "145258307", "name": "M. Schatz"}]}, {"paperId": "0e2b3faed39561f712c3b14a08c7c36272d9857a", "url": "https://www.semanticscholar.org/paper/0e2b3faed39561f712c3b14a08c7c36272d9857a", "title": "Understanding and Improving Convolutional Neural Networks via Concatenated Rectified Linear Units", "abstract": "Recently, convolutional neural networks (CNNs) have been used as a powerful tool to solve many problems of machine learning and computer vision. In this paper, we aim to provide insight on the property of convolutional neural networks, as well as a generic method to improve the performance of many CNN architectures. Specifically, we first examine existing CNN models and observe an intriguing property that the filters in the lower layers form pairs (i.e., filters with opposite phase). Inspired by our observation, we propose a novel, simple yet effective activation scheme called concatenated ReLU (CRelu) and theoretically analyze its reconstruction property in CNNs. We integrate CRelu into several state-of-the-art CNN architectures and demonstrate improvement in their recognition performance on CIFAR-10/100 and ImageNet datasets with fewer trainable parameters. Our results suggest that better understanding of the properties of CNNs can lead to significant performance improvement with a simple modification.", "year": 2016, "referenceCount": 35, "citationCount": 411, "influentialCitationCount": 43, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3163480", "name": "Wenling Shang"}, {"authorId": "1729571", "name": "Kihyuk Sohn"}, {"authorId": "2061137049", "name": "Diogo Almeida"}, {"authorId": "1697141", "name": "Honglak Lee"}]}, {"paperId": "9e65b35e8bc74cf87c93d1c396a7200b6b9fd5e0", "url": "https://www.semanticscholar.org/paper/9e65b35e8bc74cf87c93d1c396a7200b6b9fd5e0", "title": "Knowledge Representation and Organization in Machine Learning", "abstract": null, "year": 1989, "referenceCount": 0, "citationCount": 72, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1752599", "name": "K. Morik"}]}, {"paperId": "5c5be36e3111e42247d78a6d529e4b1d7d2ced12", "url": "https://www.semanticscholar.org/paper/5c5be36e3111e42247d78a6d529e4b1d7d2ced12", "title": "Ilastik: Interactive learning and segmentation toolkit", "abstract": "Segmentation is the process of partitioning digital images into meaningful regions. The analysis of biological high content images often requires segmentation as a first step. We propose ilastik as an easy-to-use tool which allows the user without expertise in image processing to perform segmentation and classification in a unified way. ilastik learns from labels provided by the user through a convenient mouse interface. Based on these labels, ilastik infers a problem specific segmentation. A random forest classifier is used in the learning step, in which each pixel's neighborhood is characterized by a set of generic (nonlinear) features. ilastik supports up to three spatial plus one spectral dimension and makes use of all dimensions in the feature calculation. ilastik provides realtime feedback that enables the user to interactively refine the segmentation result and hence further fine-tune the classifier. An uncertainty measure guides the user to ambiguous regions in the images. Real time performance is achieved by multi-threading which fully exploits the capabilities of modern multi-core machines. Once a classifier has been trained on a set of representative images, it can be exported and used to automatically process a very large number of images (e.g. using the CellProfiler pipeline). ilastik is an open source project and released under the BSD license at www.ilastik.org.", "year": 2011, "referenceCount": 17, "citationCount": 1067, "influentialCitationCount": 103, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2059204163", "name": "Christoph Sommer"}, {"authorId": "145486652", "name": "C. Straehle"}, {"authorId": "1708103", "name": "U. Köthe"}, {"authorId": "1685187", "name": "F. Hamprecht"}]}, {"paperId": "0565c3e3374a8edf372f0fa25386b8325a47b037", "url": "https://www.semanticscholar.org/paper/0565c3e3374a8edf372f0fa25386b8325a47b037", "title": "Automatic document metadata extraction using support vector machines", "abstract": "Automatic metadata generation provides scalability and usability for digital libraries and their collections. Machine learning methods offer robust and adaptable automatic metadata extraction. We describe a support vector machine classification-based method for metadata extraction from header part of research papers and show that it outperforms other machine learning methods on the same task. The method first classifies each line of the header into one or more of 15 classes. An iterative convergence procedure is then used to improve the line classification by using the predicted class labels of its neighbor lines in the previous round. Further metadata extraction is done by seeking the best chunk boundaries of each line. We found that discovery and use of the structural patterns of the data and domain based word clustering can improve the metadata extraction performance. An appropriate feature normalization also greatly improves the classification performance. Our metadata extraction method was originally designed to improve the metadata extraction quality of the digital libraries Citeseer [S. Lawrence et al., (1999)] and EbizSearch [Y. Petinot et al., (2003)]. We believe it can be generalized to other digital libraries.", "year": 2003, "referenceCount": 36, "citationCount": 340, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144910499", "name": "Hui Han"}, {"authorId": "145157784", "name": "C. Lee Giles"}, {"authorId": "2690730", "name": "Eren Manavoglu"}, {"authorId": "145203884", "name": "H. Zha"}, {"authorId": "2923061", "name": "Zhenyue Zhang"}, {"authorId": "1705950", "name": "E. Fox"}]}, {"paperId": "46a86a9868122594e3477e90c778767b98cfd5a0", "url": "https://www.semanticscholar.org/paper/46a86a9868122594e3477e90c778767b98cfd5a0", "title": "Guest Editors' Introduction: Machine Learning and Natural Language", "abstract": null, "year": 1999, "referenceCount": 34, "citationCount": 35, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1748501", "name": "Claire Cardie"}, {"authorId": "1797655", "name": "R. Mooney"}]}, {"paperId": "f1664bbaddedea8c250873e7610ab07e53fa7132", "url": "https://www.semanticscholar.org/paper/f1664bbaddedea8c250873e7610ab07e53fa7132", "title": "Machine learning pipeline for battery state of health estimation", "abstract": null, "year": 2021, "referenceCount": 86, "citationCount": 72, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "80025697", "name": "D. Roman"}, {"authorId": "49730050", "name": "Saurabh Saxena"}, {"authorId": "1718021", "name": "V. Robu"}, {"authorId": "145937021", "name": "M. Pecht"}, {"authorId": "143836960", "name": "D. Flynn"}]}, {"paperId": "2dc18f661b400033abd1086b917c451d3358aef2", "url": "https://www.semanticscholar.org/paper/2dc18f661b400033abd1086b917c451d3358aef2", "title": "Visible Machine Learning for Biomedicine", "abstract": null, "year": 2018, "referenceCount": 17, "citationCount": 98, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "21310951", "name": "M. Yu"}, {"authorId": "5214991", "name": "Jianzhu Ma"}, {"authorId": "38531806", "name": "J. Fisher"}, {"authorId": "5768509", "name": "J. Kreisberg"}, {"authorId": "35016672", "name": "Benjamin J. Raphael"}, {"authorId": "144261466", "name": "T. Ideker"}]}, {"paperId": "8db9df2eadea654f128c1887722c677c708e8a47", "url": "https://www.semanticscholar.org/paper/8db9df2eadea654f128c1887722c677c708e8a47", "title": "Deep Reinforcement Learning framework for Autonomous Driving", "abstract": "Reinforcement learning is considered to be a strong AI paradigm which can be used to teach machines through interaction with the environment and learning from their mistakes. Despite its perceived utility, it has not yet been successfully applied in automotive applications. Motivated by the successful demonstrations of learning of Atari games and Go by Google DeepMind, we propose a framework for autonomous driving using deep reinforcement learning. This is of particular relevance as it is difficult to pose autonomous driving as a supervised learning problem due to strong interactions with the environment including other vehicles, pedestrians and roadworks. As it is a relatively new area of research for autonomous driving, we provide a short overview of deep reinforcement learning and then describe our proposed framework. It incorporates Recurrent Neural Networks for information integration, enabling the car to handle partially observable scenarios. It also integrates the recent work on attention models to focus on relevant information, thereby reducing the computational complexity for deployment on embedded hardware. The framework was tested in an open source 3D car racing simulator called TORCS. Our simulation results demonstrate learning of autonomous maneuvering in a scenario of complex road curvatures and simple interaction of other vehicles.", "year": 2017, "referenceCount": 24, "citationCount": 652, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "7353741", "name": "Ahmad El Sallab"}, {"authorId": "144026300", "name": "Mohammed Abdou"}, {"authorId": "8211183", "name": "E. Perot"}, {"authorId": "2601522", "name": "S. Yogamani"}]}, {"paperId": "3029a4610f719c917db7eb1ac05cdb6120deadfb", "url": "https://www.semanticscholar.org/paper/3029a4610f719c917db7eb1ac05cdb6120deadfb", "title": "Wave physics as an analog recurrent neural network", "abstract": "Analog machine learning computations are performed passively by propagating light and sound waves through programmed materials. Analog machine learning hardware platforms promise to be faster and more energy efficient than their digital counterparts. Wave physics, as found in acoustics and optics, is a natural candidate for building analog processors for time-varying signals. Here, we identify a mapping between the dynamics of wave physics and the computation in recurrent neural networks. This mapping indicates that physical wave systems can be trained to learn complex features in temporal data, using standard training techniques for neural networks. As a demonstration, we show that an inverse-designed inhomogeneous medium can perform vowel classification on raw audio signals as their waveforms scatter and propagate through it, achieving performance comparable to a standard digital implementation of a recurrent neural network. These findings pave the way for a new class of analog machine learning platforms, capable of fast and efficient processing of information in its native domain.", "year": 2019, "referenceCount": 45, "citationCount": 155, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Medicine", "Physics", "Computer Science"], "authors": [{"authorId": "39932230", "name": "Tyler W. Hughes"}, {"authorId": "6049231", "name": "Ian A. D. Williamson"}, {"authorId": "5325132", "name": "M. Minkov"}, {"authorId": "144567568", "name": "S. Fan"}]}, {"paperId": "4d8f0ae904779a50b2e18fec49e51a5661a98d8a", "url": "https://www.semanticscholar.org/paper/4d8f0ae904779a50b2e18fec49e51a5661a98d8a", "title": "MRI-Based Brain Tumor Classification Using Ensemble of Deep Features and Machine Learning Classifiers", "abstract": "Brain tumor classification plays an important role in clinical diagnosis and effective treatment. In this work, we propose a method for brain tumor classification using an ensemble of deep features and machine learning classifiers. In our proposed framework, we adopt the concept of transfer learning and uses several pre-trained deep convolutional neural networks to extract deep features from brain magnetic resonance (MR) images. The extracted deep features are then evaluated by several machine learning classifiers. The top three deep features which perform well on several machine learning classifiers are selected and concatenated as an ensemble of deep features which is then fed into several machine learning classifiers to predict the final output. To evaluate the different kinds of pre-trained models as a deep feature extractor, machine learning classifiers, and the effectiveness of an ensemble of deep feature for brain tumor classification, we use three different brain magnetic resonance imaging (MRI) datasets that are openly accessible from the web. Experimental results demonstrate that an ensemble of deep features can help improving performance significantly, and in most cases, support vector machine (SVM) with radial basis function (RBF) kernel outperforms other machine learning classifiers, especially for large datasets.", "year": 2021, "referenceCount": 77, "citationCount": 74, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2837279", "name": "Jaeyong Kang"}, {"authorId": "48740398", "name": "Z. Ullah"}, {"authorId": "1969352", "name": "Jeonghwan Gwak"}]}, {"paperId": "0fc10de6129f61fb362de48ebeca1d61b9724294", "url": "https://www.semanticscholar.org/paper/0fc10de6129f61fb362de48ebeca1d61b9724294", "title": "Harnessing the power of big data: infusing the scientific method with machine learning to transform ecology", "abstract": "Most efforts to harness the power of big data for ecology and environmental sciences focus on data and metadata sharing, standardization, and accuracy. However, many scientists have not accepted the data deluge as an integral part of their research because the current scientific method is not scalable to large, complex datasets. Here, we explain how integrating a data-intensive, machine learning approach with a hypothesis-driven, mechanistic approach can lead to a novel knowledge, learning, analysis system (KLAS) for discovery and problem solving. Machine learning leads to more efficient, user-friendly analytics as the streams of data increase while hypothesis-driven decisions lead to the strategic design of experiments to fill knowledge gaps and to elucidate mechanisms. KLAS will transform ecology and environmental sciences by shortening the time lag between individual discoveries and leaps in knowledge by the scientific community, and will lead to paradigm shifts predicated on open access data and analytics in a machine learning environment.", "year": 2014, "referenceCount": 48, "citationCount": 107, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "144020586", "name": "D. Peters"}, {"authorId": "2341684", "name": "K. Havstad"}, {"authorId": "1988802", "name": "J. Cushing"}, {"authorId": "2474084", "name": "C. Tweedie"}, {"authorId": "152401643", "name": "O. Fuentes"}, {"authorId": "1402807854", "name": "Natalia Villanueva-Rosales"}]}, {"paperId": "ebcc0e71ef6a77d05e7ab064435bc2da87c55e91", "url": "https://www.semanticscholar.org/paper/ebcc0e71ef6a77d05e7ab064435bc2da87c55e91", "title": "Deep Hidden Physics Models: Deep Learning of Nonlinear Partial Differential Equations", "abstract": "A long-standing problem at the interface of artificial intelligence and applied mathematics is to devise an algorithm capable of achieving human level or even superhuman proficiency in transforming observed data into predictive mathematical models of the physical world. In the current era of abundance of data and advanced machine learning capabilities, the natural question arises: How can we automatically uncover the underlying laws of physics from high-dimensional data generated from experiments? In this work, we put forth a deep learning approach for discovering nonlinear partial differential equations from scattered and potentially noisy observations in space and time. Specifically, we approximate the unknown solution as well as the nonlinear dynamics by two deep neural networks. The first network acts as a prior on the unknown solution and essentially enables us to avoid numerical differentiations which are inherently ill-conditioned and unstable. The second network represents the nonlinear dynamics and helps us distill the mechanisms that govern the evolution of a given spatiotemporal data-set. We test the effectiveness of our approach for several benchmark problems spanning a number of scientific domains and demonstrate how the proposed framework can help us accurately learn the underlying dynamics and forecast future states of the system. In particular, we study the Burgers', Korteweg-de Vries (KdV), Kuramoto-Sivashinsky, nonlinear Schr\\\"{o}dinger, and Navier-Stokes equations.", "year": 2018, "referenceCount": 58, "citationCount": 463, "influentialCitationCount": 47, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145401977", "name": "M. Raissi"}]}, {"paperId": "2dec4f52b1ce552b416f086d4ea1040626675dfa", "url": "https://www.semanticscholar.org/paper/2dec4f52b1ce552b416f086d4ea1040626675dfa", "title": "Toward an Integration of Deep Learning and Neuroscience", "abstract": "Neuroscience has focused on the detailed implementation of computation, studying neural codes, dynamics and circuits. In machine learning, however, artificial neural networks tend to eschew precisely designed codes, dynamics or circuits in favor of brute force optimization of a cost function, often using simple and relatively uniform initial architectures. Two recent developments have emerged within machine learning that create an opportunity to connect these seemingly divergent perspectives. First, structured architectures are used, including dedicated systems for attention, recursion and various forms of short- and long-term memory storage. Second, cost functions and training procedures have become more complex and are varied across layers and over time. Here we think about the brain in terms of these ideas. We hypothesize that (1) the brain optimizes cost functions, (2) the cost functions are diverse and differ across brain locations and over development, and (3) optimization operates within a pre-structured architecture matched to the computational problems posed by behavior. In support of these hypotheses, we argue that a range of implementations of credit assignment through multiple layers of neurons are compatible with our current knowledge of neural circuitry, and that the brain's specialized systems can be interpreted as enabling efficient optimization for specific problem classes. Such a heterogeneously optimized system, enabled by a series of interacting cost functions, serves to make learning data-efficient and precisely targeted to the needs of the organism. We suggest directions by which neuroscience could seek to refine and test these hypotheses.", "year": 2016, "referenceCount": 548, "citationCount": 459, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "2367822", "name": "Adam H. Marblestone"}, {"authorId": "89504302", "name": "Greg Wayne"}, {"authorId": "3282030", "name": "Konrad Paul Kording"}]}, {"paperId": "843c1f0d1721f513cf91054a9321978536d5bd5b", "url": "https://www.semanticscholar.org/paper/843c1f0d1721f513cf91054a9321978536d5bd5b", "title": "Android HIV: A Study of Repackaging Malware for Evading Machine-Learning Detection", "abstract": "Machine learning-based solutions have been successfully employed for the automatic detection of malware on Android. However, machine learning models lack robustness to adversarial examples, which are crafted by adding carefully chosen perturbations to the normal inputs. So far, the adversarial examples can only deceive detectors that rely on syntactic features (e.g., requested permissions, API calls, etc.), and the perturbations can only be implemented by simply modifying application’s manifest. While recent Android malware detectors rely more on semantic features from Dalvik bytecode rather than manifest, existing attacking/defending methods are no longer effective. In this paper, we introduce a new attacking method that generates adversarial examples of Android malware and evades being detected by the current models. To this end, we propose a method of applying optimal perturbations onto Android APK that can successfully deceive the machine learning detectors. We develop an automated tool to generate the adversarial examples without human intervention. In contrast to existing works, the adversarial examples crafted by our method can also deceive recent machine learning-based detectors that rely on semantic features such as control-flow-graph. The perturbations can also be implemented directly onto APK’s Dalvik bytecode rather than Android manifest to evade from recent detectors. We demonstrate our attack on two state-of-the-art Android malware detection schemes, MaMaDroid and Drebin. Our results show that the malware detection rates decreased from 96% to 0% in MaMaDroid, and from 97% to 0% in Drebin, with just a small number of codes to be inserted into the APK.", "year": 2018, "referenceCount": 53, "citationCount": 133, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2117025915", "name": "Xiao Chen"}, {"authorId": "2150357175", "name": "Chaoran Li"}, {"authorId": "2860169", "name": "Derui Wang"}, {"authorId": "145018147", "name": "S. Wen"}, {"authorId": "37269546", "name": "Jun Zhang"}, {"authorId": "1681657", "name": "S. Nepal"}, {"authorId": "2068334260", "name": "Yang Xiang"}, {"authorId": "2072596749", "name": "K. Ren"}]}, {"paperId": "2e7d0c4d18eda20b3eeca8041e9b745812f31ec7", "url": "https://www.semanticscholar.org/paper/2e7d0c4d18eda20b3eeca8041e9b745812f31ec7", "title": "Large-scale automated synthesis of human functional neuroimaging data", "abstract": null, "year": 2011, "referenceCount": 72, "citationCount": 2486, "influentialCitationCount": 305, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "47835216", "name": "Tal Yarkoni"}, {"authorId": "145625277", "name": "R. Poldrack"}, {"authorId": "2358653", "name": "Thomas E. Nichols"}, {"authorId": "7549580", "name": "D. V. Van Essen"}, {"authorId": "2549424", "name": "T. Wager"}]}, {"paperId": "794e0003bb261f355f3262ae2321073288cf5e17", "url": "https://www.semanticscholar.org/paper/794e0003bb261f355f3262ae2321073288cf5e17", "title": "A review of supervised machine learning applied to ageing research", "abstract": null, "year": 2017, "referenceCount": 80, "citationCount": 83, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "144312054", "name": "F. Fabris"}, {"authorId": "144402116", "name": "J. P. Magalhães"}, {"authorId": "1683199", "name": "A. Freitas"}]}, {"paperId": "ed636bc7b976b64e7113bf219df563ce33d1cddf", "url": "https://www.semanticscholar.org/paper/ed636bc7b976b64e7113bf219df563ce33d1cddf", "title": "Identifying Customer Needs from User-Generated Content", "abstract": "We evaluate user-generated content as a source of customer needs and propose and test a machine-learning approach for identifying customer needs more efficiently.", "year": 2019, "referenceCount": 73, "citationCount": 189, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Economics"], "authors": [{"authorId": "145199190", "name": "Artem Timoshenko"}, {"authorId": "98694489", "name": "J. Hauser"}]}, {"paperId": "3e864a40b40b64ddc3a6a59af239146aabd9abd4", "url": "https://www.semanticscholar.org/paper/3e864a40b40b64ddc3a6a59af239146aabd9abd4", "title": "A review of machine learning techniques using decision tree and support vector machine", "abstract": "In this paper, the brief survey of data mining classification by using the machine learning techniques is presented. The machine learning techniques like decision tree and support vector machine play the important role in all the applications of artificial intelligence. Decision tree works efficiently with discrete data and SVM is capable of building the nonlinear boundaries among the classes. Both of these techniques have their own set of strengths which makes them suitable in almost all classification tasks.", "year": 2016, "referenceCount": 18, "citationCount": 90, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9728522", "name": "Madan Somvanshi"}, {"authorId": "115699877", "name": "Pranjali Chavan"}]}, {"paperId": "a4febe19161b1a5478fdebddedf3a564c5e44637", "url": "https://www.semanticscholar.org/paper/a4febe19161b1a5478fdebddedf3a564c5e44637", "title": "Machine-Learning-Based Coadaptive Calibration for Brain-Computer Interfaces", "abstract": "Brain-computer interfaces (BCIs) allow users to control a computer application by brain activity as acquired (e.g., by EEG). In our classic machine learning approach to BCIs, the participants undertake a calibration measurement without feedback to acquire data to train the BCI system. After the training, the user can control a BCI and improve the operation through some type of feedback. However, not all BCI users are able to perform sufficiently well during feedback operation. In fact, a nonnegligible portion of participants (estimated 1530) cannot control the system (a BCI illiteracy problem, generic to all motor-imagery-based BCIs). We hypothesize that one main difficulty for a BCI user is the transition from offline calibration to online feedback. In this work, we investigate adaptive machine learning methods to eliminate offline calibration and analyze the performance of 11 volunteers in a BCI based on the modulation of sensorimotor rhythms. We present an adaptation scheme that individually guides the user. It starts with a subject-independent classifier that evolves to a subject-optimized state-of-the-art classifier within one session while the user interacts continuously. These initial runs use supervised techniques for robust coadaptive learning of user and machine. Subsequent runs use unsupervised adaptation to track the features drift during the session and provide an unbiased measure of BCI performance. Using this approach, without any offline calibration, six users, including one novice, obtained good performance after 3 to 6 minutes of adaptation. More important, this novel guided learning also allows participants with BCI illiteracy to gain significant control with the BCI in less than 60 minutes. In addition, one volunteer without sensorimotor idle rhythm peak at the beginning of the BCI experiment developed it during the course of the session and used voluntary modulation of its amplitude to control the feedback application.", "year": 2011, "referenceCount": 49, "citationCount": 180, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1753498", "name": "C. Vidaurre"}, {"authorId": "2221418", "name": "C. Sannelli"}, {"authorId": "145034054", "name": "K. Müller"}, {"authorId": "3156886", "name": "B. Blankertz"}]}, {"paperId": "63a6bc3e0dbb8f1c0aaa6c6193330094553005ae", "url": "https://www.semanticscholar.org/paper/63a6bc3e0dbb8f1c0aaa6c6193330094553005ae", "title": "Using machine learning and GA to solve time-cost trade-off problems", "abstract": "Existing genetic algorithms (GA) based systems for solving time-cost trade-off problems suffer from two limitations. First, these systems require the user to manually craft the time-cost curves for formulating the objective functions. Second, these systems only deal with linear time-cost relationships. To overcome these limitations, this paper presents a computer system called MLGAS (Machine Learning and Genetic Algorithms based System), which integrates a machine learning method with GA. A quadratic template is introduced to capture the nonlinearity of time-cost relationships. The machine learning method automatically generates the quadratic time-cost curves from historical data and also measures the credibility of each quadratic time-cost curve. The quadratic curves are then used to formulate the objective function that can be solved by the GA. Several improvements are made to enhance the capacity of GA to prevent premature convergence. Comparisons of MLGAS with an experienced project manager indicate that MLGAS generates better solutions to nonlinear time-cost trade-off problems.", "year": 1999, "referenceCount": 30, "citationCount": 123, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "46382469", "name": "Heng Li"}, {"authorId": "73205692", "name": "Jn Cao"}, {"authorId": "81800053", "name": "P. Love"}]}, {"paperId": "e39b586e561b36a3b71fa3d9ee7cb15c35d84203", "url": "https://www.semanticscholar.org/paper/e39b586e561b36a3b71fa3d9ee7cb15c35d84203", "title": "Abusive Language Detection in Online User Content", "abstract": "Detection of abusive language in user generated online content has become an issue of increasing importance in recent years. Most current commercial methods make use of blacklists and regular expressions, however these measures fall short when contending with more subtle, less ham-fisted examples of hate speech. In this work, we develop a machine learning based method to detect hate speech on online user comments from two domains which outperforms a state-of-the-art deep learning approach. We also develop a corpus of user comments annotated for abusive language, the first of its kind. Finally, we use our detection tool to analyze abusive language over time and in different settings to further enhance our knowledge of this behavior.", "year": 2016, "referenceCount": 23, "citationCount": 837, "influentialCitationCount": 87, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3209949", "name": "Chikashi Nobata"}, {"authorId": "1739099", "name": "J. Tetreault"}, {"authorId": "2873535", "name": "A. Thomas"}, {"authorId": "2263803", "name": "Yashar Mehdad"}, {"authorId": "145882798", "name": "Yi Chang"}]}, {"paperId": "ef08bad72793f7f44edb66531d39d5153282d5aa", "url": "https://www.semanticscholar.org/paper/ef08bad72793f7f44edb66531d39d5153282d5aa", "title": "The Higgs boson machine learning challenge", "abstract": "The Higgs Boson Machine Learning Challenge (HiggsML or the Challenge for short) was organized to promote collaboration between high energy physicists and data scientists. The ATLAS experiment at CERN provided simulated data that has been used by physicists in a search for the Higgs boson. The Challenge was organized by a small group of ATLAS physicists and data scientists. It was hosted by Kaggle at https://www.kaggle. com/c/higgs-boson; the challenge data is now available on http://opendata.cern.ch/ collection/ATLAS-Higgs-Challenge-2014. This paper provides the physics background and explains the challenge setting, the challenge design, and analyzes its results.", "year": 2014, "referenceCount": 27, "citationCount": 108, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1404968468", "name": "C. Adam-Bourdarios"}, {"authorId": "146784092", "name": "G. Cowan"}, {"authorId": "144296177", "name": "Cécile Germain"}, {"authorId": "1743797", "name": "I. Guyon"}, {"authorId": "143674326", "name": "B. Kégl"}, {"authorId": "3200334", "name": "D. Rousseau"}]}, {"paperId": "8d41cf63e1455b27fad5b9299c49aaa658c0cd85", "url": "https://www.semanticscholar.org/paper/8d41cf63e1455b27fad5b9299c49aaa658c0cd85", "title": "Machine learning for heterogeneous catalyst design and discovery", "abstract": "A dvances in machine learning (ML) are making a large impact in many fields, including: artificial intelligence, materials science, and chemical engineering. Generally, ML tools learn from data to find insights or make fast predictions of target properties. Recently, ML is also greatly influencing heterogeneous catalysis research due to the availability of ML (e.g., Python Scikit-learn, TensorFlow) and workflow management tools (e.g., ASE, Atomate), the growing amount of data in materials databases (e.g., Novel Materials Discovery Laboratory, Citrination, Materials Project, CatApp), and algorithmic improvements. New catalysts are needed for sustainable chemical production, alternative energy, and pollution mitigation applications to meet the demands of our world’s rising population. It is a challenging endeavor, however, to make novel heterogeneous catalysts with good performance (i.e., stable, active, selective) because their performance depends on many properties: composition, support, surface termination, particle size, particle morphology, and atomic coordination environment. Additionally, the properties of heterogeneous catalysts can change under reaction conditions through various phenomena such as Ostwald ripening, particle disintegration, surface oxidation, and surface reconstruction. Many heterogeneous catalyst structures are disordered or amorphous in their active state, which further complicates their atomic-level characterization by modeling and experiment. Computational modeling using quantum mechanical (QM) methods such as density functional theory (DFT) can accelerate catalyst screening by enabling rapid prototyping and revealing active sites and structure-activity relations. The high computational cost of QM methods, however, limits the range of catalyst spaces that can be examined. Recent progress in merging ML with QM modeling and experiments promises to drive forward rational catalyst design. Therefore, it is timely to highlight the ability of ML tools to accelerate heterogeneous catalyst research. A key question we aim to address in this perspective is how machine learning can aid heterogeneous catalyst design and discovery. ML has been used in catalysis research since at least the 1990s. Early studies used neural networks to correlate catalyst physicochemical properties and reaction conditions with measured catalytic performance, but these studies were limited in the number of systems considered. Recently, ML has been applied to the high-throughput screening of heterogeneous catalysts and found to be predictive and applicable across a broad space of catalysts. ML algorithms such as decision trees, kernel ridge regression, neural networks, support vector machines, principal component analysis, and compressed sensing can help create predictive models of catalyst target properties, which are typically figures of merit corresponding to stability, activity, selectivity. In this perspective, we discuss various areas where ML is making an impact on heterogeneous catalysis research. ML is also aiding homogeneous catalysis research and shares many similarities (and differences) with ML for heterogeneous catalysis, but this discussion is beyond the perspective’s scope (for interested readers, see Ref. 26–28). Here, we emphasize the ability of ML combined with QM calculations to speed-up the search for optimal catalysts in combinatorial large spaces, such as alloys. ML-derived interatomic potentials for accurate and fast catalyst simulations will also be assessed, as well as the opportunity for ML to help find descriptors of catalyst performance in large datasets. The use of ML to aid transition state search algorithms (to compute reaction mechanisms) will Correspondence concerning this article should be addressed to B. R. Goldsmith at bgoldsm@umich.edu.", "year": 2018, "referenceCount": 126, "citationCount": 202, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Chemistry"], "authors": [{"authorId": "8797649", "name": "B. Goldsmith"}, {"authorId": "144292869", "name": "J. Esterhuizen"}, {"authorId": "48211311", "name": "Jin-Xun Liu"}, {"authorId": "38683639", "name": "Christopher J. Bartel"}, {"authorId": "152549861", "name": "Christopher Sutton"}]}, {"paperId": "96434a024a6dec6e238d357d2ba50b652c69eb22", "url": "https://www.semanticscholar.org/paper/96434a024a6dec6e238d357d2ba50b652c69eb22", "title": "Learning to Recognize Volcanoes on Venus", "abstract": null, "year": 1998, "referenceCount": 63, "citationCount": 90, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2511655", "name": "M. Burl"}, {"authorId": "1769909", "name": "L. Asker"}, {"authorId": "50860274", "name": "Padhraic Smyth"}, {"authorId": "1695784", "name": "U. Fayyad"}, {"authorId": "1690922", "name": "P. Perona"}, {"authorId": "103752485", "name": "L. Crumpler"}, {"authorId": "102243890", "name": "J. Aubele"}]}, {"paperId": "aba50e02e6a798e69c5c7419bca38ddaaf1c4b90", "url": "https://www.semanticscholar.org/paper/aba50e02e6a798e69c5c7419bca38ddaaf1c4b90", "title": "Label Propagation through Linear Neighborhoods", "abstract": "In many practical data mining applications such as text classification, unlabeled training examples are readily available, but labeled ones are fairly expensive to obtain. Therefore, semi supervised learning algorithms have aroused considerable interests from the data mining and machine learning fields. In recent years, graph-based semi supervised learning has been becoming one of the most active research areas in the semi supervised learning community. In this paper, a novel graph-based semi supervised learning approach is proposed based on a linear neighborhood model, which assumes that each data point can be linearly reconstructed from its neighborhood. Our algorithm, named linear neighborhood propagation (LNP), can propagate the labels from the labeled points to the whole data set using these linear neighborhoods with sufficient smoothness. A theoretical analysis of the properties of LNP is presented in this paper. Furthermore, we also derive an easy way to extend LNP to out-of-sample data. Promising experimental results are presented for synthetic data, digit, and text classification tasks.", "year": 2006, "referenceCount": 54, "citationCount": 801, "influentialCitationCount": 126, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1682816", "name": "Fei Wang"}, {"authorId": "14966740", "name": "Changshui Zhang"}]}, {"paperId": "8bd60f6ca987a107a289263a043b8e9e505fbd62", "url": "https://www.semanticscholar.org/paper/8bd60f6ca987a107a289263a043b8e9e505fbd62", "title": "Multimodal learning analytics", "abstract": "New high-frequency data collection technologies and machine learning analysis techniques could offer new insights into learning, especially in tasks in which students have ample space to generate unique, personalized artifacts, such as a computer program, a robot, or a solution to an engineering challenge. To date most of the work on learning analytics and educational data mining has focused on online courses or cognitive tutors, in which the tasks are more structured and the entirety of interaction happens in front of a computer. In this paper, I argue that multimodal learning analytics could offer new insights into students' learning trajectories, and present several examples of this work and its educational application.", "year": 2013, "referenceCount": 24, "citationCount": 230, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3181883", "name": "Paulo Blikstein"}]}, {"paperId": "be0928f3c3bcef54c5ed966a97bd11ec1ab731c6", "url": "https://www.semanticscholar.org/paper/be0928f3c3bcef54c5ed966a97bd11ec1ab731c6", "title": "Genome scale enzyme-metabolite and drug-target interaction predictions using the signature molecular descriptor", "abstract": "MOTIVATION\nIdentifying protein enzymatic or pharmacological activities are important areas of research in biology and chemistry. Biological and chemical databases are increasingly being populated with linkages between protein sequences and chemical structures. There is now sufficient information to apply machine-learning techniques to predict interactions between chemicals and proteins at a genome scale. Current machine-learning techniques use as input either protein sequences and structures or chemical information. We propose here a method to infer protein-chemical interactions using heterogeneous input consisting of both protein sequence and chemical information.\n\n\nRESULTS\nOur method relies on expressing proteins and chemicals with a common cheminformatics representation. We demonstrate our approach by predicting whether proteins can catalyze reactions not present in training sets. We also predict whether a given drug can bind a target, in the absence of prior binding information for that drug and target. Such predictions cannot be made with current machine-learning techniques requiring binding information for individual reactions or individual targets.", "year": 2008, "referenceCount": 40, "citationCount": 152, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine", "Computer Science"], "authors": [{"authorId": "6324301", "name": "J. Faulon"}, {"authorId": "2224433", "name": "M. Misra"}, {"authorId": "144002883", "name": "Shawn Martin"}, {"authorId": "2034600", "name": "K. Sale"}, {"authorId": "2925632", "name": "R. Sapra"}]}, {"paperId": "100a038fdf29b4b20801887f0ec40e3f10d9a4f9", "url": "https://www.semanticscholar.org/paper/100a038fdf29b4b20801887f0ec40e3f10d9a4f9", "title": "One shot learning of simple visual concepts", "abstract": "One shot learning of simple visual concepts Brenden M. Lake, Ruslan Salakhutdinov, Jason Gross, and Joshua B. Tenenbaum Department of Brain and Cognitive Sciences Massachusetts Institute of Technology Abstract People can learn visual concepts from just one example, but it remains a mystery how this is accomplished. Many authors have proposed that transferred knowledge from more familiar concepts is a route to one shot learning, but what is the form of this abstract knowledge? One hypothesis is that the shar- ing of parts is core to one shot learning, and we evaluate this idea in the domain of handwritten characters, using a massive new dataset. These simple visual concepts have a rich inter- nal part structure, yet they are particularly tractable for com- putational models. We introduce a generative model of how characters are composed from strokes, where knowledge from previous characters helps to infer the latent strokes in novel characters. The stroke model outperforms a competing state- of-the-art character model on a challenging one shot learning task, and it provides a good fit to human perceptual data. Keywords: category learning; transfer learning; Bayesian modeling; neural networks Figure 1: Test yourself on one shot learning. From the example boxed in red, can you find the others in the array? On the left is a Segway and on the right is the first character of the Bengali alphabet. Answer for the Bengali character: Row 2, Column 3; Row 4, Column 2. A hallmark of human cognition is learning from just a few examples. For instance, a person only needs to see one Seg- way to acquire the concept and be able to discriminate future Segways from other vehicles like scooters and unicycles (Fig. 1 left). Similarly, children can acquire a new word from one encounter (Carey & Bartlett, 1978). How is one shot learning possible? New concepts are almost never learned in a vacuum. Past experience with other concepts in a domain can support the rapid learning of novel concepts, by showing the learner what matters for generalization. Many authors have suggested this as a route to one shot learning: transfer of abstract knowledge from old to new concepts, often called transfer learning, rep- resentation learning, or learning to learn. But what is the nature of the learned abstract knowledge that lets humans ac- quire new object concepts so quickly? The most straightforward proposals invoke attentional learning (Smith, Jones, Landau, Gershkoff-Stowe, & Samuel- son, 2002) or overhypotheses (Kemp, Perfors, & Tenenbaum, 2007; Dewar & Xu, in press), like the shape bias in word learning. Prior experience with concepts that are clearly orga- nized along one dimension (e.g., shape, as opposed to color or material) draws a learner’s attention to that same dimension (Smith et al., 2002) – or increases the prior probability of new concepts concentrating on that same dimension (Kemp et al., 2007). But this approach is limited since it requires that the relevant dimensions of similarity be defined in advance. For many real-world concepts, the relevant dimensions of similarity may be constructed in the course of learning to learn. For instance, when we first see a Segway, we may parse it into a structure of familiar parts arranged in a novel configuration: it has two wheels, connected by a platform, supporting a motor and a central post at the top of which are two handlebars. These parts and their relations comprise a Figure 2: Examples from a new 1600 character database. useful representational basis for many different vehicle and artifact concepts – a representation that is likely learned in the course of learning the concepts that they support. Several papers from the recent machine learning and computer vision literature argue for such an approach: joint learning of many concepts and a high-level part vocabulary that underlies those concepts (e.g., Torralba, Murphy, & Freeman, 2007; Fei-Fei, Fergus, & Perona, 2006). Another recently popular machine learning approach is based on deep learning (Salakhutdinov & Hinton, 2009): unsupervised learning of hierarchies of dis- tributed feature representations in neural-network-style prob- abilistic generative models. These models do not specify ex- plicit parts and structural relations, but they can still construct meaningful representations of what makes two objects deeply similar that go substantially beyond low-level image features. These approaches from machine learning may be com- pelling ways to understand how humans learn so quickly, but there is little experimental evidence that directly supports them. Models that construct parts or features from sensory data (pixels) while learning object concepts have been tested in elegant behavioral experiments with very simple stimuli and a very small number of concepts (Austerweil & Griffiths, 2009; Schyns, Goldstone, & Thibaut, 1998). But there have been few systematic comparisons of multiple state-of-the-art computational approaches to representation learning with hu-", "year": 2011, "referenceCount": 20, "citationCount": 674, "influentialCitationCount": 101, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2373318", "name": "B. Lake"}, {"authorId": "145124475", "name": "R. Salakhutdinov"}, {"authorId": "145372150", "name": "Jason Gross"}, {"authorId": "1763295", "name": "J. Tenenbaum"}]}, {"paperId": "57619d0962814f38a447fe9e26e8bcc74b5fc1bb", "url": "https://www.semanticscholar.org/paper/57619d0962814f38a447fe9e26e8bcc74b5fc1bb", "title": "Combining human and machine intelligence in large-scale crowdsourcing", "abstract": "We show how machine learning and inference can be harnessed to leverage the complementary strengths of humans and computational agents to solve crowdsourcing tasks. We construct a set of Bayesian predictive models from data and describe how the models operate within an overall crowd-sourcing architecture that combines the efforts of people and machine vision on the task of classifying celestial bodies defined within a citizens' science project named Galaxy Zoo. We show how learned probabilistic models can be used to fuse human and machine contributions and to predict the behaviors of workers. We employ multiple inferences in concert to guide decisions on hiring and routing workers to tasks so as to maximize the efficiency of large-scale crowdsourcing processes based on expected utility.", "year": 2012, "referenceCount": 16, "citationCount": 374, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1783184", "name": "Ece Kamar"}, {"authorId": "21748312", "name": "Severin Hacker"}, {"authorId": "145479841", "name": "E. Horvitz"}]}, {"paperId": "5f4f970e18c09aafeafaeb42d729ca243f811db0", "url": "https://www.semanticscholar.org/paper/5f4f970e18c09aafeafaeb42d729ca243f811db0", "title": "Learning to Rank for Information Retrieval and Natural Language Processing", "abstract": "Learning to rank refers to machine learning techniques for training the model in a ranking task. Learning to rank is useful for many applications in information retrieval, natural language processing, and data mining. Intensive studies have been conducted on the problem recently and significant progress has been made. This lecture gives an introduction to the area including the fundamental problems, existing approaches, theories, applications, and future work. The author begins by showing that various ranking problems in information retrieval and natural language processing can be formalized as two basic ranking tasks, namely ranking creation (or simply ranking) and ranking aggregation. In ranking creation, given a request, one wants to generate a ranking list of offerings based on the features derived from the request and the offerings. In ranking aggregation, given a request, as well as a number of ranking lists of offerings, one wants to generate a new ranking list of the offerings. Ranking creation (or ranking) is the major problem in learning to rank. It is usually formalized as a supervised learning task. The author gives detailed explanations on learning for ranking creation and ranking aggregation, including training and testing, evaluation, feature creation, and major approaches. Many methods have been proposed for ranking creation. The methods can be categorized as the pointwise, pairwise, and listwise approaches according to the loss functions they employ. They can also be categorized according to the techniques they employ, such as the SVM based, Boosting SVM, Neural Network based approaches. The author also introduces some popular learning to rank methods in details. These include PRank, OC SVM, Ranking SVM, IR SVM, GBRank, RankNet, LambdaRank, ListNet & ListMLE, AdaRank, SVM MAP, SoftRank, Borda Count, Markov Chain, and CRanking. The author explains several example applications of learning to rank including web search, collaborative filtering, definition search, keyphrase extraction, query dependent summarization, and re-ranking in machine translation. A formulation of learning for ranking creation is given in the statistical learning framework. Ongoing and future research directions for learning to rank are also discussed. Table of Contents: Introduction / Learning for Ranking Creation / Learning for Ranking Aggregation / Methods of Learning to Rank / Applications of Learning to Rank / Theory of Learning to Rank / Ongoing and Future Work", "year": 2011, "referenceCount": 166, "citationCount": 367, "influentialCitationCount": 43, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49404233", "name": "Hang Li"}]}, {"paperId": "83d4b94527cb0bf9519f0fdd1f3b643c7f98a408", "url": "https://www.semanticscholar.org/paper/83d4b94527cb0bf9519f0fdd1f3b643c7f98a408", "title": "Detection and classification of micro-grid faults based on HHT and machine learning techniques", "abstract": "This study presents a novel micro-grid protection scheme based on Hilbert-Huang transform (HHT) and machine learning techniques. Initialisation of the proposed approach is done by extracting the three-phase current signals at the targeted buses of different feeders. The obtained non-stationary signals are passed through the empirical mode decomposition method to extract different intrinsic mode functions (IMFs). In the next step using HHT to the selected IMFs component, different needful differential features are computed. The extracted features are further used as an input vector to the machine learning models to classify the fault events. The proposed micro-grid protection scheme is tested for different protection scenarios, such as the type of fault (symmetrical, asymmetrical and high impedance fault), micro-grid structure (radial and mesh) and mode of operation (islanded and grid connected) and so on. Three different machine learning models are tested and compared in this framework: Naive Bayes classifier, support vector machine and extreme learning machine. The extensive simulated results from a standard IEC micro-grid model prove the effectiveness and reliability of the proposed micro-grid protection scheme.", "year": 2017, "referenceCount": 25, "citationCount": 114, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9736746", "name": "Manohar Mishra"}, {"authorId": "34851668", "name": "P. Rout"}]}, {"paperId": "064cd41d323441209ce1484a9bba02a22b625088", "url": "https://www.semanticscholar.org/paper/064cd41d323441209ce1484a9bba02a22b625088", "title": "Selective Transfer Machine for Personalized Facial Action Unit Detection", "abstract": "Automatic facial action unit (AFA) detection from video is a long-standing problem in facial expression analysis. Most approaches emphasize choices of features and classifiers. They neglect individual differences in target persons. People vary markedly in facial morphology (e.g., heavy versus delicate brows, smooth versus deeply etched wrinkles) and behavior. Individual differences can dramatically influence how well generic classifiers generalize to previously unseen persons. While a possible solution would be to train person-specific classifiers, that often is neither feasible nor theoretically compelling. The alternative that we propose is to personalize a generic classifier in an unsupervised manner (no additional labels for the test subjects are required). We introduce a transductive learning method, which we refer to Selective Transfer Machine (STM), to personalize a generic classifier by attenuating person-specific biases. STM achieves this effect by simultaneously learning a classifier and re-weighting the training samples that are most relevant to the test subject. To evaluate the effectiveness of STM, we compared STM to generic classifiers and to cross-domain learning methods in three major databases: CK+, GEMEP-FERA and RU-FACS. STM outperformed generic classifiers in all.", "year": 2013, "referenceCount": 40, "citationCount": 274, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "39336289", "name": "Wen-Sheng Chu"}, {"authorId": "143867160", "name": "F. D. L. Torre"}, {"authorId": "1737918", "name": "J. Cohn"}]}]}