{"total": 5120627, "offset": 2800, "next": 2900, "data": [{"paperId": "f6227e4c1caf47da99955b61253984bfbb0eddf8", "url": "https://www.semanticscholar.org/paper/f6227e4c1caf47da99955b61253984bfbb0eddf8", "title": "Benchmark Data Set for in Silico Prediction of Ames Mutagenicity", "abstract": "Up to now, publicly available data sets to build and evaluate Ames mutagenicity prediction tools have been very limited in terms of size and chemical space covered. In this report we describe a new unique public Ames mutagenicity data set comprising about 6500 nonconfidential compounds (available as SMILES strings and SDF) together with their biological activity. Three commercial tools (DEREK, MultiCASE, and an off-the-shelf Bayesian machine learner in Pipeline Pilot) are compared with four noncommercial machine learning implementations (Support Vector Machines, Random Forests, k-Nearest Neighbors, and Gaussian Processes) on the new benchmark data set.", "year": 2009, "referenceCount": 8, "citationCount": 241, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "39960184", "name": "K. Hansen"}, {"authorId": "2459012", "name": "S. Mika"}, {"authorId": "34954622", "name": "T. Schroeter"}, {"authorId": "2079588955", "name": "A. Sutter"}, {"authorId": "14270207", "name": "A. T. Laak"}, {"authorId": "1390062673", "name": "T. Steger-Hartmann"}, {"authorId": "34305015", "name": "N. Heinrich"}, {"authorId": "145034054", "name": "K. Müller"}]}, {"paperId": "56453a88588732bbb9975166e019b052c4fcc0a7", "url": "https://www.semanticscholar.org/paper/56453a88588732bbb9975166e019b052c4fcc0a7", "title": "Estimating crop yields with deep learning and remotely sensed data", "abstract": "This paper describes Illinois corn yield estimation using deep learning and another machine learning, SVR. Deep learning is a technique that has been attracting attention in recent years of machine learning, it is possible to implement using the Caffe. High accuracy estimation of crop yield is very important from the viewpoint of food security. However, since every country prepare data inhomogeneously, the implementation of the crop model in all regions is difficult. Deep learning is possible to extract important features for estimating the object from the input data, so it can be expected to reduce dependency of input data. The network model of two InnerProductLayer was the best algorithm in this study, achieving RMSE of 6.298 (standard value). This study highlights the advantages of deep learning for agricultural yield estimating.", "year": 2015, "referenceCount": 13, "citationCount": 137, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46944179", "name": "Kentaro Kuwata"}, {"authorId": "1721111", "name": "R. Shibasaki"}]}, {"paperId": "4467bf31acec51141c4cb799e6cebbb8ef7150ec", "url": "https://www.semanticscholar.org/paper/4467bf31acec51141c4cb799e6cebbb8ef7150ec", "title": "Adoption of Machine Learning Techniques in Ecology and Earth Science", "abstract": "The natural sciences, such as ecology and earth science, study complex interactions between biotic and abiotic systems in order to infer understanding and make predictions. Machine-learning-based methods have an advantage over traditional statistical methods in studying these systems because the former do not impose unrealistic assumptions (such as linearity), are capable of inferring missing data, and can reduce long-term expert annotation burden. Thus, a wider adoption of machine learning methods in ecology and earth science has the potential to greatly accelerate the pace and quality of science. Despite these advantages, machine learning techniques have not had wide spread adoption in ecology and earth science. This is largely due to 1) a lack of communication and collaboration between the machine learning research community and natural scientists, 2) a lack of easily accessible tools and services, and 3) the requirement for a robust training and test data set. These impediments can be overcome through financial support for collaborative work and the development of tools and services facilitating ML use. Natural scientists who have not yet used machine learning methods can be introduced to these techniques through Random Forest, a method that is easy to implement and performs well. This manuscript will 1) briefly describe several popular ML methods and their application to ecology and earth science, 2) discuss why ML methods are underutilized in natural science, and 3) propose solutions for barriers preventing wider ML adoption.", "year": 2016, "referenceCount": 230, "citationCount": 91, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2058930", "name": "A. Thessen"}]}, {"paperId": "d6a250c3e01003240b309ed78f20551e41521896", "url": "https://www.semanticscholar.org/paper/d6a250c3e01003240b309ed78f20551e41521896", "title": "Layered Learning", "abstract": null, "year": 2000, "referenceCount": 29, "citationCount": 167, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144848112", "name": "P. Stone"}, {"authorId": "1956361", "name": "M. Veloso"}]}, {"paperId": "0d678ce457ad13e0d13a96cd502cc9da0ae95dcd", "url": "https://www.semanticscholar.org/paper/0d678ce457ad13e0d13a96cd502cc9da0ae95dcd", "title": "Experimental Machine Learning of Quantum States.", "abstract": "Quantum information technologies provide promising applications in communication and computation, while machine learning has become a powerful technique for extracting meaningful structures in \"big data.\" A crossover between quantum information and machine learning represents a new interdisciplinary area stimulating progress in both fields. Traditionally, a quantum state is characterized by quantum-state tomography, which is a resource-consuming process when scaled up. Here we experimentally demonstrate a machine-learning approach to construct a quantum-state classifier for identifying the separability of quantum states. We show that it is possible to experimentally train an artificial neural network to efficiently learn and classify quantum states, without the need of obtaining the full information of the states. We also show how adding a hidden layer of neurons to the neural network can significantly boost the performance of the state classifier. These results shed new light on how classification of quantum states can be achieved with limited resources, and represent a step towards machine-learning-based applications in quantum information processing.", "year": 2017, "referenceCount": 47, "citationCount": 93, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Physics", "Computer Science"], "authors": [{"authorId": "2111014047", "name": "Jun Gao"}, {"authorId": "6891618", "name": "Lu-Feng Qiao"}, {"authorId": "66183707", "name": "Zhi-Qiang Jiao"}, {"authorId": "2109387083", "name": "Yue-Chi Ma"}, {"authorId": "50989843", "name": "Cheng-Qiu Hu"}, {"authorId": "51012274", "name": "Ruo-Jing Ren"}, {"authorId": "8026905", "name": "Ai-Lin Yang"}, {"authorId": "2109238434", "name": "Hao Tang"}, {"authorId": "145666876", "name": "M. Yung"}, {"authorId": "3398360", "name": "Xian-min Jin"}]}, {"paperId": "330dda431e0343a96f9d630a0b4ee526bd93ad11", "url": "https://www.semanticscholar.org/paper/330dda431e0343a96f9d630a0b4ee526bd93ad11", "title": "Domain Adaptation for Visual Applications: A Comprehensive Survey", "abstract": "The aim of this paper is to give an overview of domain adaptation and transfer learning with a specific view on visual applications. After a general motivation, we first position domain adaptation in the larger transfer learning problem. Second, we try to address and analyze briefly the state-of-the-art methods for different types of scenarios, first describing the historical shallow methods, addressing both the homogeneous and the heterogeneous domain adaptation methods. Third, we discuss the effect of the success of deep convolutional architectures which led to new type of domain adaptation methods that integrate the adaptation within the deep architecture. Fourth, we overview the methods that go beyond image categorization, such as object detection or image segmentation, video analyses or learning visual attributes. Finally, we conclude the paper with a section where we relate domain adaptation to other machine learning solutions.", "year": 2017, "referenceCount": 286, "citationCount": 373, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1808423", "name": "G. Csurka"}]}, {"paperId": "1683ffc189d16b616131c300f45af87602d211f7", "url": "https://www.semanticscholar.org/paper/1683ffc189d16b616131c300f45af87602d211f7", "title": "Fast context-aware recommendations with factorization machines", "abstract": "The situation in which a choice is made is an important information for recommender systems. Context-aware recommenders take this information into account to make predictions. So far, the best performing method for context-aware rating prediction in terms of predictive accuracy is Multiverse Recommendation based on the Tucker tensor factorization model. However this method has two drawbacks: (1) its model complexity is exponential in the number of context variables and polynomial in the size of the factorization and (2) it only works for categorical context variables. On the other hand there is a large variety of fast but specialized recommender methods which lack the generality of context-aware methods. We propose to apply Factorization Machines (FMs) to model contextual information and to provide context-aware rating predictions. This approach results in fast context-aware recommendations because the model equation of FMs can be computed in linear time both in the number of context variables and the factorization size. For learning FMs, we develop an iterative optimization method that analytically finds the least-square solution for one parameter given the other ones. Finally, we show empirically that our approach outperforms Multiverse Recommendation in prediction quality and runtime.", "year": 2011, "referenceCount": 21, "citationCount": 525, "influentialCitationCount": 43, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2843982", "name": "Steffen Rendle"}, {"authorId": "2382247", "name": "Zeno Gantner"}, {"authorId": "1825333", "name": "C. Freudenthaler"}, {"authorId": "1388781075", "name": "L. Schmidt-Thieme"}]}, {"paperId": "9a28e015836560996fe1e406891eeee11a3449c1", "url": "https://www.semanticscholar.org/paper/9a28e015836560996fe1e406891eeee11a3449c1", "title": "Machine learning for spoken dialogue systems", "abstract": "During the last decade, research in the field of Spoken Dialogue Systems (SDS) has experienced increasing growth. However, the design and optimization of SDS is not only about combin- ing speech and language processing systems such as Automatic Speech Recognition (ASR), parsers, Natural Language Gener- ation (NLG), and Text-to-Speech (TTS) synthesis systems. It also requires the development of dialogue strategies taking at least into account the performances of these subsystems (and others), the nature of the task (e.g. form filling, tutoring, robot control, or database search/browsing), and the user's behaviour (e.g. cooperativeness, expertise). Due to the great variability of these factors, reuse of previous hand-crafted designs is also made very difficult. For these reasons, statistical machine learn- ing (ML) methods applied to automatic SDS optimization have been a leading research area for the last few years. In this paper, we provide a short review of the field and of recent advances.", "year": 2007, "referenceCount": 42, "citationCount": 126, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1782798", "name": "Oliver Lemon"}, {"authorId": "1721354", "name": "O. Pietquin"}]}, {"paperId": "700dd2b620c12b06ba47225752b300c2c8d8c31f", "url": "https://www.semanticscholar.org/paper/700dd2b620c12b06ba47225752b300c2c8d8c31f", "title": "Learning to Discover Social Circles in Ego Networks", "abstract": "Our personal social networks are big and cluttered, and currently there is no good way to organize them. Social networking sites allow users to manually categorize their friends into social circles (e.g. 'circles' on Google+, and 'lists' on Facebook and Twitter), however they are laborious to construct and must be updated whenever a user's network grows. We define a novel machine learning task of identifying users' social circles. We pose the problem as a node clustering problem on a user's ego-network, a network of connections between her friends. We develop a model for detecting circles that combines network structure as well as user profile information. For each circle we learn its members and the circle-specific user profile similarity metric. Modeling node membership to multiple circles allows us to detect overlapping as well as hierarchically nested circles. Experiments show that our model accurately identifies circles on a diverse set of data from Facebook, Google+, and Twitter for all of which we obtain hand-labeled ground-truth.", "year": 2012, "referenceCount": 40, "citationCount": 1403, "influentialCitationCount": 146, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35660011", "name": "Julian McAuley"}, {"authorId": "1702139", "name": "J. Leskovec"}]}, {"paperId": "a1abe16a6bc50b1e06e0a23282105db367854188", "url": "https://www.semanticscholar.org/paper/a1abe16a6bc50b1e06e0a23282105db367854188", "title": "Combinatorial screening for new materials in unconstrained composition space with machine learning", "abstract": "Typically, computational screens for new materials sharply constrain the compositional search space, structural search space, or both, for the sake of tractability. To lift these constraints, we construct a machine learning model from a database of thousands of density functional theory (DFT) calculations. The resulting model can predict the thermodynamic stability of arbitrary compositions without any other input and with six orders of magnitude less computer time than DFT. We use this model to scan roughly 1.6 million candidate compositions for novel ternary compounds (AxByCz), and predict 4500 new stable materials. Our method can be readily applied to other descriptors of interest to accelerate domain-specific materials discovery.", "year": 2014, "referenceCount": 54, "citationCount": 433, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "8839934", "name": "B. Meredig"}, {"authorId": "2075308233", "name": "Amit Agrawal"}, {"authorId": "8407652", "name": "S. Kirklin"}, {"authorId": "39280442", "name": "J. Saal"}, {"authorId": "1907763", "name": "J. Doak"}, {"authorId": "2117429617", "name": "Alan J Thompson"}, {"authorId": "2119017058", "name": "Kunpeng Zhang"}, {"authorId": "143975793", "name": "A. Choudhary"}, {"authorId": "2088553", "name": "C. Wolverton"}]}, {"paperId": "b208cff55a44f9daa82972f81690be29a2677e2d", "url": "https://www.semanticscholar.org/paper/b208cff55a44f9daa82972f81690be29a2677e2d", "title": "A Differentiable Programming System to Bridge Machine Learning and Scientific Computing", "abstract": "Scientific computing is increasingly incorporating the advancements in machine learning and the ability to work with large amounts of data. At the same time, machine learning models are becoming increasingly sophisticated and exhibit many features often seen in scientific computing, stressing the capabilities of machine learning frameworks. Just as the disciplines of scientific computing and machine learning have shared common underlying infrastructure in the form of numerical linear algebra, we now have the opportunity to further share new computational infrastructure, and thus ideas, in the form of Differentiable Programming. We describe Zygote, a Differentiable Programming system that is able to take gradients of general program structures. We implement this system in the Julia programming language. Our system supports almost all language constructs (control flow, recursion, mutation, etc.) and compiles high-performance code without requiring any user intervention or refactoring to stage computations. This enables an expressive programming model for deep learning, but more importantly, it enables us to incorporate a large ecosystem of libraries in our models in a straightforward way. We discuss our approach to automatic differentiation, including its support for advanced techniques such as mixed-mode, complex and checkpointed differentiation, and present several examples of differentiating programs.", "year": 2019, "referenceCount": 50, "citationCount": 107, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34289387", "name": "Mike Innes"}, {"authorId": "144397527", "name": "A. Edelman"}, {"authorId": "47247177", "name": "Keno Fischer"}, {"authorId": "150956309", "name": "C. Rackauckas"}, {"authorId": "2377846", "name": "Elliot Saba"}, {"authorId": "2543935", "name": "Viral B. Shah"}, {"authorId": "90684986", "name": "Will Tebbutt"}]}, {"paperId": "fba9a5e5c03854c14e1df481c4e8e8e5a276c47a", "url": "https://www.semanticscholar.org/paper/fba9a5e5c03854c14e1df481c4e8e8e5a276c47a", "title": "Medical Entity Recognition: A Comparaison of Semantic and Statistical Methods", "abstract": "Medical Entity Recognition is a crucial step towards efficient medical texts analysis. In this paper we present and compare three methods based on domain-knowledge and machine-learning techniques. We study two research directions through these approaches: (i) a first direction where noun phrases are extracted in a first step with a chunker before the final classification step and (ii) a second direction where machine learning techniques are used to identify simultaneously entities boundaries and categories. Each of the presented approaches is tested on a standard corpus of clinical texts. The obtained results show that the hybrid approach based on both machine learning and domain knowledge obtains the best performance.", "year": 2011, "referenceCount": 23, "citationCount": 103, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2205800", "name": "Asma Ben Abacha"}, {"authorId": "3232546", "name": "Pierre Zweigenbaum"}]}, {"paperId": "92ab9599524eccd753a5d5300f4001d13c543ce3", "url": "https://www.semanticscholar.org/paper/92ab9599524eccd753a5d5300f4001d13c543ce3", "title": "An Introduction to Machine Learning Communications Systems", "abstract": "We introduce and motivate machine learning (ML) communications systems that aim to improve on and to even replace the vast expert knowledge in the field of communications using modern machine learning techniques. These have recently achieved breakthroughs in many different domains, but not yet in communications. By interpreting a communications system as an autoencoder, we develop a fundamental new way to think about radio communications system design as an end-to-end reconstruction optimization task that seeks to jointly optimize transmitter and receiver components in a single process. We further present the concept of Radio Transformer Networks (RTNs) as a means to incorporate expert domain knowledge in the ML model and study the application of convolutional neural networks (CNNs) on raw IQ time-series data for modulation classification. We conclude the paper with a deep discussion of open challenges and areas for future investigation.", "year": 2017, "referenceCount": 52, "citationCount": 95, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1388350203", "name": "Tim O'Shea"}, {"authorId": "1749686", "name": "J. Hoydis"}]}, {"paperId": "ede72940ae0246a292d644bd3c7e0ebf1e12a01a", "url": "https://www.semanticscholar.org/paper/ede72940ae0246a292d644bd3c7e0ebf1e12a01a", "title": "Opportunities and Challenges for Machine Learning in Materials Science", "abstract": "Advances in machine learning have impacted myriad areas of materials science, such as the discovery of novel materials and the improvement of molecular simulations, with likely many more important developments to come. Given the rapid changes in this field, it is challenging to understand both the breadth of opportunities and the best practices for their use. In this review, we address aspects of both problems by providing an overview of the areas in which machine learning has recently had significant impact in materials science, and then we provide a more detailed discussion on determining the accuracy and domain of applicability of some common types of machine learning models. Finally, we discuss some opportunities and challenges for the materials community to fully utilize the capabilities of machine learning.", "year": 2020, "referenceCount": 248, "citationCount": 79, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science", "Physics"], "authors": [{"authorId": "79150910", "name": "D. Morgan"}, {"authorId": "46940104", "name": "R. Jacobs"}]}, {"paperId": "d395c7b8d43faaa37d69506cad18eb6ec58e26d7", "url": "https://www.semanticscholar.org/paper/d395c7b8d43faaa37d69506cad18eb6ec58e26d7", "title": "A novel method for protein secondary structure prediction using dual‐layer SVM and profiles", "abstract": "A high‐performance method was developed for protein secondary structure prediction based on the dual‐layer support vector machine (SVM) and position‐specific scoring matrices (PSSMs). SVM is a new machine learning technology that has been successfully applied in solving problems in the field of bioinformatics. The SVM's performance is usually better than that of traditional machine learning approaches. The performance was further improved by combining PSSM profiles with the SVM analysis. The PSSMs were generated from PSI‐BLAST profiles, which contain important evolution information. The final prediction results were generated from the second SVM layer output. On the CB513 data set, the three‐state overall per‐residue accuracy, Q3, reached 75.2%, while segment overlap (SOV) accuracy increased to 80.0%. On the CB396 data set, the Q3 of our method reached 74.0% and the SOV reached 78.1%. A web server utilizing the method has been constructed and is available at http://www.bioinfo.tsinghua.edu.cn/pmsvm. Proteins 2004;00:000–000. © 2004 Wiley‐Liss, Inc.", "year": 2004, "referenceCount": 30, "citationCount": 195, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "50115727", "name": "Jian Guo"}, {"authorId": "2108276437", "name": "Hu Chen"}, {"authorId": "2300991", "name": "Zhirong Sun"}, {"authorId": "2153417", "name": "Yuanlie Lin"}]}, {"paperId": "e377d9dd1eefa68f826261d82cb10665e04fe034", "url": "https://www.semanticscholar.org/paper/e377d9dd1eefa68f826261d82cb10665e04fe034", "title": "Accelerating crystal structure prediction by machine-learning interatomic potentials with active learning", "abstract": "We propose a methodology for crystal structure prediction that is based on the evolutionary algorithm USPEX and the machine-learning interatomic potentials actively learning on-the-fly. Our methodology allows for an automated construction of an interatomic interaction model from scratch, replacing the expensive density functional theory (DFT) and giving a speedup of several orders of magnitude. Predicted low-energy structures are then tested on DFT, ensuring that our machine-learning model does not introduce any prediction error. We tested our methodology on prediction of crystal structures of carbon, high-pressure phases of sodium, and boron allotropes, including those that have more than 100 atoms in the primitive cell. All the the main allotropes have been reproduced, and a hitherto unknown 54-atom structure of boron has been predicted with very modest computational effort.", "year": 2018, "referenceCount": 89, "citationCount": 134, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "51019270", "name": "E. Podryabinkin"}, {"authorId": "2144661717", "name": "E. Tikhonov"}, {"authorId": "2810901", "name": "A. Shapeev"}, {"authorId": "1793507", "name": "A. Oganov"}]}, {"paperId": "ab3a1407179e67f18f81497f915d1b010a552092", "url": "https://www.semanticscholar.org/paper/ab3a1407179e67f18f81497f915d1b010a552092", "title": "A Survey on Behavior Recognition Using WiFi Channel State Information", "abstract": "In this article, we present a survey of recent advances in passive human behavior recognition in indoor areas using the channel state information (CSI) of commercial WiFi systems. The movement of the human body parts cause changes in the wireless signal reflections, which result in variations in the CSI. By analyzing the data streams of CSIs for different activities and comparing them against stored models, human behavior can be recognized. This is done by extracting features from CSI data streams and using machine learning techniques to build models and classifiers. The techniques from the literature that are presented herein have great performance; however, instead of the machine learning techniques employed in these works, we propose to use deep learning techniques such as long-short term memory (LSTM) recurrent neural networking (RNN) and show the improved performance. We also discuss different challenges such as environment change, frame rate selection, and the multi-user scenario; and finally suggest possible directions for future work.", "year": 2017, "referenceCount": 14, "citationCount": 203, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1732890", "name": "Siamak Yousefi"}, {"authorId": "32062191", "name": "H. Narui"}, {"authorId": "2494634", "name": "Sankalp Dayal"}, {"authorId": "2490652", "name": "S. Ermon"}, {"authorId": "1742726", "name": "S. Valaee"}]}, {"paperId": "3bcdf9cc129d6e39d9ede590672b3f1ad41acd49", "url": "https://www.semanticscholar.org/paper/3bcdf9cc129d6e39d9ede590672b3f1ad41acd49", "title": "An explainable deep machine vision framework for plant stress phenotyping", "abstract": "Significance Plant stress identification based on visual symptoms has predominately remained a manual exercise performed by trained pathologists, primarily due to the occurrence of confounding symptoms. However, the manual rating process is tedious, is time-consuming, and suffers from inter- and intrarater variabilities. Our work resolves such issues via the concept of explainable deep machine learning to automate the process of plant stress identification, classification, and quantification. We construct a very accurate model that can not only deliver trained pathologist-level performance but can also explain which visual symptoms are used to make predictions. We demonstrate that our method is applicable to a large variety of biotic and abiotic stresses and is transferable to other imaging conditions and plants. Current approaches for accurate identification, classification, and quantification of biotic and abiotic stresses in crop research and production are predominantly visual and require specialized training. However, such techniques are hindered by subjectivity resulting from inter- and intrarater cognitive variability. This translates to erroneous decisions and a significant waste of resources. Here, we demonstrate a machine learning framework’s ability to identify and classify a diverse set of foliar stresses in soybean [Glycine max (L.) Merr.] with remarkable accuracy. We also present an explanation mechanism, using the top-K high-resolution feature maps that isolate the visual symptoms used to make predictions. This unsupervised identification of visual symptoms provides a quantitative measure of stress severity, allowing for identification (type of foliar stress), classification (low, medium, or high stress), and quantification (stress severity) in a single framework without detailed symptom annotation by experts. We reliably identified and classified several biotic (bacterial and fungal diseases) and abiotic (chemical injury and nutrient deficiency) stresses by learning from over 25,000 images. The learned model is robust to input image perturbations, demonstrating viability for high-throughput deployment. We also noticed that the learned model appears to be agnostic to species, seemingly demonstrating an ability of transfer learning. The availability of an explainable model that can consistently, rapidly, and accurately identify and quantify foliar stresses would have significant implications in scientific research, plant breeding, and crop production. The trained model could be deployed in mobile platforms (e.g., unmanned air vehicles and automated ground scouts) for rapid, large-scale scouting or as a mobile application for real-time detection of stress by farmers and researchers.", "year": 2018, "referenceCount": 22, "citationCount": 272, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "34892652", "name": "Sambuddha Ghosal"}, {"authorId": "47998550", "name": "David Blystone"}, {"authorId": "152395021", "name": "Asheesh K Singh"}, {"authorId": "3042938", "name": "B. Ganapathysubramanian"}, {"authorId": "1712215532", "name": "Arti Singh"}, {"authorId": "144016196", "name": "S. Sarkar"}]}, {"paperId": "20966ec8b64dd7b713873c3a13e3d8e25d1d833f", "url": "https://www.semanticscholar.org/paper/20966ec8b64dd7b713873c3a13e3d8e25d1d833f", "title": "Land-Use Land-Cover Classification by Machine Learning Classifiers for Satellite Observations - A Review", "abstract": "Rapid and uncontrolled population growth along with economic and industrial development, especially in developing countries during the late twentieth and early twenty-first centuries, have increased the rate of land-use/land-cover (LULC) change many times. Since quantitative assessment of changes in LULC is one of the most efficient means to understand and manage the land transformation, there is a need to examine the accuracy of different algorithms for LULC mapping in order to identify the best classifier for further applications of earth observations. In this article, six machine-learning algorithms, namely random forest (RF), support vector machine (SVM), artificial neural network (ANN), fuzzy adaptive resonance theory-supervised predictive mapping (Fuzzy ARTMAP), spectral angle mapper (SAM) and Mahalanobis distance (MD) were examined. Accuracy assessment was performed by using Kappa coefficient, receiver operational curve (RoC), index-based validation and root mean square error (RMSE). Results of Kappa coefficient show that all the classifiers have a similar accuracy level with minor variation, but the RF algorithm has the highest accuracy of 0.89 and the MD algorithm (parametric classifier) has the least accuracy of 0.82. In addition, the index-based LULC and visual cross-validation show that the RF algorithm (correlations between RF and normalised differentiation water index, normalised differentiation vegetation index and normalised differentiation built-up index are 0.96, 0.99 and 1, respectively, at 0.05 level of significance) has the highest accuracy level in comparison to the other classifiers adopted. Findings from the literature also proved that ANN and RF algorithms are the best LULC classifiers, although a non-parametric classifier like SAM (Kappa coefficient 0.84; area under curve (AUC) 0.85) has a better and consistent accuracy level than the other machine-learning algorithms. Finally, this review concludes that the RF algorithm is the best machine-learning LULC classifier, among the six examined algorithms although it is necessary to further test the RF algorithm in different morphoclimatic conditions in the future.", "year": 2020, "referenceCount": 110, "citationCount": 218, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "89374469", "name": "Swapan Talukdar"}, {"authorId": "152612867", "name": "P. Singha"}, {"authorId": "1756706678", "name": "Susanta Mahato"}, {"authorId": "108164555", "name": "Shahfahad"}, {"authorId": "40959887", "name": "Swades Pal"}, {"authorId": "2352071", "name": "Y. Liou"}, {"authorId": "2148758361", "name": "Atiqur Rahman"}]}, {"paperId": "feb62bea49eae95fd1c616b840e4ca652fc06fed", "url": "https://www.semanticscholar.org/paper/feb62bea49eae95fd1c616b840e4ca652fc06fed", "title": "Visualizing Dataflow Graphs of Deep Learning Models in TensorFlow", "abstract": "We present a design study of the TensorFlow Graph Visualizer, part of the TensorFlow machine intelligence platform. This tool helps users understand complex machine learning architectures by visualizing their underlying dataflow graphs. The tool works by applying a series of graph transformations that enable standard layout techniques to produce a legible interactive diagram. To declutter the graph, we decouple non-critical nodes from the layout. To provide an overview, we build a clustered graph using the hierarchical structure annotated in the source code. To support exploration of nested structure on demand, we perform edge bundling to enable stable and responsive cluster expansion. Finally, we detect and highlight repeated structures to emphasize a model's modular composition. To demonstrate the utility of the visualizer, we describe example usage scenarios and report user feedback. Overall, users find the visualizer useful for understanding, debugging, and sharing the structures of their models.", "year": 2018, "referenceCount": 56, "citationCount": 263, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "8334069", "name": "Kanit Wongsuphasawat"}, {"authorId": "2842148", "name": "D. Smilkov"}, {"authorId": "49556437", "name": "James Wexler"}, {"authorId": "2109357255", "name": "Jimbo Wilson"}, {"authorId": "30415265", "name": "Dandelion Mané"}, {"authorId": "40514522", "name": "Doug Fritz"}, {"authorId": "1707347", "name": "Dilip Krishnan"}, {"authorId": "1765169", "name": "F. Viégas"}, {"authorId": "145233583", "name": "M. Wattenberg"}]}, {"paperId": "7078de49e9f80a11d1c2f52f8a14bf95f5cacd34", "url": "https://www.semanticscholar.org/paper/7078de49e9f80a11d1c2f52f8a14bf95f5cacd34", "title": "Trustless Machine Learning Contracts; Evaluating and Exchanging Machine Learning Models on the Ethereum Blockchain", "abstract": "Using blockchain technology, it is possible to create contracts that offer a reward in exchange for a trained machine learning model for a particular data set. This would allow users to train machine learning models for a reward in a trustless manner. The smart contract will use the blockchain to automatically validate the solution, so there would be no debate about whether the solution was correct or not. Users who submit the solutions won't have counterparty risk that they won't get paid for their work. Contracts can be created easily by anyone with a dataset, even programmatically by software agents. This creates a market where parties who are good at solving machine learning problems can directly monetize their skillset, and where any organization or software agent that has a problem to solve with AI can solicit solutions from all over the world. This will incentivize the creation of better machine learning models, and make AI more accessible to companies and software agents.", "year": 2018, "referenceCount": 17, "citationCount": 73, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2073104718", "name": "A. B. Kurtulmus"}, {"authorId": "123476763", "name": "K. Daniel"}]}, {"paperId": "136dee73f203df2f4831994bf4f0c0a4ad2e764e", "url": "https://www.semanticscholar.org/paper/136dee73f203df2f4831994bf4f0c0a4ad2e764e", "title": "Ensemble Adversarial Training: Attacks and Defenses", "abstract": "Adversarial examples are perturbed inputs designed to fool machine learning models. Adversarial training injects such examples into training data to increase robustness. To scale this technique to large datasets, perturbations are crafted using fast single-step methods that maximize a linear approximation of the model's loss. We show that this form of adversarial training converges to a degenerate global minimum, wherein small curvature artifacts near the data points obfuscate a linear approximation of the loss. The model thus learns to generate weak perturbations, rather than defend against strong ones. As a result, we find that adversarial training remains vulnerable to black-box attacks, where we transfer perturbations computed on undefended models, as well as to a powerful novel single-step attack that escapes the non-smooth vicinity of the input data via a small random step. We further introduce Ensemble Adversarial Training, a technique that augments training data with perturbations transferred from other models. On ImageNet, Ensemble Adversarial Training yields models with strong robustness to black-box attacks. In particular, our most robust model won the first round of the NIPS 2017 competition on Defenses against Adversarial Attacks. However, subsequent work found that more elaborate black-box attacks could significantly enhance transferability and reduce the accuracy of our models.", "year": 2017, "referenceCount": 63, "citationCount": 1914, "influentialCitationCount": 264, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2444919", "name": "Florian Tramèr"}, {"authorId": "145714153", "name": "A. Kurakin"}, {"authorId": "1967156", "name": "Nicolas Papernot"}, {"authorId": "1752788", "name": "D. Boneh"}, {"authorId": "144061974", "name": "P. Mcdaniel"}]}, {"paperId": "3e2da7c1c7dfc7960d1515b61f32fdc55359eea7", "url": "https://www.semanticscholar.org/paper/3e2da7c1c7dfc7960d1515b61f32fdc55359eea7", "title": "An open access repository of images on plant health to enable the development of mobile disease diagnostics through machine learning and crowdsourcing", "abstract": "Human society needs to increase food production by an estimated 70% by 2050 to feed an expected population size that is predicted to be over 9 billion people. Currently infectious diseases reduce the potential yield by an average of 40% with many farmers in the developing world experiencing yield losses as high as 100%. Infectious diseases of crops are not new and historic examples such as the Irish Potato Famine of 1845-49 demonstrate this. But what is new is the widespread distribution of smartphones among crop growers around the world with an expected 5 billion smartphones by 2020. This offers the potential of turning the smartphone into a valuable tool for diverse communities growing food. One potential application is the development of mobile disease diagnostics through machine learning and crowdsourcing. Computer vision and machine learning have shown their potential to automatically classify images. To do this for plant diseases requires a training set that facilitates the development of the algorithms. Here we announce the release of >50,000 expertly curated images on healthy and infected leaves of crops plants through the existing platform www.PlantVillage.org. We describe both the data and the platform. These data are the beginning of an on-going, crowdsourcing effort to enable computer vision approaches to help solve the problem of yield losses in crop plants due to infectious diseases.", "year": 2015, "referenceCount": 47, "citationCount": 494, "influentialCitationCount": 60, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2068146094", "name": "David P. Hughes"}, {"authorId": "3046313", "name": "M. Salathé"}]}, {"paperId": "f1e0484607a57687da6f663954292b0c848141f1", "url": "https://www.semanticscholar.org/paper/f1e0484607a57687da6f663954292b0c848141f1", "title": "Adversarial Sensor Attack on LiDAR-based Perception in Autonomous Driving", "abstract": "In Autonomous Vehicles (AVs), one fundamental pillar is perception,which leverages sensors like cameras and LiDARs (Light Detection and Ranging) to understand the driving environment. Due to its direct impact on road safety, multiple prior efforts have been made to study its the security of perception systems. In contrast to prior work that concentrates on camera-based perception, in this work we perform the first security study of LiDAR-based perception in AV settings, which is highly important but unexplored. We consider LiDAR spoofing attacks as the threat model and set the attack goal as spoofing obstacles close to the front of a victim AV. We find that blindly applying LiDAR spoofing is insufficient to achieve this goal due to the machine learning-based object detection process.Thus, we then explore the possibility of strategically controlling the spoofed attack to fool the machine learning model. We formulate this task as an optimization problem and design modeling methods for the input perturbation function and the objective function.We also identify the inherent limitations of directly solving the problem using optimization and design an algorithm that combines optimization and global sampling, which improves the attack success rates to around 75%. As a case study to understand the attack impact at the AV driving decision level, we construct and evaluate two attack scenarios that may damage road safety and mobility.We also discuss defense directions at the AV system, sensor, and machine learning model levels.", "year": 2019, "referenceCount": 52, "citationCount": 245, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering", "Mathematics"], "authors": [{"authorId": "2146176464", "name": "Yulong Cao"}, {"authorId": "2723309", "name": "Chaowei Xiao"}, {"authorId": "51011036", "name": "Benjamin Cyr"}, {"authorId": "51092355", "name": "Yimeng Zhou"}, {"authorId": "2087289279", "name": "Wonseok Park"}, {"authorId": "2921321", "name": "Sara Rampazzi"}, {"authorId": "39645110", "name": "Qi Alfred Chen"}, {"authorId": "144070916", "name": "Kevin Fu"}, {"authorId": "3895596", "name": "Z. Morley Mao"}]}, {"paperId": "ff95dcec9098a66f0110b10b76618f1eee505f84", "url": "https://www.semanticscholar.org/paper/ff95dcec9098a66f0110b10b76618f1eee505f84", "title": "A tutorial survey of architectures, algorithms, and applications for deep learning", "abstract": "In this invited paper, my overview material on the same topic as presented in the plenary overview session of APSIPA-2011 and the tutorial material presented in the same conference [1] are expanded and updated to include more recent developments in deep learning. The previous and the updated materials cover both theory and applications, and analyze its future directions. The goal of this tutorial survey is to introduce the emerging area of deep learning or hierarchical learning to the APSIPA community. Deep learning refers to a class of machine learning techniques, developed largely since 2006, where many stages of non-linear information processing in hierarchical architectures are exploited for pattern classification and for feature learning. In the more recent literature, it is also connected to representation learning, which involves a hierarchy of features or concepts where higher-level concepts are defined from lower-level ones and where the same lower-level concepts help to define higher-level ones. In this tutorial survey, a brief history of deep learning research is discussed first. Then, a classificatory scheme is developed to analyze and summarize major work reported in the recent deep learning literature. Using this scheme, I provide a taxonomy-oriented survey on the existing deep architectures and algorithms in the literature, and categorize them into three classes: generative, discriminative, and hybrid. Three representative deep architectures – deep autoencoders, deep stacking networks with their generalization to the temporal domain (recurrent networks), and deep neural networks (pretrained with deep belief networks) – one in each of the three classes, are presented in more detail. Next, selected applications of deep learning are reviewed in broad areas of signal and information processing including audio/speech, image/vision, multimodality, language modeling, natural language processing, and information retrieval. Finally, future directions of deep learning are discussed and analyzed.", "year": 2014, "referenceCount": 244, "citationCount": 627, "influentialCitationCount": 31, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144718788", "name": "L. Deng"}]}, {"paperId": "9e6c798940c9998477a462b50e0a5b07259f1056", "url": "https://www.semanticscholar.org/paper/9e6c798940c9998477a462b50e0a5b07259f1056", "title": "PLANET: Massively Parallel Learning of Tree Ensembles with MapReduce", "abstract": "Classification and regression tree learning on massive datasets is a common data mining task at Google, yet many state of the art tree learning algorithms require training data to reside in memory on a single machine. While more scalable implementations of tree learning have been proposed, they typically require specialized parallel computing architectures. In contrast, the majority of Google's computing infrastructure is based on commodity hardware. \n \nIn this paper, we describe PLANET: a scalable distributed framework for learning tree models over large datasets. PLANET defines tree learning as a series of distributed computations, and implements each one using the MapReduce model of distributed computation. We show how this framework supports scalable construction of classification and regression trees, as well as ensembles of such models. We discuss the benefits and challenges of using a MapReduce compute cluster for tree learning, and demonstrate the scalability of this approach by applying it to a real world learning task from the domain of computational advertising.", "year": 2009, "referenceCount": 41, "citationCount": 306, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34547779", "name": "Biswanath Panda"}, {"authorId": "101285460", "name": "Josh Herbach"}, {"authorId": "40632403", "name": "Sugato Basu"}, {"authorId": "1692160", "name": "R. Bayardo"}]}, {"paperId": "35887dba951a13d53cc1e9b0130ef04fb0542266", "url": "https://www.semanticscholar.org/paper/35887dba951a13d53cc1e9b0130ef04fb0542266", "title": "Machine Learning of Three-dimensional Right Ventricular Motion Enables Outcome Prediction in Pulmonary Hypertension: A Cardiac MR Imaging Study", "abstract": "Applying machine learning of complex motion phenotypes obtained from cardiac MR images allows more accurate prediction of patient outcomes in pulmonary hypertension.", "year": 2017, "referenceCount": 39, "citationCount": 144, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2883039", "name": "T. Dawes"}, {"authorId": "2922425", "name": "A. de Marvao"}, {"authorId": "2700496", "name": "W. Shi"}, {"authorId": "37027922", "name": "Tristan Fletcher"}, {"authorId": "47055053", "name": "Geoffrey M J Watson"}, {"authorId": "145109764", "name": "J. Wharton"}, {"authorId": "145690689", "name": "C. Rhodes"}, {"authorId": "96674758", "name": "L. Howard"}, {"authorId": "144937710", "name": "J. Gibbs"}, {"authorId": "1717710", "name": "D. Rueckert"}, {"authorId": "145502615", "name": "S. Cook"}, {"authorId": "35208181", "name": "M. Wilkins"}, {"authorId": "145515557", "name": "D. O’Regan"}]}, {"paperId": "c7591ddfe3553c5111890d21fb8c25927e3c3612", "url": "https://www.semanticscholar.org/paper/c7591ddfe3553c5111890d21fb8c25927e3c3612", "title": "Content-Based Filtering in On-Line Social Networks", "abstract": null, "year": 2010, "referenceCount": 47, "citationCount": 150, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31737358", "name": "M. Vanetti"}, {"authorId": "145559983", "name": "E. Binaghi"}, {"authorId": "1678413", "name": "B. Carminati"}, {"authorId": "2439821", "name": "M. Carullo"}, {"authorId": "88162783", "name": "E. Ferrari"}]}, {"paperId": "57b3f8df7020b67df71a96974adef8d5282ed396", "url": "https://www.semanticscholar.org/paper/57b3f8df7020b67df71a96974adef8d5282ed396", "title": "11,001 New Features for Statistical Machine Translation", "abstract": "We use the Margin Infused Relaxed Algorithm of Crammer et al. to add a large number of new features to two machine translation systems: the Hiero hierarchical phrase-based translation system and our syntax-based translation system. On a large-scale Chinese-English translation task, we obtain statistically significant improvements of +1.5 Bleu and + 1.1 Bleu, respectively. We analyze the impact of the new features and the performance of the learning algorithm.", "year": 2009, "referenceCount": 43, "citationCount": 220, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145287425", "name": "David Chiang"}, {"authorId": "152971314", "name": "Kevin Knight"}, {"authorId": "49337181", "name": "Wei Wang"}]}, {"paperId": "71207632839723b51368fa5221c66dc75325bf58", "url": "https://www.semanticscholar.org/paper/71207632839723b51368fa5221c66dc75325bf58", "title": "Increasing generality in machine learning through procedural content generation", "abstract": null, "year": 2019, "referenceCount": 100, "citationCount": 64, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1745664", "name": "S. Risi"}, {"authorId": "1810053", "name": "J. Togelius"}]}, {"paperId": "fa121f1afc835e0e6a5454bbf64826c35bd6c626", "url": "https://www.semanticscholar.org/paper/fa121f1afc835e0e6a5454bbf64826c35bd6c626", "title": "A comparison of machine learning techniques for customer churn prediction", "abstract": null, "year": 2015, "referenceCount": 42, "citationCount": 251, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2140023", "name": "T. Vafeiadis"}, {"authorId": "1705272", "name": "K. Diamantaras"}, {"authorId": "2628589", "name": "G. Sarigiannidis"}, {"authorId": "6476644", "name": "K. Chatzisavvas"}]}, {"paperId": "006cb500fd0b25200e12eb5a024756aea3d569ed", "url": "https://www.semanticscholar.org/paper/006cb500fd0b25200e12eb5a024756aea3d569ed", "title": "Learning in a Large Function Space: Privacy-Preserving Mechanisms for SVM Learning", "abstract": "The ubiquitous need for analyzing privacy-sensitive information—including health records, personal communications, product ratings and social network data—is driving significant interest in privacy-preserving data analysis across several research communities. This paper explores the release of Support Vector Machine (SVM) classifiers while preserving the privacy of training data. The SVM is a popular machine learning method that maps data to a high-dimensional feature space before learning a linear decision boundary. We present efficient mechanisms for finite-dimensional feature mappings and for (potentially infinite-dimensional) mappings with translation-invariant kernels. In the latter case, our mechanism borrows a technique from large-scale learning to learn in a finite-dimensional feature space whose inner-product uniformly approximates the desired feature space inner-product (the desired kernel) with high probability. Differential privacy is established using algorithmic stability, a property used in learning theory to bound generalization error. Utility—when the private classifier is pointwise close to the non-private classifier with high probability—is proven using smoothness of regularized empirical risk minimization with respect to small perturbations to the feature mapping. Finally we conclude with lower bounds on the differential privacy of any mechanism approximating the SVM.", "year": 2009, "referenceCount": 58, "citationCount": 263, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1868067", "name": "Benjamin I. P. Rubinstein"}, {"authorId": "1745169", "name": "P. Bartlett"}, {"authorId": "50055322", "name": "Ling Huang"}, {"authorId": "2703784", "name": "N. Taft"}]}, {"paperId": "06aa334b466e68704eef37d90202894f34f4ea4f", "url": "https://www.semanticscholar.org/paper/06aa334b466e68704eef37d90202894f34f4ea4f", "title": "Protein secondary structure prediction using logic-based machine learning", "abstract": "Many attempts have been made to solve the problem of predicting protein secondary structure from the primary sequence but the best performance results are still disappointing. In this paper, the use of a machine learning algorithm which allows relational descriptions is shown to lead to improved performance. The Inductive Logic Programming computer program, Golem, was applied to learning secondary structure prediction rules for alpha/alpha domain type proteins. The input to the program consisted of 12 non-homologous proteins (1612 residues) of known structure, together with a background knowledge describing the chemical and physical properties of the residues. Golem learned a small set of rules that predict which residues are part of the alpha-helices--based on their positional relationships and chemical and physical properties. The rules were tested on four independent non-homologous proteins (416 residues) giving an accuracy of 81% (+/- 2%). This is an improvement, on identical data, over the previously reported result of 73% by King and Sternberg (1990, J. Mol. Biol., 216, 441-457) using the machine learning program PROMIS, and of 72% using the standard Garnier-Osguthorpe-Robson method. The best previously reported result in the literature for the alpha/alpha domain type is 76%, achieved using a neural net approach. Machine learning also has the advantage over neural network and statistical methods in producing more understandable results.", "year": 1992, "referenceCount": 2, "citationCount": 137, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145147566", "name": "S. Muggleton"}, {"authorId": "33654217", "name": "R. King"}, {"authorId": "145410834", "name": "M. Sternberg"}]}, {"paperId": "fbc913faf39b1e369dfcdcfefb354d846a46573c", "url": "https://www.semanticscholar.org/paper/fbc913faf39b1e369dfcdcfefb354d846a46573c", "title": "Learning With Kernels: Support Vector Machines, Regularization, Optimization, and Beyond", "abstract": null, "year": 2003, "referenceCount": 0, "citationCount": 280, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "145715698", "name": "Christopher K. I. Williams"}]}, {"paperId": "b2504b0b2a7e06eab02a3584dd46d94a3f05ffdf", "url": "https://www.semanticscholar.org/paper/b2504b0b2a7e06eab02a3584dd46d94a3f05ffdf", "title": "Conditional Neural Processes", "abstract": "Deep neural networks excel at function approximation, yet they are typically trained from scratch for each new function. On the other hand, Bayesian methods, such as Gaussian Processes (GPs), exploit prior knowledge to quickly infer the shape of a new function at test time. Yet GPs are computationally expensive, and it can be hard to design appropriate priors. In this paper we propose a family of neural models, Conditional Neural Processes (CNPs), that combine the benefits of both. CNPs are inspired by the flexibility of stochastic processes such as GPs, but are structured as neural networks and trained via gradient descent. CNPs make accurate predictions after observing only a handful of training data points, yet scale to complex functions and large datasets. We demonstrate the performance and versatility of the approach on a range of canonical machine learning tasks, including regression, classification and image completion.", "year": 2018, "referenceCount": 34, "citationCount": 370, "influentialCitationCount": 93, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3468254", "name": "M. Garnelo"}, {"authorId": "2445250", "name": "Dan Rosenbaum"}, {"authorId": "2772217", "name": "Chris J. Maddison"}, {"authorId": "34505275", "name": "Tiago Ramalho"}, {"authorId": "143810408", "name": "D. Saxton"}, {"authorId": "1757629", "name": "M. Shanahan"}, {"authorId": "1725303", "name": "Y. Teh"}, {"authorId": "1748523", "name": "Danilo Jimenez Rezende"}, {"authorId": "143648071", "name": "S. Eslami"}]}, {"paperId": "be13051815e357c4963bb21546b301a336feca6a", "url": "https://www.semanticscholar.org/paper/be13051815e357c4963bb21546b301a336feca6a", "title": "Using Machine-Learning Methods for Musical Style Modeling", "abstract": "The ability to construct a musical theory from examples presents a great intellectual challenge that, if successfully met, could foster a range of new creative applications. Inspired by this challenge, we sought to apply machine-learning methods to the problem of musical style modeling. Our work so far has produced examples of musical generation and applications to a computer-aided composition system. Machine learning consists of deriving a mathematical model, such as a set of stochastic rules, from a set of musical examples. The act of musical composition involves a highly structured mental process. Although it is complex and difficult to formalize, it is clearly far from being a random activity. Our research seeks to capture some of the regularity apparent in the composition process by using statistical and information theoretic tools to analyze musical pieces. The resulting models can be used for inference and prediction and, to a certain extent, to generate new works that imitate the style of the great masters.", "year": 2003, "referenceCount": 17, "citationCount": 164, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2204186", "name": "S. Dubnov"}, {"authorId": "2435162", "name": "G. Assayag"}, {"authorId": "2251215", "name": "O. Lartillot"}, {"authorId": "2455381", "name": "G. Bejerano"}]}, {"paperId": "b1a5961609c623fc816aaa77565ba38b25531a8e", "url": "https://www.semanticscholar.org/paper/b1a5961609c623fc816aaa77565ba38b25531a8e", "title": "Neural Networks: Tricks of the Trade", "abstract": null, "year": 2002, "referenceCount": 0, "citationCount": 1463, "influentialCitationCount": 102, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1747181", "name": "J. Hartmanis"}, {"authorId": "143817739", "name": "J. V. Leeuwen"}]}, {"paperId": "f98497d63a286637262c98e07d5325aa22ad2a7a", "url": "https://www.semanticscholar.org/paper/f98497d63a286637262c98e07d5325aa22ad2a7a", "title": "Analysis of Sparse Bayesian Learning", "abstract": "The recent introduction of the 'relevance vector machine' has effectively demonstrated how sparsity may be obtained in generalised linear models within a Bayesian framework. Using a particular form of Gaussian parameter prior, 'learning' is the maximisation, with respect to hyperparameters, of the marginal likelihood of the data. This paper studies the properties of that objective function, and demonstrates that conditioned on an individual hyper-parameter, the marginal likelihood has a unique maximum which is computable in closed form. It is further shown that if a derived 'sparsity criterion' is satisfied, this maximum is exactly equivalent to 'pruning' the corresponding parameter from the model.", "year": 2001, "referenceCount": 9, "citationCount": 301, "influentialCitationCount": 33, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "33171556", "name": "Anita C. Faul"}, {"authorId": "2831141", "name": "Michael E. Tipping"}]}, {"paperId": "76d4b7fd734f987dc87c9aafdbcc7e1af99ad8a5", "url": "https://www.semanticscholar.org/paper/76d4b7fd734f987dc87c9aafdbcc7e1af99ad8a5", "title": "Learning to recognize patterns without a teacher", "abstract": "An important problem in pattern recognition or signal detection is the recognition of a pattern that is completely characterized statistically except for a finite set of unknown parameters. If a machine is required to solve such a problem on a number of occasions, it is possible to take advantage of this repetition. One can design a machine that will extract more and more of the pertinent information about these unknown parameters as it recognizes the patterns and readjusts itself to be more selective to them; the machine improves in performance as it gains experience on the problem. This paper presents a model suitable for many such problems and evolves a solution in the form of a machine that \"learns\" to solve the problem without external aid. Such machines are said to \"learn without a teacher.\" The Bayes solution to the model problem requires the computation of the a posteriori probability density of the unknown parameters. A recursive equation for this density is derived. This equation describes the structure of a relatively simple system of finite size that may be realized in a delay-feedback form. The application of the model and the synthesis of a learning system are illustrated by the derivation of a receiver for the detection of signals of unknown amplitude in white Gaussian noise.", "year": 1967, "referenceCount": 10, "citationCount": 138, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2158281", "name": "S. Fralick"}]}, {"paperId": "0165568bcc1a819c18564567f2ec15d859be2519", "url": "https://www.semanticscholar.org/paper/0165568bcc1a819c18564567f2ec15d859be2519", "title": "Cheap and Fast – But is it Good? Evaluating Non-Expert Annotations for Natural Language Tasks", "abstract": "Human linguistic annotation is crucial for many natural language processing tasks but can be expensive and time-consuming. We explore the use of Amazon's Mechanical Turk system, a significantly cheaper and faster method for collecting annotations from a broad base of paid non-expert contributors over the Web. We investigate five tasks: affect recognition, word similarity, recognizing textual entailment, event temporal ordering, and word sense disambiguation. For all five, we show high agreement between Mechanical Turk non-expert annotations and existing gold standard labels provided by expert labelers. For the task of affect recognition, we also show that using non-expert labels for training machine learning algorithms can be as effective as using gold standard annotations from experts. We propose a technique for bias correction that significantly improves annotation quality on two tasks. We conclude that many large labeling tasks can be effectively designed and carried out in this method at a fraction of the usual expense.", "year": 2008, "referenceCount": 35, "citationCount": 2195, "influentialCitationCount": 170, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144621026", "name": "R. Snow"}, {"authorId": "1401020033", "name": "Brendan T. O'Connor"}, {"authorId": "1746807", "name": "Dan Jurafsky"}, {"authorId": "34699434", "name": "A. Ng"}]}, {"paperId": "56edaa1368ff4dfa45388e4be24fdfbded7d88a7", "url": "https://www.semanticscholar.org/paper/56edaa1368ff4dfa45388e4be24fdfbded7d88a7", "title": "A Primer on Neural Network Models for Natural Language Processing", "abstract": "Over the past few years, neural networks have re-emerged as powerful machine-learning models, yielding state-of-the-art results in fields such as image recognition and speech processing. More recently, neural network models started to be applied also to textual natural language signals, again with very promising results. This tutorial surveys neural network models from the perspective of natural language processing research, in an attempt to bring natural-language researchers up to speed with the neural techniques. The tutorial covers input encoding for natural language tasks, feed-forward networks, convolutional networks, recurrent networks and recursive networks, as well as the computation graph abstraction for automatic gradient computation.", "year": 2015, "referenceCount": 185, "citationCount": 892, "influentialCitationCount": 59, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2089067", "name": "Yoav Goldberg"}]}, {"paperId": "4ec953de1331fe5f720320c9f2f82884b2512701", "url": "https://www.semanticscholar.org/paper/4ec953de1331fe5f720320c9f2f82884b2512701", "title": "Machine Learning Methods in Drug Discovery", "abstract": "The advancements of information technology and related processing techniques have created a fertile base for progress in many scientific fields and industries. In the fields of drug discovery and development, machine learning techniques have been used for the development of novel drug candidates. The methods for designing drug targets and novel drug discovery now routinely combine machine learning and deep learning algorithms to enhance the efficiency, efficacy, and quality of developed outputs. The generation and incorporation of big data, through technologies such as high-throughput screening and high through-put computational analysis of databases used for both lead and target discovery, has increased the reliability of the machine learning and deep learning incorporated techniques. The use of these virtual screening and encompassing online information has also been highlighted in developing lead synthesis pathways. In this review, machine learning and deep learning algorithms utilized in drug discovery and associated techniques will be discussed. The applications that produce promising results and methods will be reviewed.", "year": 2020, "referenceCount": 101, "citationCount": 63, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2026124178", "name": "Lauv Patel"}, {"authorId": "51466154", "name": "T. Shukla"}, {"authorId": "38820495", "name": "Xiuzhen Huang"}, {"authorId": "2251733", "name": "D. Ussery"}, {"authorId": "5954673", "name": "Shanzhi Wang"}]}, {"paperId": "696e44a895bd153006b90a47be0c6bfba0a6ef4c", "url": "https://www.semanticscholar.org/paper/696e44a895bd153006b90a47be0c6bfba0a6ef4c", "title": "Machine learning : an artificial intelligence approach", "abstract": null, "year": 1988, "referenceCount": 0, "citationCount": 135, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1644142764", "name": "黃崇冀"}, {"authorId": "2115528778", "name": "Henry C. Huang"}]}, {"paperId": "b9bf865c3cad373caa48a8328596394dad1ac0e4", "url": "https://www.semanticscholar.org/paper/b9bf865c3cad373caa48a8328596394dad1ac0e4", "title": "Artificial Neural Networks-Based Machine Learning for Wireless Networks: A Tutorial", "abstract": "In order to effectively provide ultra reliable low latency communications and pervasive connectivity for Internet of Things (IoT) devices, next-generation wireless networks can leverage intelligent, data-driven functions enabled by the integration of machine learning (ML) notions across the wireless core and edge infrastructure. In this context, this paper provides a comprehensive tutorial that overviews how artificial neural networks (ANNs)-based ML algorithms can be employed for solving various wireless networking problems. For this purpose, we first present a detailed overview of a number of key types of ANNs that include recurrent, spiking, and deep neural networks, that are pertinent to wireless networking applications. For each type of ANN, we present the basic architecture as well as specific examples that are particularly important and relevant wireless network design. Such ANN examples include echo state networks, liquid state machine, and long short term memory. Then, we provide an in-depth overview on the variety of wireless communication problems that can be addressed using ANNs, ranging from communication using unmanned aerial vehicles to virtual reality applications over wireless networks as well as edge computing and caching. For each individual application, we present the main motivation for using ANNs along with the associated challenges while we also provide a detailed example for a use case scenario and outline future works that can be addressed using ANNs. In a nutshell, this paper constitutes the first holistic tutorial on the development of ANN-based ML techniques tailored to the needs of future wireless networks.", "year": 2017, "referenceCount": 245, "citationCount": 479, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2107942948", "name": "Mingzhe Chen"}, {"authorId": "2318575", "name": "Ursula Challita"}, {"authorId": "145412074", "name": "W. Saad"}, {"authorId": "1768333", "name": "Changchuan Yin"}, {"authorId": "145118318", "name": "M. Debbah"}]}, {"paperId": "18145e358d4d5cd5dab06558aca47b8ea21fadef", "url": "https://www.semanticscholar.org/paper/18145e358d4d5cd5dab06558aca47b8ea21fadef", "title": "Machine Learning Techniques for Civil Engineering Problems", "abstract": "The growing volume of information databases presents opportunities for advanced data analysis techniques from machine learning (ML) research. Practical applications of ML are very different from theoretical or empirical studies, involving organizational and human aspects and various other constraints. Despite the importance of applied ML, little has been discussed in the general ML literature on this topic. In order to remedy this situation, I studied practical applications of ML and developed a proposal for a seven–step process that can guide practical applications of ML in engineering. The process is illustrated by relevant applications of ML in civil engineering. This illustration shows that the potential of ML has only begun to be explored but also cautions that in order to be successful, the application process must carefully address the issues related to the seven–step process.", "year": 1997, "referenceCount": 112, "citationCount": 101, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2870501", "name": "Y. Reich"}]}, {"paperId": "c7330852a07170cd0e6990f5fbde5fca12b6ccd6", "url": "https://www.semanticscholar.org/paper/c7330852a07170cd0e6990f5fbde5fca12b6ccd6", "title": "Mitigating Unwanted Biases with Adversarial Learning", "abstract": "Machine learning is a tool for building models that accurately represent input training data. When undesired biases concerning demographic groups are in the training data, well-trained models will reflect those biases. We present a framework for mitigating such biases by including a variable for the group of interest and simultaneously learning a predictor and an adversary. The input to the network X, here text or census data, produces a prediction Y, such as an analogy completion or income bracket, while the adversary tries to model a protected variable Z, here gender or zip code. The objective is to maximize the predictor's ability to predict Y while minimizing the adversary's ability to predict Z. Applied to analogy completion, this method results in accurate predictions that exhibit less evidence of stereotyping Z. When applied to a classification task using the UCI Adult (Census) Dataset, it results in a predictive model that does not lose much accuracy while achieving very close to equality of odds (Hardt, et al., 2016). The method is flexible and applicable to multiple definitions of fairness as well as a wide range of gradient-based learning models, including both regression and classification tasks.", "year": 2018, "referenceCount": 11, "citationCount": 761, "influentialCitationCount": 99, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "11809518", "name": "B. Zhang"}, {"authorId": "40640868", "name": "B. Lemoine"}, {"authorId": "49501003", "name": "Margaret Mitchell"}]}, {"paperId": "8aeb2344e841d397c7a741484329fdfeb42506ca", "url": "https://www.semanticscholar.org/paper/8aeb2344e841d397c7a741484329fdfeb42506ca", "title": "Cooperating with machines", "abstract": null, "year": 2017, "referenceCount": 153, "citationCount": 140, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1779856", "name": "J. Crandall"}, {"authorId": "3231527", "name": "Mayada Oudah"}, {"authorId": "1863373", "name": "Tennom Chenlinangjia"}, {"authorId": "1403867197", "name": "Fatimah Ishowo-Oloko"}, {"authorId": "144578221", "name": "S. Abdallah"}, {"authorId": "3107309", "name": "Jean‐François Bonnefon"}, {"authorId": "145512647", "name": "Manuel Cebrian"}, {"authorId": "1999088", "name": "A. Shariff"}, {"authorId": "7410831", "name": "M. Goodrich"}, {"authorId": "1705156", "name": "I. Rahwan"}]}, {"paperId": "105112c538f7dda548678f2e3ef92d6de0acd807", "url": "https://www.semanticscholar.org/paper/105112c538f7dda548678f2e3ef92d6de0acd807", "title": "Bilevel Optimization and Machine Learning", "abstract": null, "year": 2008, "referenceCount": 19, "citationCount": 47, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2065549778", "name": "Kristin P. Bennett"}, {"authorId": "1738307", "name": "Gautam Kunapuli"}, {"authorId": "2118516900", "name": "Jing Hu"}, {"authorId": "1784816", "name": "J. Pang"}]}, {"paperId": "d65f8bb342f3a4fbf119bd2f822318741de3b567", "url": "https://www.semanticscholar.org/paper/d65f8bb342f3a4fbf119bd2f822318741de3b567", "title": "Comparing molecules and solids across structural and alchemical space.", "abstract": "Evaluating the (dis)similarity of crystalline, disordered and molecular compounds is a critical step in the development of algorithms to navigate automatically the configuration space of complex materials. For instance, a structural similarity metric is crucial for classifying structures, searching chemical space for better compounds and materials, and driving the next generation of machine-learning techniques for predicting the stability and properties of molecules and materials. In the last few years several strategies have been designed to compare atomic coordination environments. In particular, the smooth overlap of atomic positions (SOAPs) has emerged as an elegant framework to obtain translation, rotation and permutation-invariant descriptors of groups of atoms, underlying the development of various classes of machine-learned inter-atomic potentials. Here we discuss how one can combine such local descriptors using a regularized entropy match (REMatch) approach to describe the similarity of both whole molecular and bulk periodic structures, introducing powerful metrics that enable the navigation of alchemical and structural complexities within a unified framework. Furthermore, using this kernel and a ridge regression method we can predict atomization energies for a database of small organic molecules with a mean absolute error below 1 kcal mol(-1), reaching an important milestone in the application of machine-learning techniques for the evaluation of molecular properties.", "year": 2015, "referenceCount": 101, "citationCount": 387, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Chemistry", "Medicine", "Materials Science"], "authors": [{"authorId": "153048885", "name": "Sandip De"}, {"authorId": "3938091", "name": "A. Bartók"}, {"authorId": "2559761", "name": "Gábor Csányi"}, {"authorId": "1917770", "name": "M. Ceriotti"}]}, {"paperId": "f6a9f4569368969cca84988a7d823b7bb94b4f35", "url": "https://www.semanticscholar.org/paper/f6a9f4569368969cca84988a7d823b7bb94b4f35", "title": "Transformation Equivariant Boltzmann Machines", "abstract": null, "year": 2011, "referenceCount": 16, "citationCount": 101, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "6245351", "name": "J. Kivinen"}, {"authorId": "145715698", "name": "Christopher K. I. Williams"}]}, {"paperId": "779e4492f1cf93fe9d92f58e70ee56003e3c5970", "url": "https://www.semanticscholar.org/paper/779e4492f1cf93fe9d92f58e70ee56003e3c5970", "title": "Big data and black-box medical algorithms", "abstract": "New machine-learning techniques entering medicine present challenges in validation, regulation, and integration into practice. New machine-learning techniques entering medicine present challenges in validation, regulation, and integration into practice.", "year": 2018, "referenceCount": 15, "citationCount": 89, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "40503754", "name": "W. Price"}]}, {"paperId": "2f91dbe76db2d377b8a08c58017883dda4b77a97", "url": "https://www.semanticscholar.org/paper/2f91dbe76db2d377b8a08c58017883dda4b77a97", "title": "Generalized SMO Algorithm for SVM-Based Multitask Learning", "abstract": "Exploiting additional information to improve traditional inductive learning is an active research area in machine learning. In many supervised-learning applications, training data can be naturally separated into several groups, and incorporating this group information into learning may improve generalization. Recently, Vapnik proposed a general approach to formalizing such problems, known as “learning with structured data” and its support vector machine (SVM) based optimization formulation called SVM+. Liang and Cherkassky showed the connection between SVM+ and multitask learning (MTL) approaches in machine learning, and proposed an SVM-based formulation for MTL called SVM+MTL for classification. Training the SVM+MTL classifier requires the solution of a large quadratic programming optimization problem which scales as O(n3) with sample size n. So there is a need to develop computationally efficient algorithms for implementing SVM+MTL. This brief generalizes Platt's sequential minimal optimization (SMO) algorithm to the SVM+MTL setting. Empirical results show that, for typical SVM+MTL problems, the proposed generalized SMO achieves over 100 times speed-up, in comparison with general-purpose optimization routines.", "year": 2012, "referenceCount": 25, "citationCount": 62, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2064272099", "name": "Feng Cai"}, {"authorId": "145884505", "name": "V. Cherkassky"}]}, {"paperId": "0c236e611a90018e84d9de23d1cff241354079be", "url": "https://www.semanticscholar.org/paper/0c236e611a90018e84d9de23d1cff241354079be", "title": "Automatically refining the wikipedia infobox ontology", "abstract": "The combined efforts of human volunteers have recently extracted numerous facts from Wikipedia, storing them as machine-harvestable object-attribute-value triples in Wikipedia infoboxes. Machine learning systems, such as Kylin, use these infoboxes as training data, accurately extracting even more semantic knowledge from natural language text. But in order to realize the full power of this information, it must be situated in a cleanly-structured ontology. This paper introduces KOG, an autonomous system for refining Wikipedia's infobox-class ontology towards this end. We cast the problem of ontology refinement as a machine learning problem and solve it using both SVMs and a more powerful joint-inference approach expressed in Markov Logic Networks. We present experiments demonstrating the superiority of the joint-inference approach and evaluating other aspects of our system. Using these techniques, we build a rich ontology, integrating Wikipedia's infobox-class schemata with WordNet. We demonstrate how the resulting ontology may be used to enhance Wikipedia with improved query processing and other features.", "year": 2008, "referenceCount": 37, "citationCount": 381, "influentialCitationCount": 24, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2110920850", "name": "Fei Wu"}, {"authorId": "1780531", "name": "Daniel S. Weld"}]}, {"paperId": "2aff69adb95ddb6c766385acf439e9a19d45b20b", "url": "https://www.semanticscholar.org/paper/2aff69adb95ddb6c766385acf439e9a19d45b20b", "title": "Constraining Effective Field Theories with Machine Learning.", "abstract": "We present powerful new analysis techniques to constrain effective field theories at the LHC. By leveraging the structure of particle physics processes, we extract extra information from Monte Carlo simulations, which can be used to train neural network models that estimate the likelihood ratio. These methods scale well to processes with many observables and theory parameters, do not require any approximations of the parton shower or detector response, and can be evaluated in microseconds. We show that they allow us to put significantly stronger bounds on dimension-six operators than existing methods, demonstrating their potential to improve the precision of the LHC legacy constraints.", "year": 2018, "referenceCount": 80, "citationCount": 113, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "32906304", "name": "J. Brehmer"}, {"authorId": "11638962", "name": "K. Cranmer"}, {"authorId": "1881041", "name": "Gilles Louppe"}, {"authorId": "144701212", "name": "J. Pavez"}]}, {"paperId": "e8b3c5e2cf19768b61a263ed4762db98be60c3cb", "url": "https://www.semanticscholar.org/paper/e8b3c5e2cf19768b61a263ed4762db98be60c3cb", "title": "Inductive logic programming - from machine learning to software engineering", "abstract": "From the Publisher: \nAlthough Inductive Logic Programming (ILP) is generally thought of as a research area at the intersection of machine learning and computational logic, Bergadano and Gunetti propose that most of the research in ILP has in fact come from machine learning, particularly in the evolution of inductive reasoning from pattern recognition, through initial approaches to symbolic machine learning, to recent techniques for learning relational concepts. In this book they provide an extended, up-to-date survey of ILP, emphasizing methods and systems suitable for software engineering applications, including inductive program development, testing, and maintenance. \nInductive Logic Programming includes a definition of the basic ILP problem and its variations (incremental, with queries, for multiple predicates and predicate invention capabilities), a description of bottom-up operators and techniques (such as least general generalization, inverse resolution, and inverse implication), an analysis of top-down methods (mainly MIS and FOIL-like systems), and a survey of methods and languages for specifying inductive bias. \nLogic Programming series", "year": 1995, "referenceCount": 0, "citationCount": 126, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2080984", "name": "F. Bergadano"}, {"authorId": "1792257", "name": "D. Gunetti"}]}, {"paperId": "3a108514efc67a62a170ebaf485be22144553d3c", "url": "https://www.semanticscholar.org/paper/3a108514efc67a62a170ebaf485be22144553d3c", "title": "Paraphrase Identification on the Basis of Supervised Machine Learning Techniques", "abstract": null, "year": 2006, "referenceCount": 29, "citationCount": 103, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1714932", "name": "Zornitsa Kozareva"}, {"authorId": "9259337", "name": "A. Montoyo"}]}, {"paperId": "0a1767633b5f586c8fc81b5402d51fe3f0d3352f", "url": "https://www.semanticscholar.org/paper/0a1767633b5f586c8fc81b5402d51fe3f0d3352f", "title": "Machine learning and genome annotation: a match meant to be?", "abstract": null, "year": 2013, "referenceCount": 128, "citationCount": 87, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "4277180", "name": "Kevin Y. Yip"}, {"authorId": "1576009457", "name": "Chao Cheng"}, {"authorId": "1717018", "name": "M. Gerstein"}]}, {"paperId": "c5f09665323d22b8248f9e3b459562de6efc5911", "url": "https://www.semanticscholar.org/paper/c5f09665323d22b8248f9e3b459562de6efc5911", "title": "Amp: A modular approach to machine learning in atomistic simulations", "abstract": null, "year": 2016, "referenceCount": 53, "citationCount": 231, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3454273", "name": "A. Khorshidi"}, {"authorId": "34641730", "name": "A. Peterson"}]}, {"paperId": "cac327586f004d404775e893846e5b2486df1c29", "url": "https://www.semanticscholar.org/paper/cac327586f004d404775e893846e5b2486df1c29", "title": "Machine learning ensembles for wind power prediction", "abstract": null, "year": 2016, "referenceCount": 29, "citationCount": 134, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3146037", "name": "J. Heinermann"}, {"authorId": "144309134", "name": "Oliver Kramer"}]}, {"paperId": "833c4ac0599f4b8c5f1ee6ea948ec675fbe56b15", "url": "https://www.semanticscholar.org/paper/833c4ac0599f4b8c5f1ee6ea948ec675fbe56b15", "title": "Neural-Symbolic Computing: An Effective Methodology for Principled Integration of Machine Learning and Reasoning", "abstract": "Current advances in Artificial Intelligence and machine learning in general, and deep learning in particular have reached unprecedented impact not only across research communities, but also over popular media channels. However, concerns about interpretability and accountability of AI have been raised by influential thinkers. In spite of the recent impact of AI, several works have identified the need for principled knowledge representation and reasoning mechanisms integrated with deep learning-based systems to provide sound and explainable models for such systems. Neural-symbolic computing aims at integrating, as foreseen by Valiant, two most fundamental cognitive abilities: the ability to learn from the environment, and the ability to reason from what has been learned. Neural-symbolic computing has been an active topic of research for many years, reconciling the advantages of robust learning in neural networks and reasoning and interpretability of symbolic representation. In this paper, we survey recent accomplishments of neural-symbolic computing as a principled methodology for integrated machine learning and reasoning. We illustrate the effectiveness of the approach by outlining the main characteristics of the methodology: principled integration of neural learning with symbolic knowledge representation and reasoning allowing for the construction of explainable AI systems. The insights provided by neural-symbolic computing shed new light on the increasingly prominent need for interpretable and accountable AI systems.", "year": 2019, "referenceCount": 57, "citationCount": 169, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2925941", "name": "A. Garcez"}, {"authorId": "145467467", "name": "M. Gori"}, {"authorId": "2335532", "name": "L. Lamb"}, {"authorId": "144077615", "name": "L. Serafini"}, {"authorId": "145570895", "name": "Michael Spranger"}, {"authorId": "1930235", "name": "S. Tran"}]}, {"paperId": "ddacf4b9dea711d2ac50f0d6a29e62f3cd96bccb", "url": "https://www.semanticscholar.org/paper/ddacf4b9dea711d2ac50f0d6a29e62f3cd96bccb", "title": "Applications of support vector machines to speech recognition", "abstract": "Recent work in machine learning has focused on models, such as the support vector machine (SVM), that automatically control generalization and parameterization as part of the overall optimization process. In this paper, we show that SVMs provide a significant improvement in performance on a static pattern classification task based on the Deterding vowel data. We also describe an application of SVMs to large vocabulary speech recognition and demonstrate an improvement in error rate on a continuous alphadigit task (OGI Alphadigits) and a large vocabulary conversational speech task (Switchboard). Issues related to the development and optimization of an SVM/HMM hybrid system are discussed.", "year": 2004, "referenceCount": 66, "citationCount": 292, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1782807", "name": "A. Ganapathiraju"}, {"authorId": "144170973", "name": "J. Hamaker"}, {"authorId": "1744408", "name": "J. Picone"}]}, {"paperId": "c27b5c53985996834540243b4c3173ba18efc386", "url": "https://www.semanticscholar.org/paper/c27b5c53985996834540243b4c3173ba18efc386", "title": "Machine Learning Algorithms in Bipedal Robot Control", "abstract": "Over the past decades, machine learning techniques, such as supervised learning, reinforcement learning, and unsupervised learning, have been increasingly used in the control engineering community. Various learning algorithms have been developed to achieve autonomous operation and intelligent decision making for many complex and challenging control problems. One of such problems is bipedal walking robot control. Although still in their early stages, learning techniques have demonstrated promising potential to build adaptive control systems for bipedal robots. This paper gives a review of recent advances on the state-of-the-art learning algorithms and their applications to bipedal robot control. The effects and limitations of different learning techniques are discussed through a representative selection of examples from the literature. Guidelines for future research on learning control of bipedal robots are provided in the end.", "year": 2012, "referenceCount": 142, "citationCount": 68, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2116951567", "name": "Shouyi Wang"}, {"authorId": "1936810", "name": "W. Chaovalitwongse"}, {"authorId": "1705222", "name": "Robert Babuška"}]}, {"paperId": "069425ec2c7729f6fddd2bac3702a4ecce694593", "url": "https://www.semanticscholar.org/paper/069425ec2c7729f6fddd2bac3702a4ecce694593", "title": "A Polynomial Approach to the Constructive Induction of Structural Knowledge", "abstract": null, "year": 1994, "referenceCount": 65, "citationCount": 93, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2563970", "name": "J. Kietz"}, {"authorId": "1752599", "name": "K. Morik"}]}, {"paperId": "9ebb28851b253817f9a0ea5ddc22b0fd9a934a2f", "url": "https://www.semanticscholar.org/paper/9ebb28851b253817f9a0ea5ddc22b0fd9a934a2f", "title": "Deep Learning--based Text Classification", "abstract": "Deep learning--based models have surpassed classical machine learning--based approaches in various text classification tasks, including sentiment analysis, news categorization, question answering, and natural language inference. In this article, we provide a comprehensive review of more than 150 deep learning--based models for text classification developed in recent years, and we discuss their technical contributions, similarities, and strengths. We also provide a summary of more than 40 popular datasets widely used for text classification. Finally, we provide a quantitative analysis of the performance of different deep learning models on popular benchmarks, and we discuss future research directions.", "year": 2020, "referenceCount": 239, "citationCount": 230, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2164604", "name": "Shervin Minaee"}, {"authorId": "2583391", "name": "Nal Kalchbrenner"}, {"authorId": "49943757", "name": "E. Cambria"}, {"authorId": "1620486779", "name": "Narjes Nikzad"}, {"authorId": "89845455", "name": "M. Chenaghlu"}, {"authorId": "1800422", "name": "Jianfeng Gao"}]}, {"paperId": "775dc4bdfb51541acbeced051d2bd8ce0840367c", "url": "https://www.semanticscholar.org/paper/775dc4bdfb51541acbeced051d2bd8ce0840367c", "title": "Temporal Sequence Learning, Prediction, and Control: A Review of Different Models and Their Relation to Biological Mechanisms", "abstract": "In this review, we compare methods for temporal sequence learning (TSL) across the disciplines machine-control, classical conditioning, neuronal models for TSL as well as spike-timing-dependent plasticity (STDP). This review introduces the most influential models and focuses on two questions: To what degree are reward-based (e.g., TD learning) and correlation-based (Hebbian) learning related? and How do the different models correspond to possibly underlying biological mechanisms of synaptic plasticity? We first compare the different models in an open-loop condition, where behavioral feedback does not alter the learning. Here we observe that reward-based and correlation-based learning are indeed very similar. Machine control is then used to introduce the problem of closed-loop control (e.g., actor-critic architectures). Here the problem of evaluative (rewards) versus nonevaluative (correlations) feedback from the environment will be discussed, showing that both learning approaches are fundamentally different in the closed-loop condition. In trying to answer the second question, we compare neuronal versions of the different learning architectures to the anatomy of the involved brain structures (basal-ganglia, thalamus, and cortex) and the molecular biophysics of glutamatergic and dopaminergic synapses. Finally, we discuss the different algorithms used to model STDP and compare them to reward-based learning rules. Certain similarities are found in spite of the strongly different timescales. Here we focus on the biophysics of the different calcium-release mechanisms known to be involved in STDP.", "year": 2005, "referenceCount": 353, "citationCount": 222, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Psychology", "Medicine"], "authors": [{"authorId": "1714016", "name": "F. Wörgötter"}, {"authorId": "2728662", "name": "B. Porr"}]}, {"paperId": "46038cb1606041001be2f42b4e09f630d4b4147f", "url": "https://www.semanticscholar.org/paper/46038cb1606041001be2f42b4e09f630d4b4147f", "title": "On Challenges in Machine Learning Model Management", "abstract": "The training, maintenance, deployment, monitoring, organization and documentation of machine learning (ML) models – in short model management – is a critical task in virtually all production ML use cases. Wrong model management decisions can lead to poor performance of a ML system and result in high maintenance cost. As both research on infrastructure as well as on algorithms is quickly evolving, there is a lack of understanding of challenges and best practices for ML model management. Therefore, this field is receiving increased attention in recent years, both from the data management as well as from the ML community. In this paper, we discuss a selection of ML use cases, develop an overview over conceptual, engineering, and data-related challenges arising in the management of the corresponding ML models, and point out future research directions.", "year": 2018, "referenceCount": 42, "citationCount": 99, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2180399", "name": "Sebastian Schelter"}, {"authorId": "2170760", "name": "F. Biessmann"}, {"authorId": "2166235", "name": "Tim Januschowski"}, {"authorId": "144607961", "name": "David Salinas"}, {"authorId": "1792476", "name": "Stephan Seufert"}, {"authorId": "72270481", "name": "Gyuri Szarvas"}]}, {"paperId": "1890c124749d00cce965e0b9495eafe127e16a26", "url": "https://www.semanticscholar.org/paper/1890c124749d00cce965e0b9495eafe127e16a26", "title": "Chapter 11 Transfer Learning", "abstract": "Transfer learning is the improvement of learning in a new task through the transfer of knowledge from a related task that has already been learned. While most machine learning algorithms are designed to address single tasks, the development of algorithms that facilitate transfer learning is a topic of ongoing interest in the machine-learning community. This chapter provides an introduction to the goals, formulations, and challenges of transfer learning. It surveys current research in this area, giving an overview of the state of the art and outlining the open problems. The survey covers transfer in both inductive learning and reinforcement learning, and discusses the issues of negative transfer and task mapping in depth.", "year": 2009, "referenceCount": 63, "citationCount": 93, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1801209", "name": "Lisa A. Torrey"}, {"authorId": "1734317", "name": "J. Shavlik"}]}, {"paperId": "85f6caeba5514b5af83eb0e0309c6b9908e4aa5c", "url": "https://www.semanticscholar.org/paper/85f6caeba5514b5af83eb0e0309c6b9908e4aa5c", "title": "Comparison of Machine Learning Methods With Traditional Models for Use of Administrative Claims With Electronic Medical Records to Predict Heart Failure Outcomes", "abstract": "Key Points Question Can prediction of patient outcomes in heart failure based on routinely collected claims data be improved with machine learning methods and incorporating linked electronic medical records? Findings In this prognostic study including records on 9502 patients, machine learning methods offered only limited improvement over logistic regression in predicting key outcomes in heart failure based on administrative claims. Inclusion of additional predictors from electronic medical records improved prediction for mortality, heart failure hospitalization, and loss in home days but not for high cost. Meaning Models based on claims-only predictors may achieve modest discrimination and accuracy in prediction of key patient outcomes in heart failure, and machine learning approaches and incorporation of additional predictors from electronic medical records may offer some improvement in risk prediction of select outcomes.", "year": 2020, "referenceCount": 28, "citationCount": 118, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "49277759", "name": "R. Desai"}, {"authorId": "1993121367", "name": "Shirley V. Wang"}, {"authorId": "5942717", "name": "M. Vaduganathan"}, {"authorId": "5466525", "name": "T. Evers"}, {"authorId": "145876902", "name": "S. Schneeweiss"}]}, {"paperId": "0b822de3ed689344862eecb5ad86c36eb2ff9de5", "url": "https://www.semanticscholar.org/paper/0b822de3ed689344862eecb5ad86c36eb2ff9de5", "title": "One-Class Classification with Extreme Learning Machine", "abstract": "One-class classification problem has been investigated thoroughly for past decades. Among one of the most effective neural network approaches for one-class classification, autoencoder has been successfully applied for many applications. However, this classifier relies on traditional learning algorithms such as backpropagation to train the network, which is quite time-consuming. To tackle the slow learning speed in autoencoder neural network, we propose a simple and efficient one-class classifier based on extreme learning machine (ELM). The essence of ELM is that the hidden layer need not be tuned and the output weights can be analytically determined, which leads to much faster learning speed. The experimental evaluation conducted on several real-world benchmarks shows that the ELM based one-class classifier can learn hundreds of times faster than autoencoder and it is competitive over a variety of one-class classification methods.", "year": 2015, "referenceCount": 66, "citationCount": 106, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2105528449", "name": "Qian Leng"}, {"authorId": "144097734", "name": "H. Qi"}, {"authorId": "145235303", "name": "Jun Miao"}, {"authorId": "2111465410", "name": "Wentao Zhu"}, {"authorId": "1807065", "name": "Guiping Su"}]}, {"paperId": "55635aac4cd439a00356f83dad52bd8d7b0ea87e", "url": "https://www.semanticscholar.org/paper/55635aac4cd439a00356f83dad52bd8d7b0ea87e", "title": "A Survey on Curriculum Learning", "abstract": "Curriculum learning (CL) is a training strategy that trains a machine learning model from easier data to harder data, which imitates the meaningful learning order in human curricula. As an easy-to-use plug-in, the CL strategy has demonstrated its power in improving the generalization capacity and convergence rate of various models in a wide range of scenarios such as computer vision and natural language processing etc. In this survey article, we comprehensively review CL from various aspects including motivations, definitions, theories, and applications. We discuss works on curriculum learning within a general CL framework, elaborating on how to design a manually predefined curriculum or an automatic curriculum. In particular, we summarize existing CL designs based on the general framework of <italic>Difficulty Measurer <inline-formula><tex-math notation=\"LaTeX\">$+$</tex-math><alternatives><mml:math><mml:mo>+</mml:mo></mml:math><inline-graphic xlink:href=\"wang-ieq1-3069908.gif\"/></alternatives></inline-formula> Training Scheduler</italic> and further categorize the methodologies for automatic CL into four groups, i.e., Self-paced Learning, Transfer Teacher, RL Teacher, and Other Automatic CL. We also analyze principles to select different CL designs that may benefit practical applications. Finally, we present our insights on the relationships connecting CL and other machine learning concepts including transfer learning, meta-learning, continual learning and active learning, etc., then point out challenges in CL as well as potential future research directions deserving further investigations.", "year": 2021, "referenceCount": 153, "citationCount": 75, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2153687490", "name": "Xin Wang"}, {"authorId": "51310474", "name": "Yudong Chen"}, {"authorId": "145583986", "name": "Wenwu Zhu"}]}, {"paperId": "1f8f0329c8c4a9d006ec44dd80338b937afdb216", "url": "https://www.semanticscholar.org/paper/1f8f0329c8c4a9d006ec44dd80338b937afdb216", "title": "Detection of Phishing Attacks: A Machine Learning Approach", "abstract": null, "year": 2008, "referenceCount": 13, "citationCount": 211, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2500317", "name": "Ram B. Basnet"}, {"authorId": "1718382", "name": "S. Mukkamala"}, {"authorId": "1742050", "name": "A. Sung"}]}, {"paperId": "3b5505eaec8583a2dd98d72a84d95b9eff475a81", "url": "https://www.semanticscholar.org/paper/3b5505eaec8583a2dd98d72a84d95b9eff475a81", "title": "Few-shot Learning: A Survey", "abstract": "The quest of `can machines think' and `can machines do what human do' are quests that drive the development of artificial intelligence. Although recent artificial intelligence succeeds in many data intensive applications, it still lacks the ability of learning from limited exemplars and fast generalizing to new tasks. To tackle this problem, one has to turn to machine learning, which supports the scientific study of artificial intelligence. Particularly, a machine learning problem called Few-Shot Learning (FSL) targets at this case. It can rapidly generalize to new tasks of limited supervised experience by turning to prior knowledge, which mimics human's ability to acquire knowledge from few examples through generalization and analogy. It has been seen as a test-bed for real artificial intelligence, a way to reduce laborious data gathering and computationally costly training, and antidote for rare cases learning. With extensive works on FSL emerging, we give a comprehensive survey for it. We first give the formal definition for FSL. Then we point out the core issues of FSL, which turns the problem from \"how to solve FSL\" to \"how to deal with the core issues\". Accordingly, existing works from the birth of FSL to the most recent published ones are categorized in a unified taxonomy, with thorough discussion of the pros and cons for different categories. Finally, we envision possible future directions for FSL in terms of problem setup, techniques, applications and theory, hoping to provide insights to both beginners and experienced researchers.", "year": 2019, "referenceCount": 0, "citationCount": 114, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115793087", "name": "Yaqing Wang"}, {"authorId": "3259992", "name": "Quanming Yao"}]}, {"paperId": "3b718eebc6f4469053dadb5737b67ee18b16722d", "url": "https://www.semanticscholar.org/paper/3b718eebc6f4469053dadb5737b67ee18b16722d", "title": "Beyond prediction: Using big data for policy problems", "abstract": "Machine-learning prediction methods have been extremely productive in applications ranging from medicine to allocating fire and health inspectors in cities. However, there are a number of gaps between making a prediction and making a decision, and underlying assumptions need to be understood in order to optimize data-driven decision-making.", "year": 2017, "referenceCount": 27, "citationCount": 344, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2631417", "name": "S. Athey"}]}, {"paperId": "89c2a023e0eb3d46bfa9e849e77afb83d6d870f4", "url": "https://www.semanticscholar.org/paper/89c2a023e0eb3d46bfa9e849e77afb83d6d870f4", "title": "Machine learning and excited-state molecular dynamics", "abstract": "Machine learning is employed at an increasing rate in the research field of quantum chemistry. While the majority of approaches target the investigation of chemical systems in their electronic ground state, the inclusion of light into the processes leads to electronically excited states and gives rise to several new challenges. Here, we survey recent advances for excited-state dynamics based on machine learning. In doing so, we highlight successes, pitfalls, challenges and future avenues for machine learning approaches for light-induced molecular processes.", "year": 2020, "referenceCount": 306, "citationCount": 28, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "90050189", "name": "J. Westermayr"}, {"authorId": "4850899", "name": "P. Marquetand"}]}, {"paperId": "69d0813dcefd3a8679656529855704b1eab9bf59", "url": "https://www.semanticscholar.org/paper/69d0813dcefd3a8679656529855704b1eab9bf59", "title": "Wrapping a MOOC: Student Perceptions of an Experiment in Blended Learning", "abstract": "Although massive open online courses (MOOCs) are seen to be, and are in fact designed to be, stand-alone online courses, their introduction to the higher education landscape has expanded the space of possibilities for blended course designs (those that combine online and face-to-face learning experiences). Instead of replacing courses at higher education institutions, could MOOCs enhance those courses? This paper reports one such exploration, in which a Stanford University Machine Learning MOOC was integrated into a graduate course in machine learning at Vanderbilt University during the Fall 2012 semester. The blended course design, which leveraged a MOOC course and platform for lecturing, grading, and discussion, enabled the Vanderbilt instructor to lead an overload course in a topic much desired by students. The study shows that while students regarded some elements of the course positively, they had concerns about the coupling of online and in-class components of this particular blended course design. Analysis of student and instructor reflections on the course suggests dimensions for characterizing blended course designs that incorporate MOOCs, either in whole or in part. Given the reported challenges in this case study of integrating a MOOC in its entirety in an on-campus course, the paper advocates for more complex forms of blended learning in which course materials are drawn from multiple MOOCs, as well as from other online sources.", "year": 2013, "referenceCount": 39, "citationCount": 302, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "52554014", "name": "D. Bruff"}, {"authorId": "8993101", "name": "D. Fisher"}, {"authorId": "2070908180", "name": "Karen McEwen"}, {"authorId": "35098540", "name": "Blaine E. Smith"}]}, {"paperId": "2d045aec8585cae8e5ccba56db1d64820cf73773", "url": "https://www.semanticscholar.org/paper/2d045aec8585cae8e5ccba56db1d64820cf73773", "title": "Comparing discriminating transformations and SVM for learning during multimedia retrieval", "abstract": "On-line learning or \"relevance feedback\" techniques for multimedia information retrieval have been explored from many different points of view: from early heuristic-based feature weighting schemes to recently proposed optimal learning algorithms, probabilistic/Bayesian learning algorithms, boosting techniques, discriminant-EM algorithm, support vector machine, and other kernel-based learning machines. Based on a careful examination of the problem and a detailed analysis of the existing solutions, we propose several discriminating transforms as the learning machine during the user interaction. We argue that relevance feedback problem is best represented as a biased classification problem, or a (1+x)-class classification problem. Biased Discriminant Transform (BDT) is shown to outperform all the others. A kernel form is proposed to capture non-linearity in the class distributions.", "year": 2001, "referenceCount": 38, "citationCount": 121, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40403107", "name": "X. Zhou"}, {"authorId": "153652752", "name": "Thomas S. Huang"}]}, {"paperId": "17b05e44253c7100290985d9af2237292f6afc9c", "url": "https://www.semanticscholar.org/paper/17b05e44253c7100290985d9af2237292f6afc9c", "title": "Multicategory ψ-Learning and Support Vector Machine: Computational Tools", "abstract": "Many margin-based binary classification techniques such as support vector machine (SVM) and ψ-learning deliver high performance. An earlier article proposed a new multicategory ψ-learning methodology that shows great promise in generalization ability. However,ψ-learning is computationally difficult because it requires handling a nonconvex minimization problem. In this article, we propose two computational tools for multicategory ψ-learning. The first one is based on d.c. algorithms and solved by sequential quadratic programming, while the second one uses the outer approximation method, which yields the global minimizer via sequential concave minimization. Numerical examples show the proposed algorithms perform well.", "year": 2005, "referenceCount": 14, "citationCount": 126, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "46399637", "name": "Yufeng Liu"}, {"authorId": "2266946", "name": "Xiaotong Shen"}, {"authorId": "144163716", "name": "Hani Doss"}]}, {"paperId": "b7fc718fb6237df4eed84ca47c5a461588a97282", "url": "https://www.semanticscholar.org/paper/b7fc718fb6237df4eed84ca47c5a461588a97282", "title": "Bioactive Molecule Prediction Using Extreme Gradient Boosting", "abstract": "Following the explosive growth in chemical and biological data, the shift from traditional methods of drug discovery to computer-aided means has made data mining and machine learning methods integral parts of today’s drug discovery process. In this paper, extreme gradient boosting (Xgboost), which is an ensemble of Classification and Regression Tree (CART) and a variant of the Gradient Boosting Machine, was investigated for the prediction of biological activity based on quantitative description of the compound’s molecular structure. Seven datasets, well known in the literature were used in this paper and experimental results show that Xgboost can outperform machine learning algorithms like Random Forest (RF), Support Vector Machines (LSVM), Radial Basis Function Neural Network (RBFN) and Naïve Bayes (NB) for the prediction of biological activities. In addition to its ability to detect minority activity classes in highly imbalanced datasets, it showed remarkable performance on both high and low diversity datasets.", "year": 2016, "referenceCount": 34, "citationCount": 155, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "7552337", "name": "Ismail Babajide Mustapha"}, {"authorId": "2689948", "name": "Faisal Saeed"}]}, {"paperId": "36cf47c52668b77705da3429e992a4ee83425165", "url": "https://www.semanticscholar.org/paper/36cf47c52668b77705da3429e992a4ee83425165", "title": "A knowledge-intensive genetic algorithm for supervised learning", "abstract": null, "year": 1993, "referenceCount": 58, "citationCount": 153, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2751408", "name": "C. Janikow"}]}, {"paperId": "508571db5d2f77c17d2829878bb1dc645010dda8", "url": "https://www.semanticscholar.org/paper/508571db5d2f77c17d2829878bb1dc645010dda8", "title": "A Comparative Analysis of Methods for Pruning Decision Trees", "abstract": "In this paper, we address the problem of retrospectively pruning decision trees induced from data, according to a top-down approach. This problem has received considerable attention in the areas of pattern recognition and machine learning, and many distinct methods have been proposed in literature. We make a comparative study of six well-known pruning methods with the aim of understanding their theoretical foundations, their computational complexity, and the strengths and weaknesses of their formulation. Comments on the characteristics of each method are empirically supported. In particular, a wide experimentation performed on several data sets leads us to opposite conclusions on the predictive accuracy of simplified trees from some drawn in the literature. We attribute this divergence to differences in experimental designs. Finally, we prove and make use of a property of the reduced error pruning method to obtain an objective evaluation of the tendency to overprune/underprune observed in each method.", "year": 1997, "referenceCount": 27, "citationCount": 554, "influentialCitationCount": 35, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1700821", "name": "F. Esposito"}, {"authorId": "1738657", "name": "D. Malerba"}, {"authorId": "145467353", "name": "G. Semeraro"}]}, {"paperId": "5ba7944dd68b0e18efad4ca11fb1475cdb0ff618", "url": "https://www.semanticscholar.org/paper/5ba7944dd68b0e18efad4ca11fb1475cdb0ff618", "title": "Toward Massive Machine Type Communications in Ultra-Dense Cellular IoT Networks: Current Issues and Machine Learning-Assisted Solutions", "abstract": "The ever-increasing number of resource-constrained machine-type communication (MTC) devices is leading to the critical challenge of fulfilling diverse communication requirements in dynamic and ultra-dense wireless environments. Among different application scenarios that the upcoming 5G and beyond cellular networks are expected to support, such as enhanced mobile broadband (eMBB), massive machine type communications (mMTCs), and ultra-reliable and low latency communications (URLLCs), the mMTC brings the unique technical challenge of supporting a huge number of MTC devices in cellular networks, which is the main focus of this paper. The related challenges include quality of service (QoS) provisioning, handling highly dynamic and sporadic MTC traffic, huge signalling overhead, and radio access network (RAN) congestion. In this regard, this paper aims to identify and analyze the involved technical issues, to review recent advances, to highlight potential solutions and to propose new research directions. First, starting with an overview of mMTC features and QoS provisioning issues, we present the key enablers for mMTC in cellular networks. Along with the highlights on the inefficiency of the legacy random access (RA) procedure in the mMTC scenario, we then present the key features and channel access mechanisms in the emerging cellular IoT standards, namely, LTE-M and narrowband IoT (NB-IoT). Subsequently, we present a framework for the performance analysis of transmission scheduling with the QoS support along with the issues involved in short data packet transmission. Next, we provide a detailed overview of the existing and emerging solutions toward addressing RAN congestion problem, and then identify potential advantages, challenges, and use cases for the applications of emerging machine learning (ML) techniques in ultra-dense cellular networks. Out of several ML techniques, we focus on the application of low-complexity $Q$ -learning approach in the mMTC scenario along with the recent advances toward enhancing its learning performance and convergence. Finally, we discuss some open research challenges and promising future research directions.", "year": 2018, "referenceCount": 216, "citationCount": 190, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "1399927423", "name": "Shree Krishna Sharma"}, {"authorId": "2107982675", "name": "Xianbin Wang"}]}, {"paperId": "932709a41eee54f3eddbd3b3a7baf043c3ed33ec", "url": "https://www.semanticscholar.org/paper/932709a41eee54f3eddbd3b3a7baf043c3ed33ec", "title": "Learning-Based Model Predictive Control: Toward Safe Learning in Control", "abstract": "Recent successes in the field of machine learning, as well as the availability of increased sensing and computational capabilities in modern control systems, have led to a growing interest in learning and data-driven control techniques. Model predictive control (MPC), as the prime methodology for constrained control, offers a significant opportunity to exploit the abundance of data in a reliable manner, particularly while taking safety constraints into account. This review aims at summarizing and categorizing previous research on learning-based MPC, i.e., the integration or combination of MPC with learning methods, for which we consider three main categories. Most of the research addresses learning for automatic improvement of the prediction model from recorded data. There is, however, also an increasing interest in techniques to infer the parameterization of the MPC controller, i.e., the cost and constraints, that lead to the best closed-loop performance. Finally, we discuss concepts that leverage MPC to augment learning-based controllers with constraint satisfaction properties.", "year": 2020, "referenceCount": 142, "citationCount": 244, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9381839", "name": "Lukas Hewing"}, {"authorId": "2359207", "name": "K. P. Wabersich"}, {"authorId": "47761203", "name": "Marcel Menner"}, {"authorId": "2176899", "name": "M. Zeilinger"}]}, {"paperId": "03956f0d63c1a8a3c9192afc5d05781779858005", "url": "https://www.semanticscholar.org/paper/03956f0d63c1a8a3c9192afc5d05781779858005", "title": "Machine Learning Predictions of Molecular Properties: Accurate Many-Body Potentials and Nonlocality in Chemical Space", "abstract": "Simultaneously accurate and efficient prediction of molecular properties throughout chemical compound space is a critical ingredient toward rational compound design in chemical and pharmaceutical industries. Aiming toward this goal, we develop and apply a systematic hierarchy of efficient empirical methods to estimate atomization and total energies of molecules. These methods range from a simple sum over atoms, to addition of bond energies, to pairwise interatomic force fields, reaching to the more sophisticated machine learning approaches that are capable of describing collective interactions between many atoms or bonds. In the case of equilibrium molecular geometries, even simple pairwise force fields demonstrate prediction accuracy comparable to benchmark energies calculated using density functional theory with hybrid exchange-correlation functionals; however, accounting for the collective many-body interactions proves to be essential for approaching the “holy grail” of chemical accuracy of 1 kcal/mol for both equilibrium and out-of-equilibrium geometries. This remarkable accuracy is achieved by a vectorized representation of molecules (so-called Bag of Bonds model) that exhibits strong nonlocality in chemical space. In addition, the same representation allows us to predict accurate electronic properties of molecules, such as their polarizability and molecular frontier orbital energies.", "year": 2015, "referenceCount": 28, "citationCount": 509, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Physics"], "authors": [{"authorId": "39960184", "name": "K. Hansen"}, {"authorId": "3022604", "name": "Franziska Biegler"}, {"authorId": "6781829", "name": "R. Ramakrishnan"}, {"authorId": "6791798", "name": "Wiktor Pronobis"}, {"authorId": "7847508", "name": "O. A. von Lilienfeld"}, {"authorId": "145034054", "name": "K. Müller"}, {"authorId": "2462983", "name": "A. Tkatchenko"}]}, {"paperId": "dc77fb6c3b053095c74759f35e33029c0cd911fa", "url": "https://www.semanticscholar.org/paper/dc77fb6c3b053095c74759f35e33029c0cd911fa", "title": "Development and Validation of an Electronic Health Record–Based Machine Learning Model to Estimate Delirium Risk in Newly Hospitalized Patients Without Known Cognitive Impairment", "abstract": "Key Points Question Can machine learning be used to predict incident delirium in newly hospitalized patients using only data available in the electronic health record shortly after admission? Findings In this cohort study, classification models were trained using 5 different machine learning algorithms on 14 227 hospital stays and validated on a prospective test set of 3996 hospital stays. The gradient boosting machine model performed best, with an area under the receiver operating characteristic curve of 0.855. Meaning Machine learning can accurately predict delirium risk using electronic health record data on admission and outperforms the nurse-administered prediction rules currently used.", "year": 2018, "referenceCount": 31, "citationCount": 77, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2064868963", "name": "Andrew Wong"}, {"authorId": "47973433", "name": "Albert T. Young"}, {"authorId": "2057099724", "name": "April S. Liang"}, {"authorId": "145776427", "name": "R. Gonzales"}, {"authorId": "6512927", "name": "V. Douglas"}, {"authorId": "48901174", "name": "D. Hadley"}]}, {"paperId": "239b2210b3fbc1f4b8246437a88a668bf9a0d2c0", "url": "https://www.semanticscholar.org/paper/239b2210b3fbc1f4b8246437a88a668bf9a0d2c0", "title": "An overview of classification algorithms for imbalanced datasets", "abstract": "Unbalanced data set, a problem often found in real world application, can cause seriously negative effect on classification performance of machine learning algorithms. There have been many attempts at dealing with classification of unbalanced data sets. In this paper we present a brief review of existing solutions to the class-imbalance problem proposed both at the data and algorithmic levels. Even though a common practice to handle the problem of imbalanced data is to rebalance them artificially by oversampling and/or under-sampling, some researchers proved that modified support vector machine, rough set based minority class oriented rule learning methods, cost sensitive classifier perform good on imbalanced data set. We observed that current research in imbalance data problem is moving to", "year": 2012, "referenceCount": 45, "citationCount": 289, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "70777243", "name": "Vaishali Ganganwar"}]}, {"paperId": "ac0a59165ee2ac666b1880316eefe349b87f6ba0", "url": "https://www.semanticscholar.org/paper/ac0a59165ee2ac666b1880316eefe349b87f6ba0", "title": "Toward Interpretable Machine Learning: Transparent Deep Neural Networks and Beyond", "abstract": "With the broader and highly successful usage of machine learning in industry and the sciences, there has been a growing demand for explainable AI. Interpretability and explanation methods for gaining a better understanding about the problem solving abilities and strategies of nonlinear Machine Learning such as Deep Learning (DL), LSTMs, and kernel methods are therefore receiving increased attention. In this work we aim to (1) provide a timely overview of this active emerging field and explain its theoretical foundations, (2) put interpretability algorithms to a test both from a theory and comparative evaluation perspective using extensive simulations, (3) outline best practice aspects i.e. how to best include interpretation methods into the standard usage of machine learning and (4) demonstrate successful usage of explainable AI in a representative selection of application scenarios. Finally, we discuss challenges and possible future directions of this exciting foundational field of machine learning.", "year": 2020, "referenceCount": 165, "citationCount": 70, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1699054", "name": "W. Samek"}, {"authorId": "144535526", "name": "G. Montavon"}, {"authorId": "3633358", "name": "S. Lapuschkin"}, {"authorId": "51004625", "name": "Christopher J. Anders"}, {"authorId": "145034054", "name": "K. Müller"}]}, {"paperId": "8b20f103c1f20074fa35bd8fc41983964283acac", "url": "https://www.semanticscholar.org/paper/8b20f103c1f20074fa35bd8fc41983964283acac", "title": "Fictitious Self-Play in Extensive-Form Games", "abstract": "Fictitious play is a popular game-theoretic model of learning in games. However, it has received little attention in practical applications to large problems. This paper introduces two variants of fictitious play that are implemented in behavioural strategies of an extensive-form game. The first variant is a full-width process that is realization equivalent to its normal-form counterpart and therefore inherits its convergence guarantees. However, its computational requirements are linear in time and space rather than exponential. The second variant, Fictitious Self-Play, is a machine learning framework that implements fictitious play in a sample-based fashion. Experiments in imperfect-information poker games compare our approaches and demonstrate their convergence to approximate Nash equilibria.", "year": 2015, "referenceCount": 36, "citationCount": 170, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2052354576", "name": "Johannes Heinrich"}, {"authorId": "1975889", "name": "Marc Lanctot"}, {"authorId": "145824029", "name": "David Silver"}]}, {"paperId": "0e54e1d7ca6d795bb5e6bd9ad9291af46fbcaa72", "url": "https://www.semanticscholar.org/paper/0e54e1d7ca6d795bb5e6bd9ad9291af46fbcaa72", "title": "Trident: Efficient 4PC Framework for Privacy Preserving Machine Learning", "abstract": "Machine learning has started to be deployed in fields such as healthcare and finance, which propelled the need for and growth of privacy-preserving machine learning (PPML). We propose an actively secure four-party protocol (4PC), and a framework for PPML, showcasing its applications on four of the most widely-known machine learning algorithms -- Linear Regression, Logistic Regression, Neural Networks, and Convolutional Neural Networks. \nOur 4PC protocol tolerating at most one malicious corruption is practically efficient as compared to the existing works. We use the protocol to build an efficient mixed-world framework (Trident) to switch between the Arithmetic, Boolean, and Garbled worlds. Our framework operates in the offline-online paradigm over rings and is instantiated in an outsourced setting for machine learning. Also, we propose conversions especially relevant to privacy-preserving machine learning. \nThe highlights of our framework include using a minimal number of expensive circuits overall as compared to ABY3. This can be seen in our technique for truncation, which does not affect the online cost of multiplication and removes the need for any circuits in the offline phase. Our B2A conversion has an improvement of $\\mathbf{7} \\times$ in rounds and $\\mathbf{18} \\times$ in the communication complexity. In addition to these, all of the special conversions for machine learning, e.g. Secure Comparison, achieve constant round complexity. \nThe practicality of our framework is argued through improvements in the benchmarking of the aforementioned algorithms when compared with ABY3. All the protocols are implemented over a 64-bit ring in both LAN and WAN settings. Our improvements go up to $\\mathbf{187} \\times$ for the training phase and $\\mathbf{158} \\times$ for the prediction phase when observed over LAN and WAN.", "year": 2019, "referenceCount": 57, "citationCount": 92, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "65831050", "name": "Rahul Rachuri"}, {"authorId": "153456203", "name": "Ajith Suresh"}]}, {"paperId": "2ea4a33a468958de14303daaaba2349d0ed07b73", "url": "https://www.semanticscholar.org/paper/2ea4a33a468958de14303daaaba2349d0ed07b73", "title": "Deterministic Boltzmann Learning Performs Steepest Descent in Weight-Space", "abstract": "The Boltzmann machine learning procedure has been successfully applied in deterministic networks of analog units that use a mean field approximation to efficiently simulate a truly stochastic system (Peterson and Anderson 1987). This type of deterministic Boltzmann machine (DBM) learns much faster than the equivalent stochastic Boltzmann machine (SBM), but since the learning procedure for DBM's is only based on an analogy with SBM's, there is no existing proof that it performs gradient descent in any function, and it has only been justified by simulations. By using the appropriate interpretation for the way in which a DBM represents the probability of an output vector given an input vector, it is shown that the DBM performs steepest descent in the same function as the original SBM, except at rare discontinuities. A very simple way of forcing the weights to become symmetrical is also described, and this makes the DBM more biologically plausible than back-propagation (Werbos 1974; Parker 1985; Rumelhart et al. 1986).", "year": 1989, "referenceCount": 5, "citationCount": 181, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1695689", "name": "Geoffrey E. Hinton"}]}, {"paperId": "462663b9075c11af4c4b24c85b013af91cb08ab7", "url": "https://www.semanticscholar.org/paper/462663b9075c11af4c4b24c85b013af91cb08ab7", "title": "Predictive analytics for chronic kidney disease using machine learning techniques", "abstract": "Predictive analytics for healthcare using machine learning is a challenged task to help doctors decide the exact treatments for saving lives. In this paper, we present machine learning techniques for predicting the chronic kidney disease using clinical data. Four machine learning methods are explored including K-nearest neighbors (KNN), support vector machine (SVM), logistic regression (LR), and decision tree classifiers. These predictive models are constructed from chronic kidney disease dataset and the performance of these models are compared together in order to select the best classifier for predicting the chronic kidney disease.", "year": 2016, "referenceCount": 12, "citationCount": 71, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9323606", "name": "Anusorn Charleonnan"}, {"authorId": "30824028", "name": "Thipwan Fufaung"}, {"authorId": "31260166", "name": "Tippawan Niyomwong"}, {"authorId": "31032350", "name": "Wandee Chokchueypattanakit"}, {"authorId": "31261376", "name": "Sathit Suwannawach"}, {"authorId": "31369331", "name": "Nitat Ninchawee"}]}, {"paperId": "bc183ee72b40416548937b9155b427a65e5ecbb2", "url": "https://www.semanticscholar.org/paper/bc183ee72b40416548937b9155b427a65e5ecbb2", "title": "Iterative Machine Teaching", "abstract": "In this paper, we consider the problem of machine teaching, the inverse problem of machine learning. Different from traditional machine teaching which views the learners as batch algorithms, we study a new paradigm where the learner uses an iterative algorithm and a teacher can feed examples sequentially and intelligently based on the current performance of the learner. We show that the teaching complexity in the iterative case is very different from that in the batch case. Instead of constructing a minimal training set for learners, our iterative machine teaching focuses on achieving fast convergence in the learner model. Depending on the level of information the teacher has from the learner model, we design teaching algorithms which can provably reduce the number of teaching examples and achieve faster convergence than learning without teachers. We also validate our theoretical findings with extensive experiments on different data distribution and real image datasets.", "year": 2017, "referenceCount": 28, "citationCount": 104, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "36326884", "name": "Weiyang Liu"}, {"authorId": "144445933", "name": "Bo Dai"}, {"authorId": "3162535", "name": "Ahmad Humayun"}, {"authorId": "39367354", "name": "C. Tay"}, {"authorId": "144136729", "name": "Chen Yu"}, {"authorId": "2836466", "name": "Linda B. Smith"}, {"authorId": "144177248", "name": "James M. Rehg"}, {"authorId": "1779453", "name": "Le Song"}]}, {"paperId": "46597f490a73ded25110cc8d81d43f6248bbb652", "url": "https://www.semanticscholar.org/paper/46597f490a73ded25110cc8d81d43f6248bbb652", "title": "Machine Learning Applications", "abstract": null, "year": 2015, "referenceCount": 106, "citationCount": 53, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1731683", "name": "P. Bonissone"}]}, {"paperId": "86713aa23ad99039ba76a670797df40ad65a64b2", "url": "https://www.semanticscholar.org/paper/86713aa23ad99039ba76a670797df40ad65a64b2", "title": "An Introduction to Machine Learning", "abstract": "In the last few years, machine learning (ML) and artificial intelligence have seen a new wave of publicity fueled by the huge and ever‐increasing amount of data and computational power as well as the discovery of improved learning algorithms. However, the idea of a computer learning some abstract concept from data and applying them to yet unseen situations is not new and has been around at least since the 1950s. Many of these basic principles are very familiar to the pharmacometrics and clinical pharmacology community. In this paper, we want to introduce the foundational ideas of ML to this community such that readers obtain the essential tools they need to understand publications on the topic. Although we will not go into the very details and theoretical background, we aim to point readers to relevant literature and put applications of ML in molecular biology as well as the fields of pharmacometrics and clinical pharmacology into perspective.", "year": 2020, "referenceCount": 93, "citationCount": 64, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2383814", "name": "Solveig Badillo"}, {"authorId": "49842626", "name": "B. Bánfai"}, {"authorId": "3232090", "name": "F. Birzele"}, {"authorId": "91987714", "name": "I. I. Davydov"}, {"authorId": "2023123740", "name": "L. Hutchinson"}, {"authorId": "1398629935", "name": "T. Kam-Thong"}, {"authorId": "1436740047", "name": "Juliane Siebourg-Polster"}, {"authorId": "3258307", "name": "Bernhard Steiert"}, {"authorId": "2108489886", "name": "J. Zhang"}]}, {"paperId": "d5f2eb89f902609ff7e11e9d3477fe7cc2bc6110", "url": "https://www.semanticscholar.org/paper/d5f2eb89f902609ff7e11e9d3477fe7cc2bc6110", "title": "Microsoft Azure Machine Learning", "abstract": null, "year": 2015, "referenceCount": 0, "citationCount": 65, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "121696843", "name": "S. Mund"}]}, {"paperId": "2ee2592c95bf44aeb10439a14901ee761c99b846", "url": "https://www.semanticscholar.org/paper/2ee2592c95bf44aeb10439a14901ee761c99b846", "title": "Recent Advances in Example-Based Machine Translation", "abstract": "I Foundations of EBMT.- 1 An Overview of EBMT.- 2 What is Example-Based Machine Translation?.- 3 Example-Based Machine Translation in a Controlled Environment.- 4 EBMT Seen as Case-based Reasoning.- II Run-time Approaches to EBMT.- 5 Formalizing Translation Memory.- 6 EBMT Using DP-Matching Between Word Sequences.- 7 A Hybrid Rule and Example-Based Method for Machine Translation.- 8 EBMT of POS-Tagged Sentences via Inductive Learning.- III Template-Driven EBMT.- 9 Learning Translation Templates from Bilingual Translation Examples.- 10 Clustered Transfer Rule Induction for Example-Based Translation.- 11 Translation Patterns, Linguistic Knowledge and Complexity in EBMT.- 12 Inducing Translation Grammars from Bracketed Alignments.- IV EBMT and Derivation Trees.- 13 Extracting Translation Knowledge from Parallel Corpora.- 14 Finding Translation Patterns from Dependency Structures.- 15 A Best-First Alignment Algorithm for Extraction of Transfer Mappings.- 16 Translating with Examples: The LFG-DOT Models of Translation.", "year": 2004, "referenceCount": 4, "citationCount": 167, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "93671213", "name": "M. Carl"}, {"authorId": "144315616", "name": "Andy Way"}, {"authorId": "1735272", "name": "Walter Daelemans"}]}, {"paperId": "2bdae3b9484e139696c983fbd2e6d3ebae581725", "url": "https://www.semanticscholar.org/paper/2bdae3b9484e139696c983fbd2e6d3ebae581725", "title": "Enhancing understanding and improving prediction of severe weather through spatiotemporal relational learning", "abstract": null, "year": 2013, "referenceCount": 88, "citationCount": 42, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2299685", "name": "A. McGovern"}, {"authorId": "30751341", "name": "D. Gagne"}, {"authorId": "2111929791", "name": "John K. Williams"}, {"authorId": "2150172379", "name": "Rodger A. Brown"}, {"authorId": "2112800", "name": "J. Basara"}]}, {"paperId": "be26cdf0573bc8eee1119802e548dfaa2e401bdb", "url": "https://www.semanticscholar.org/paper/be26cdf0573bc8eee1119802e548dfaa2e401bdb", "title": "Overview of deep learning", "abstract": "In recent years, deep learning has achieved great success in many fields, such as computer vision and natural language processing. Compared to traditional machine learning methods, deep learning has a strong learning ability and can make better use of datasets for feature extraction. Because of its practicability, deep learning becomes more and more popular for many researchers to do research works. In this paper, we mainly introduce some advanced neural networks of deep learning and their applications. Besides, we also discuss the limitations and prospects of deep learning.", "year": 2016, "referenceCount": 40, "citationCount": 181, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31254825", "name": "Xuedan Du"}, {"authorId": "2230979", "name": "Yinghao Cai"}, {"authorId": "2117010531", "name": "Shuo Wang"}, {"authorId": "2107887550", "name": "Leijie Zhang"}]}, {"paperId": "772c3f272882c75b6ec847b9502b625501ba3866", "url": "https://www.semanticscholar.org/paper/772c3f272882c75b6ec847b9502b625501ba3866", "title": "Supervised Machine Learning for Population Genetics: A New Paradigm", "abstract": null, "year": 2018, "referenceCount": 95, "citationCount": 231, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "3060593", "name": "Daniel R. Schrider"}, {"authorId": "32093740", "name": "A. Kern"}]}, {"paperId": "8155fbbb65cd7cd49d4e9f257e788c67d8c88019", "url": "https://www.semanticscholar.org/paper/8155fbbb65cd7cd49d4e9f257e788c67d8c88019", "title": "The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning", "abstract": null, "year": 2004, "referenceCount": 0, "citationCount": 704, "influentialCitationCount": 65, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35064932", "name": "R. Rubinstein"}, {"authorId": "1704242", "name": "Dirk P. Kroese"}]}, {"paperId": "9f4c8e1a6f93399eef8556218ac55840e1393105", "url": "https://www.semanticscholar.org/paper/9f4c8e1a6f93399eef8556218ac55840e1393105", "title": "Opportunities in Machine Learning for Healthcare", "abstract": "Modern electronic health records (EHRs) provide data to answer clinically meaningful questions. The growing data in EHRs makes healthcare ripe for the use of machine learning. However, learning in a clinical setting presents unique challenges that complicate the use of common machine learning methodologies. For example, diseases in EHRs are poorly labeled, conditions can encompass multiple underlying endotypes, and healthy individuals are underrepresented. This article serves as a primer to illuminate these challenges and highlights opportunities for members of the machine learning community to contribute to healthcare.", "year": 2018, "referenceCount": 122, "citationCount": 68, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2804918", "name": "M. Ghassemi"}, {"authorId": "40466858", "name": "Tristan Naumann"}, {"authorId": "145610328", "name": "Peter F. Schulam"}, {"authorId": "143649421", "name": "Andrew Beam"}, {"authorId": "2615814", "name": "R. Ranganath"}]}]}