{"total": 5120627, "offset": 3100, "next": 3200, "data": [{"paperId": "a4f981c06d398849eb78894e98e7c16ae4372d7e", "url": "https://www.semanticscholar.org/paper/a4f981c06d398849eb78894e98e7c16ae4372d7e", "title": "Learning multidimensional signal processing", "abstract": "This paper presents our general strategy for designing learning machines as well as a number of particular designs. The search for methods allowing a sufficient level of adaptivity are based on two main principles: 1) simple adaptive local models; and 2) adaptive model distribution. Particularly important concepts in our work is mutual information and canonical correlation. Examples are given on learning feature descriptors, modeling disparity, synthesis of a global 3-mode model and a setup for reinforcement learning of online video coder parameter control.", "year": 1998, "referenceCount": 192, "citationCount": 224, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3117916", "name": "H. Knutsson"}, {"authorId": "145290346", "name": "M. Borga"}, {"authorId": "2976013", "name": "T. Landelius"}]}, {"paperId": "8d5ffc4e6ed933f8f21258e1147ecf6bdca8539d", "url": "https://www.semanticscholar.org/paper/8d5ffc4e6ed933f8f21258e1147ecf6bdca8539d", "title": "Performance evaluation of Botnet DDoS attack detection using machine learning", "abstract": null, "year": 2020, "referenceCount": 61, "citationCount": 74, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "104194322", "name": "Tong Anh Tuan"}, {"authorId": "2086181", "name": "H. Long"}, {"authorId": "144904069", "name": "Le Hoang Son"}, {"authorId": "2107921481", "name": "Raghvendra Kumar"}, {"authorId": "47979571", "name": "Ishaani Priyadarshini"}, {"authorId": "145594963", "name": "N. T. K. Son"}]}, {"paperId": "c6956c05171ba71ee8442a49bfb8316127873b62", "url": "https://www.semanticscholar.org/paper/c6956c05171ba71ee8442a49bfb8316127873b62", "title": "Aleatoric and Epistemic Uncertainty in Machine Learning: A Tutorial Introduction", "abstract": "The notion of uncertainty is of major importance in machine learning and constitutes a key element of machine learning methodology. In line with the statistical tradition, uncertainty has long been perceived as almost synonymous with standard probability and probabilistic predictions. Yet, due to the steadily increasing relevance of machine learning for practical applications and related issues such as safety requirements, new problems and challenges have recently been identified by machine learning scholars, and these problems may call for new methodological developments. In particular, this includes the importance of distinguishing between (at least) two different types of uncertainty, often refereed to as aleatoric and epistemic. In this paper, we provide an introduction to the topic of uncertainty in machine learning as well as an overview of hitherto attempts at handling uncertainty in general and formalizing this distinction in particular.", "year": 2019, "referenceCount": 86, "citationCount": 61, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1691955", "name": "E. Hüllermeier"}, {"authorId": "3249834", "name": "W. Waegeman"}]}, {"paperId": "8077a34c426acff10f0717c0cf0b99958fc3c5ed", "url": "https://www.semanticscholar.org/paper/8077a34c426acff10f0717c0cf0b99958fc3c5ed", "title": "AUTOMATIC TEXT CLASSIFICATION: A TECHNICAL REVIEW", "abstract": "Automatic Text Classification is a semi-supervised machine learning task that automatically assigns a given document to a set of pre-defined categories based on its textual content and extracted features. Automatic Text Classification has important applications in content management, contextual search, opinion mining, product review analysis, spam filtering and text sentiment mining. This paper explains the generic strategy for automatic text classification and surveys existing solutions to major issues such as dealing with unstructured text, handling large number of attributes and selecting a machine learning technique appropriate to the text-classification application.", "year": 2011, "referenceCount": 32, "citationCount": 160, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "36244416", "name": "M. K. Dalal"}, {"authorId": "144123655", "name": "M. Zaveri"}]}, {"paperId": "544950fb0f1353accc40b3a5cc675f0eb939f1da", "url": "https://www.semanticscholar.org/paper/544950fb0f1353accc40b3a5cc675f0eb939f1da", "title": "A Lockdown Technique to Prevent Machine Learning on PUFs for Lightweight Authentication", "abstract": "We present a lightweight PUF-based authentication approach that is practical in settings where a server authenticates a device, and for use cases where the number of authentications is limited over a device's lifetime. Our scheme uses a server-managed challenge/response pair (CRP) lockdown protocol: unlike prior approaches, an adaptive chosen-challenge adversary with machine learning capabilities cannot obtain new CRPs without the server's implicit permission. The adversary is faced with the problem of deriving a PUF model with a limited amount of machine learning training data. Our system-level approach allows a so-called strong PUF to be used for lightweight authentication in a manner that is heuristically secure against today's best machine learning methods through a worst-case CRP exposure algorithmic validation. We also present a degenerate instantiation using a weak PUF that is secure against computationally unrestricted adversaries, which includes any learning adversary, for practical device lifetimes and read-out rates. We validate our approach using silicon PUF data, and demonstrate the feasibility of supporting 10, 1,000, and 1M authentications, including practical configurations that are not learnable with polynomial resources, e.g., the number of CRPs and the attack runtime, using recent results based on the probably-approximately-correct (PAC) complexity-theoretic framework.", "year": 2016, "referenceCount": 41, "citationCount": 141, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2888811", "name": "M. Yu"}, {"authorId": "2077185", "name": "Matthias Hiller"}, {"authorId": "34396254", "name": "Jeroen Delvaux"}, {"authorId": "2066538436", "name": "R. Sowell"}, {"authorId": "1695217", "name": "S. Devadas"}, {"authorId": "1722064", "name": "I. Verbauwhede"}]}, {"paperId": "05f39431776d2b8858132b2118b68a6a68bf4f14", "url": "https://www.semanticscholar.org/paper/05f39431776d2b8858132b2118b68a6a68bf4f14", "title": "Revolt: Collaborative Crowdsourcing for Labeling Machine Learning Datasets", "abstract": "Crowdsourcing provides a scalable and efficient way to construct labeled datasets for training machine learning systems. However, creating comprehensive label guidelines for crowdworkers is often prohibitive even for seemingly simple concepts. Incomplete or ambiguous label guidelines can then result in differing interpretations of concepts and inconsistent labels. Existing approaches for improving label quality, such as worker screening or detection of poor work, are ineffective for this problem and can lead to rejection of honest work and a missed opportunity to capture rich interpretations about data. We introduce Revolt, a collaborative approach that brings ideas from expert annotation workflows to crowd-based labeling. Revolt eliminates the burden of creating detailed label guidelines by harnessing crowd disagreements to identify ambiguous concepts and create rich structures (groups of semantically related items) for post-hoc label decisions. Experiments comparing Revolt to traditional crowdsourced labeling show that Revolt produces high quality labels without requiring label guidelines in turn for an increase in monetary cost. This up front cost, however, is mitigated by Revolt's ability to produce reusable structures that can accommodate a variety of label boundaries without requiring new data to be collected. Further comparisons of Revolt's collaborative and non-collaborative variants show that collaboration reaches higher label accuracy with lower monetary cost.", "year": 2017, "referenceCount": 61, "citationCount": 170, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48808806", "name": "Joseph Chee Chang"}, {"authorId": "1719124", "name": "Saleema Amershi"}, {"authorId": "1783184", "name": "Ece Kamar"}]}, {"paperId": "46f45109ba90ce7ac6068e9c27097949dc3e1c4d", "url": "https://www.semanticscholar.org/paper/46f45109ba90ce7ac6068e9c27097949dc3e1c4d", "title": "1 Support Vector Machine Solvers", "abstract": "The support vector machine (SVM) algorithm (Cortes and Vapnik, 1995) is probably the most widely used kernel learning algorithm. It achieves relatively robust pattern recognition performance using well-established concepts in optimization theory. Despite this mathematical classicism, the implementation of efficient SVM solvers has diverged from the classical methods of numerical optimization. This divergence is common to virtually all learning algorithms. The numerical optimization literature focuses on the asymptotic performance: how quickly the accuracy of the solution increases with computing time. In the case of learning algorithms, two other factors mitigate the impact of optimization accuracy.", "year": 2007, "referenceCount": 0, "citationCount": 88, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "52184096", "name": "L. Bottou"}, {"authorId": "1711460", "name": "Chih-Jen Lin"}]}, {"paperId": "051f6c8aea41f3f52d39a1cafd2d7e2bfa60a564", "url": "https://www.semanticscholar.org/paper/051f6c8aea41f3f52d39a1cafd2d7e2bfa60a564", "title": "Protein sequence classification using extreme learning machine", "abstract": "Traditionally, two protein sequences are classified into the same class if they have high homology in terms of feature patterns extracted through sequence alignment algorithms. These algorithms compare an unseen protein sequence with all the identified protein sequences and returned the higher scored protein sequences. As the sizes of the protein sequence databases are very large, it is a very time consuming job to perform exhaustive comparison of existing protein sequence. Therefore, there is a need to build an improved classification system for effectively identifying protein sequences. In this paper, a recently developed machine learning algorithm referred to as the extreme learning machine (ELM) is used to classify protein sequences with ten classes of super-families downloaded from a public domain database. A comparative study on system performance is conducted between ELM and the main conventional neural network classifier - backpropagation neural networks. Results show that ELM needs up to four orders of magnitude less training time compared to BP Network. The classification accuracy of ELM is also higher than that of BP network. For given network architecture, ELM does not have any control parameters (i.e, stopping criteria, learning rate, learning epoches, etc.) to be manually tuned and can be implemented easily.", "year": 2005, "referenceCount": 13, "citationCount": 102, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49371187", "name": "Dianhui Wang"}, {"authorId": "145678691", "name": "G. Huang"}]}, {"paperId": "40e5a40ae66d44e6c00d562d068d35db6922715d", "url": "https://www.semanticscholar.org/paper/40e5a40ae66d44e6c00d562d068d35db6922715d", "title": "Improving the Accuracy and Speed of Support Vector Machines", "abstract": "Support Vector Learning Machines (SVM) are finding application in pattern recognition, regression estimation, and operator inversion for ill-posed problems. Against this very general backdrop, any methods for improving the generalization performance, or for improving the speed in test phase, of SVMs are of increasing interest. In this paper we combine two such techniques on a pattern recognition problem. The method for improving generalization performance (the \"virtual support vector\" method) does so by incorporating known invariances of the problem. This method achieves a drop in the error rate on 10,000 NIST test digit images of 1.4% to 1.0%. The method for improving the speed (the \"reduced set\" method) does so by approximating the support vector decision surface. We apply this method to achieve a factor of fifty speedup in test phase over the virtual support vector machine. The combined approach yields a machine which is both 22 times faster than the original machine, and which has better generalization performance, achieving 1.1 % error. The virtual support vector method is applicable to any SVM problem with known invariances. The reduced set method is applicable to any support vector machine.", "year": 1996, "referenceCount": 10, "citationCount": 424, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2676309", "name": "C. Burges"}, {"authorId": "1707625", "name": "B. Schölkopf"}]}, {"paperId": "192e7880535131f28b76a4bb6936105c45c6f485", "url": "https://www.semanticscholar.org/paper/192e7880535131f28b76a4bb6936105c45c6f485", "title": "Can Children Understand Machine Learning Concepts?: The Effect of Uncovering Black Boxes", "abstract": "Machine Learning services are integrated into various aspects of everyday life. Their underlying processes are typically black-boxed to increase ease-of-use. Consequently, children lack the opportunity to explore such processes and develop essential mental models. We present a gesture recognition research platform, designed to support learning from experience by uncovering Machine Learning building blocks: Data Labeling and Evaluation. Children used the platform to perform physical gestures, iterating between sampling and evaluation. Their understanding was tested in a pre/post experimental design, in three conditions: learning activity uncovering Data Labeling only, Evaluation only, or both. Our findings show that both building blocks are imperative to enhance children's understanding of basic Machine Learning concepts. Children were able to apply their new knowledge to everyday life context, including personally meaningful applications. We conclude that children's interaction with uncovered black boxes of Machine Learning contributes to a better understanding of the world around them.", "year": 2019, "referenceCount": 44, "citationCount": 65, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "19190271", "name": "Tom Hitron"}, {"authorId": "17787357", "name": "Yoav Orlev"}, {"authorId": "40521060", "name": "I. Wald"}, {"authorId": "2947946", "name": "Ariel Shamir"}, {"authorId": "49983945", "name": "H. Erel"}, {"authorId": "1790753", "name": "Oren Zuckerman"}]}, {"paperId": "57df42bf288114e0b98c0b02d2ba79efa2750135", "url": "https://www.semanticscholar.org/paper/57df42bf288114e0b98c0b02d2ba79efa2750135", "title": "Artificial intelligence approaches for rational drug design and discovery.", "abstract": "Pattern recognition, machine learning and artificial intelligence approaches play an increasingly important role in rational drug design, screening and identification of candidate molecules and studies on quantitative structure-activity relationships (QSAR). In this review, we present an overview of basic concepts and methodology in the fields of machine learning and artificial intelligence (AI). An emphasis is put on methods that enable an intuitive interpretation of the results and facilitate gaining an insight into the structure of the problem at hand. We also discuss representative applications of AI methods to docking, screening and QSAR studies. The growing trend to integrate computational and experimental efforts in that regard and some future developments are discussed. In addition, we comment on a broader role of machine learning and artificial intelligence approaches in biomedical research.", "year": 2007, "referenceCount": 124, "citationCount": 128, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1679601", "name": "Wlodzislaw Duch"}, {"authorId": "2368884", "name": "Karthikeyan Swaminathan"}, {"authorId": "49806460", "name": "J. Meller"}]}, {"paperId": "8058d7aa0b6d0bb046c725f3b17788b66aa3f320", "url": "https://www.semanticscholar.org/paper/8058d7aa0b6d0bb046c725f3b17788b66aa3f320", "title": "A machine learning approach against a masked AES", "abstract": null, "year": 2013, "referenceCount": 54, "citationCount": 147, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39319437", "name": "Liran Lerman"}, {"authorId": "1772497", "name": "Gianluca Bontempi"}, {"authorId": "1802747", "name": "O. Markowitch"}]}, {"paperId": "6f79e82b19470a78eb1f597e1662674b9320a6d9", "url": "https://www.semanticscholar.org/paper/6f79e82b19470a78eb1f597e1662674b9320a6d9", "title": "GamePad: A Learning Environment for Theorem Proving", "abstract": "In this paper, we introduce a system called GamePad that can be used to explore the application of machine learning methods to theorem proving in the Coq proof assistant. Interactive theorem provers such as Coq enable users to construct machine-checkable proofs in a step-by-step manner. Hence, they provide an opportunity to explore theorem proving with human supervision. We use GamePad to synthesize proofs for a simple algebraic rewrite problem and train baseline models for a formalization of the Feit-Thompson theorem. We address position evaluation (i.e., predict the number of proof steps left) and tactic prediction (i.e., predict the next proof step) tasks, which arise naturally in tactic-based theorem proving.", "year": 2018, "referenceCount": 27, "citationCount": 73, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "46307329", "name": "Daniel Huang"}, {"authorId": "6515819", "name": "Prafulla Dhariwal"}, {"authorId": "143711382", "name": "D. Song"}, {"authorId": "1701686", "name": "Ilya Sutskever"}]}, {"paperId": "b401747b5e93b99585f5fe367d34750a5d7da030", "url": "https://www.semanticscholar.org/paper/b401747b5e93b99585f5fe367d34750a5d7da030", "title": "Journal of Machine Learning Research: Preface", "abstract": null, "year": 2014, "referenceCount": 0, "citationCount": 118, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2118385160", "name": "Hang Li"}, {"authorId": "145890410", "name": "Dinh Phung"}]}, {"paperId": "df45e8a96f22c2ccab067b64850d1ce3c2f10c8b", "url": "https://www.semanticscholar.org/paper/df45e8a96f22c2ccab067b64850d1ce3c2f10c8b", "title": "Automated taxonomic classification of phytoplankton sampled with imaging‐in‐flow cytometry", "abstract": "High‐resolution photomicrographs of phytoplankton cells and chains can now be acquired with imaging‐in‐flow systems at rates that make manual identification impractical for many applications. To address the challenge for automated taxonomic identification of images generated by our custom‐built submersible Imaging FlowCytobot, we developed an approach that relies on extraction of image features, which are then presented to a machine learning algorithm for classification. Our approach uses a combination of image feature types including size, shape, symmetry, and texture characteristics, plus orientation invariant moments, diffraction pattern sampling, and co‐occurrence matrix statistics. Some of these features required preprocessing with image analysis techniques including edge detection after phase congruency calculations, morphological operations, boundary representation and simplification, and rotation. For the machine learning strategy, we developed an approach that combines a feature selection algorithm and use of a support vector machine specified with a rigorous parameter selection and training approach. After training, a 22‐category classifier provides 88% overall accuracy for an independent test set, with individual category accuracies ranging from 68% to 99%. We demonstrate application of this classifier to a nearly uninterrupted 2‐month time series of images acquired in Woods Hole Harbor, including use of statistical error correction to derive quantitative concentration estimates, which are shown to be unbiased with respect to manual estimates for random subsamples. Our approach, which provides taxonomically resolved estimates of phytoplankton abundance with fine temporal resolution (hours for many species), permits access to scales of variability from tidal to seasonal and longer.", "year": 2007, "referenceCount": 45, "citationCount": 342, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2121893269", "name": "H. M. Sosik"}, {"authorId": "145128064", "name": "R. Olson"}]}, {"paperId": "7b581c9ce200b031451f592478c7c34b5fc47898", "url": "https://www.semanticscholar.org/paper/7b581c9ce200b031451f592478c7c34b5fc47898", "title": "Task-based End-to-end Model Learning in Stochastic Optimization", "abstract": "With the increasing popularity of machine learning techniques, it has become common to see prediction algorithms operating within some larger process. However, the criteria by which we train these algorithms often differ from the ultimate criteria on which we evaluate them. This paper proposes an end-to-end approach for learning probabilistic machine learning models in a manner that directly captures the ultimate task-based objective for which they will be used, within the context of stochastic programming. We present three experimental evaluations of the proposed approach: a classical inventory stock problem, a real-world electrical grid scheduling task, and a real-world energy storage arbitrage task. We show that the proposed approach can outperform both traditional modeling and purely black-box policy optimization approaches in these applications.", "year": 2017, "referenceCount": 35, "citationCount": 184, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49698491", "name": "P. Donti"}, {"authorId": "145116464", "name": "J. Z. Kolter"}, {"authorId": "1773498", "name": "Brandon Amos"}]}, {"paperId": "aa3ff3ec835fffaf002d5ca4afc354af69ecf117", "url": "https://www.semanticscholar.org/paper/aa3ff3ec835fffaf002d5ca4afc354af69ecf117", "title": "Bayesian Differential Privacy for Machine Learning", "abstract": "Traditional differential privacy is independent of the data distribution. However, this is not well-matched with the modern machine learning context, where models are trained on specific data. As a result, achieving meaningful privacy guarantees in ML often excessively reduces accuracy. We propose Bayesian differential privacy (BDP), which takes into account the data distribution to provide more practical privacy guarantees. We also derive a general privacy accounting method under BDP, building upon the well-known moments accountant. Our experiments demonstrate that in-distribution samples in classic machine learning datasets, such as MNIST and CIFAR-10, enjoy significantly stronger privacy guarantees than postulated by DP, while models maintain high classification accuracy.", "year": 2019, "referenceCount": 54, "citationCount": 33, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2507835", "name": "Aleksei Triastcyn"}, {"authorId": "1735128", "name": "B. Faltings"}]}, {"paperId": "990a17a9f9d02bf489a25e2e2980fab4e6f52642", "url": "https://www.semanticscholar.org/paper/990a17a9f9d02bf489a25e2e2980fab4e6f52642", "title": "Asynchronous Distributed ADMM for Consensus Optimization", "abstract": "Distributed optimization algorithms are highly attractive for solving big data problems. In particular, many machine learning problems can be formulated as the global consensus optimization problem, which can then be solved in a distributed manner by the alternating direction method of multipliers (ADMM) algorithm. However, this suffers from the straggler problem as its updates have to be synchronized. In this paper, we propose an asynchronous ADMM algorithm by using two conditions to control the asynchrony: partial barrier and bounded delay. The proposed algorithm has a simple structure and good convergence guarantees (its convergence rate can be reduced to that of its synchronous counterpart). Experiments on different distributed ADMM applications show that asynchrony reduces the time on network waiting, and achieves faster convergence than its synchronous counterpart in terms of the wall clock time.", "year": 2014, "referenceCount": 24, "citationCount": 325, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109972030", "name": "Ruiliang Zhang"}, {"authorId": "145193332", "name": "J. Kwok"}]}, {"paperId": "9a044eec8de883d45bd748ef0694324f8b1a7812", "url": "https://www.semanticscholar.org/paper/9a044eec8de883d45bd748ef0694324f8b1a7812", "title": "Abduction-Based Explanations for Machine Learning Models", "abstract": "The growing range of applications of Machine Learning (ML) in a multitude of settings motivates the ability of computing small explanations for predictions made. Small explanations are generally accepted as easier for human decision makers to understand. Most earlier work on computing explanations is based on heuristic approaches, providing no guarantees of quality, in terms of how close such solutions are from cardinality- or subset-minimal explanations. This paper develops a constraint-agnostic solution for computing explanations for any ML model. The proposed solution exploits abductive reasoning, and imposes the requirement that the ML model can be represented as sets of constraints using some target constraint reasoning system for which the decision problem can be answered with some oracle. The experimental results, obtained on well-known datasets, validate the scalability of the proposed approach as well as the quality of the computed solutions.", "year": 2018, "referenceCount": 54, "citationCount": 96, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145127870", "name": "Alexey Ignatiev"}, {"authorId": "2701535", "name": "Nina Narodytska"}, {"authorId": "1393656234", "name": "Joao Marques-Silva"}]}, {"paperId": "fad3db9dd291c3a92f95d73da1605ff6a7544629", "url": "https://www.semanticscholar.org/paper/fad3db9dd291c3a92f95d73da1605ff6a7544629", "title": "Optimal Learning", "abstract": null, "year": 2022, "referenceCount": 47, "citationCount": 117, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1852241", "name": "Warrren B Powell"}, {"authorId": "1922747", "name": "P. Frazier"}]}, {"paperId": "59444b096f7c8a561d540102e8b5bfb189edabc6", "url": "https://www.semanticscholar.org/paper/59444b096f7c8a561d540102e8b5bfb189edabc6", "title": "Perspectives on the Impact of Machine Learning, Deep Learning, and Artificial Intelligence on Materials, Processes, and Structures Engineering", "abstract": null, "year": 2018, "referenceCount": 216, "citationCount": 147, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": null, "authors": [{"authorId": "4022088", "name": "D. Dimiduk"}, {"authorId": "3163251", "name": "E. Holm"}, {"authorId": "1969237", "name": "S. Niezgoda"}]}, {"paperId": "070fb2d97e438750bc1b3a354819ce08a4d9e924", "url": "https://www.semanticscholar.org/paper/070fb2d97e438750bc1b3a354819ce08a4d9e924", "title": "gBoost: a mathematical programming approach to graph classification and regression", "abstract": null, "year": 2009, "referenceCount": 46, "citationCount": 147, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2547442", "name": "Hiroto Saigo"}, {"authorId": "2388416", "name": "S. Nowozin"}, {"authorId": "8943978", "name": "T. Kadowaki"}, {"authorId": "1765329", "name": "Taku Kudo"}, {"authorId": "34628173", "name": "K. Tsuda"}]}, {"paperId": "d003a82747ab2276133bc182230a3b70f14d2e85", "url": "https://www.semanticscholar.org/paper/d003a82747ab2276133bc182230a3b70f14d2e85", "title": "Deep Learning in Microscopy Image Analysis: A Survey.", "abstract": "Computerized microscopy image analysis plays an important role in computer aided diagnosis and prognosis. Machine learning techniques have powered many aspects of medical investigation and clinical practice. Recently, deep learning is emerging as a leading machine learning tool in computer vision and has attracted considerable attention in biomedical image analysis. In this paper, we provide a snapshot of this fast-growing field, specifically for microscopy image analysis. We briefly introduce the popular deep neural networks and summarize current deep learning achievements in various tasks, such as detection, segmentation, and classification in microscopy image analysis. In particular, we explain the architectures and the principles of convolutional neural networks, fully convolutional networks, recurrent neural networks, stacked autoencoders, and deep belief networks, and interpret their formulations or modelings for specific tasks on various microscopy images. In addition, we discuss the open challenges and the potential trends of future research in microscopy image analysis using deep learning.", "year": 2018, "referenceCount": 0, "citationCount": 59, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "146764575", "name": "Fuyong Xing"}, {"authorId": "148420812", "name": "Yuanpu Xie"}, {"authorId": "146951411", "name": "Hai Su"}, {"authorId": "146764530", "name": "Fujun Liu"}, {"authorId": "2099966006", "name": "Lin Yang"}]}, {"paperId": "050026aeec0c43751b4f9ae2640d77174f692200", "url": "https://www.semanticscholar.org/paper/050026aeec0c43751b4f9ae2640d77174f692200", "title": "Searching for information in a hypertext medical handbook", "abstract": "Medicine is an ideal domain for hypertext applications and research. Implementing a popular medical handbook in hypertext underscores the need to study hypertext in the context of full-text document retrieval, machine learning, and user interface issues.", "year": 1988, "referenceCount": 14, "citationCount": 207, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "67264874", "name": "E. Mark"}]}, {"paperId": "b79870d22d85dde31c72df6ae147f64d462d177b", "url": "https://www.semanticscholar.org/paper/b79870d22d85dde31c72df6ae147f64d462d177b", "title": "Machine learning in GI endoscopy: practical guidance in how to interpret a novel field", "abstract": "There has been a vast increase in GI literature focused on the use of machine learning in endoscopy. The relative novelty of this field poses a challenge for reviewers and readers of GI journals. To appreciate scientific quality and novelty of machine learning studies, understanding of the technical basis and commonly used techniques is required. Clinicians often lack this technical background, while machine learning experts may be unfamiliar with clinical relevance and implications for daily practice. Therefore, there is an increasing need for a multidisciplinary, international evaluation on how to perform high-quality machine learning research in endoscopy. This review aims to provide guidance for readers and reviewers of peer-reviewed GI journals to allow critical appraisal of the most relevant quality requirements of machine learning studies. The paper provides an overview of common trends and their potential pitfalls and proposes comprehensive quality requirements in six overarching themes: terminology, data, algorithm description, experimental setup, interpretation of results and machine learning in clinical practice.", "year": 2020, "referenceCount": 41, "citationCount": 53, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "15065097", "name": "F. van der Sommen"}, {"authorId": "1423745025", "name": "Jeroen de Groof"}, {"authorId": "120631502", "name": "Maarten P. Struyvenberg"}, {"authorId": "118341291", "name": "J. van der Putten"}, {"authorId": "1482569768", "name": "T. Boers"}, {"authorId": "1430744224", "name": "K. Fockens"}, {"authorId": "2151647", "name": "E. Schoon"}, {"authorId": "3553816", "name": "W. Curvers"}, {"authorId": "122835730", "name": "P. D. De with"}, {"authorId": "2558826", "name": "Y. Mori"}, {"authorId": "2167748", "name": "M. Byrne"}, {"authorId": "1398465128", "name": "J. Bergman"}]}, {"paperId": "c1317f812bfaec25958ec7b5b583eb035fe6d5a1", "url": "https://www.semanticscholar.org/paper/c1317f812bfaec25958ec7b5b583eb035fe6d5a1", "title": "Scoring diverse cellular morphologies in image-based screens with iterative feedback and machine learning", "abstract": "Many biological pathways were first uncovered by identifying mutants with visible phenotypes and by scoring every sample in a screen via tedious and subjective visual inspection. Now, automated image analysis can effectively score many phenotypes. In practical application, customizing an image-analysis algorithm or finding a sufficient number of example cells to train a machine learning algorithm can be infeasible, particularly when positive control samples are not available and the phenotype of interest is rare. Here we present a supervised machine learning approach that uses iterative feedback to readily score multiple subtle and complex morphological phenotypes in high-throughput, image-based screens. First, automated cytological profiling extracts hundreds of numerical descriptors for every cell in every image. Next, the researcher generates a rule (i.e., classifier) to recognize cells with a phenotype of interest during a short, interactive training session using iterative feedback. Finally, all of the cells in the experiment are automatically classified and each sample is scored based on the presence of cells displaying the phenotype. By using this approach, we successfully scored images in RNA interference screens in 2 organisms for the prevalence of 15 diverse cellular morphologies, some of which were previously intractable.", "year": 2009, "referenceCount": 40, "citationCount": 372, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2646100", "name": "T. Jones"}, {"authorId": "1721012", "name": "Anne E Carpenter"}, {"authorId": "3809951", "name": "M. R. Lamprecht"}, {"authorId": "143862649", "name": "J. Moffat"}, {"authorId": "2154459", "name": "S. Silver"}, {"authorId": "34523021", "name": "J. Grenier"}, {"authorId": "5049724", "name": "A. Castoreno"}, {"authorId": "3926612", "name": "U. Eggert"}, {"authorId": "3198018", "name": "D. Root"}, {"authorId": "1729630", "name": "P. Golland"}, {"authorId": "1843680", "name": "D. Sabatini"}]}, {"paperId": "a7a14f141774d05a58b0f5a4d011e91625c7b00d", "url": "https://www.semanticscholar.org/paper/a7a14f141774d05a58b0f5a4d011e91625c7b00d", "title": "Predicting the outcomes of organic reactions via machine learning: are current descriptors sufficient?", "abstract": null, "year": 2017, "referenceCount": 50, "citationCount": 77, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "18125573", "name": "G. Skoraczyński"}, {"authorId": "3272247", "name": "P. Dittwald"}, {"authorId": "40602116", "name": "B. Miasojedow"}, {"authorId": "15569748", "name": "S. Szymkuć"}, {"authorId": "49893795", "name": "E. P. Gajewska"}, {"authorId": "4941209", "name": "B. Grzybowski"}, {"authorId": "2904414", "name": "A. Gambin"}]}, {"paperId": "39604eee28a2401d3e244182504b7b06a71d05c4", "url": "https://www.semanticscholar.org/paper/39604eee28a2401d3e244182504b7b06a71d05c4", "title": "Unsupervised machine learning in atomistic simulations, between predictions and understanding.", "abstract": "Automated analyses of the outcome of a simulation have been an important part of atomistic modeling since the early days, addressing the need of linking the behavior of individual atoms and the collective properties that are usually the final quantity of interest. Methods such as clustering and dimensionality reduction have been used to provide a simplified, coarse-grained representation of the structure and dynamics of complex systems from proteins to nanoparticles. In recent years, the rise of machine learning has led to an even more widespread use of these algorithms in atomistic modeling and to consider different classification and inference techniques as part of a coherent toolbox of data-driven approaches. This perspective briefly reviews some of the unsupervised machine-learning methods-that are geared toward classification and coarse-graining of molecular simulations-seen in relation to the fundamental mathematical concepts that underlie all machine-learning techniques. It discusses the importance of using concise yet complete representations of atomic structures as the starting point of the analyses and highlights the risk of introducing preconceived biases when using machine learning to rationalize and understand structure-property relations. Supervised machine-learning techniques that explicitly attempt to predict the properties of a material given its structure are less susceptible to such biases. Current developments in the field suggest that using these two classes of approaches side-by-side and in a fully integrated mode, while keeping in mind the relations between the data analysis framework and the fundamental physical principles, will be key to realizing the full potential of machine learning to help understand the behavior of complex molecules and materials.", "year": 2019, "referenceCount": 111, "citationCount": 83, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Chemistry", "Physics"], "authors": [{"authorId": "1917770", "name": "M. Ceriotti"}]}, {"paperId": "8b346f6afaf1ad9dafe43d6b7ce1a8dbe3489979", "url": "https://www.semanticscholar.org/paper/8b346f6afaf1ad9dafe43d6b7ce1a8dbe3489979", "title": "The Power of Randomization: Distributed Submodular Maximization on Massive Datasets", "abstract": "A wide variety of problems in machine learning, including exemplar clustering, document summarization, and sensor placement, can be cast as constrained submodular maximization problems. Unfortunately, the resulting submodular optimization problems are often too large to be solved on a single machine. We consider a distributed, greedy algorithm that combines previous approaches with randomization. The result is an algorithm that is embarrassingly parallel and achieves provable, constant factor, worstcase approximation guarantees. In our experiments, we demonstrate its efficiency in large problems with different kinds of constraints with objective values always close to what is achievable in the centralized setting.", "year": 2015, "referenceCount": 15, "citationCount": 88, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1767397", "name": "Rafael da Ponte Barbosa"}, {"authorId": "1725000", "name": "Alina Ene"}, {"authorId": "47320986", "name": "Huy L. Nguyen"}, {"authorId": "144131927", "name": "Justin Ward"}]}, {"paperId": "f6d918d1c9b7bb1e45b9ca750bd9618bf8ef4ad7", "url": "https://www.semanticscholar.org/paper/f6d918d1c9b7bb1e45b9ca750bd9618bf8ef4ad7", "title": "Crop yield prediction using machine learning: A systematic literature review", "abstract": null, "year": 2020, "referenceCount": 75, "citationCount": 221, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1944680782", "name": "Thomas van Klompenburg"}, {"authorId": "2805164", "name": "A. Kassahun"}, {"authorId": "3213443", "name": "C. Catal"}]}, {"paperId": "40e74875bcb2d57c77607cc16daf9d07dd635dc0", "url": "https://www.semanticscholar.org/paper/40e74875bcb2d57c77607cc16daf9d07dd635dc0", "title": "Speech emotion recognition using deep neural network and extreme learning machine", "abstract": "Speech emotion recognition is a challenging problem partly because it is unclear what features are effective for the task. In this paper we propose to utilize deep neural networks (DNNs) to extract high level features from raw data and show that they are effective for speech emotion recognition. We first produce an emotion state probability distribution for each speech segment using DNNs. We then construct utterance-level features from segment-level probability distributions. These utterancelevel features are then fed into an extreme learning machine (ELM), a special simple and efficient single-hidden-layer neural network, to identify utterance-level emotions. The experimental results demonstrate that the proposed approach effectively learns emotional information from low-level features and leads to 20% relative accuracy improvement compared to the stateof-the-art approaches.", "year": 2014, "referenceCount": 22, "citationCount": 560, "influentialCitationCount": 35, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143771219", "name": "Kun Han"}, {"authorId": "144580027", "name": "Dong Yu"}, {"authorId": "2417067", "name": "I. Tashev"}]}, {"paperId": "e1444961fff98048b43bb3212d6633ee8bc9ecc4", "url": "https://www.semanticscholar.org/paper/e1444961fff98048b43bb3212d6633ee8bc9ecc4", "title": "An Overview on Clustering Methods", "abstract": "Clustering is a common technique for statistical data analysis, which is used in many fields, including machine learning, data mining, pattern recognition, image analysis and bioinformatics. Clustering is the process of grouping similar objects into different groups, or more precisely, the partitioning of a data set into subsets, so that the data in each subset according to some defined distance measure. This paper covers about clustering algorithms, benefits and its applications. Paper concludes by discussing some limitations.", "year": 2012, "referenceCount": 10, "citationCount": 444, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2922914", "name": "T. Madhulatha"}]}, {"paperId": "fbde35733765c7f6e5b5b2518fc284d5f29b3865", "url": "https://www.semanticscholar.org/paper/fbde35733765c7f6e5b5b2518fc284d5f29b3865", "title": "Machine Learning for Survival Analysis: A Case Study on Recurrence of Prostate Cancer", "abstract": null, "year": 1999, "referenceCount": 29, "citationCount": 110, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1775384", "name": "B. Zupan"}, {"authorId": "2701105", "name": "J. Demšar"}, {"authorId": "1987434491", "name": "M. Kattan"}, {"authorId": "144402982", "name": "J. Beck"}, {"authorId": "1725040", "name": "I. Bratko"}]}, {"paperId": "e8eadb51a5b98e526aed261f5bc68e00831fb3bc", "url": "https://www.semanticscholar.org/paper/e8eadb51a5b98e526aed261f5bc68e00831fb3bc", "title": "Automated Breast Cancer Diagnosis Based on Machine Learning Algorithms", "abstract": "There have been several empirical studies addressing breast cancer using machine learning and soft computing techniques. Many claim that their algorithms are faster, easier, or more accurate than others are. This study is based on genetic programming and machine learning algorithms that aim to construct a system to accurately differentiate between benign and malignant breast tumors. The aim of this study was to optimize the learning algorithm. In this context, we applied the genetic programming technique to select the best features and perfect parameter values of the machine learning classifiers. The performance of the proposed method was based on sensitivity, specificity, precision, accuracy, and the roc curves. The present study proves that genetic programming can automatically find the best model by combining feature preprocessing methods and classifier algorithms.", "year": 2019, "referenceCount": 50, "citationCount": 84, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1936657", "name": "Habib Dhahri"}, {"authorId": "1452173016", "name": "Eslam Al Maghayreh"}, {"authorId": "1410291190", "name": "A. Mahmood"}, {"authorId": "7591592", "name": "W. Elkilani"}, {"authorId": "1452173191", "name": "Mohammed Faisal Nagi"}]}, {"paperId": "2c12ee28bda90b16b325ed1b8c20988fbae1555f", "url": "https://www.semanticscholar.org/paper/2c12ee28bda90b16b325ed1b8c20988fbae1555f", "title": "Detection of Unauthorized IoT Devices Using Machine Learning Techniques", "abstract": "Security experts have demonstrated numerous risks imposed by Internet of Things (IoT) devices on organizations. Due to the widespread adoption of such devices, their diversity, standardization obstacles, and inherent mobility, organizations require an intelligent mechanism capable of automatically detecting suspicious IoT devices connected to their networks. In particular, devices not included in a white list of trustworthy IoT device types (allowed to be used within the organizational premises) should be detected. In this research, Random Forest, a supervised machine learning algorithm, was applied to features extracted from network traffic data with the aim of accurately identifying IoT device types from the white list. To train and evaluate multi-class classifiers, we collected and manually labeled network traffic data from 17 distinct IoT devices, representing nine types of IoT devices. Based on the classification of 20 consecutive sessions and the use of majority rule, IoT device types that are not on the white list were correctly detected as unknown in 96% of test cases (on average), and white listed device types were correctly classified by their actual types in 99% of cases. Some IoT device types were identified quicker than others (e.g., sockets and thermostats were successfully detected within five TCP sessions of connecting to the network). Perfect detection of unauthorized IoT device types was achieved upon analyzing 110 consecutive sessions; perfect classification of white listed types required 346 consecutive sessions, 110 of which resulted in 99.49% accuracy. Further experiments demonstrated the successful applicability of classifiers trained in one location and tested on another. In addition, a discussion is provided regarding the resilience of our machine learning-based IoT white listing method to adversarial attacks.", "year": 2017, "referenceCount": 52, "citationCount": 159, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "11034542", "name": "Yair Meidan"}, {"authorId": "11055183", "name": "Michael Bohadana"}, {"authorId": "1720589", "name": "A. Shabtai"}, {"authorId": "145010553", "name": "Martín Ochoa"}, {"authorId": "2225170", "name": "Nils Ole Tippenhauer"}, {"authorId": "144953724", "name": "J. Guarnizo"}, {"authorId": "1724372", "name": "Y. Elovici"}]}, {"paperId": "f1386eed2d7bf6a7b85bf709c840edfb698ccf47", "url": "https://www.semanticscholar.org/paper/f1386eed2d7bf6a7b85bf709c840edfb698ccf47", "title": "Classifier systems and the animat problem", "abstract": null, "year": 2004, "referenceCount": 29, "citationCount": 43, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2341152", "name": "Stewart W. Wilson"}]}, {"paperId": "93df739c1279e42f739687bd1b31ddaf60d19a0e", "url": "https://www.semanticscholar.org/paper/93df739c1279e42f739687bd1b31ddaf60d19a0e", "title": "Parallel man-machine training in development of EEG-based cursor control.", "abstract": "A new parallel man-machine training approach to brain-computer interface (BCI) succeeded through a unique application of machine learning methods. The BCI system could train users to control an animated cursor on the computer screen by voluntary electroencephalogram (EEG) modulation. Our BCI system requires only two to four electrodes, and has a relatively short training time for both the user and the machine. Moving the cursor in one dimension, our subjects were able to hit 100% of randomly selected targets, while in two dimensions, accuracies of approximately 63% and 76% was achieved with our two subjects.", "year": 2000, "referenceCount": 8, "citationCount": 192, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "48878345", "name": "A. Kostov"}, {"authorId": "145169798", "name": "M. Polak"}]}, {"paperId": "128a04774830b19c34eae23e3faf2bfed9d13255", "url": "https://www.semanticscholar.org/paper/128a04774830b19c34eae23e3faf2bfed9d13255", "title": "Epileptic seizure detection using hybrid machine learning methods", "abstract": null, "year": 2017, "referenceCount": 43, "citationCount": 154, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9076397", "name": "A. Subasi"}, {"authorId": "2048351", "name": "Jasmin Kevric"}, {"authorId": "3456930", "name": "Muhammed Abdullah Canbaz"}]}, {"paperId": "c2dec7253ffd530689745bbacad04b4017996363", "url": "https://www.semanticscholar.org/paper/c2dec7253ffd530689745bbacad04b4017996363", "title": "Discovering phases, phase transitions, and crossovers through unsupervised machine learning: A critical examination.", "abstract": "We apply unsupervised machine learning techniques, mainly principal component analysis (PCA), to compare and contrast the phase behavior and phase transitions in several classical spin models-the square- and triangular-lattice Ising models, the Blume-Capel model, a highly degenerate biquadratic-exchange spin-1 Ising (BSI) model, and the two-dimensional XY model-and we examine critically what machine learning is teaching us. We find that quantified principal components from PCA not only allow the exploration of different phases and symmetry-breaking, but they can distinguish phase-transition types and locate critical points. We show that the corresponding weight vectors have a clear physical interpretation, which is particularly interesting in the frustrated models such as the triangular antiferromagnet, where they can point to incipient orders. Unlike the other well-studied models, the properties of the BSI model are less well known. Using both PCA and conventional Monte Carlo analysis, we demonstrate that the BSI model shows an absence of phase transition and macroscopic ground-state degeneracy. The failure to capture the \"charge\" correlations (vorticity) in the BSI model (XY model) from raw spin configurations points to some of the limitations of PCA. Finally, we employ a nonlinear unsupervised machine learning procedure, the \"autoencoder method,\" and we demonstrate that it too can be trained to capture phase transitions and critical points.", "year": 2017, "referenceCount": 82, "citationCount": 171, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Medicine"], "authors": [{"authorId": "13827135", "name": "Wenjian Hu"}, {"authorId": "49120926", "name": "Rajiv R. P. Singh"}, {"authorId": "2542621", "name": "R. Scalettar"}]}, {"paperId": "831a54907a8026558e2a294e5adadee6859482c0", "url": "https://www.semanticscholar.org/paper/831a54907a8026558e2a294e5adadee6859482c0", "title": "Learning relational probability trees", "abstract": "Classification trees are widely used in the machine learning and data mining communities for modeling propositional data. Recent work has extended this basic paradigm to probability estimation trees. Traditional tree learning algorithms assume that instances in the training data are homogenous and independently distributed. Relational probability trees (RPTs) extend standard probability estimation trees to a relational setting in which data instances are heterogeneous and interdependent. Our algorithm for learning the structure and parameters of an RPT searches over a space of relational features that use aggregation functions (e.g. AVERAGE, MODE, COUNT) to dynamically propositionalize relational data and create binary splits within the RPT. Previous work has identified a number of statistical biases due to characteristics of relational data such as autocorrelation and degree disparity. The RPT algorithm uses a novel form of randomization test to adjust for these biases. On a variety of relational learning tasks, RPTs built using randomization tests are significantly smaller than other models and achieve equivalent, or better, performance.", "year": 2003, "referenceCount": 13, "citationCount": 259, "influentialCitationCount": 37, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144050371", "name": "Jennifer Neville"}, {"authorId": "144774129", "name": "David D. Jensen"}, {"authorId": "46835179", "name": "L. Friedland"}, {"authorId": "145256244", "name": "Michael Hay"}]}, {"paperId": "5bb26565af6463506a1c7c88277c6ca653adc543", "url": "https://www.semanticscholar.org/paper/5bb26565af6463506a1c7c88277c6ca653adc543", "title": "Learning about risk: Machine learning for risk assessment", "abstract": null, "year": 2019, "referenceCount": 110, "citationCount": 100, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2023348", "name": "N. Paltrinieri"}, {"authorId": "2596268", "name": "L. Comfort"}, {"authorId": "32745363", "name": "G. Reniers"}]}, {"paperId": "b0bbea300988928b7c2998e98e52670b2c365327", "url": "https://www.semanticscholar.org/paper/b0bbea300988928b7c2998e98e52670b2c365327", "title": "Applying machine learning to software fault-proneness prediction", "abstract": null, "year": 2008, "referenceCount": 34, "citationCount": 217, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3108495", "name": "I. Gondra"}]}, {"paperId": "320b227027030fc291de2896fc3c6da49d7614be", "url": "https://www.semanticscholar.org/paper/320b227027030fc291de2896fc3c6da49d7614be", "title": "Solving Rubik's Cube with a Robot Hand", "abstract": "We demonstrate that models trained only in simulation can be used to solve a manipulation problem of unprecedented complexity on a real robot. This is made possible by two key components: a novel algorithm, which we call automatic domain randomization (ADR) and a robot platform built for machine learning. ADR automatically generates a distribution over randomized environments of ever-increasing difficulty. Control policies and vision state estimators trained with ADR exhibit vastly improved sim2real transfer. For control policies, memory-augmented models trained on an ADR-generated distribution of environments show clear signs of emergent meta-learning at test time. The combination of ADR with our custom robot platform allows us to solve a Rubik's cube with a humanoid robot hand, which involves both control and state estimation problems. Videos summarizing our results are available: this https URL", "year": 2019, "referenceCount": 127, "citationCount": 667, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "51139888", "name": "OpenAI"}, {"authorId": "2258629", "name": "Ilge Akkaya"}, {"authorId": "2206490", "name": "Marcin Andrychowicz"}, {"authorId": "36045639", "name": "Maciek Chociej"}, {"authorId": "1380985420", "name": "Mateusz Litwin"}, {"authorId": "39593364", "name": "Bob McGrew"}, {"authorId": "6817951", "name": "Arthur Petron"}, {"authorId": "34800652", "name": "Alex Paino"}, {"authorId": "3407285", "name": "Matthias Plappert"}, {"authorId": "2059171221", "name": "Glenn Powell"}, {"authorId": "1380603785", "name": "Raphael Ribas"}, {"authorId": "2113526509", "name": "Jonas Schneider"}, {"authorId": "145950540", "name": "N. Tezak"}, {"authorId": "2065005836", "name": "Jerry Tworek"}, {"authorId": "2930640", "name": "P. Welinder"}, {"authorId": "2065741038", "name": "Lilian Weng"}, {"authorId": "153930486", "name": "Qiming Yuan"}, {"authorId": "2563432", "name": "Wojciech Zaremba"}, {"authorId": "2152836492", "name": "Lei M. Zhang"}]}, {"paperId": "462754e479123ef2167c3946fd4cd04a242c2767", "url": "https://www.semanticscholar.org/paper/462754e479123ef2167c3946fd4cd04a242c2767", "title": "A machine learning approach to sentiment analysis in multilingual Web texts", "abstract": null, "year": 2009, "referenceCount": 76, "citationCount": 415, "influentialCitationCount": 22, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2955093", "name": "Erik Boiy"}, {"authorId": "145446752", "name": "Marie-Francine Moens"}]}, {"paperId": "c8576b5df33813fe8938cbb19e35217ee21fc80b", "url": "https://www.semanticscholar.org/paper/c8576b5df33813fe8938cbb19e35217ee21fc80b", "title": "Permission-Based Android Malware Detection", "abstract": "Mobile devices have become popular in our lives since they offer almost the same functionality as personal computers. Among them, Android-based mobile devices had appeared lately and, they were now an ideal target for attackers. Android-based smartphone users can get free applications from Android Application Market. But, these applications were not certified by legitimate organizations and they may contain malware applications that can steal privacy information for users. In this paper, a framework that can detect android malware applications is propos ed to help organizing Android Market. The proposed framework intends to develop a machine learning-based malware detection system on Android to detect malware applications and to enhance security and privacy of smartphone users. This system monitors various permissionbased features and events obtained from the android applications, and analyses these features by using machine learning classifiers to classify whether the application is goodware or malware.", "year": 2013, "referenceCount": 19, "citationCount": 251, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2144918437", "name": "Zarni Aung"}, {"authorId": "2110933", "name": "W. Zaw"}]}, {"paperId": "fd328a4c3f414e87c64eafbd5b3625042adb4b78", "url": "https://www.semanticscholar.org/paper/fd328a4c3f414e87c64eafbd5b3625042adb4b78", "title": "Heart disease prediction using machine learning techniques : a survey", "abstract": "Heart related diseases or Cardiovascular Diseases (CVDs) are the main reason for a huge number of death in the world over the last few decades and has emerged as the most life-threatening disease, not only in India but in the whole world. So, there is a need of reliable, accurate and feasible system to diagnose such diseases in time for proper treatment. Machine Learning algorithms and techniques have been applied to various medical datasets to automate the analysis of large and complex data. Many researchers, in recent times, have been using several machine learning techniques to help the health care industry and the professionals in the diagnosis of heart related diseases. This paper presents a survey of various models based on such algorithms and techniques andanalyze their performance. Models based on supervised learning algorithms such as Support Vector Machines (SVM), K-Nearest Neighbour (KNN), NaïveBayes, Decision Trees (DT), Random Forest (RF) and ensemble models are found very popular among the researchers.", "year": 2018, "referenceCount": 29, "citationCount": 99, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144287454", "name": "V. Ramalingam"}, {"authorId": "72137919", "name": "A. Dandapath"}, {"authorId": "152850967", "name": "M. Raja"}]}, {"paperId": "08320e328296495d973df25974e66727e63c1c3b", "url": "https://www.semanticscholar.org/paper/08320e328296495d973df25974e66727e63c1c3b", "title": "Use of machine learning approaches for novel drug discovery", "abstract": "abstract Introduction: The use of computational tools in the early stages of drug development has increased in recent decades. Machine learning (ML) approaches have been of special interest, since they can be applied in several steps of the drug discovery methodology, such as prediction of target structure, prediction of biological activity of new ligands through model construction, discovery or optimization of hits, and construction of models that predict the pharmacokinetic and toxicological (ADMET) profile of compounds. Areas covered: This article presents an overview on some applications of ML techniques in drug design. These techniques can be employed in ligand-based drug design (LBDD) and structure-based drug design (SBDD) studies, such as similarity searches, construction of classification and/or prediction models of biological activity, prediction of secondary structures and binding sites docking and virtual screening. Expert opinion: Successful cases have been reported in the literature, demonstrating the efficiency of ML techniques combined with traditional approaches to study medicinal chemistry problems. Some ML techniques used in drug design are: support vector machine, random forest, decision trees and artificial neural networks. Currently, an important application of ML techniques is related to the calculation of scoring functions used in docking and virtual screening assays from a consensus, combining traditional and ML techniques in order to improve the prediction of binding sites and docking solutions.", "year": 2016, "referenceCount": 184, "citationCount": 160, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "46480421", "name": "Angélica Nakagawa Lima"}, {"authorId": "2335673", "name": "E. A. Philot"}, {"authorId": "4982244", "name": "G. Trossini"}, {"authorId": "143865051", "name": "L. Scott"}, {"authorId": "6019396", "name": "V. Maltarollo"}, {"authorId": "2082452", "name": "K. M. Honorio"}]}, {"paperId": "30c6f7725bcd1502ac9de22eb1cfc66426b2855b", "url": "https://www.semanticscholar.org/paper/30c6f7725bcd1502ac9de22eb1cfc66426b2855b", "title": "Kernelized value function approximation for reinforcement learning", "abstract": "A recent surge in research in kernelized approaches to reinforcement learning has sought to bring the benefits of kernelized machine learning techniques to reinforcement learning. Kernelized reinforcement learning techniques are fairly new and different authors have approached the topic with different assumptions and goals. Neither a unifying view nor an understanding of the pros and cons of different approaches has yet emerged. In this paper, we offer a unifying view of the different approaches to kernelized value function approximation for reinforcement learning. We show that, except for different approaches to regularization, Kernelized LSTD (KLSTD) is equivalent to a modelbased approach that uses kernelized regression to find an approximate reward and transition model, and that Gaussian Process Temporal Difference learning (GPTD) returns a mean value function that is equivalent to these other approaches. We also discuss the relationship between our modelbased approach and the earlier Gaussian Processes in Reinforcement Learning (GPRL). Finally, we decompose the Bellman error into the sum of transition error and reward error terms, and demonstrate through experiments that this decomposition can be helpful in choosing regularization parameters.", "year": 2009, "referenceCount": 16, "citationCount": 117, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2189083", "name": "Gavin Taylor"}, {"authorId": "145726861", "name": "Ronald E. Parr"}]}, {"paperId": "8bdc6fae0b59b2aa8ae362cf860a0ed9786bc39d", "url": "https://www.semanticscholar.org/paper/8bdc6fae0b59b2aa8ae362cf860a0ed9786bc39d", "title": "Predicting diabetes mellitus using SMOTE and ensemble machine learning approach: The Henry Ford ExercIse Testing (FIT) project", "abstract": "Machine learning is becoming a popular and important approach in the field of medical research. In this study, we investigate the relative performance of various machine learning methods such as Decision Tree, Naïve Bayes, Logistic Regression, Logistic Model Tree and Random Forests for predicting incident diabetes using medical records of cardiorespiratory fitness. In addition, we apply different techniques to uncover potential predictors of diabetes. This FIT project study used data of 32,555 patients who are free of any known coronary artery disease or heart failure who underwent clinician-referred exercise treadmill stress testing at Henry Ford Health Systems between 1991 and 2009 and had a complete 5-year follow-up. At the completion of the fifth year, 5,099 of those patients have developed diabetes. The dataset contained 62 attributes classified into four categories: demographic characteristics, disease history, medication use history, and stress test vital signs. We developed an Ensembling-based predictive model using 13 attributes that were selected based on their clinical importance, Multiple Linear Regression, and Information Gain Ranking methods. The negative effect of the imbalance class of the constructed model was handled by Synthetic Minority Oversampling Technique (SMOTE). The overall performance of the predictive model classifier was improved by the Ensemble machine learning approach using the Vote method with three Decision Trees (Naïve Bayes Tree, Random Forest, and Logistic Model Tree) and achieved high accuracy of prediction (AUC = 0.92). The study shows the potential of ensembling and SMOTE approaches for predicting incident diabetes using cardiorespiratory fitness data.", "year": 2017, "referenceCount": 61, "citationCount": 173, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "143743435", "name": "M. Alghamdi"}, {"authorId": "1397581130", "name": "M. Al-Mallah"}, {"authorId": "152695843", "name": "Steven K Keteyian"}, {"authorId": "4701643", "name": "C. Brawner"}, {"authorId": "2976656", "name": "J. Ehrman"}, {"authorId": "144250946", "name": "S. Sakr"}]}, {"paperId": "b7f2f024a1498b2c47f3fce569efbc3154ee1e8f", "url": "https://www.semanticscholar.org/paper/b7f2f024a1498b2c47f3fce569efbc3154ee1e8f", "title": "Artificial Intelligence and Machine Learning in Anesthesiology.", "abstract": "Commercial applications of artificial intelligence and machine learning have made remarkable progress recently, particularly in areas such as image recognition, natural speech processing, language translation, textual analysis, and self-learning. Progress had historically languished in these areas, such that these skills had come to seem ineffably bound to intelligence. However, these commercial advances have performed best at single-task applications in which imperfect outputs and occasional frank errors can be tolerated.The practice of anesthesiology is different. It embodies a requirement for high reliability, and a pressured cycle of interpretation, physical action, and response rather than any single cognitive act. This review covers the basics of what is meant by artificial intelligence and machine learning for the practicing anesthesiologist, describing how decision-making behaviors can emerge from simple equations. Relevant clinical questions are introduced to illustrate how machine learning might help solve them-perhaps bringing anesthesiology into an era of machine-assisted discovery.", "year": 2019, "referenceCount": 116, "citationCount": 70, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2212934", "name": "C. Connor"}]}, {"paperId": "2a957bfcd11761cabb851e8a59fc4d022d92cd73", "url": "https://www.semanticscholar.org/paper/2a957bfcd11761cabb851e8a59fc4d022d92cd73", "title": "Less is more: sampling chemical space with active learning", "abstract": "The development of accurate and transferable machine learning (ML) potentials for predicting molecular energetics is a challenging task. The process of data generation to train such ML potentials is a task neither well understood nor researched in detail. In this work, we present a fully automated approach for the generation of datasets with the intent of training universal ML potentials. It is based on the concept of active learning (AL) via Query by Committee (QBC), which uses the disagreement between an ensemble of ML potentials to infer the reliability of the ensemble's prediction. QBC allows the presented AL algorithm to automatically sample regions of chemical space where the ML potential fails to accurately predict the potential energy. AL improves the overall fitness of ANAKIN-ME (ANI) deep learning potentials in rigorous test cases by mitigating human biases in deciding what new training data to use. AL also reduces the training set size to a fraction of the data required when using naive random sampling techniques. To provide validation of our AL approach, we develop the COmprehensive Machine-learning Potential (COMP6) benchmark (publicly available on GitHub) which contains a diverse set of organic molecules. Active learning-based ANI potentials outperform the original random sampled ANI-1 potential with only 10% of the data, while the final active learning-based model vastly outperforms ANI-1 on the COMP6 benchmark after training to only 25% of the data. Finally, we show that our proposed AL technique develops a universal ANI potential (ANI-1x) that provides accurate energy and force predictions on the entire COMP6 benchmark. This universal ML potential achieves a level of accuracy on par with the best ML potentials for single molecules or materials, while remaining applicable to the general class of organic molecules composed of the elements CHNO.", "year": 2018, "referenceCount": 62, "citationCount": 317, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics", "Medicine"], "authors": [{"authorId": "2109795450", "name": "Justin S. Smith"}, {"authorId": "16253773", "name": "B. Nebgen"}, {"authorId": "95613409", "name": "N. Lubbers"}, {"authorId": "2385206", "name": "O. Isayev"}, {"authorId": "145848913", "name": "A. Roitberg"}]}, {"paperId": "1cf6a15921ee7377044e99a3d58c1d5ecef5da1b", "url": "https://www.semanticscholar.org/paper/1cf6a15921ee7377044e99a3d58c1d5ecef5da1b", "title": "Dynamic Multicore Resource Management: A Machine Learning Approach", "abstract": "A machine learning approach to multicore resource management produces self-optimizing on-chip hardware agents capable of learning, planning, and continuously adapting to changing workload demands. Machine learning is the study of computer programs and algorithms that learn about their environment and improve automatically with experience.This approach thus contrasts with today's predominant approach of directly specifying at design time how the hardware should accomplish the desired goal. This results in more efficient and flexible management of critical hardware resources at runtime.", "year": 2009, "referenceCount": 28, "citationCount": 78, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109798451", "name": "José F. Martínez"}, {"authorId": "1787439", "name": "Engin Ipek"}]}, {"paperId": "ebb38c8b36508aad443e989a677e9bcd67e43498", "url": "https://www.semanticscholar.org/paper/ebb38c8b36508aad443e989a677e9bcd67e43498", "title": "Prediction Models of Functional Outcomes for Individuals in the Clinical High-Risk State for Psychosis or With Recent-Onset Depression: A Multimodal, Multisite Machine Learning Analysis.", "abstract": "Importance\nSocial and occupational impairments contribute to the burden of psychosis and depression. There is a need for risk stratification tools to inform personalized functional-disability preventive strategies for individuals in at-risk and early phases of these illnesses.\n\n\nObjective\nTo determine whether predictors associated with social and role functioning can be identified in patients in clinical high-risk (CHR) states for psychosis or with recent-onset depression (ROD) using clinical, imaging-based, and combined machine learning; assess the geographic, transdiagnostic, and prognostic generalizability of machine learning and compare it with human prognostication; and explore sequential prognosis encompassing clinical and combined machine learning.\n\n\nDesign, Setting, and Participants\nThis multisite naturalistic study followed up patients in CHR states, with ROD, and with recent-onset psychosis, and healthy control participants for 18 months in 7 academic early-recognition services in 5 European countries. Participants were recruited between February 2014 and May 2016, and data were analyzed from April 2017 to January 2018.\n\n\nMain Outcomes and Measures\nPerformance and generalizability of prognostic models.\n\n\nResults\nA total of 116 individuals in CHR states (mean [SD] age, 24.0 [5.1] years; 58 [50.0%] female) and 120 patients with ROD (mean [SD] age, 26.1 [6.1] years; 65 [54.2%] female) were followed up for a mean (SD) of 329 (142) days. Machine learning predicted the 1-year social-functioning outcomes with a balanced accuracy of 76.9% of patients in CHR states and 66.2% of patients with ROD using clinical baseline data. Balanced accuracy in models using structural neuroimaging was 76.2% in patients in CHR states and 65.0% in patients with ROD, and in combined models, it was 82.7% for CHR states and 70.3% for ROD. Lower functioning before study entry was a transdiagnostic predictor. Medial prefrontal and temporo-parieto-occipital gray matter volume (GMV) reductions and cerebellar and dorsolateral prefrontal GMV increments had predictive value in the CHR group; reduced mediotemporal and increased prefrontal-perisylvian GMV had predictive value in patients with ROD. Poor prognoses were associated with increased risk of psychotic, depressive, and anxiety disorders at follow-up in patients in the CHR state but not ones with ROD. Machine learning outperformed expert prognostication. Adding neuroimaging machine learning to clinical machine learning provided a 1.9-fold increase of prognostic certainty in uncertain cases of patients in CHR states, and a 10.5-fold increase of prognostic certainty for patients with ROD.\n\n\nConclusions and Relevance\nPrecision medicine tools could augment effective therapeutic strategies aiming at the prevention of social functioning impairments in patients with CHR states or with ROD.", "year": 2018, "referenceCount": 0, "citationCount": 106, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "3214043", "name": "N. Koutsouleris"}, {"authorId": "1414119219", "name": "L. Kambeitz-Ilankovic"}, {"authorId": "1982479", "name": "S. Ruhrmann"}, {"authorId": "40892922", "name": "M. Rosen"}, {"authorId": "32098768", "name": "A. Ruef"}, {"authorId": "5672681", "name": "D. Dwyer"}, {"authorId": "5250359", "name": "M. Paolini"}, {"authorId": "15568397", "name": "Katharine Chisholm"}, {"authorId": "2876416", "name": "J. Kambeitz"}, {"authorId": "40900560", "name": "T. Haidl"}, {"authorId": "12462273", "name": "A. Schmidt"}, {"authorId": "40210909", "name": "J. Gillam"}, {"authorId": "1398034341", "name": "F. Schultze-Lutter"}, {"authorId": "2660554", "name": "P. Falkai"}, {"authorId": "145371637", "name": "M. Reiser"}, {"authorId": "146173036", "name": "A. Riecher-Rössler"}, {"authorId": "4361455", "name": "R. Upthegrove"}, {"authorId": "34718106", "name": "J. Hietala"}, {"authorId": "6257052", "name": "R. Salokangas"}, {"authorId": "8770059", "name": "C. Pantelis"}, {"authorId": "2875471", "name": "E. Meisenzahl"}, {"authorId": "2086924", "name": "S. Wood"}, {"authorId": "2423864", "name": "D. Beque"}, {"authorId": "3110755", "name": "P. Brambilla"}, {"authorId": "48682353", "name": "S. Borgwardt"}]}, {"paperId": "9880d1ff04f94bd6716c8566cf5556a2f3e22a98", "url": "https://www.semanticscholar.org/paper/9880d1ff04f94bd6716c8566cf5556a2f3e22a98", "title": "Extreme learning machines for intrusion detection", "abstract": "We consider the problem of intrusion detection in a computer network, and investigate the use of extreme learning machines (ELMs) to classify and detect the intrusions. With increasing connectivity between networks, the risk of information systems to external attacks or intrusions has increased tremendously. Machine learning methods like support vector machines (SVMs) and neural networks have been widely used for intrusion detection. These methods generally suffer from long training times, require parameter tuning, or do not perform well in multi-class classification. We propose a basic ELM method based on random features, and a kernel based ELM method for classification. We compare our methods with commonly used SVM techniques in both binary and multi-class classifications. Simulation results show that the proposed basic ELM approach outperforms SVM in training and testing speed, while the proposed kernel based ELM achieves higher detection accuracy than SVM in multi-class classification case.", "year": 2012, "referenceCount": 26, "citationCount": 99, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "120623785", "name": "Chi Cheng"}, {"authorId": "3118058", "name": "Wee Peng Tay"}, {"authorId": "145678691", "name": "G. Huang"}]}, {"paperId": "4a0d35989d91b3b7d2318802b1de6d10e4e6e830", "url": "https://www.semanticscholar.org/paper/4a0d35989d91b3b7d2318802b1de6d10e4e6e830", "title": "Wasserstein Distributionally Robust Optimization: Theory and Applications in Machine Learning", "abstract": "Many decision problems in science, engineering and economics are affected by uncertain parameters whose distribution is only indirectly observable through samples. The goal of data-driven decision-making is to learn a decision from finitely many training samples that will perform well on unseen test samples. This learning task is difficult even if all training and test samples are drawn from the same distribution---especially if the dimension of the uncertainty is large relative to the training sample size. Wasserstein distributionally robust optimization seeks data-driven decisions that perform well under the most adverse distribution within a certain Wasserstein distance from a nominal distribution constructed from the training samples. In this tutorial we will argue that this approach has many conceptual and computational benefits. Most prominently, the optimal decisions can often be computed by solving tractable convex optimization problems, and they enjoy rigorous out-of-sample and asymptotic consistency guarantees. We will also show that Wasserstein distributionally robust optimization has interesting ramifications for statistical learning and motivates new approaches for fundamental learning tasks such as classification, regression, maximum likelihood estimation or minimum mean square error estimation, among others.", "year": 2019, "referenceCount": 115, "citationCount": 203, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2500534", "name": "D. Kuhn"}, {"authorId": "1787177", "name": "Peyman Mohajerin Esfahani"}, {"authorId": "2075327618", "name": "Viet Anh Nguyen"}, {"authorId": "1380260325", "name": "Soroosh Shafieezadeh-Abadeh"}]}, {"paperId": "182c79cc5218f0e0a57cfb863937117d8c1c80f6", "url": "https://www.semanticscholar.org/paper/182c79cc5218f0e0a57cfb863937117d8c1c80f6", "title": "MaLeCoP Machine Learning Connection Prover", "abstract": null, "year": 2011, "referenceCount": 16, "citationCount": 70, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2087993", "name": "J. Urban"}, {"authorId": "49212925", "name": "J. Vyskočil"}, {"authorId": "47966787", "name": "P. Štěpánek"}]}, {"paperId": "cefbbaf980ea1637d14e641d4706eb008b395ffb", "url": "https://www.semanticscholar.org/paper/cefbbaf980ea1637d14e641d4706eb008b395ffb", "title": "Inductive process modeling", "abstract": null, "year": 2008, "referenceCount": 72, "citationCount": 90, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144183948", "name": "Will Bridewell"}, {"authorId": "1713919", "name": "P. Langley"}, {"authorId": "1735220", "name": "L. Todorovski"}, {"authorId": "1693549", "name": "S. Džeroski"}]}, {"paperId": "52fac26b3dae6402fd1ebdd8d73cfb6c31f13fca", "url": "https://www.semanticscholar.org/paper/52fac26b3dae6402fd1ebdd8d73cfb6c31f13fca", "title": "Deep Learning for Forecasting Stock Returns in the Cross-Section", "abstract": null, "year": 2018, "referenceCount": 17, "citationCount": 73, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Economics", "Computer Science"], "authors": [{"authorId": "2396632", "name": "Masaya Abe"}, {"authorId": "48731103", "name": "Hideki Nakayama"}]}, {"paperId": "f350fe92a2d246a02df2a41928affa1c526cb609", "url": "https://www.semanticscholar.org/paper/f350fe92a2d246a02df2a41928affa1c526cb609", "title": "On formalizing fairness in prediction with machine learning", "abstract": "Machine learning algorithms for prediction are increasingly being used in critical decisions affecting human lives. Various fairness formalizations, with no firm consensus yet, are employed to prevent such algorithms from systematically discriminating against people based on certain attributes protected by law. The aim of this article is to survey how fairness is formalized in the machine learning literature for the task of prediction and present these formalizations with their corresponding notions of distributive justice from the social sciences literature. We provide theoretical as well as empirical critiques of these notions from the social sciences literature and explain how these critiques limit the suitability of the corresponding fairness formalizations to certain domains. We also suggest two notions of distributive justice which address some of these critiques and discuss avenues for prospective fairness formalizations.", "year": 2017, "referenceCount": 92, "citationCount": 147, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3144996", "name": "Pratik Gajane"}]}, {"paperId": "7c2271ddf761a70a5e5668cd999e9589d12f79c4", "url": "https://www.semanticscholar.org/paper/7c2271ddf761a70a5e5668cd999e9589d12f79c4", "title": "Hierarchical quantum classifiers", "abstract": null, "year": 2018, "referenceCount": 41, "citationCount": 177, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "2003565875", "name": "E. Grant"}, {"authorId": "3468759", "name": "M. Benedetti"}, {"authorId": "145631859", "name": "Shuxiang Cao"}, {"authorId": "2064228008", "name": "A. Hallam"}, {"authorId": "37735828", "name": "J. Lockhart"}, {"authorId": "12054054", "name": "V. Stojevic"}, {"authorId": "84260279", "name": "A. Green"}, {"authorId": "47831052", "name": "S. Severini"}]}, {"paperId": "a351ffd1634b0930bd51ff225a8836e540269947", "url": "https://www.semanticscholar.org/paper/a351ffd1634b0930bd51ff225a8836e540269947", "title": "Text Categorization with Support Vector Machines: Learning with Many Relevant F Eatures Text Categorization with Support Vector Machines: Learning with Many Relevant F Eatures", "abstract": "This paper explores the use of Support Vector Machines (SVMs) for learning text classiers from examples. It analyzes the particular properties of learning with text data and identi es, why SVMs are appropriate for this task. Empirical results support the theoretical ndings. SVMs achieve substantial improvements over the currently best performing methods and they behave robustly over a variety of di erent learning tasks. Furthermore, they are fully automatic, eliminating the need for manual parameter tuning.", "year": 1997, "referenceCount": 29, "citationCount": 125, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "70703746", "name": "AT Dortmund"}, {"authorId": "1680188", "name": "T. Joachims"}]}, {"paperId": "f3a467f1a32b844b3f04321212d49ee4f215d484", "url": "https://www.semanticscholar.org/paper/f3a467f1a32b844b3f04321212d49ee4f215d484", "title": "Named entity recognition approaches", "abstract": "Recognizing and extracting exact name entities, like Persons, Locations and Organizations are very useful to mining information from text. Learning to extract names in natural language text is called Named Entity Recognition (NER) task. Proper named entity recognition and extraction is important to solve most problems in hot research area such as Question Answering and Summarization Systems, Information Retrieval, Machine Translation, Video Annotation, Semantic Web Search and Bioinformatics. Nowadays more researchers use different methods such as Rule-base NER, Machine Learning-base NER and Hybrid NER, to identify names from text. In this paper, we review these methods and compare them based on precision in recognition and also portability using the Message Understanding Conference (MUC) named entity definition and its standard data set to find their strength and weakness of each \nthese methods. We proposed a robust and novel Machine \nLearning Based method called Fuzzy support Vector Machine \n(FSVM) for NER.", "year": 2008, "referenceCount": 22, "citationCount": 108, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "41216009", "name": "A. Mansouri"}, {"authorId": "2397973", "name": "L. S. Affendey"}, {"authorId": "2760630", "name": "A. Mamat"}]}, {"paperId": "77fafe38b0817835a80dde4ce8d3dde8a7be8a22", "url": "https://www.semanticscholar.org/paper/77fafe38b0817835a80dde4ce8d3dde8a7be8a22", "title": "Machine Learning of Generic and User-Focused Summarization", "abstract": "A key problem in text summarization is finding a salience function which determines what information in the source should be included in the summary. This paper describes the use of machine learning on a training corpus of documents and their abstracts to discover salience functions which describe what combination of features is optimal for a given summarization task. The method addresses both \"generic\" and user-focused summaries.", "year": 1998, "referenceCount": 34, "citationCount": 148, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1729172", "name": "I. Mani"}, {"authorId": "2740861", "name": "E. Bloedorn"}]}, {"paperId": "fa4a3d9e65e31dda14de204def468984814b5bec", "url": "https://www.semanticscholar.org/paper/fa4a3d9e65e31dda14de204def468984814b5bec", "title": "An empirical performance comparison of machine learning methods for spam e-mail categorization", "abstract": "The increasing volume of unsolicited bulk e-mail (also known as spam) has generated a need for reliable antispam filters. Using a classifier based on machine learning techniques to automatically filter out spam e-mail has drawn many researchers' attention. In this paper, we review some of relevant ideas and do a set of systematic experiments on e-mail categorization, which has been conducted with four machine learning algorithms applied to different parts of e-mail. Experimental results reveal that the header of e-mail provides very useful information for all the machine learning algorithms considered to detect spam e-mail.", "year": 2004, "referenceCount": 12, "citationCount": 76, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38243685", "name": "Chih-Chin Lai"}, {"authorId": "145463287", "name": "Ming-Chi Tsai"}]}, {"paperId": "46597f490a73ded25110cc8d81d43f6248bbb652", "url": "https://www.semanticscholar.org/paper/46597f490a73ded25110cc8d81d43f6248bbb652", "title": "Machine Learning Applications", "abstract": null, "year": 2015, "referenceCount": 106, "citationCount": 53, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1731683", "name": "P. Bonissone"}]}, {"paperId": "b5d8a6468c63188d88bcc3ff3ea0be415cf168eb", "url": "https://www.semanticscholar.org/paper/b5d8a6468c63188d88bcc3ff3ea0be415cf168eb", "title": "FLOOD STAGE FORECASTING WITH SUPPORT VECTOR MACHINES 1", "abstract": "ABSTRACT: Machine learning techniques are finding more and more applications in the field of forecasting. A novel regression technique, called Support Vector Machine (SVM), based on the statistical learning theory is explored in this study. SVM is based on the principle of Structural Risk Minimization as opposed to the principle of Empirical Risk Minimization espoused by conventional regression techniques. The flood data at Dhaka, Bangladesh, are used in this study to demonstrate the forecasting capabilities of SVM. The result is compared with that of Artificial Neural Network (ANN) based model for one‐lead day to seven‐lead day forecasting. The improvements in maximum predicted water level errors by SVM over ANN for four‐lead day to seven‐lead day are 9.6 cm, 22.6 cm, 4.9 cm and 15.7 cm, respectively. The result shows that the prediction accuracy of SVM is at least as good as and in some cases (particularly at higher lead days) actually better than that of ANN, yet it offers advantages over many of the limitations of ANN, for example in arriving at ANN's optimal network architecture and choosing useful training set. Thus, SVM appears to be a very promising prediction tool.", "year": 2002, "referenceCount": 24, "citationCount": 285, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144979041", "name": "S. Liong"}, {"authorId": "2051885", "name": "C. Sivapragasam"}]}, {"paperId": "86713aa23ad99039ba76a670797df40ad65a64b2", "url": "https://www.semanticscholar.org/paper/86713aa23ad99039ba76a670797df40ad65a64b2", "title": "An Introduction to Machine Learning", "abstract": "In the last few years, machine learning (ML) and artificial intelligence have seen a new wave of publicity fueled by the huge and ever‐increasing amount of data and computational power as well as the discovery of improved learning algorithms. However, the idea of a computer learning some abstract concept from data and applying them to yet unseen situations is not new and has been around at least since the 1950s. Many of these basic principles are very familiar to the pharmacometrics and clinical pharmacology community. In this paper, we want to introduce the foundational ideas of ML to this community such that readers obtain the essential tools they need to understand publications on the topic. Although we will not go into the very details and theoretical background, we aim to point readers to relevant literature and put applications of ML in molecular biology as well as the fields of pharmacometrics and clinical pharmacology into perspective.", "year": 2020, "referenceCount": 93, "citationCount": 64, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2383814", "name": "Solveig Badillo"}, {"authorId": "49842626", "name": "B. Bánfai"}, {"authorId": "3232090", "name": "F. Birzele"}, {"authorId": "91987714", "name": "I. I. Davydov"}, {"authorId": "2023123740", "name": "L. Hutchinson"}, {"authorId": "1398629935", "name": "T. Kam-Thong"}, {"authorId": "1436740047", "name": "Juliane Siebourg-Polster"}, {"authorId": "3258307", "name": "Bernhard Steiert"}, {"authorId": "2108489886", "name": "J. Zhang"}]}, {"paperId": "26c842995920157dd3997c27ff8175416b4604d9", "url": "https://www.semanticscholar.org/paper/26c842995920157dd3997c27ff8175416b4604d9", "title": "Machine learning for radiation oncology", "abstract": null, "year": 2019, "referenceCount": 1, "citationCount": 60, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2571273", "name": "I. E. Naqa"}, {"authorId": "1736607", "name": "Ruijiang Li"}, {"authorId": "30436861", "name": "M. Murphy"}]}, {"paperId": "8f13f2964c255f99cfe03bef02b74a3f1be138d8", "url": "https://www.semanticscholar.org/paper/8f13f2964c255f99cfe03bef02b74a3f1be138d8", "title": "Margin-Based Active Learning for Structured Output Spaces", "abstract": null, "year": 2006, "referenceCount": 19, "citationCount": 113, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144590225", "name": "D. Roth"}, {"authorId": "50044599", "name": "Kevin Small"}]}, {"paperId": "fd831cce62827a0abea5e4eb6507b501eac1cb44", "url": "https://www.semanticscholar.org/paper/fd831cce62827a0abea5e4eb6507b501eac1cb44", "title": "Meta-QSAR: a large-scale application of meta-learning to drug design and discovery", "abstract": null, "year": 2017, "referenceCount": 86, "citationCount": 46, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "47085909", "name": "I. Olier"}, {"authorId": "3331007", "name": "Noureddin M. Sadawi"}, {"authorId": "144460732", "name": "G. R. Bickerton"}, {"authorId": "1717534", "name": "J. Vanschoren"}, {"authorId": "1725250", "name": "C. Grosan"}, {"authorId": "3284305", "name": "L. Soldatova"}, {"authorId": "33654217", "name": "R. King"}]}, {"paperId": "97b9cfbc775bf45a485920a0dd1b3ef05b1c70c7", "url": "https://www.semanticscholar.org/paper/97b9cfbc775bf45a485920a0dd1b3ef05b1c70c7", "title": "Machine learning in suicide science: Applications and ethics.", "abstract": "For decades, our ability to predict suicide has remained at near-chance levels. Machine learning has recently emerged as a promising tool for advancing suicide science, particularly in the domain of suicide prediction. The present review provides an introduction to machine learning and its potential application to open questions in suicide research. Although only a few studies have implemented machine learning for suicide prediction, results to date indicate considerable improvement in accuracy and positive predictive value. Potential barriers to algorithm integration into clinical practice are discussed, as well as attendant ethical issues. Overall, machine learning approaches hold promise for accurate, scalable, and effective suicide risk detection; however, many critical questions and issues remain unexplored.", "year": 2019, "referenceCount": 29, "citationCount": 68, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "14864293", "name": "Kathryn P Linthicum"}, {"authorId": "67345170", "name": "K. Schafer"}, {"authorId": "144945435", "name": "J. Ribeiro"}]}, {"paperId": "147db0417e95ce8039ce18671260096c1bc046b8", "url": "https://www.semanticscholar.org/paper/147db0417e95ce8039ce18671260096c1bc046b8", "title": "Efficient Deep Learning on Multi-Source Private Data", "abstract": "Machine learning models benefit from large and diverse datasets. Using such datasets, however, often requires trusting a centralized data aggregator. For sensitive applications like healthcare and finance this is undesirable as it could compromise patient privacy or divulge trade secrets. Recent advances in secure and privacy-preserving computation, including trusted hardware enclaves and differential privacy, offer a way for mutually distrusting parties to efficiently train a machine learning model without revealing the training data. In this work, we introduce Myelin, a deep learning framework which combines these privacy-preservation primitives, and use it to establish a baseline level of performance for fully private machine learning.", "year": 2018, "referenceCount": 32, "citationCount": 82, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "32856859", "name": "Nicholas Hynes"}, {"authorId": "1971760", "name": "Raymond Cheng"}, {"authorId": "143711382", "name": "D. Song"}]}, {"paperId": "1e4694dd26047f7ca7ff11f851f48652f68c7bde", "url": "https://www.semanticscholar.org/paper/1e4694dd26047f7ca7ff11f851f48652f68c7bde", "title": "SAT Based Abstraction-Refinement Using ILP and Machine Learning Techniques", "abstract": null, "year": 2002, "referenceCount": 17, "citationCount": 160, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143877541", "name": "E. Clarke"}, {"authorId": "2110761762", "name": "Anubhav Gupta"}, {"authorId": "3249755", "name": "J. Kukula"}, {"authorId": "1747890", "name": "O. Strichman"}]}, {"paperId": "107ade683b685700a399fe345dbc341901040513", "url": "https://www.semanticscholar.org/paper/107ade683b685700a399fe345dbc341901040513", "title": "Airline Passenger Profiling Based on Fuzzy Deep Machine Learning", "abstract": "Passenger profiling plays a vital part of commercial aviation security, but classical methods become very inefficient in handling the rapidly increasing amounts of electronic records. This paper proposes a deep learning approach to passenger profiling. The center of our approach is a Pythagorean fuzzy deep Boltzmann machine (PFDBM), whose parameters are expressed by Pythagorean fuzzy numbers such that each neuron can learn how a feature affects the production of the correct output from both the positive and negative sides. We propose a hybrid algorithm combining a gradient-based method and an evolutionary algorithm for training the PFDBM. Based on the novel learning model, we develop a deep neural network (DNN) for classifying normal passengers and potential attackers, and further develop an integrated DNN for identifying group attackers whose individual features are insufficient to reveal the abnormality. Experiments on data sets from Air China show that our approach provides much higher learning ability and classification accuracy than existing profilers. It is expected that the fuzzy deep learning approach can be adapted for a variety of complex pattern analysis tasks.", "year": 2017, "referenceCount": 75, "citationCount": 62, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3250526", "name": "Yujun Zheng"}, {"authorId": "119707675", "name": "Weiguo Sheng"}, {"authorId": "2112903153", "name": "Xing-Ming Sun"}, {"authorId": "2118528925", "name": "Shengyong Chen"}]}, {"paperId": "97d69e7e8c04714bf58dcbe5ae7454db69b657a7", "url": "https://www.semanticscholar.org/paper/97d69e7e8c04714bf58dcbe5ae7454db69b657a7", "title": "The Next Decade in AI: Four Steps Towards Robust Artificial Intelligence", "abstract": "Recent research in artificial intelligence and machine learning has largely emphasized general-purpose learning and ever-larger training sets and more and more compute. In contrast, I propose a hybrid, knowledge-driven, reasoning-based approach, centered around cognitive models, that could provide the substrate for a richer, more robust AI than is currently possible.", "year": 2020, "referenceCount": 112, "citationCount": 177, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1923674", "name": "G. Marcus"}]}, {"paperId": "c206862416365b68a41773c7f1393d065756635e", "url": "https://www.semanticscholar.org/paper/c206862416365b68a41773c7f1393d065756635e", "title": "TargetSpy: a supervised machine learning approach for microRNA target prediction", "abstract": null, "year": 2010, "referenceCount": 48, "citationCount": 165, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "144294589", "name": "M. Sturm"}, {"authorId": "2185427", "name": "M. Hackenberg"}, {"authorId": "2571623", "name": "David Langenberger"}, {"authorId": "1697754", "name": "D. Frishman"}]}, {"paperId": "96baf66b1ead911d18b64ad674c9512e189c290b", "url": "https://www.semanticscholar.org/paper/96baf66b1ead911d18b64ad674c9512e189c290b", "title": "Machine Learning and Deep Learning in Medical Imaging: Intelligent Imaging.", "abstract": null, "year": 2019, "referenceCount": 35, "citationCount": 103, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "3948517", "name": "G. Currie"}, {"authorId": "151073947", "name": "K. Hawk"}, {"authorId": "4308674", "name": "E. Rohren"}, {"authorId": "35686882", "name": "Alanna Vial"}, {"authorId": "38920132", "name": "R. Klein"}]}, {"paperId": "1d5aea8546d67021c12e33512b8d8f9f7800a3bc", "url": "https://www.semanticscholar.org/paper/1d5aea8546d67021c12e33512b8d8f9f7800a3bc", "title": "Recent Advances in Clustering : A Brief Survey", "abstract": "Unsupervised learning (clustering) deals with instances, which have not been pre-classified in any way and so do not have a class attribute associated with them. The scope of applying clustering algorithms is to discover useful but unknown classes of items. Unsupervised learning is an approach of learning where instances are automatically placed into meaningful groups based on their similarity. This paper introduces the fundamental concepts of unsupervised learning while it surveys the recent clustering algorithms. Moreover, recent advances in unsupervised learning, such as ensembles of clustering algorithms and distributed clustering, are described. Key-Words: Pattern Analysis, Machine Intelligence, Intelligent Systems", "year": 2004, "referenceCount": 38, "citationCount": 206, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "1697867", "name": "S. Kotsiantis"}, {"authorId": "46773391", "name": "P. Pintelas"}]}, {"paperId": "625a9e9822603b79f754c4ce044760f7363b5eb6", "url": "https://www.semanticscholar.org/paper/625a9e9822603b79f754c4ce044760f7363b5eb6", "title": "Data Quality Considerations for Big Data and Machine Learning: Going Beyond Data Cleaning and Transformations", "abstract": "Data quality issues trace back their origin to the early days of computing. A wide range of domainspecific techniques to assess and improve the quality of data exist in the literature. These solutions primarily target data which resides in relational databases and data warehouses. The recent emergence of big data analytics and renaissance in machine learning necessitates evaluating the suitability relational database-centric approaches to data quality. In this paper, we describe the nature of the data quality issues in the context of big data and machine learning. We discuss facets of data quality, present a data governance-driven framework for data quality lifecycle for this new scenario, and describe an approach to its implementation. A sampling of the tools available for data quality management are indicated and future trends are discussed. Keywords-Data Quality; Data Quality Assessment ; Data Cleaning; Big Data; Machine Learning; Data Transformation", "year": 2017, "referenceCount": 59, "citationCount": 101, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2052232", "name": "V. Gudivada"}, {"authorId": "1748096", "name": "A. Apon"}, {"authorId": "1560317211", "name": "Junhua Ding"}]}, {"paperId": "50b4da438f3a39ca7aa02939e9872045feb8da55", "url": "https://www.semanticscholar.org/paper/50b4da438f3a39ca7aa02939e9872045feb8da55", "title": "Neural networks and kernel ridge regression for excited states dynamics of CH2NH 2+ : From single-state to multi-state representations and multi-property machine learning models", "abstract": "Excited-state dynamics simulations are a powerful tool to investigate photo-induced reactions of molecules and materials and provide complementary information to experiments. Since the applicability of these simulation techniques is limited by the costs of the underlying electronic structure calculations, we develop and assess different machine learning models for this task. The machine learning models are trained on ab initio calculations for excited electronic states, using the methylenimmonium cation (CH2NH 2+ ) as a model system. Two distinct strategies for modeling excited state properties are tested in this work. The first strategy is to treat each state separately in a kernel ridge regression model and all states together in a multiclass neural network. The second strategy is to instead encode the state as input into the model, which is tested with both models. Numerical evidence suggests that using the state as input yields the best performance. An important goal for excited-state machine learning models is their use in dynamics simulations, which needs not only state-specific information but also couplings, i.e. properties involving pairs of states. Accordingly, we investigate how well machine learning models can predict the couplings. Furthermore, we explore how combining all properties in a single neural network affects the accuracy. Finally, machine learning predicted energies, forces, and couplings are used to carry out excited-state dynamics simulations. Results demonstrate the scopes and possibilities of machine learning to model excited-state properties.", "year": 2019, "referenceCount": 86, "citationCount": 30, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "90050189", "name": "J. Westermayr"}, {"authorId": "145483118", "name": "Felix A Faber"}, {"authorId": "145487354", "name": "Anders S. Christensen"}, {"authorId": "7847508", "name": "O. A. von Lilienfeld"}, {"authorId": "4850899", "name": "P. Marquetand"}]}, {"paperId": "74d3c6352d73e4120a3bcba9b27fc69f79c1a655", "url": "https://www.semanticscholar.org/paper/74d3c6352d73e4120a3bcba9b27fc69f79c1a655", "title": "Using machine learning to predict learner emotional state from brainwaves", "abstract": "Intelligent Tutoring Systems (ITS) learner model has progressively evolved. Initially composed of a cognitive module it was extended with a psychological module and an emotional module. The learner model still remains non-exhaustive. Methods of data collection on the cognitive and emotional state of the learner often lack precision and objectivity. In this paper we introduce an emomental agent. It interacts with an ITS to communicate the emotional state of the learner based upon his mental state. The mental state is obtained from the learner's brainwaves. The agent learns to predict the learner's emotions by using machine learning techniques.", "year": 2007, "referenceCount": 28, "citationCount": 63, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1896154", "name": "Alicia Heraz"}, {"authorId": "2327173", "name": "Ryad Razaki"}, {"authorId": "1788058", "name": "C. Frasson"}]}, {"paperId": "a4051e9f560742b9d28afb78da4622141ec4db89", "url": "https://www.semanticscholar.org/paper/a4051e9f560742b9d28afb78da4622141ec4db89", "title": "Quantum Learning", "abstract": "The notion of quantum learning machines { quantum computers that modify themselves in order to improve their performance in some way { is introduced. This is followed by a discussion of the advantages that quantum computers in general, and a quantum implementation of a neural network learning algorithm in particular, might bring, not only to our search for more powerful computational systems, but also to our search for greater understanding of the brain, the mind, and quantum physics itself.", "year": 1995, "referenceCount": 15, "citationCount": 145, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2100153776", "name": "LearningRonald L. ChrisleySchool"}]}, {"paperId": "869fdb53a40290a3941fd6ab808835e9b5184d62", "url": "https://www.semanticscholar.org/paper/869fdb53a40290a3941fd6ab808835e9b5184d62", "title": "Adversarial Attacks and Defences: A Survey", "abstract": "Deep learning has emerged as a strong and efficient framework that can be applied to a broad spectrum of complex learning problems which were difficult to solve using the traditional machine learning techniques in the past. In the last few years, deep learning has advanced radically in such a way that it can surpass human-level performance on a number of tasks. As a consequence, deep learning is being extensively used in most of the recent day-to-day applications. However, security of deep learning systems are vulnerable to crafted adversarial examples, which may be imperceptible to the human eye, but can lead the model to misclassify the output. In recent times, different types of adversaries based on their threat model leverage these vulnerabilities to compromise a deep learning system where adversaries have high incentives. Hence, it is extremely important to provide robustness to deep learning algorithms against these adversaries. However, there are only a few strong countermeasures which can be used in all types of attack scenarios to design a robust deep learning system. In this paper, we attempt to provide a detailed discussion on different types of adversarial attacks with various threat models and also elaborate the efficiency and challenges of recent countermeasures against them.", "year": 2018, "referenceCount": 72, "citationCount": 384, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2055809732", "name": "Anirban Chakraborty"}, {"authorId": "2109936241", "name": "Manaar Alam"}, {"authorId": "38592060", "name": "Vishal Dey"}, {"authorId": "144990091", "name": "A. Chattopadhyay"}, {"authorId": "1705579", "name": "Debdeep Mukhopadhyay"}]}, {"paperId": "edf6117a38afa73b211259c88e4e5539891f6c2c", "url": "https://www.semanticscholar.org/paper/edf6117a38afa73b211259c88e4e5539891f6c2c", "title": "Handling Sparsity via the Horseshoe", "abstract": "This paper presents a general, fully Bayesian framework for sparse supervised-learning problems based on the horseshoe prior. The horseshoe prior is a member of the family of multivariate scale mixtures of normals, and is therefore closely related to widely used approaches for sparse Bayesian learning, including, among others, Laplacian priors (e.g. the LASSO) and Student-t priors (e.g. the relevance vector machine). The advantages of the horseshoe are its robustness at handling unknown sparsity and large outlying signals. These properties are justied theoretically via a representation theorem and accompanied by comprehensive empirical experiments that compare its performance to benchmark alternatives.", "year": 2009, "referenceCount": 18, "citationCount": 379, "influentialCitationCount": 54, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "122657211", "name": "C. Carvalho"}, {"authorId": "2085638", "name": "Nicholas G. Polson"}, {"authorId": "145516664", "name": "James G. Scott"}]}, {"paperId": "8985000860dbb88a80736cac8efe30516e69ee3f", "url": "https://www.semanticscholar.org/paper/8985000860dbb88a80736cac8efe30516e69ee3f", "title": "Human Activity Recognition Using Recurrent Neural Networks", "abstract": null, "year": 2017, "referenceCount": 26, "citationCount": 106, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144178915", "name": "Deepika Singh"}, {"authorId": "10385642", "name": "Erinc Merdivan"}, {"authorId": "23546564", "name": "I. Psychoula"}, {"authorId": "2513519", "name": "J. Kropf"}, {"authorId": "80148958", "name": "S. Hanke"}, {"authorId": "1737555", "name": "M. Geist"}, {"authorId": "1749801", "name": "Andreas Holzinger"}]}, {"paperId": "32fb61d6f477d1d704d50b58394680a74228ecd6", "url": "https://www.semanticscholar.org/paper/32fb61d6f477d1d704d50b58394680a74228ecd6", "title": "Learning and optimization of machining operations using computing abilities of neural networks", "abstract": "The authors present a scheme that uses a feedforward neural network for the learning and synthesis task. Neural networks consist of a collection of interconnected processors that compute in parallel. The parallelism allows the network to examine various constraints simultaneously during the learning phase and enables reductions in computing time that are attractive in real-time applications. The learning abilities of these networks in a tuning operation are discussed. The network learns by observing the effect of the input variables of the operation (such as feed rate, depth of cut, and cutting speed) on the output variables (such as cutting force, power, temperature, and surface finish of the workpiece). The learning phase is followed by a synthesis phase during which the network predicts the input conditions to be used by the machine tool to maximize the metal removal rate subject to appropriate operating constraints. >", "year": 1989, "referenceCount": 15, "citationCount": 193, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2499016", "name": "S. Rangwala"}, {"authorId": "1736323", "name": "D. Dornfeld"}]}, {"paperId": "a1a34ce5a7342fde17d799599ea278f79b613aee", "url": "https://www.semanticscholar.org/paper/a1a34ce5a7342fde17d799599ea278f79b613aee", "title": "SAMOA: scalable advanced massive online analysis", "abstract": "SAMOA (SCALABLE ADVANCED MASSIVE ONLINE ANALYSIS) is a platform for mining big data streams. It provides a collection of distributed streaming algorithms for the most common data mining and machine learning tasks such as classification, clustering, and regression, as well as programming abstractions to develop new algorithms. It features a pluggable architecture that allows it to run on several distributed stream processing engines such as Storm, S4, and Samza. samoa is written in Java, is open source, and is available at http://samoa-project.net under the Apache Software License version 2.0.", "year": 2015, "referenceCount": 15, "citationCount": 168, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35168570", "name": "G. D. F. Morales"}, {"authorId": "1762931", "name": "A. Bifet"}]}, {"paperId": "d59803d54313f3b93c5bd5a3551d71dafbc1fef7", "url": "https://www.semanticscholar.org/paper/d59803d54313f3b93c5bd5a3551d71dafbc1fef7", "title": "Fairness and Accountability Design Needs for Algorithmic Support in High-Stakes Public Sector Decision-Making", "abstract": "Calls for heightened consideration of fairness and accountability in algorithmically-informed public decisions-like taxation, justice, and child protection-are now commonplace. How might designers support such human values? We interviewed 27 public sector machine learning practitioners across 5 OECD countries regarding challenges understanding and imbuing public values into their work. The results suggest a disconnect between organisational and institutional realities, constraints and needs, and those addressed by current research into usable, transparent and 'discrimination-aware' machine learning-absences likely to undermine practical initiatives unless addressed. We see design opportunities in this disconnect, such as in supporting the tracking of concept drift in secondary data sources, and in building usable transparency tools to identify risks and incorporate domain knowledge, aimed both at managers and at the 'street-level bureaucrats' on the frontlines of public service. We conclude by outlining ethical challenges and future directions for collaboration in these high-stakes applications.", "year": 2018, "referenceCount": 91, "citationCount": 245, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Business"], "authors": [{"authorId": "33699440", "name": "Michael Veale"}, {"authorId": "2341082", "name": "M. V. Kleek"}, {"authorId": "144147883", "name": "R. Binns"}]}, {"paperId": "1554134e34366adcd69cd021a0b930a003ae789e", "url": "https://www.semanticscholar.org/paper/1554134e34366adcd69cd021a0b930a003ae789e", "title": "Squares: Supporting Interactive Performance Analysis for Multiclass Classifiers", "abstract": "Performance analysis is critical in applied machine learning because it influences the models practitioners produce. Current performance analysis tools suffer from issues including obscuring important characteristics of model behavior and dissociating performance from data. In this work, we present Squares, a performance visualization for multiclass classification problems. Squares supports estimating common performance metrics while displaying instance-level distribution information necessary for helping practitioners prioritize efforts and access data. Our controlled study shows that practitioners can assess performance significantly faster and more accurately with Squares than a confusion matrix, a common performance analysis tool in machine learning.", "year": 2017, "referenceCount": 38, "citationCount": 156, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "40633287", "name": "Donghao Ren"}, {"authorId": "1719124", "name": "Saleema Amershi"}, {"authorId": "49132427", "name": "Bongshin Lee"}, {"authorId": "38972741", "name": "Jina Suh"}, {"authorId": "47271859", "name": "J. Williams"}]}, {"paperId": "4d9fb7ebf0f40d61e5c6c5f00c30299ce304b5e2", "url": "https://www.semanticscholar.org/paper/4d9fb7ebf0f40d61e5c6c5f00c30299ce304b5e2", "title": "Single-machine and two-machine flowshop scheduling with general learning functions", "abstract": null, "year": 2007, "referenceCount": 7, "citationCount": 202, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1764881", "name": "Christos Koulamas"}, {"authorId": "1801744", "name": "George J. Kyparisis"}]}, {"paperId": "dfcae80f4d34ac09ba8063c5cfb5be954d0bf5f1", "url": "https://www.semanticscholar.org/paper/dfcae80f4d34ac09ba8063c5cfb5be954d0bf5f1", "title": "Fields of Experts", "abstract": null, "year": 2009, "referenceCount": 99, "citationCount": 732, "influentialCitationCount": 97, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "145920814", "name": "S. Roth"}, {"authorId": "2105795", "name": "Michael J. Black"}]}, {"paperId": "b1a9517ebf81ef3f80734ba3d5e48a37693ae1c9", "url": "https://www.semanticscholar.org/paper/b1a9517ebf81ef3f80734ba3d5e48a37693ae1c9", "title": "Support vector machines for hyperspectral remote sensing classification", "abstract": "The Support Vector Machine provides a new way to design classification algorithms which learn from examples (supervised learning) and generalize when applied to new data. We demonstrate its success on a difficult classification problem from hyperspectral remote sensing, where we obtain performances of 96%, and 87% correct for a 4 class problem, and a 16 class problem respectively. These results are somewhat better than other recent result on the same data. A key feature of this classifier is its ability to use high-dimensional data without the usual recourse to a feature selection step to reduce the dimensionality of the data. For this application, this is important, as hyperspectral data consists of several hundred contiguous spectral channels for each exemplar. We provide an introduction to this new approach, and demonstrate its application to classification of an agriculture scene.", "year": 1999, "referenceCount": 42, "citationCount": 467, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "144439707", "name": "J. A. Gualtieri"}, {"authorId": "2511265", "name": "R. Cromp"}]}, {"paperId": "d7d53d46e0328854c3192f2ee6b7b83120e03a4c", "url": "https://www.semanticscholar.org/paper/d7d53d46e0328854c3192f2ee6b7b83120e03a4c", "title": "A survey of machine learning in Wireless Sensor netoworks From networking and application perspectives", "abstract": "Wireless sensor networks (WSNs) are used to collect data from and make inferences about the environments or objects that they are sensing. These sensors are usually characterized by limited communication capabilities due to energy and bandwidth constraints. As a result, WSNs have inspired resurgence in research on machine learning methodologies with the objective of overcoming the physical constraints of sensors. In this paper, machine learning methods that have been applied in WSNs to solve some networking and application problems are surveyed. Fundamental limits of learning algorithms will be addressed and future machine learning research direction are highlighted.", "year": 2007, "referenceCount": 31, "citationCount": 68, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "101620408", "name": "M. di"}, {"authorId": "9224769", "name": "E. Joo"}]}, {"paperId": "d9b03cd97db6255081d1e57983fa673d1f8f2d0e", "url": "https://www.semanticscholar.org/paper/d9b03cd97db6255081d1e57983fa673d1f8f2d0e", "title": "Exploiting Source-side Monolingual Data in Neural Machine Translation", "abstract": "Neural Machine Translation (NMT) based on the encoder-decoder architecture has recently become a new paradigm. Researchers have proven that the target-side monolingual data can greatly enhance the decoder model of NMT. However, the source-side monolingual data is not fully explored although it should be useful to strengthen the encoder model of NMT, especially when the parallel corpus is far from sufficient. In this paper, we propose two approaches to make full use of the sourceside monolingual data in NMT. The first approach employs the self-learning algorithm to generate the synthetic large-scale parallel data for NMT training. The second approach applies the multi-task learning framework using two NMTs to predict the translation and the reordered source-side monolingual sentences simultaneously. The extensive experiments demonstrate that the proposed methods obtain significant improvements over the strong attention-based NMT.", "year": 2016, "referenceCount": 38, "citationCount": 226, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38358352", "name": "Jiajun Zhang"}, {"authorId": "2423168", "name": "Chengqing Zong"}]}, {"paperId": "d70b5dd40951dc97cb0296668c7affa482f3c970", "url": "https://www.semanticscholar.org/paper/d70b5dd40951dc97cb0296668c7affa482f3c970", "title": "Support vector learning for fuzzy rule-based classification systems", "abstract": "To design a fuzzy rule-based classification system (fuzzy classifier) with good generalization ability in a high dimensional feature space has been an active research topic for a long time. As a powerful machine learning approach for pattern recognition problems, the support vector machine (SVM) is known to have good generalization ability. More importantly, an SVM can work very well on a high- (or even infinite) dimensional feature space. This paper investigates the connection between fuzzy classifiers and kernel machines, establishes a link between fuzzy rules and kernels, and proposes a learning algorithm for fuzzy classifiers. We first show that a fuzzy classifier implicitly defines a translation invariant kernel under the assumption that all membership functions associated with the same input variable are generated from location transformation of a reference function. Fuzzy inference on the IF-part of a fuzzy rule can be viewed as evaluating the kernel function. The kernel function is then proven to be a Mercer kernel if the reference functions meet a certain spectral requirement. The corresponding fuzzy classifier is named positive definite fuzzy classifier (PDFC). A PDFC can be built from the given training samples based on a support vector learning approach with the IF-part fuzzy rules given by the support vectors. Since the learning process minimizes an upper bound on the expected risk (expected prediction error) instead of the empirical risk (training error), the resulting PDFC usually has good generalization. Moreover, because of the sparsity properties of the SVMs, the number of fuzzy rules is irrelevant to the dimension of input space. In this sense, we avoid the \"curse of dimensionality.\" Finally, PDFCs with different reference functions are constructed using the support vector learning approach. The performance of the PDFCs is illustrated by extensive experimental results. Comparisons with other methods are also provided.", "year": 2003, "referenceCount": 95, "citationCount": 234, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2116664201", "name": "Yixin Chen"}, {"authorId": "48094094", "name": "James Ze Wang"}]}, {"paperId": "21ae9d6358ee090162b10d3a9da43e0d85ef4c7e", "url": "https://www.semanticscholar.org/paper/21ae9d6358ee090162b10d3a9da43e0d85ef4c7e", "title": "Design pattern mining enhanced by machine learning", "abstract": "Design patterns present good solutions to frequently occurring problems in object-oriented software design. Thus their correct application in a system's design may significantly improve its internal quality attributes such as reusability and maintainability. In software maintenance the existence of up-to-date documentation is crucial, so the discovery of as yet unknown design pattern instances can help improve the documentation. Hence a reliable design pattern recognition system is very desirable. However, simpler methods (based on pattern matching) may give imprecise results due to the vague nature of the patterns' structural description. In previous work we presented a pattern matching-based system using the Columbus framework with which we were able to find pattern instances from the source code by considering the patterns' structural descriptions only, and therefore we could not identify false hits and distinguish similar design patterns such as state and strategy. In the present work we use machine learning to enhance pattern mining by filtering out as many false hits as possible. To do so we distinguish true and false pattern instances with the help of a learning database created by manually tagging a large C++ system.", "year": 2005, "referenceCount": 27, "citationCount": 93, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3172077", "name": "R. Ferenc"}, {"authorId": "1752419", "name": "Árpád Beszédes"}, {"authorId": "3025233", "name": "Lajos Jeno Fülöp"}, {"authorId": "46603077", "name": "Janos Lele"}]}, {"paperId": "46ff1e407be3f9f83cca960cbc075c664e4e7450", "url": "https://www.semanticscholar.org/paper/46ff1e407be3f9f83cca960cbc075c664e4e7450", "title": "AlphaD3M: Machine Learning Pipeline Synthesis", "abstract": "We introduce AlphaD3M, an automatic machine learning (AutoML) system based on meta reinforcement learning using sequence models with self play. AlphaD3M is based on edit operations performed over machine learning pipeline primitives providing explainability. We compare AlphaD3M with state-of-the-art AutoML systems: Autosklearn, Autostacker, and TPOT, on OpenML datasets. AlphaD3M achieves competitive performance while being an order of magnitude faster, reducing computation time from hours to minutes, and is explainable by design.", "year": 2021, "referenceCount": 17, "citationCount": 58, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2861627", "name": "Iddo Drori"}, {"authorId": "2756087", "name": "Yamuna Krishnamurthy"}, {"authorId": "3416217", "name": "Rémi Rampin"}, {"authorId": "120081176", "name": "Raoni Lourenço"}, {"authorId": "3471393", "name": "Jorge Piazentin Ono"}, {"authorId": "1979489", "name": "Kyunghyun Cho"}, {"authorId": "2109873665", "name": "Cláudio T. Silva"}, {"authorId": "144162611", "name": "J. Freire"}]}, {"paperId": "6d375f8b45d8e5e961875bf74a89f32394759b89", "url": "https://www.semanticscholar.org/paper/6d375f8b45d8e5e961875bf74a89f32394759b89", "title": "Exploiting Semantic Role Labeling, WordNet and Wikipedia for Coreference Resolution", "abstract": "In this paper we present an extension of a machine learning based coreference resolution system which uses features induced from different semantic knowledge sources. These features represent knowledge mined from WordNet and Wikipedia, as well as information about semantic role labels. We show that semantic features indeed improve the performance on different referring expression types such as pronouns and common nouns.", "year": 2006, "referenceCount": 47, "citationCount": 305, "influentialCitationCount": 27, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1801255", "name": "Simone Paolo Ponzetto"}, {"authorId": "31380436", "name": "M. Strube"}]}, {"paperId": "989f8a5d28b597b784391656fbd37af961b821dc", "url": "https://www.semanticscholar.org/paper/989f8a5d28b597b784391656fbd37af961b821dc", "title": "Unsupervised Supervised Learning I: Estimating Classification and Regression Errors without Labels", "abstract": "Estimating the error rates of classifiers or regression models is a fundamental task in machine learning which has thus far been studied exclusively using supervised learning techniques. We propose a novel unsupervised framework for estimating these error rates using only unlabeled data and mild assumptions. We prove consistency results for the framework and demonstrate its practical applicability on both synthetic and real world data.", "year": 2010, "referenceCount": 20, "citationCount": 57, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2046500", "name": "Pinar Donmez"}, {"authorId": "1717932", "name": "G. Lebanon"}, {"authorId": "1682978", "name": "K. Balasubramanian"}]}, {"paperId": "b3f2a11d45757e675be123d55ec0eb192bcca990", "url": "https://www.semanticscholar.org/paper/b3f2a11d45757e675be123d55ec0eb192bcca990", "title": "Chiron: Privacy-preserving Machine Learning as a Service", "abstract": "Major cloud operators offer machine learning (ML) as a service, enabling customers who have the data but not ML expertise or infrastructure to train predictive models on this data. Existing ML-as-a-service platforms require users to reveal all training data to the service operator. We design, implement, and evaluate Chiron, a system for privacy-preserving machine learning as a service. First, Chiron conceals the training data from the service operator. Second, in keeping with how many existing ML-as-a-service platforms work, Chiron reveals neither the training algorithm nor the model structure to the user, providing only black-box access to the trained model. Chiron is implemented using SGX enclaves, but SGX alone does not achieve the dual goals of data privacy and model confidentiality. Chiron runs the standard ML training toolchain (including the popular Theano framework and C compiler) in an enclave, but the untrusted model-creation code from the service operator is further confined in a Ryoan sandbox to prevent it from leaking the training data outside the enclave. To support distributed training, Chiron executes multiple concurrent enclaves that exchange model parameters via a parameter server. We evaluate Chiron on popular deep learning models, focusing on benchmark image classification tasks such as CIFAR and ImageNet, and show that its training performance and accuracy of the resulting models are practical for common uses of ML-as-a-service.", "year": 2018, "referenceCount": 54, "citationCount": 145, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48062937", "name": "T. Hunt"}, {"authorId": "3469125", "name": "Congzheng Song"}, {"authorId": "2520493", "name": "R. Shokri"}, {"authorId": "1723945", "name": "Vitaly Shmatikov"}, {"authorId": "1683338", "name": "E. Witchel"}]}]}