{"total": 5120627, "offset": 3400, "next": 3500, "data": [{"paperId": "2f871fda8e3dd460a19f6e07f1f52ad8e9e34806", "url": "https://www.semanticscholar.org/paper/2f871fda8e3dd460a19f6e07f1f52ad8e9e34806", "title": "Prediction‐based fingerprints of protein–protein interactions", "abstract": "The recognition of protein interaction sites is an important intermediate step toward identification of functionally relevant residues and understanding protein function, facilitating experimental efforts in that regard. Toward that goal, the authors propose a novel representation for the recognition of protein–protein interaction sites that integrates enhanced relative solvent accessibility (RSA) predictions with high resolution structural data. An observation that RSA predictions are biased toward the level of surface exposure consistent with protein complexes led the authors to investigate the difference between the predicted and actual (i.e., observed in an unbound structure) RSA of an amino acid residue as a fingerprint of interaction sites. The authors demonstrate that RSA prediction‐based fingerprints of protein interactions significantly improve the discrimination between interacting and noninteracting sites, compared with evolutionary conservation, physicochemical characteristics, structure‐derived and other features considered before. On the basis of these observations, the authors developed a new method for the prediction of protein–protein interaction sites, using machine learning approaches to combine the most informative features into the final predictor. For training and validation, the authors used several large sets of protein complexes and derived from them nonredundant representative chains, with interaction sites mapped from multiple complexes. Alternative machine learning techniques are used, including Support Vector Machines and Neural Networks, so as to evaluate the relative effects of the choice of a representation and a specific learning algorithm. The effects of induced fit and uncertainty of the negative (noninteracting) class assignment are also evaluated. Several representative methods from the literature are reimplemented to enable direct comparison of the results. Using rigorous validation protocols, the authors estimated that the new method yields the overall classification accuracy of about 74% and Matthews correlation coefficients of 0.42, as opposed to up to 70% classification accuracy and up to 0.3 Matthews correlation coefficient for methods that do not utilize RSA prediction‐based fingerprints. The new method is available at http://sppider.cchmc.org. Proteins 2007. © 2006 Wiley‐Liss, Inc.", "year": 2006, "referenceCount": 69, "citationCount": 331, "influentialCitationCount": 51, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3192177", "name": "A. Porollo"}, {"authorId": "49806460", "name": "J. Meller"}]}, {"paperId": "c7f81751848c4ecacad4917fec2903602e0fcc37", "url": "https://www.semanticscholar.org/paper/c7f81751848c4ecacad4917fec2903602e0fcc37", "title": "Bayesian inference with posterior regularization and applications to infinite latent SVMs", "abstract": "Existing Bayesian models, especially nonparametric Bayesian methods, rely on specially conceived priors to incorporate domain knowledge for discovering improved latent representations. While priors can affect posterior distributions through Bayes' rule, imposing posterior regularization is arguably more direct and in some cases more natural and general. In this paper, we present regularized Bayesian inference (RegBayes), a novel computational framework that performs posterior inference with a regularization term on the desired post-data posterior distribution under an information theoretical formulation. RegBayes is more flexible than the procedure that elicits expert knowledge via priors, and it covers both directed Bayesian networks and undirected Markov networks whose Bayesian formulation results in hybrid chain graph models. When the regularization is induced from a linear operator on the posterior distributions, such as the expectation operator, we present a general convex-analysis theorem to characterize the solution of RegBayes. Furthermore, we present two concrete examples of RegBayes, infinite latent support vector machines (iLSVM) and multi-task infinite latent support vector machines (MT-iLSVM), which explore the large-margin idea in combination with a nonparametric Bayesian model for discovering predictive latent features for classification and multi-task learning, respectively. We present efficient inference methods and report empirical studies on several benchmark datasets, which appear to demonstrate the merits inherited from both large-margin learning and Bayesian nonparametrics. Such results were not available until now, and contribute to push forward the interface between these two important subfields, which have been largely treated as isolated in the community.", "year": 2012, "referenceCount": 89, "citationCount": 142, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145254043", "name": "Jun Zhu"}, {"authorId": "1406245631", "name": "Ning Chen"}, {"authorId": "143977260", "name": "E. Xing"}]}, {"paperId": "c8bcfb6a13546e12c3bb4a346057158c26b02611", "url": "https://www.semanticscholar.org/paper/c8bcfb6a13546e12c3bb4a346057158c26b02611", "title": "Image driven machine learning methods for microstructure recognition", "abstract": null, "year": 2016, "referenceCount": 39, "citationCount": 200, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "70327435", "name": "Aritra Chowdhury"}, {"authorId": "100466411", "name": "E. Kautz"}, {"authorId": "7834060", "name": "B. Yener"}, {"authorId": "48938293", "name": "D. Lewis"}]}, {"paperId": "6112f728389e635675cd6f29c77c2dce6cabc6b0", "url": "https://www.semanticscholar.org/paper/6112f728389e635675cd6f29c77c2dce6cabc6b0", "title": "Object Detection in Optical Remote Sensing Images Based on Weakly Supervised Learning and High-Level Feature Learning", "abstract": "The abundant spatial and contextual information provided by the advanced remote sensing technology has facilitated subsequent automatic interpretation of the optical remote sensing images (RSIs). In this paper, a novel and effective geospatial object detection framework is proposed by combining the weakly supervised learning (WSL) and high-level feature learning. First, deep Boltzmann machine is adopted to infer the spatial and structural information encoded in the low-level and middle-level features to effectively describe objects in optical RSIs. Then, a novel WSL approach is presented to object detection where the training sets require only binary labels indicating whether an image contains the target object or not. Based on the learnt high-level features, it jointly integrates saliency, intraclass compactness, and interclass separability in a Bayesian framework to initialize a set of training examples from weakly labeled images and start iterative learning of the object detector. A novel evaluation criterion is also developed to detect model drift and cease the iterative learning. Comprehensive experiments on three optical RSI data sets have demonstrated the efficacy of the proposed approach in benchmarking with several state-of-the-art supervised-learning-based object detection approaches.", "year": 2015, "referenceCount": 46, "citationCount": 616, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "7181955", "name": "Junwei Han"}, {"authorId": "39901030", "name": "Dingwen Zhang"}, {"authorId": "2152127024", "name": "Gong Cheng"}, {"authorId": "143621713", "name": "Lei Guo"}, {"authorId": "145811527", "name": "Jinchang Ren"}]}, {"paperId": "4ed0286846d776da4f7db09518557ff324d0eb24", "url": "https://www.semanticscholar.org/paper/4ed0286846d776da4f7db09518557ff324d0eb24", "title": "On Quality Control and Machine Learning in Crowdsourcing", "abstract": "The advent of crowdsourcing has created a variety of new opportunities for improving upon traditional methods of data collection and annotation. This in turn has created intriguing new opportunities for data-driven machine learning (ML). Convenient access to crowd workers for simple data collection has further generalized to leveraging more arbitrary crowd-based human computation (von Ahn 2005) to supplement automated ML. While new potential applications of crowdsourcing continue to emerge, a variety of practical and sometimes unexpected obstacles have already limited the degree to which its promised potential can be actually realized in practice. This paper considers two particular aspects of crowdsourcing and their interplay, data quality control (QC) and ML, reflecting on where we have been, where we are, and where we might go from here.", "year": 2011, "referenceCount": 26, "citationCount": 143, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1747771", "name": "Matthew Lease"}]}, {"paperId": "999619bf0800b2865e65f61c8d89ce465d02622f", "url": "https://www.semanticscholar.org/paper/999619bf0800b2865e65f61c8d89ce465d02622f", "title": "Advances in the prediction of protein targeting signals", "abstract": "Enlarged sets of reference data and special machine learning approaches have improved the accuracy of the prediction of protein subcellular localization. Recent approaches report over 95% correct predictions with low fractions of false‐positives for secretory proteins. A clear trend is to develop specifically tailored organism‐ and organelle‐specific prediction tools rather than using one general method. Focus of the review is on machine learning systems, highlighting four concepts: the artificial neural feed‐forward network, the self‐organizing map (SOM), the Hidden‐Markov‐Model (HMM), and the support vector machine (SVM).", "year": 2004, "referenceCount": 65, "citationCount": 111, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "144522872", "name": "G. Schneider"}, {"authorId": "1892803", "name": "U. Fechner"}]}, {"paperId": "7c748c1bea85b9d0112ce5f8504086cedc644c2e", "url": "https://www.semanticscholar.org/paper/7c748c1bea85b9d0112ce5f8504086cedc644c2e", "title": "Genomic Selection in Plant Breeding: A Comparison of Models", "abstract": "Simulation and empirical studies of genomic selection (GS) show accuracies suffi cient to generate rapid genetic gains. However, with the increased popularity of GS approaches, numerous models have been proposed and no comparative analysis is available to identify the most promising ones. Using eight wheat (Triticum aestivum L.), barley (Hordeum vulgare L.), Arabidopsis thaliana (L.) Heynh., and maize (Zea mays L.) datasets, the predictive ability of currently available GS models along with several machine learning methods was evaluated by comparing accuracies, the genomic estimated breeding values (GEBVs), and the marker effects for each model. While a similar level of accuracy was observed for many models, the level of overfi tting varied widely as did the computation time and the distribution of marker effect estimates. Our comparisons suggested that GS in plant breeding programs could be based on a reduced set of models such as the Bayesian Lasso, weighted Bayesian shrinkage regression (wBSR, a fast version of BayesB), and random forest (RF) (a machine learning method that could capture nonadditive effects). Linear combinations of different models were tested as well as bagging and boosting methods, but they did not improve accuracy. This study also showed large differences in accuracy between subpopulations within a dataset that could not always be explained by differences in phenotypic variance and size. The broad diversity of empirical datasets tested here adds evidence that GS could increase genetic gain per unit of time and cost.", "year": 2012, "referenceCount": 56, "citationCount": 512, "influentialCitationCount": 28, "isOpenAccess": false, "fieldsOfStudy": ["Biology"], "authors": [{"authorId": "3181216", "name": "N. Heslot"}, {"authorId": "2109429886", "name": "Hsiao-Pei Yang"}, {"authorId": "3518291", "name": "M. Sorrells"}, {"authorId": "1818359", "name": "J. Jannink"}]}, {"paperId": "cebd59035faf1849e22204cc5893d7dde571bab5", "url": "https://www.semanticscholar.org/paper/cebd59035faf1849e22204cc5893d7dde571bab5", "title": "Nonadiabatic Excited-State Dynamics with Machine Learning", "abstract": "We show that machine learning (ML) can be used to accurately reproduce nonadiabatic excited-state dynamics with decoherence-corrected fewest switches surface hopping in a 1-D model system. We propose to use ML to significantly reduce the simulation time of realistic, high-dimensional systems with good reproduction of observables obtained from reference simulations. Our approach is based on creating approximate ML potentials for each adiabatic state using a small number of training points. We investigate the feasibility of this approach by using adiabatic spin-boson Hamiltonian models of various dimensions as reference methods.", "year": 2018, "referenceCount": 77, "citationCount": 83, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Physics"], "authors": [{"authorId": "5378288", "name": "Pavlo O. Dral"}, {"authorId": "2840250", "name": "M. Barbatti"}, {"authorId": "143718971", "name": "W. Thiel"}]}, {"paperId": "2c9022fe0af15568a885e59d475ec8f95726e51b", "url": "https://www.semanticscholar.org/paper/2c9022fe0af15568a885e59d475ec8f95726e51b", "title": "Metrics for Multi-Class Classification: an Overview", "abstract": "Classification tasks in machine learning involving more than two classes are known by the name of \"multi-class classification\". Performance indicators are very useful when the aim is to evaluate and compare different classification models or machine learning techniques. Many metrics come in handy to test the ability of a multi-class classifier. Those metrics turn out to be useful at different stage of the development process, e.g. comparing the performance of two different models or analysing the behaviour of the same model by tuning different parameters. In this white paper we review a list of the most promising multi-class metrics, we highlight their advantages and disadvantages and show their possible usages during the development of a classification model.", "year": 2020, "referenceCount": 12, "citationCount": 224, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "114313889", "name": "Margherita Grandini"}, {"authorId": "2064595648", "name": "Enrico Bagli"}, {"authorId": "1491293345", "name": "Giorgio Visani"}]}, {"paperId": "e33af1f3b3bfa615b2399deb5390f96f3cfb86f4", "url": "https://www.semanticscholar.org/paper/e33af1f3b3bfa615b2399deb5390f96f3cfb86f4", "title": "Grammatical evolution - evolutionary automatic programming in an arbitrary language", "abstract": "From the Publisher: \nGrammatical Evolution: Evolutionary Automatic Programming in an Arbitrary Language provides the first comprehensive introduction to Grammatical Evolution, a novel approach to Genetic Programming that adopts principles from molecular biology in a simple and useful manner, coupled with the use of grammars to specify legal structures in a search. Grammatical Evolution's rich modularity gives a unique flexibility, making it possible to use alternative search strategies - whether evolutionary, deterministics or some other approach - and to radically change its behavior by merely changing the grammar supplied. This approach to Genetic Programming represents a powerful new weapon in the Machine Learning toolkit that can be applied to a diverse set of problem domains.", "year": 2003, "referenceCount": 1, "citationCount": 679, "influentialCitationCount": 49, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "117838237", "name": "M. O’Neill"}, {"authorId": "144063088", "name": "C. Ryan"}]}, {"paperId": "fec86faa56764658b128eb1bf10c3ea359907924", "url": "https://www.semanticscholar.org/paper/fec86faa56764658b128eb1bf10c3ea359907924", "title": "Practical real-time intrusion detection using machine learning approaches", "abstract": null, "year": 2011, "referenceCount": 23, "citationCount": 196, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2732580", "name": "Phurivit Sangkatsanee"}, {"authorId": "2828008", "name": "N. Wattanapongsakorn"}, {"authorId": "1778979", "name": "C. Charnsripinyo"}]}, {"paperId": "ef6586c6f6f188f0d9dffef67245a570ed072c9e", "url": "https://www.semanticscholar.org/paper/ef6586c6f6f188f0d9dffef67245a570ed072c9e", "title": "Survey of Classification Techniques in Data Mining", "abstract": "Classification is a data mining (machine learning) technique used to predict group membership for data instances. In this paper, we present the basic classification techniques. Several major kinds of classification method including decision tree induction, Bayesian networks, k-nearest neighbor classifier, case-based reasoning, genetic algorithm and fuzzy logic techniques. The goal of this survey is to provide a comprehensive review of different classification techniques in data mining. Data mining involves the use of sophisticated data analysis tools to discover previously unknown, valid patterns and relationships in large data set. These tools can include statistical models, mathematical algorithm and machine learning methods. Consequently, data mining consists of more than collection and managing data, it also includes analysis and prediction. Classification technique is capable of processing a wider variety of data than regression and is growing in popularity. There are several applications for Machine Learning (ML), the most significant of which is data mining. People are often prone to making mistakes during analyses or, possibly, when trying to establish relationships between multiple features. This makes it difficult for them to find solutions to certain problems. Machine learning can often be successfully applied to these problems, improving the efficiency of systems and the designs of machines.", "year": 2009, "referenceCount": 24, "citationCount": 109, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "67149030", "name": "Thair Nu Phyu"}]}, {"paperId": "305d689afb6574ffec7b01e24431d541d0ce6f5d", "url": "https://www.semanticscholar.org/paper/305d689afb6574ffec7b01e24431d541d0ce6f5d", "title": "Gambling in a rigged casino: The adversarial multi-armed bandit problem", "abstract": "In the multi-armed bandit problem, a gambler must decide which arm of K non-identical slot machines to play in a sequence of trials so as to maximize his reward. This classical problem has received much attention because of the simple model it provides of the trade-off between exploration (trying out each arm to find the best one) and exploitation (playing the arm believed to give the best payoff). Past solutions for the bandit problem have almost always relied on assumptions about the statistics of the slot machines. In this work, we make no statistical assumptions whatsoever about the nature of the process generating the payoffs of the slot machines. We give a solution to the bandit problem in which an adversary, rather than a well-behaved stochastic process, has complete control over the payoffs. In a sequence of T plays, we prove that the expected per-round payoff of our algorithm approaches that of the best arm at the rate O(T/sup -1/3/), and we give an improved rate of convergence when the best arm has fairly low payoff. We also consider a setting in which the player has a team of \"experts\" advising him on which arm to play; here, we give a strategy that will guarantee expected payoff close to that of the best expert. Finally, we apply our result to the problem of learning to play an unknown repeated matrix game against an all-powerful adversary.", "year": 1995, "referenceCount": 21, "citationCount": 847, "influentialCitationCount": 157, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144543541", "name": "P. Auer"}, {"authorId": "1388387856", "name": "N. Cesa-Bianchi"}, {"authorId": "1703537", "name": "Y. Freund"}, {"authorId": "1716301", "name": "R. Schapire"}]}, {"paperId": "6bf2309a54a2ea27857de4c702e7e88b3da00753", "url": "https://www.semanticscholar.org/paper/6bf2309a54a2ea27857de4c702e7e88b3da00753", "title": "Learning Interface Agents", "abstract": "Interface agents are computer programs that employ Artificial Intelligence techniques in order to provide assistance to a user dealing with a particular computer application. The paper discusses an interface agent which has been modelled closely after the metaphor of a personal assistant. The agent learns how to assist the user by (i) observing the user's actions and imitating them, (ii) receiving user feedback when it takes wrong actions and (iii) being trained by the user on the basis of hypothetical examples. The paper discusses how this learning agent was implemented using memory-based learning and reinforcement learning techniques. It presents actual results from two prototype agents built using these techniques: one for a meeting scheduling application and one for electronic mail. It argues that the machine learning approach to building interface agents is a feasible one which has several advantages over other approaches: it provides a customized and adaptive solution which is less costly and ensures better user acceptability. The paper also argues what the advantages are of the particular learning techniques used.", "year": 1993, "referenceCount": 22, "citationCount": 337, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1701876", "name": "P. Maes"}, {"authorId": "2683445", "name": "Robyn Kozierok"}]}, {"paperId": "2a3d09bbdfe21418ce75d6973f71028fa9192b89", "url": "https://www.semanticscholar.org/paper/2a3d09bbdfe21418ce75d6973f71028fa9192b89", "title": "Federated Learning for Edge Networks: Resource Optimization and Incentive Mechanism", "abstract": "Recent years have witnessed a rapid proliferation of smart Internet of Things (IoT) devices. IoT devices with intelligence require the use of effective machine learning paradigms. Federated learning can be a promising solution for enabling IoT-based smart applications. In this article, we present the primary design aspects for enabling federated learning at the network edge. We model the incentive- based interaction between a global server and participating devices for federated learning via a Stackelberg game to motivate the participation of the devices in the federated learning process. We present several open research challenges with their possible solutions. Finally, we provide an outlook on future research.", "year": 2019, "referenceCount": 24, "citationCount": 167, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2280048", "name": "L. U. Khan"}, {"authorId": "144534427", "name": "Nguyen H. Tran"}, {"authorId": "40997408", "name": "Shashi Raj Pandey"}, {"authorId": "145412074", "name": "W. Saad"}, {"authorId": "145169163", "name": "Zhu Han"}, {"authorId": "143781043", "name": "Minh N. H. Nguyen"}, {"authorId": "143849708", "name": "C. Hong"}]}, {"paperId": "fc32074b37a6d9dda535a70f9689022e70508520", "url": "https://www.semanticscholar.org/paper/fc32074b37a6d9dda535a70f9689022e70508520", "title": "Prediction of functional microRNA targets by integrative modeling of microRNA binding and target expression data", "abstract": null, "year": 2019, "referenceCount": 40, "citationCount": 404, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "2144379732", "name": "Weijun Liu"}, {"authorId": "2121283749", "name": "Xiaowei Wang"}]}, {"paperId": "5757ab2769aff6078b16bffb914e7b451721006d", "url": "https://www.semanticscholar.org/paper/5757ab2769aff6078b16bffb914e7b451721006d", "title": "Machine learning to classify animal species in camera trap images: applications in ecology", "abstract": "1. Motion-activated cameras (“camera traps”) are increasingly used in ecological and management studies for remotely observing wildlife and have been regarded as among the most powerful tools for wildlife research. However, studies involving camera traps result in millions of images that need to be analyzed, typically by visually observing each image, in order to extract data that can be used in ecological analyses. 2. We trained machine learning models using convolutional neural networks with the ResNet-18 architecture and 3,367,383 images to automatically classify wildlife species from camera trap images obtained from five states across the United States. We tested our model on an independent subset of images not seen during training from the United States and on an out-of-sample (or “out-of-distribution” in the machine learning literature) dataset of ungulate images from Canada. We also tested the ability of our model to distinguish empty images from those with animals in another out-of-sample dataset from Tanzania, containing a faunal community that was novel to the model. 3. The trained model classified approximately 2,000 images per minute on a laptop computer with 16 gigabytes of RAM. The trained model achieved 98% accuracy at identifying species in the United States, the highest accuracy of such a model to date. Out-of-sample validation from Canada achieved 82% accuracy, and correctly identified 94% of images containing an animal in the dataset from Tanzania. We provide an R package (Machine Learning for Wildlife Image Classification; MLWIC) that allows the users to A) implement the trained model presented here and B) train their own model using classified images of wildlife from their studies. 4. The use of machine learning to rapidly and accurately classify wildlife in camera trap images can facilitate non-invasive sampling designs in ecological studies by reducing the burden of manually analyzing images. We present an R package making these methods accessible to ecologists. We discuss the implications of this technology for ecology and considerations that should be addressed in future implementations of these methods.", "year": 2018, "referenceCount": 48, "citationCount": 228, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science"], "authors": [{"authorId": "40406856", "name": "M. A. Tabak"}, {"authorId": "2832481", "name": "M. S. Norouzzadeh"}, {"authorId": "13594979", "name": "David W. Wolfson"}, {"authorId": "2125331", "name": "S. Sweeney"}, {"authorId": "2906619", "name": "K. Vercauteren"}, {"authorId": "4592491", "name": "Nathan P. Snow"}, {"authorId": "4988359", "name": "Joseph M. Halseth"}, {"authorId": "1401585473", "name": "Paul A. Di Salvo"}, {"authorId": "152255096", "name": "Jesse S. Lewis"}, {"authorId": "2118713959", "name": "Michael White"}, {"authorId": "88744301", "name": "Ben S. Teton"}, {"authorId": "32331066", "name": "J. Beasley"}, {"authorId": "49216995", "name": "P. Schlichting"}, {"authorId": "48625693", "name": "R. Boughton"}, {"authorId": "51052748", "name": "Bethany Wight"}, {"authorId": "70299493", "name": "Eric S. Newkirk"}, {"authorId": "145898120", "name": "Jacob S. Ivan"}, {"authorId": "88557257", "name": "E. Odell"}, {"authorId": "6565924", "name": "R. Brook"}, {"authorId": "4579121", "name": "P. Lukacs"}, {"authorId": "49125698", "name": "Anna K. Moeller"}, {"authorId": "6156152", "name": "E. Mandeville"}, {"authorId": "2552141", "name": "J. Clune"}, {"authorId": "2158307092", "name": "Ryan S. Miller"}]}, {"paperId": "ff55ea55eb917a427d8cb5d6167199128db1b4fc", "url": "https://www.semanticscholar.org/paper/ff55ea55eb917a427d8cb5d6167199128db1b4fc", "title": "Landslide identification using machine learning", "abstract": null, "year": 2021, "referenceCount": 39, "citationCount": 75, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2051213347", "name": "Haojie Wang"}, {"authorId": "2118821351", "name": "Limin Zhang"}, {"authorId": "1644062600", "name": "K. Yin"}, {"authorId": "2110589155", "name": "H. Luo"}, {"authorId": "2117952697", "name": "Jin-hui Li"}]}, {"paperId": "48336cd6e6aa2e94446e2be6bbbb7ce2c3815c5c", "url": "https://www.semanticscholar.org/paper/48336cd6e6aa2e94446e2be6bbbb7ce2c3815c5c", "title": "A snapshot of the frontiers of fairness in machine learning", "abstract": "A group of industry, academic, and government experts convene in Philadelphia to explore the roots of algorithmic bias.", "year": 2020, "referenceCount": 113, "citationCount": 174, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2082393", "name": "A. Chouldechova"}, {"authorId": "1682008", "name": "Aaron Roth"}]}, {"paperId": "f045ec92c44c872565a6bedfdac61ee031ab5dfc", "url": "https://www.semanticscholar.org/paper/f045ec92c44c872565a6bedfdac61ee031ab5dfc", "title": "Kernel Based Algorithms for Mining Huge Data Sets: Supervised, Semi-supervised, and Unsupervised Learning", "abstract": null, "year": 2006, "referenceCount": 0, "citationCount": 206, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31694668", "name": "T. Huang"}, {"authorId": "2886979", "name": "V. Kecman"}, {"authorId": "2447262", "name": "I. Kopriva"}]}, {"paperId": "23037085b0815455e6d47333089b925c8c0e21d5", "url": "https://www.semanticscholar.org/paper/23037085b0815455e6d47333089b925c8c0e21d5", "title": "The MTG-Jamendo Dataset for Automatic Music Tagging", "abstract": "Comunicacio presentada a: ML4MD Machine Learning for Music Discovery Workshop del congres ICML2019 celebrat el 15 de juny de 2019 a Long Beach, California.", "year": 2019, "referenceCount": 8, "citationCount": 50, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144705733", "name": "D. Bogdanov"}, {"authorId": "28924703", "name": "Minz Won"}, {"authorId": "26576924", "name": "Philip Tovstogan"}, {"authorId": "23779614", "name": "Alastair Porter"}, {"authorId": "144611740", "name": "X. Serra"}]}, {"paperId": "f049a909e5023f304a64f956d15e46273ae2afb8", "url": "https://www.semanticscholar.org/paper/f049a909e5023f304a64f956d15e46273ae2afb8", "title": "Learning from multiple annotators with varying expertise", "abstract": null, "year": 2014, "referenceCount": 51, "citationCount": 131, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2117857710", "name": "Yan Yan"}, {"authorId": "144956884", "name": "Rómer Rosales"}, {"authorId": "144848317", "name": "Glenn Fung"}, {"authorId": "1742936", "name": "Subramanian Ramanathan"}, {"authorId": "144729179", "name": "Jennifer G. Dy"}]}, {"paperId": "970adc0c514bacabd7a6e25e6d6a4141b6fb8f08", "url": "https://www.semanticscholar.org/paper/970adc0c514bacabd7a6e25e6d6a4141b6fb8f08", "title": "Prediction of In-hospital Mortality in Emergency Department Patients With Sepsis: A Local Big Data-Driven, Machine Learning Approach.", "abstract": "OBJECTIVES\nPredictive analytics in emergency care has mostly been limited to the use of clinical decision rules (CDRs) in the form of simple heuristics and scoring systems. In the development of CDRs, limitations in analytic methods and concerns with usability have generally constrained models to a preselected small set of variables judged to be clinically relevant and to rules that are easily calculated. Furthermore, CDRs frequently suffer from questions of generalizability, take years to develop, and lack the ability to be updated as new information becomes available. Newer analytic and machine learning techniques capable of harnessing the large number of variables that are already available through electronic health records (EHRs) may better predict patient outcomes and facilitate automation and deployment within clinical decision support systems. In this proof-of-concept study, a local, big data-driven, machine learning approach is compared to existing CDRs and traditional analytic methods using the prediction of sepsis in-hospital mortality as the use case.\n\n\nMETHODS\nThis was a retrospective study of adult ED visits admitted to the hospital meeting criteria for sepsis from October 2013 to October 2014. Sepsis was defined as meeting criteria for systemic inflammatory response syndrome with an infectious admitting diagnosis in the ED. ED visits were randomly partitioned into an 80%/20% split for training and validation. A random forest model (machine learning approach) was constructed using over 500 clinical variables from data available within the EHRs of four hospitals to predict in-hospital mortality. The machine learning prediction model was then compared to a classification and regression tree (CART) model, logistic regression model, and previously developed prediction tools on the validation data set using area under the receiver operating characteristic curve (AUC) and chi-square statistics.\n\n\nRESULTS\nThere were 5,278 visits among 4,676 unique patients who met criteria for sepsis. Of the 4,222 patients in the training group, 210 (5.0%) died during hospitalization, and of the 1,056 patients in the validation group, 50 (4.7%) died during hospitalization. The AUCs with 95% confidence intervals (CIs) for the different models were as follows: random forest model, 0.86 (95% CI = 0.82 to 0.90); CART model, 0.69 (95% CI = 0.62 to 0.77); logistic regression model, 0.76 (95% CI = 0.69 to 0.82); CURB-65, 0.73 (95% CI = 0.67 to 0.80); MEDS, 0.71 (95% CI = 0.63 to 0.77); and mREMS, 0.72 (95% CI = 0.65 to 0.79). The random forest model AUC was statistically different from all other models (p ≤ 0.003 for all comparisons).\n\n\nCONCLUSIONS\nIn this proof-of-concept study, a local big data-driven, machine learning approach outperformed existing CDRs as well as traditional analytic techniques for predicting in-hospital mortality of ED patients with sepsis. Future research should prospectively evaluate the effectiveness of this approach and whether it translates into improved clinical outcomes for high-risk sepsis patients. The methods developed serve as an example of a new model for predictive analytics in emergency care that can be automated, applied to other clinical outcomes of interest, and deployed in EHRs to enable locally relevant clinical predictions.", "year": 2016, "referenceCount": 61, "citationCount": 301, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2107598798", "name": "R. A. Taylor"}, {"authorId": "10732911", "name": "J. Pare"}, {"authorId": "144215836", "name": "A. Venkatesh"}, {"authorId": "32653768", "name": "Hani Mowafi"}, {"authorId": "2118315", "name": "E. Melnick"}, {"authorId": "2830075", "name": "William Fleischman"}, {"authorId": "46718618", "name": "M. K. Hall"}]}, {"paperId": "4dc0e6599d543a5ad3c32b9127c9dac04e34021b", "url": "https://www.semanticscholar.org/paper/4dc0e6599d543a5ad3c32b9127c9dac04e34021b", "title": "On the Complexity of Best-Arm Identification in Multi-Armed Bandit Models", "abstract": "The stochastic multi-armed bandit model is a simple abstraction that has proven useful in many different contexts in statistics and machine learning. Whereas the achievable limit in terms of regret minimization is now well known, our aim is to contribute to a better understanding of the performance in terms of identifying the m best arms. We introduce generic notions of complexity for the two dominant frameworks considered in the literature: fixed-budget and fixed-confidence settings. In the fixed-confidence setting, we provide the first known distribution-dependent lower bound on the complexity that involves information-theoretic quantities and holds when m ≥ 1 under general assumptions. In the specific case of two armed-bandits, we derive refined lower bounds in both the fixedcon fidence and fixed-budget settings, along with matching algorithms for Gaussian and Bernoulli bandit models. These results show in particular that the complexity of the fixed-budget setting may be smaller than the complexity of the fixed-confidence setting, contradicting the familiar behavior observed when testing fully specified alternatives. In addition, we also provide improved sequential stopping rules that have guaranteed error probabilities and shorter average running times. The proofs rely on two technical results that are of independent interest: a deviation lemma for self-normalized sums (Lemma 7) and a novel change of measure inequality for bandit models (Lemma 1).", "year": 2014, "referenceCount": 38, "citationCount": 855, "influentialCitationCount": 87, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2578263", "name": "E. Kaufmann"}, {"authorId": "1769551", "name": "O. Cappé"}, {"authorId": "2927057", "name": "Aurélien Garivier"}]}, {"paperId": "66b60012afb7dcc755bcb79dfc088bed55631af8", "url": "https://www.semanticscholar.org/paper/66b60012afb7dcc755bcb79dfc088bed55631af8", "title": "Consideration On Automation of 5G Network Slicing with Machine Learning", "abstract": "Machine learning has the capability to provide simpler solutions to complex problems by analyzing a huge volume of data in a short time, learning for adapting its functionality to dynamically changing environments, and predicting near future events with reasonably good accuracy. The 5G communication networks are getting complex due to emergence of unprecedentedly huge number of new connected devices and new types of services. Moreover, the requirements of creating virtual network slices suitable to provide optimal services for diverse users and applications are posing challenges to the efficient management of network resources, processing information about a huge volume of traffic, staying robust against all potential security threats, and adaptively adjustment of network functionality for time-varying workload. In this paper, we introduce about the envisioned 5G network slicing and elaborate the necessity of automation of network functions for the design, construction, deployment, operation, control and management of network slices. We then revisit the machine learning techniques that can be applied for the automation of network functions. We also discuss the status of artificial intelligence and machine learning related activities being progressed in standards development organizations and industrial forums.", "year": 2018, "referenceCount": 10, "citationCount": 46, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1734625", "name": "Ved P. Kafle"}, {"authorId": "144673887", "name": "Y. Fukushima"}, {"authorId": "1398682373", "name": "P. Martinez-Julia"}, {"authorId": "2575439", "name": "T. Miyazawa"}]}, {"paperId": "00e884959ac4e12db983a27f7a0638f7168af10a", "url": "https://www.semanticscholar.org/paper/00e884959ac4e12db983a27f7a0638f7168af10a", "title": "Managing the Complexity of Human/Machine Interactions in Computerized Learning Environments: Guiding Students’ Command Process through Instrumental Orchestrations", "abstract": null, "year": 2004, "referenceCount": 44, "citationCount": 418, "influentialCitationCount": 50, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2164742", "name": "L. Trouche"}]}, {"paperId": "17933ee1a7caddc3366ba1dccf8abca510a24223", "url": "https://www.semanticscholar.org/paper/17933ee1a7caddc3366ba1dccf8abca510a24223", "title": "Regularization on Graphs with Function-adapted Diffusion Processes", "abstract": "Harmonic analysis and diffusion on discrete data has been shown to lead to state-of-the-art algorithms for machine learning tasks, especially in the context of semi-supervised and transductive learning. The success of these algorithms rests on the assumption that the function(s) to be studied (learned, interpolated, etc.) are smooth with respect to the geometry of the data. In this paper we present a method for modifying the given geometry so the function(s) to be studied are smoother with respect to the modified geometry, and thus more amenable to treatment using harmonic analysis methods. Among the many possible applications, we consider the problems of image denoising and transductive classification. In both settings, our approach improves on standard diffusion based methods.", "year": 2008, "referenceCount": 105, "citationCount": 138, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "3149531", "name": "Arthur D. Szlam"}, {"authorId": "34207023", "name": "M. Maggioni"}, {"authorId": "1780112", "name": "R. Coifman"}]}, {"paperId": "b8ff13570f6f0d8b93c3d22cf2048d6f310a0a5e", "url": "https://www.semanticscholar.org/paper/b8ff13570f6f0d8b93c3d22cf2048d6f310a0a5e", "title": "Boosting: Foundations and Algorithms", "abstract": "Boosting is an approach to machine learning based on the idea of creating a highly accurate predictor by combining many weak and inaccurate \"rules of thumb.\" A remarkably rich theory has evolved around boosting, with connections to a range of topics, including statistics, game theory, convex optimization, and information geometry. Boosting algorithms have also enjoyed practical success in such fields as biology, vision, and speech processing. At various times in its history, boosting has been perceived as mysterious, controversial, even paradoxical.This book, written by the inventors of the method, brings together, organizes, simplifies, and substantially extends two decades of research on boosting, presenting both theory and applications in a way that is accessible to readers from diverse backgrounds while also providing an authoritative reference for advanced researchers. With its introductory treatment of all material and its inclusion of exercises in every chapter, the book is appropriate for course use as well. The book begins with a general introduction to machine learning algorithms and their analysis; then explores the core theory of boosting, especially its ability to generalize; examines some of the myriad other theoretical viewpoints that help to explain and understand boosting; provides practical extensions of boosting for more complex learning problems; and finally presents a number of advanced theoretical topics. Numerous applications and practical illustrations are offered throughout.", "year": 2012, "referenceCount": 220, "citationCount": 330, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1716301", "name": "R. Schapire"}, {"authorId": "1703537", "name": "Y. Freund"}]}, {"paperId": "cd8e4c9d01615d86c0f1c0a5a9ebf1b2a64f62f8", "url": "https://www.semanticscholar.org/paper/cd8e4c9d01615d86c0f1c0a5a9ebf1b2a64f62f8", "title": "Imputation of Missing Data Using Machine Learning Techniques", "abstract": "A serious problem in mining industrial data bases is that they are often incomplete, and a significant amount of data is missing, or erroneously entered. This paper explores the use of machine-learning based alternatives to standard statistical data completion (data imputation) methods, for dealing with missing data. We have approached the data completion problem using two well-known machine learning techniques. The first is an unsupervised clustering strategy which uses a Bayesian approach to cluster the data into classes. The classes so obtained are then used to predict multiple choices for the attribute of interest. The second technique involves modeling missing variables by supervised induction of a decision tree-based classifier. This predicts the most likely value for the attribute of interest. Empirical tests using extracts from industrial databases maintained by Honeywell customers have been done in order to compare the two techniques. These tests show both approaches are useful and have advantages and disadvantages. We argue that the choice between unsupervised and supervised classification techniques should be influenced by the motivation for solving the missing data problem, and discuss potential applications for the procedures we are developing.", "year": 1996, "referenceCount": 8, "citationCount": 142, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1831282", "name": "K. Lakshminarayan"}, {"authorId": "1685484", "name": "S. Harp"}, {"authorId": "2473054", "name": "R. Goldman"}, {"authorId": "47083033", "name": "T. Samad"}]}, {"paperId": "adb73d51b8473bfa403664d5417c1dea9343bba6", "url": "https://www.semanticscholar.org/paper/adb73d51b8473bfa403664d5417c1dea9343bba6", "title": "The Deep Learning Vision for Heterogeneous Network Traffic Control: Proposal, Challenges, and Future Perspective", "abstract": "Recently, deep learning, an emerging machine learning technique, is garnering a lot of research attention in several computer science areas. However, to the best of our knowledge, its application to improve heterogeneous network traffic control (which is an important and challenging area by its own merit) has yet to appear because of the difficult challenge in characterizing the appropriate input and output patterns for a deep learning system to correctly reflect the highly dynamic nature of large-scale heterogeneous networks. In this vein, in this article, we propose appropriate input and output characterizations of heterogeneous network traffic and propose a supervised deep neural network system. We describe how our proposed system works and how it differs from traditional neural networks. Also, preliminary results are reported that demonstrate the encouraging performance of our proposed deep learning system compared to a benchmark routing strategy (Open Shortest Path First (OSPF)) in terms of significantly better signaling overhead, throughput, and delay.", "year": 2017, "referenceCount": 7, "citationCount": 298, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145842185", "name": "N. Kato"}, {"authorId": "1863354", "name": "Z. Fadlullah"}, {"authorId": "152877793", "name": "Bomin Mao"}, {"authorId": "19282835", "name": "Fengxiao Tang"}, {"authorId": "2230780", "name": "Osamu Akashi"}, {"authorId": "143748893", "name": "Takeru Inoue"}, {"authorId": "2135218", "name": "Kimihiro Mizutani"}]}, {"paperId": "3f3b3dc86415ebda1043d2be55e75a29ffe2bd95", "url": "https://www.semanticscholar.org/paper/3f3b3dc86415ebda1043d2be55e75a29ffe2bd95", "title": "Higher-Order Factorization Machines", "abstract": "Factorization machines (FMs) are a supervised learning approach that can use second-order feature combinations even when the data is very high-dimensional. Unfortunately, despite increasing interest in FMs, there exists to date no efficient training algorithm for higher-order FMs (HOFMs). In this paper, we present the first generic yet efficient algorithms for training arbitrary-order HOFMs. We also present new variants of HOFMs with shared parameters, which greatly reduce model size and prediction times while maintaining similar accuracy. We demonstrate the proposed approaches on four different link prediction tasks.", "year": 2016, "referenceCount": 26, "citationCount": 137, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "27257992", "name": "Mathieu Blondel"}, {"authorId": "34433830", "name": "Akinori Fujino"}, {"authorId": "1735221", "name": "N. Ueda"}, {"authorId": "1784290", "name": "Masakazu Ishihata"}]}, {"paperId": "ffa0c918fba3010ccb635c03b4a740bd938a0493", "url": "https://www.semanticscholar.org/paper/ffa0c918fba3010ccb635c03b4a740bd938a0493", "title": "Evaluation of Combined Artificial Intelligence and Radiologist Assessment to Interpret Screening Mammograms", "abstract": "This diagnostic accuracy study evaluates whether artificial intelligence can overcome human mammography interpretation limits with a rigorous, unbiased evaluation of machine learning algorithms.", "year": 2020, "referenceCount": 76, "citationCount": 147, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1866719", "name": "T. Schaffter"}, {"authorId": "144200490", "name": "D. Buist"}, {"authorId": "1410213314", "name": "Christoph I. Lee"}, {"authorId": "2075948728", "name": "Yaroslav Nikulin"}, {"authorId": "5879373", "name": "D. Ribli"}, {"authorId": "144936019", "name": "Y. Guan"}, {"authorId": "2023002", "name": "William Lotter"}, {"authorId": "2750647", "name": "Zequn Jie"}, {"authorId": "143970698", "name": "Hao Du"}, {"authorId": "2116420948", "name": "Sijia Wang"}, {"authorId": "33221685", "name": "Jiashi Feng"}, {"authorId": "2067622344", "name": "Mengling Feng"}, {"authorId": "2144350951", "name": "Hyo-Eun Kim"}, {"authorId": "145637098", "name": "F. Albiol"}, {"authorId": "1803435", "name": "A. Albiol"}, {"authorId": "77754942", "name": "Stephen Morrell"}, {"authorId": "3282833", "name": "Z. Wojna"}, {"authorId": "2926338", "name": "M. Ahsen"}, {"authorId": "1823844", "name": "U. Asif"}, {"authorId": "52204175", "name": "Antonio José Jimeno Yepes"}, {"authorId": "3375730", "name": "Shivanthan A. C. Yohanandan"}, {"authorId": "1402930925", "name": "S. Rabinovici-Cohen"}, {"authorId": "4812647", "name": "Darvin Yi"}, {"authorId": "47368791", "name": "B. Hoff"}, {"authorId": "153071623", "name": "Thomas V Yu"}, {"authorId": "8360566", "name": "E. Chaibub Neto"}, {"authorId": "143648587", "name": "D. Rubin"}, {"authorId": "153264219", "name": "Peter Lindholm"}, {"authorId": "37492428", "name": "L. Margolies"}, {"authorId": "38846639", "name": "R. McBride"}, {"authorId": "143905382", "name": "J. Rothstein"}, {"authorId": "3465814", "name": "W. Sieh"}, {"authorId": "1397958297", "name": "Rami Ben-Ari"}, {"authorId": "40639323", "name": "S. Harrer"}, {"authorId": "3430870", "name": "A. Trister"}, {"authorId": "144682786", "name": "S. Friend"}, {"authorId": "48320083", "name": "Thea C. Norman"}, {"authorId": "1685878", "name": "B. Sahiner"}, {"authorId": "1394725980", "name": "Fredrik Strand"}, {"authorId": "1684985", "name": "J. Guinney"}, {"authorId": "2003079", "name": "G. Stolovitzky"}, {"authorId": "143722101", "name": "Lester W. Mackey"}, {"authorId": "150140157", "name": "Joyce Cahoon"}, {"authorId": "2121272233", "name": "Li Shen"}, {"authorId": "4949525", "name": "J. H. Sohn"}, {"authorId": "144821836", "name": "H. Trivedi"}, {"authorId": "35139543", "name": "Yiqiu Shen"}, {"authorId": "49852539", "name": "L. Buturovic"}, {"authorId": "152929215", "name": "José Costa Pereira"}, {"authorId": "3698192", "name": "Jaime S. Cardoso"}, {"authorId": "77713088", "name": "Eduardo Castro"}, {"authorId": "3086506", "name": "K. T. Kalleberg"}, {"authorId": "2729286", "name": "Obioma Pelka"}, {"authorId": "2916112", "name": "Imane Nedjar"}, {"authorId": "2376144", "name": "Krzysztof J Geras"}, {"authorId": "6152141", "name": "F. Nensa"}, {"authorId": "3451409", "name": "Ethan Goan"}, {"authorId": "3442093", "name": "Sven Koitka"}, {"authorId": "2074491057", "name": "Luis Caballero"}, {"authorId": "2042941", "name": "D. Cox"}, {"authorId": "33428484", "name": "Pavitra Krishnaswamy"}, {"authorId": "153842077", "name": "G. Pandey"}, {"authorId": "2955567", "name": "C. Friedrich"}, {"authorId": "40569930", "name": "Dimitri Perrin"}, {"authorId": "3140440", "name": "C. Fookes"}, {"authorId": "3251102", "name": "Bibo Shi"}, {"authorId": "1517010631", "name": "Gerard Cardoso Negrie"}, {"authorId": "96722441", "name": "M. Kawczynski"}, {"authorId": "1979489", "name": "Kyunghyun Cho"}, {"authorId": "51287785", "name": "Can Son Khoo"}, {"authorId": "2063101319", "name": "Joseph Y. Lo"}, {"authorId": "143956756", "name": "A. Sorensen"}, {"authorId": "51309208", "name": "Hwejin Jung"}]}, {"paperId": "dc9626e63dc0fc09891461612a309e92f2ef208e", "url": "https://www.semanticscholar.org/paper/dc9626e63dc0fc09891461612a309e92f2ef208e", "title": "Optimizing Kernel Machines Using Deep Learning", "abstract": "Building highly nonlinear and nonparametric models is central to several state-of-the-art machine learning systems. Kernel methods form an important class of techniques that induce a reproducing kernel Hilbert space (RKHS) for inferring non-linear models through the construction of similarity functions from data. These methods are particularly preferred in cases where the training data sizes are limited and when prior knowledge of the data similarities is available. Despite their usefulness, they are limited by the computational complexity and their inability to support end-to-end learning with a task-specific objective. On the other hand, deep neural networks have become the de facto solution for end-to-end inference in several learning paradigms. In this paper, we explore the idea of using deep architectures to perform kernel machine optimization, for both computational efficiency and end-to-end inferencing. To this end, we develop the deep kernel machine optimization framework, that creates an ensemble of dense embeddings using Nyström kernel approximations and utilizes deep learning to generate task-specific representations through the fusion of the embeddings. Intuitively, the filters of the network are trained to fuse information from an ensemble of linear subspaces in the RKHS. Furthermore, we introduce the kernel dropout regularization to enable improved training convergence. Finally, we extend this framework to the multiple kernel case, by coupling a global fusion layer with pretrained deep kernel machines for each of the constituent kernels. Using case studies with limited training data, and lack of explicit feature sources, we demonstrate the effectiveness of our framework over conventional model inferencing techniques.", "year": 2017, "referenceCount": 71, "citationCount": 42, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine", "Mathematics"], "authors": [{"authorId": "72482217", "name": "Huan Song"}, {"authorId": "121241127", "name": "Jayaraman J. Thiagarajan"}, {"authorId": "1706272", "name": "P. Sattigeri"}, {"authorId": "144924839", "name": "A. Spanias"}]}, {"paperId": "3e7537be920bda72b065c7c7208a780543c38275", "url": "https://www.semanticscholar.org/paper/3e7537be920bda72b065c7c7208a780543c38275", "title": "Federated Machine Learning: Survey, Multi-Level Classification, Desirable Criteria and Future Directions in Communication and Networking Systems", "abstract": "The communication and networking field is hungry for machine learning decision-making solutions to replace the traditional model-driven approaches that proved to be not rich enough for seizing the ever-growing complexity and heterogeneity of the modern systems in the field. Traditional machine learning solutions assume the existence of (cloud-based) central entities that are in charge of processing the data. Nonetheless, the difficulty of accessing private data, together with the high cost of transmitting raw data to the central entity gave rise to a decentralized machine learning approach called Federated Learning. The main idea of federated learning is to perform an on-device collaborative training of a single machine learning model without having to share the raw training data with any third-party entity. Although few survey articles on federated learning already exist in the literature, the motivation of this survey stems from three essential observations. The first one is the lack of a fine-grained multi-level classification of the federated learning literature, where the existing surveys base their classification on only one criterion or aspect. The second observation is that the existing surveys focus only on some common challenges, but disregard other essential aspects such as reliable client selection, resource management and training service pricing. The third observation is the lack of explicit and straightforward directives for researchers to help them design future federated learning solutions that overcome the state-of-the-art research gaps. To address these points, we first provide a comprehensive tutorial on federated learning and its associated concepts, technologies and learning approaches. We then survey and highlight the applications and future directions of federated learning in the domain of communication and networking. Thereafter, we design a three-level classification scheme that first categorizes the federated learning literature based on the high-level challenge that they tackle. Then, we classify each high-level challenge into a set of specific low-level challenges to foster a better understanding of the topic. Finally, we provide, within each low-level challenge, a fine-grained classification based on the technique used to address this particular challenge. For each category of high-level challenges, we provide a set of desirable criteria and future research directions that are aimed to help the research community design innovative and efficient future solutions. To the best of our knowledge, our survey is the most comprehensive in terms of challenges and techniques it covers and the most fine-grained in terms of the multi-level classification scheme it presents.", "year": 2021, "referenceCount": 185, "citationCount": 109, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2539141", "name": "O. A. Wahab"}, {"authorId": "144378341", "name": "A. Mourad"}, {"authorId": "1718596", "name": "H. Otrok"}, {"authorId": "1682312", "name": "T. Taleb"}]}, {"paperId": "ec3055379dff4fc19d1ad12fc00ebb42163b22c6", "url": "https://www.semanticscholar.org/paper/ec3055379dff4fc19d1ad12fc00ebb42163b22c6", "title": "5G MIMO Data for Machine Learning: Application to Beam-Selection Using Deep Learning", "abstract": "The increasing complexity of configuring cellular networks suggests that machine learning (ML) can effectively improve 5G technologies. Deep learning has proven successful in ML tasks such as speech processing and computational vision, with a performance that scales with the amount of available data. The lack of large datasets inhibits the flourish of deep learning applications in wireless communications. This paper presents a methodology that combines a vehicle traffic simulator with a ray-tracing simulator, to generate channel realizations representing 5G scenarios with mobility of both transceivers and objects. The paper then describes a specific dataset for investigating beam-selection techniques on vehicle-to-infrastructure using millimeter waves. Experiments using deep learning in classification, regression and reinforcement learning problems illustrate the use of datasets generated with the proposed methodology.", "year": 2018, "referenceCount": 45, "citationCount": 133, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "1753266", "name": "A. Klautau"}, {"authorId": "121611025", "name": "Pedro Batista"}, {"authorId": "2998505", "name": "N. G. Prelcic"}, {"authorId": "97594775", "name": "Yuyang Wang"}, {"authorId": "1797630", "name": "R. Heath"}]}, {"paperId": "e399090e4dd760e8f09bd3d4de61b13b057c7740", "url": "https://www.semanticscholar.org/paper/e399090e4dd760e8f09bd3d4de61b13b057c7740", "title": "Compiling machine learning programs via high-level tracing", "abstract": "We describe JAX, a domain-specific tracing JIT compiler for generating high-performance accelerator code from pure Python and Numpy machine learning programs. JAX uses the XLA compiler infrastructure to generate optimized code for the program subroutines that are most favorable for acceleration, and these optimized subroutines can be called and orchestrated by arbitrary Python. Because the system is fully compatible with Autograd, it allows forwardand reverse-mode automatic differentiation of Python functions to arbitrary order. Because JAX supports structured control flow, it can generate code for sophisticated machine learning algorithms while maintaining high performance. We show that by combining JAX with Autograd and Numpy we get an easily programmable and highly performant ML system that targets CPUs, GPUs, and TPUs, capable of scaling to multi-core Cloud TPUs.", "year": 2018, "referenceCount": 9, "citationCount": 132, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34765463", "name": "Roy Frostig"}, {"authorId": "143945334", "name": "Matthew Johnson"}, {"authorId": "3362246", "name": "Chris Leary"}]}, {"paperId": "015562837d3bf7fbdfbaccb43eadc6981ee5e35e", "url": "https://www.semanticscholar.org/paper/015562837d3bf7fbdfbaccb43eadc6981ee5e35e", "title": "Communication-Efficient On-Device Machine Learning: Federated Distillation and Augmentation under Non-IID Private Data", "abstract": "On-device machine learning (ML) enables the training process to exploit a massive amount of user-generated private data samples. To enjoy this benefit, inter-device communication overhead should be minimized. With this end, we propose federated distillation (FD), a distributed model training algorithm whose communication payload size is much smaller than a benchmark scheme, federated learning (FL), particularly when the model size is large. Moreover, user-generated data samples are likely to become non-IID across devices, which commonly degrades the performance compared to the case with an IID dataset. To cope with this, we propose federated augmentation (FAug), where each device collectively trains a generative model, and thereby augments its local data towards yielding an IID dataset. Empirical studies demonstrate that FD with FAug yields around 26x less communication overhead while achieving 95-98% test accuracy compared to FL.", "year": 2018, "referenceCount": 15, "citationCount": 259, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "31097538", "name": "Eunjeong Jeong"}, {"authorId": "50364303", "name": "Seungeun Oh"}, {"authorId": "145063546", "name": "Hyesung Kim"}, {"authorId": "48490823", "name": "Jihong Park"}, {"authorId": "1702172", "name": "M. Bennis"}, {"authorId": "1692004", "name": "Seong-Lyun Kim"}]}, {"paperId": "0bdc74cc6716b01eecee50032bf8dc760379e494", "url": "https://www.semanticscholar.org/paper/0bdc74cc6716b01eecee50032bf8dc760379e494", "title": "Invariant Risk Minimization Games", "abstract": "The standard risk minimization paradigm of machine learning is brittle when operating in environments whose test distributions are different from the training distribution due to spurious correlations. Training on data from many environments and finding invariant predictors reduces the effect of spurious features by concentrating models on features that have a causal relationship with the outcome. In this work, we pose such invariant risk minimization as finding the Nash equilibrium of an ensemble game among several environments. By doing so, we develop a simple training algorithm that uses best response dynamics and, in our experiments, yields similar or better empirical accuracy with much lower variance than the challenging bi-level optimization problem of Arjovsky et al. (2019). One key theoretical contribution is showing that the set of Nash equilibria for the proposed game are equivalent to the set of invariant predictors for any finite number of environments, even with nonlinear classifiers and transformations. As a result, our method also retains the generalization guarantees to a large set of environments shown in Arjovsky et al. (2019). The proposed algorithm adds to the collection of successful game-theoretic machine learning algorithms such as generative adversarial networks.", "year": 2020, "referenceCount": 54, "citationCount": 126, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3048927", "name": "Kartik Ahuja"}, {"authorId": "145455859", "name": "Karthikeyan Shanmugam"}, {"authorId": "1712865", "name": "K. Varshney"}, {"authorId": "2145784", "name": "Amit Dhurandhar"}]}, {"paperId": "dc9f999632bf6d82882cc54e2d2cc2d32eaed932", "url": "https://www.semanticscholar.org/paper/dc9f999632bf6d82882cc54e2d2cc2d32eaed932", "title": "Guiding Semi-Supervision with Constraint-Driven Learning", "abstract": "Over the last few years, two of the main research directions in machine learning of natural language processing have been the study of semi-supervised learning algorithms as a way to train classiers when the labeled data is scarce, and the study of ways to exploit knowledge and global information in structured learning tasks. In this paper, we suggest a method for incorporating domain knowledge in semi-supervised learning algorithms. Our novel framework unies and can exploit several kinds of task specic constraints. The experimental results presented in the information extraction domain demonstrate that applying constraints helps the model to generate better feedback during learning, and hence the framework allows for high performance learning with significantly less training data than was possible before on these tasks.", "year": 2007, "referenceCount": 17, "citationCount": 233, "influentialCitationCount": 34, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1744179", "name": "Ming-Wei Chang"}, {"authorId": "2335225", "name": "Lev-Arie Ratinov"}, {"authorId": "144590225", "name": "D. Roth"}]}, {"paperId": "a9f1697217687931c0817eaff61caa84c2182570", "url": "https://www.semanticscholar.org/paper/a9f1697217687931c0817eaff61caa84c2182570", "title": "Youth Learning Machine Learning through Building Models of Athletic Moves", "abstract": "Machine Learning-based (ML) technologies impact many facets of our lives. Given ML's ubiquity, and the ways it offers creative computational possibilities distinct from programming, we believe it could be a powerful tool for youth to leverage in making, creativity, and play. We investigate how youth with no programming experience can incorporate ML classifiers into athletic practice by building models of their own physical activity. In this paper, we describe a design experiment exploring how to introduce youth to making ML models within the context of their athletic interests. We present AlpacaML, an iOS application that connects to wearable sensors and allows young people to model physical movement using an ML classifier, and detail its use in a three-hour workshop with middle- and high-school athletes. We found the youth were able to collect data, build models, test and evaluate models, and quickly iterate on this process. We finish with a discussion of why this is a promising direction for the incorporation of Machine Learning into novice youth making, exploration, and play.", "year": 2019, "referenceCount": 22, "citationCount": 74, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1417420548", "name": "Abigail Zimmermann-Niefield"}, {"authorId": "2093408205", "name": "Makenna Turner"}, {"authorId": "113091236", "name": "Bridget Murphy"}, {"authorId": "2893996", "name": "Shaun K. Kane"}, {"authorId": "145140106", "name": "R. B. Shapiro"}]}, {"paperId": "8d6adaa16ed0af9935a1130a305c85e8bdf8780d", "url": "https://www.semanticscholar.org/paper/8d6adaa16ed0af9935a1130a305c85e8bdf8780d", "title": "An Algorithmic Perspective on Imitation Learning", "abstract": "As robots and other intelligent agents move from simple environments and problems to more complex, unstructured settings, manually programming their behavior has become increasingly challenging and expensive. Often, it is easier for a teacher to demonstrate a desired behavior rather than attempt to manually engineer it. This process of learning from demonstrations, and the study of algorithms to do so, is called imitation learning. This work provides an introduction to imitation learning. It covers the underlying assumptions, approaches, and how they relate; the rich set of algorithms developed to tackle the problem; and advice on effective tools and implementation. We intend this paper to serve two audiences. First, we want to familiarize machine learning experts with the challenges of imitation learning, particularly those arising in robotics, and the interesting theoretical and practical distinctions between it and more familiar frameworks like statistical supervised learning theory and reinforcement learning. Second, we want to give roboticists and experts in applied artificial intelligence a broader appreciation for the frameworks and tools available for imitation learning. We pay particular attention to the intimate connection between imitation learning approaches and those of structured prediction Daume III et al. [2009]. To structure this discussion, we categorize imitation learning techniques based on the following key criteria which drive algorithmic decisions: \n \n1) The structure of the policy space. Is the learned policy a time-index trajectory (trajectory learning), a mapping from observations to actions (so called behavioral cloning [Bain and Sammut, 1996]), or the result of a complex optimization or planning problem at each execution as is common in inverse optimal control methods [Kalman, 1964, Moylan and Anderson, 1973]. \n \n2) The information available during training and testing. In particular, is the learning algorithm privy to the full state that the teacher possess? Is the learner able to interact with the teacher and gather corrections or more data? Does the learner have a (typically a priori) model of the system with which it interacts? Does the learner have access to the reward (cost) function that the teacher is attempting to optimize? \n \n3) The notion of success. Different algorithmic approaches provide varying guarantees on the resulting learned behavior. These guarantees range from weaker (e.g., measuring disagreement with the agent’s decision) to stronger (e.g., providing guarantees on the performance of the learner with respect to a true cost function, either known or unknown). We organize our work by paying particular attention to distinction (1): dividing imitation learning into directly replicating desired behavior (sometimes called behavioral cloning) and learning the hidden objectives of the desired behavior from demonstrations (called inverse optimal control or inverse reinforcement learning [Russell, 1998]). In the latter case, behavior arises as the result of an optimization problem solved for each new instance that the learner faces. In addition to method analysis, we discuss the design decisions a practitioner must make when selecting an imitation learning approach. Moreover, application examples—such as robots that play table tennis [Kober and Peters, 2009], programs that play the game of Go [Silver et al., 2016], and systems that understand natural language [Wen et al., 2015]— illustrate the properties and motivations behind different forms of imitation learning. We conclude by presenting a set of open questions and point towards possible future research directions for machine learning.", "year": 2018, "referenceCount": 240, "citationCount": 446, "influentialCitationCount": 26, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40229316", "name": "Takayuki Osa"}, {"authorId": "34906504", "name": "J. Pajarinen"}, {"authorId": "26599977", "name": "G. Neumann"}, {"authorId": "1756566", "name": "J. Bagnell"}, {"authorId": "1689992", "name": "P. Abbeel"}, {"authorId": "145197867", "name": "Jan Peters"}]}, {"paperId": "b685a683c3a953fa71cb0b3c2b04102eb00e7c6a", "url": "https://www.semanticscholar.org/paper/b685a683c3a953fa71cb0b3c2b04102eb00e7c6a", "title": "The Learning Machines.", "abstract": null, "year": 1981, "referenceCount": 0, "citationCount": 67, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "114318907", "name": "K. Martin"}]}, {"paperId": "efeb4260370f96bb562e59de28a7909ab60a17a3", "url": "https://www.semanticscholar.org/paper/efeb4260370f96bb562e59de28a7909ab60a17a3", "title": "Fundamentals of Machine Learning", "abstract": null, "year": 2019, "referenceCount": 176, "citationCount": 27, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144623096", "name": "Ke-Lin Du"}, {"authorId": "143949858", "name": "M. Swamy"}]}, {"paperId": "c1c532fb7b39797bcd9a70d7cec659a8aa36343d", "url": "https://www.semanticscholar.org/paper/c1c532fb7b39797bcd9a70d7cec659a8aa36343d", "title": "Online Machine Learning", "abstract": "Machine Learning (ML) addresses the problem of adjusting those mathematical models which can accurately predict a characteristic of interest from a given phenomenon. They achieve this by extracting information from regularities contained in a data set. From its beginnings two visions have always coexisted in ML: batch and online learning. The former assumes full access to all data samples in order to adjust the model whilst the latter overcomes this limiting assumption thus expanding the applicability of ML. In this chapter, we review the general framework and methods of online learning since its inception are reviewed and its applicability in current application areas is explored. Diego Peteiro-Barral University of A Coruña, Spain", "year": 2013, "referenceCount": 77, "citationCount": 47, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1398284551", "name": "O. Fontenla-Romero"}, {"authorId": "1401832226", "name": "Bertha Guijarro-Berdiñas"}, {"authorId": "1401832145", "name": "David Martínez-Rego"}, {"authorId": "1401832110", "name": "Beatriz Pérez-Sánchez"}, {"authorId": "1402266988", "name": "Diego Peteiro-Barral"}]}, {"paperId": "c8e469747bcf717633ba3758d82f5edf03f926e6", "url": "https://www.semanticscholar.org/paper/c8e469747bcf717633ba3758d82f5edf03f926e6", "title": "Machine learning and artificial intelligence research for patient benefit: 20 critical questions on transparency, replicability, ethics, and effectiveness", "abstract": "Machine learning, artificial intelligence, and other modern statistical methods are providing new opportunities to operationalise previously untapped and rapidly growing sources of data for patient benefit. Despite much promising research currently being undertaken, particularly in imaging, the literature as a whole lacks transparency, clear reporting to facilitate replicability, exploration for potential ethical concerns, and clear demonstrations of effectiveness. Among the many reasons why these problems exist, one of the most important (for which we provide a preliminary solution here) is the current lack of best practice guidance specific to machine learning and artificial intelligence. However, we believe that interdisciplinary groups pursuing research and impact projects involving machine learning and artificial intelligence for health would benefit from explicitly addressing a series of questions concerning transparency, reproducibility, ethics, and effectiveness (TREE). The 20 critical questions proposed here provide a framework for research groups to inform the design, conduct, and reporting; for editors and peer reviewers to evaluate contributions to the literature; and for patients, clinicians and policy makers to critically appraise where new findings may deliver patient benefit.", "year": 2020, "referenceCount": 87, "citationCount": 161, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "3070196", "name": "S. Vollmer"}, {"authorId": "3434370", "name": "B. Mateen"}, {"authorId": "2432459", "name": "G. Bohner"}, {"authorId": "2724295", "name": "F. Király"}, {"authorId": "1791498", "name": "R. Ghani"}, {"authorId": "1995651", "name": "P. Jónsson"}, {"authorId": "115432527", "name": "Sarah Cumbers"}, {"authorId": "1580632681", "name": "Adrian Jonas"}, {"authorId": "15922974", "name": "K. McAllister"}, {"authorId": "5992113", "name": "P. Myles"}, {"authorId": "1768785053", "name": "David Grainger"}, {"authorId": "52415567", "name": "M. Birse"}, {"authorId": "50457744", "name": "Richard Branson"}, {"authorId": "144498165", "name": "K. Moons"}, {"authorId": "2003566", "name": "G. Collins"}, {"authorId": "145441750", "name": "J. Ioannidis"}, {"authorId": "104604270", "name": "C. Holmes"}, {"authorId": "2797979", "name": "H. Hemingway"}]}, {"paperId": "0ab77b31909b18a3c12d4ae619c76740c9d34464", "url": "https://www.semanticscholar.org/paper/0ab77b31909b18a3c12d4ae619c76740c9d34464", "title": "Optimizing transition states via kernel-based machine learning.", "abstract": "We present a method for optimizing transition state theory dividing surfaces with support vector machines. The resulting dividing surfaces require no a priori information or intuition about reaction mechanisms. To generate optimal dividing surfaces, we apply a cycle of machine-learning and refinement of the surface by molecular dynamics sampling. We demonstrate that the machine-learned surfaces contain the relevant low-energy saddle points. The mechanisms of reactions may be extracted from the machine-learned surfaces in order to identify unexpected chemically relevant processes. Furthermore, we show that the machine-learned surfaces significantly increase the transmission coefficient for an adatom exchange involving many coupled degrees of freedom on a (100) surface when compared to a distance-based dividing surface.", "year": 2012, "referenceCount": 47, "citationCount": 83, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3583421", "name": "Zachary D. Pozun"}, {"authorId": "39960184", "name": "K. Hansen"}, {"authorId": "2204809", "name": "D. Sheppard"}, {"authorId": "48041657", "name": "M. Rupp"}, {"authorId": "145034054", "name": "K. Müller"}, {"authorId": "2368771", "name": "G. Henkelman"}]}, {"paperId": "6ab56b78c8789bcfbe8f64657d3abc946b190d9f", "url": "https://www.semanticscholar.org/paper/6ab56b78c8789bcfbe8f64657d3abc946b190d9f", "title": "Naïve Bayes for microRNA target predictions - machine learning for microRNA targets", "abstract": "MOTIVATION\nMost computational methodologies for miRNA:mRNA target gene prediction use the seed segment of the miRNA and require cross-species sequence conservation in this region of the mRNA target. Methods that do not rely on conservation generate numbers of predictions, which are too large to validate. We describe a target prediction method (NBmiRTar) that does not require sequence conservation, using instead, machine learning by a naïve Bayes classifier. It generates a model from sequence and miRNA:mRNA duplex information from validated targets and artificially generated negative examples. Both the 'seed' and 'out-seed' segments of the miRNA:mRNA duplex are used for target identification.\n\n\nRESULTS\nThe application of machine-learning techniques to the features we have used is a useful and general approach for microRNA target gene prediction. Our technique produces fewer false positive predictions and fewer target candidates to be tested. It exhibits higher sensitivity and specificity than algorithms that rely on conserved genomic regions to decrease false positive predictions.", "year": 2007, "referenceCount": 25, "citationCount": 168, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine", "Computer Science"], "authors": [{"authorId": "144993058", "name": "M. Yousef"}, {"authorId": "2103837", "name": "Segun Jung"}, {"authorId": "1967749", "name": "A. Kossenkov"}, {"authorId": "2326178", "name": "L. Showe"}, {"authorId": "2500725", "name": "M. Showe"}]}, {"paperId": "26b5bd14433970c8d7ff45d586aea19fc8d91c80", "url": "https://www.semanticscholar.org/paper/26b5bd14433970c8d7ff45d586aea19fc8d91c80", "title": "A Brief Introduction to Machine Learning for Engineers", "abstract": "This monograph aims at providing an introduction to key concepts, algorithms, and theoretical results in machine learning. The treatment concentrates on probabilistic models for supervised and unsupervised learning problems. It introduces fundamental concepts and algorithms by building on first principles, while also exposing the reader to more advanced topics with extensive pointers to the literature, within a unified notation and mathematical framework. The material is organized according to clearly defined categories, such as discriminative and generative models, frequentist and Bayesian approaches, exact and approximate inference, as well as directed and undirected models. This monograph is meant as an entry point for researchers with a background in probability and linear algebra.", "year": 2017, "referenceCount": 106, "citationCount": 118, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1705869", "name": "O. Simeone"}]}, {"paperId": "1d06cd33aa016fa3af012607b4a483c6aa8db51f", "url": "https://www.semanticscholar.org/paper/1d06cd33aa016fa3af012607b4a483c6aa8db51f", "title": "Chemical shifts in molecular solids by machine learning", "abstract": null, "year": 2018, "referenceCount": 95, "citationCount": 132, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science", "Medicine", "Physics"], "authors": [{"authorId": "46190944", "name": "Federico M. Paruzzo"}, {"authorId": "7650149", "name": "Albert Hofstetter"}, {"authorId": "34778608", "name": "F. Musil"}, {"authorId": "153048885", "name": "Sandip De"}, {"authorId": "1917770", "name": "M. Ceriotti"}, {"authorId": "4750978", "name": "L. Emsley"}]}, {"paperId": "867f8acd70889ac771e10718ea570cf894faa659", "url": "https://www.semanticscholar.org/paper/867f8acd70889ac771e10718ea570cf894faa659", "title": "The impact of using machine translation on EFL students’ writing", "abstract": "Abstract Although it remains controversial, machine translation (MT) has gained popularity both inside and outside of the classroom. Despite the growing number of students using MT, little is known about its use as a pedagogical tool in the EFL classroom. The present study investigated the role of MT as a CALL tool in EFL writing. Most studies on MT as a tool for L2 learning have focused on student postediting of the translation that MT provides; however, the present study employed a different design with students translating their L1 writing into L2 without the help of MT and then correcting their L2 writing using the MT translation for comparison. Text analysis of students’ writing outcomes revealed that MT helped to decrease lexico-grammatical errors and improve student revisions. Using MT for revisions also positively affected student writing strategies and helped them think of writing as a process. The interviews and reflection papers demonstrated that students viewed the use of MT during writing positively. This study found that MT can be a useful aid to language learning, but for it to benefit student learning, teachers must be aware of its limitations and provide adequate guidance to students.", "year": 2020, "referenceCount": 58, "citationCount": 74, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3428747", "name": "Sangmin-Michelle Lee"}]}, {"paperId": "c985afab132dae139ea7fe648bf4ef19b4026a1c", "url": "https://www.semanticscholar.org/paper/c985afab132dae139ea7fe648bf4ef19b4026a1c", "title": "A probabilistic active support vector learning algorithm", "abstract": "The paper describes a probabilistic active learning strategy for support vector machine (SVM) design in large data applications. The learning strategy is motivated by the statistical query model. While most existing methods of active SVM learning query for points based on their proximity to the current separating hyperplane, the proposed method queries for a set of points according to a distribution as determined by the current separating hyperplane and a newly defined concept of an adaptive confidence factor. This enables the algorithm to have more robust and efficient learning capabilities. The confidence factor is estimated from local information using the k nearest neighbor principle. The effectiveness of the method is demonstrated on real-life data sets both in terms of generalization performance, query complexity, and training time.", "year": 2004, "referenceCount": 22, "citationCount": 118, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144240262", "name": "Pabitra Mitra"}, {"authorId": "1700628", "name": "C. A. Murthy"}, {"authorId": "1736103", "name": "S. Pal"}]}, {"paperId": "e6f7833d77a0ec831288b0e8fb8f5cf68efca861", "url": "https://www.semanticscholar.org/paper/e6f7833d77a0ec831288b0e8fb8f5cf68efca861", "title": "Projected Newton-type methods in machine learning", "abstract": "We consider projected Newton-type methods for solving large-scale optimization problems arising in machine learning and related fields. We first introduce an algorithmic framework for projected Newton-type methods by reviewing a canonical projected (quasi-)Newton method. This method, while conceptually pleasing, has a high computation cost per iteration. Thus, we discuss two variants that are more scalable, namely, two-metric projection and inexact projection methods. Finally, we show how to apply the Newton-type framework to handle non-smooth objectives. Examples are provided throughout the chapter to illustrate machine learning applications of our framework.", "year": 2011, "referenceCount": 33, "citationCount": 78, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145610994", "name": "Mark W. Schmidt"}, {"authorId": "47181902", "name": "Dongjae Kim"}, {"authorId": "3072326", "name": "S. Sra"}]}, {"paperId": "39b41d216b9ecfaaf1b9477d3ff9886144f2c664", "url": "https://www.semanticscholar.org/paper/39b41d216b9ecfaaf1b9477d3ff9886144f2c664", "title": "MALT: distributed data-parallelism for existing ML applications", "abstract": "Machine learning methods, such as SVM and neural networks, often improve their accuracy by using models with more parameters trained on large numbers of examples. Building such models on a single machine is often impractical because of the large amount of computation required. We introduce MALT, a machine learning library that integrates with existing machine learning software and provides data parallel machine learning. MALT provides abstractions for fine-grained in-memory updates using one-sided RDMA, limiting data movement costs during incremental model updates. MALT allows machine learning developers to specify the dataflow and apply communication and representation optimizations. Through its general-purpose API, MALT can be used to provide data-parallelism to existing ML applications written in C++ and Lua and based on SVM, matrix factorization and neural networks. In our results, we show MALT provides fault tolerance, network efficiency and speedup to these applications.", "year": 2015, "referenceCount": 65, "citationCount": 64, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1706574", "name": "Hao Li"}, {"authorId": "2293919", "name": "Asim Kadav"}, {"authorId": "3225643", "name": "E. Kruus"}, {"authorId": "2014630", "name": "C. Ungureanu"}]}, {"paperId": "1f399026772d6823a85e3883970fdfcde075cadf", "url": "https://www.semanticscholar.org/paper/1f399026772d6823a85e3883970fdfcde075cadf", "title": "Machine Learning Glove Using Self‐Powered Conductive Superhydrophobic Triboelectric Textile for Gesture Recognition in VR/AR Applications", "abstract": "The rapid progress of Internet of things (IoT) technology raises an imperative demand on human machine interfaces (HMIs) which provide a critical linkage between human and machines. Using a glove as an intuitive and low‐cost HMI can expediently track the motions of human fingers, resulting in a straightforward communication media of human–machine interactions. When combining several triboelectric textile sensors and proper machine learning technique, it has great potential to realize complex gesture recognition with the minimalist‐designed glove for the comprehensive control in both real and virtual space. However, humidity or sweat may negatively affect the triboelectric output as well as the textile itself. Hence, in this work, a facile carbon nanotubes/thermoplastic elastomer (CNTs/TPE) coating approach is investigated in detail to achieve superhydrophobicity of the triboelectric textile for performance improvement. With great energy harvesting and human motion sensing capabilities, the glove using the superhydrophobic textile realizes a low‐cost and self‐powered interface for gesture recognition. By leveraging machine learning technology, various gesture recognition tasks are done in real time by using gestures to achieve highly accurate virtual reality/augmented reality (VR/AR) controls including gun shooting, baseball pitching, and flower arrangement, with minimized effect from sweat during operation.", "year": 2020, "referenceCount": 121, "citationCount": 147, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2052575409", "name": "Feng Wen"}, {"authorId": "2109819978", "name": "Zhongda Sun"}, {"authorId": "48748590", "name": "Tianyiyi He"}, {"authorId": "2403001", "name": "Qiongfeng Shi"}, {"authorId": "9570142", "name": "Minglu Zhu"}, {"authorId": "9338775", "name": "Zixuan Zhang"}, {"authorId": "1491164292", "name": "Lianhui Li"}, {"authorId": "2146319724", "name": "Ting Zhang"}, {"authorId": "2144827722", "name": "Chengkuo Lee"}]}, {"paperId": "36a30c0507c3b1b7944288589ee6e92f3851c16c", "url": "https://www.semanticscholar.org/paper/36a30c0507c3b1b7944288589ee6e92f3851c16c", "title": "Solving a Higgs optimization problem with quantum annealing for machine learning", "abstract": null, "year": 2017, "referenceCount": 28, "citationCount": 136, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Physics"], "authors": [{"authorId": "88980775", "name": "A. Mott"}, {"authorId": "32938353", "name": "J. Job"}, {"authorId": "52630992", "name": "J. Vlimant"}, {"authorId": "1887227", "name": "D. Lidar"}, {"authorId": "6115015", "name": "M. Spiropulu"}]}, {"paperId": "0a8ccbf9f337c08984a769b64a50b1984e13fbd6", "url": "https://www.semanticscholar.org/paper/0a8ccbf9f337c08984a769b64a50b1984e13fbd6", "title": "Toolkits and Libraries for Deep Learning", "abstract": null, "year": 2017, "referenceCount": 12, "citationCount": 111, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144917634", "name": "B. Erickson"}, {"authorId": "1986491", "name": "P. Korfiatis"}, {"authorId": "2015410", "name": "Z. Akkus"}, {"authorId": "4729578", "name": "T. Kline"}, {"authorId": "4655969", "name": "K. Philbrick"}]}, {"paperId": "57f6c958eeb94e96e8a8817671033e4c954e179f", "url": "https://www.semanticscholar.org/paper/57f6c958eeb94e96e8a8817671033e4c954e179f", "title": "Combining Machine Learning Systems and Multiple Docking Simulation Packages to Improve Docking Prediction Reliability for Network Pharmacology", "abstract": "Increased availability of bioinformatics resources is creating opportunities for the application of network pharmacology to predict drug effects and toxicity resulting from multi-target interactions. Here we present a high-precision computational prediction approach that combines two elaborately built machine learning systems and multiple molecular docking tools to assess binding potentials of a test compound against proteins involved in a complex molecular network. One of the two machine learning systems is a re-scoring function to evaluate binding modes generated by docking tools. The second is a binding mode selection function to identify the most predictive binding mode. Results from a series of benchmark validations and a case study show that this approach surpasses the prediction reliability of other techniques and that it also identifies either primary or off-targets of kinase inhibitors. Integrating this approach with molecular network maps makes it possible to address drug safety issues by comprehensively investigating network-dependent effects of a drug or drug candidate.", "year": 2013, "referenceCount": 50, "citationCount": 174, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "2042374", "name": "Kun-Yi Hsin"}, {"authorId": "34868112", "name": "Samik Ghosh"}, {"authorId": "1742807", "name": "H. Kitano"}]}, {"paperId": "62a90fbb0dc2f4c2cb777aa43dce2ae872fede2c", "url": "https://www.semanticscholar.org/paper/62a90fbb0dc2f4c2cb777aa43dce2ae872fede2c", "title": "Network Representation Learning: A Survey", "abstract": "With the widespread use of information technologies, information networks are becoming increasingly popular to capture complex relationships across various disciplines, such as social networks, citation networks, telecommunication networks, and biological networks. Analyzing these networks sheds light on different aspects of social life such as the structure of societies, information diffusion, and communication patterns. In reality, however, the large scale of information networks often makes network analytic tasks computationally expensive or intractable. Network representation learning has been recently proposed as a new learning paradigm to embed network vertices into a low-dimensional vector space, by preserving network topology structure, vertex content, and other side information. This facilitates the original network to be easily handled in the new vector space for further analysis. In this survey, we perform a comprehensive review of the current literature on network representation learning in the data mining and machine learning field. We propose new taxonomies to categorize and summarize the state-of-the-art network representation learning techniques according to the underlying learning mechanisms, the network information intended to preserve, as well as the algorithmic designs and methodologies. We summarize evaluation protocols used for validating network representation learning including published benchmark datasets, evaluation methods, and open source algorithms. We also perform empirical studies to compare the performance of representative algorithms on common datasets, and analyze their computational complexity. Finally, we suggest promising research directions to facilitate future study.", "year": 2017, "referenceCount": 131, "citationCount": 407, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2589584", "name": "Daokun Zhang"}, {"authorId": "2965064", "name": "Jie Yin"}, {"authorId": "1694121", "name": "Xingquan Zhu"}, {"authorId": "32076894", "name": "Chengqi Zhang"}]}, {"paperId": "5abb0aacf11480b702ffa727de46c134348b1390", "url": "https://www.semanticscholar.org/paper/5abb0aacf11480b702ffa727de46c134348b1390", "title": "Machine Learning Methods for Planning", "abstract": null, "year": 1994, "referenceCount": 0, "citationCount": 75, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145293454", "name": "Steven Minton"}]}, {"paperId": "93e583e5abdf699fdbd0bf26f645f883a9b64f07", "url": "https://www.semanticscholar.org/paper/93e583e5abdf699fdbd0bf26f645f883a9b64f07", "title": "ThunderSVM: A Fast SVM Library on GPUs and CPUs", "abstract": "Support Vector Machines (SVMs) are classic supervised learning models for classification, regression and distribution estimation. A survey conducted by Kaggle in 2017 shows that 26% of the data mining and machine learning practitioners are users of SVMs. However, SVM training and prediction are very expensive computationally for large and complex problems. This paper presents an efficient and open source SVM software toolkit called ThunderSVM which exploits the high-performance of Graphics Processing Units (GPUs) and multi-core CPUs. ThunderSVM supports all the functionalities—including classification (SVC), regression (SVR) and one-class SVMs—of LibSVM and uses identical command line options, such that existing LibSVM users can easily apply our toolkit. ThunderSVM can be used through multiple language interfaces including C/C++, Python, R and MATLAB. Our experimental results show that ThunderSVM is generally an order of magnitude faster than LibSVM while producing identical SVMs. In addition to the high efficiency, we design our convex optimization solver in a general way such that SVC, SVR, and one-class SVMs share the same solver for the ease of maintenance. Documentation, examples, and more about ThunderSVM are available at https://github.com/zeyiwen/thundersvm.", "year": 2018, "referenceCount": 43, "citationCount": 131, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "39003902", "name": "Zeyi Wen"}, {"authorId": "49887534", "name": "Jiashuai Shi"}, {"authorId": "92621060", "name": "Q. Li"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": null, "name": "Jian Chen"}]}, {"paperId": "aece25afa8896ed482cb3f33983d1884fb69b65b", "url": "https://www.semanticscholar.org/paper/aece25afa8896ed482cb3f33983d1884fb69b65b", "title": "Machine Learning in Energy Economics and Finance: A Review", "abstract": "Abstract Machine learning (ML) is generating new opportunities for innovative research in energy economics and finance. We critically review the burgeoning literature dedicated to Energy Economics/Finance applications of ML. Our review identifies applications in areas such as predicting energy prices (e.g. crude oil, natural gas, and power), demand forecasting, risk management, trading strategies, data processing, and analyzing macro/energy trends. We critically review the content (methods and findings) of more than 130 articles published between 2005 and 2018. Our analysis suggests that Support Vector Machine (SVM), Artificial Neural Network (ANN), and Genetic Algorithms (GAs) are among the most popular techniques used in energy economics papers. We discuss the achievements and limitations of existing literature. The survey concludes by identifying current gaps and offering some suggestions for future research.", "year": 2018, "referenceCount": 220, "citationCount": 141, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1831038", "name": "Hamed Ghoddusi"}, {"authorId": "41031754", "name": "Germán G. Creamer"}, {"authorId": "123279154", "name": "Nima Rafizadeh"}]}, {"paperId": "2f9700e197e5bdfd6fffa9dc1badd25f224739fe", "url": "https://www.semanticscholar.org/paper/2f9700e197e5bdfd6fffa9dc1badd25f224739fe", "title": "Exploiting Linguistic Resources for Neural Machine Translation Using Multi-task Learning", "abstract": "Linguistic resources such as part-of-speech (POS) tags have been extensively used in statistical machine translation (SMT) frameworks and have yielded better performances. However, usage of such linguistic annotations in neural machine translation (NMT) systems has been left under-explored. \nIn this work, we show that multi-task learning is a successful and a easy approach to introduce an additional knowledge into an end-to-end neural attentional model. By jointly training several natural language processing (NLP) tasks in one system, we are able to leverage common information and improve the performance of the individual task. \nWe analyze the impact of three design decisions in multi-task learning: the tasks used in training, the training schedule, and the degree of parameter sharing across the tasks, which is defined by the network architecture. The experiments are conducted for an German to English translation task. As additional linguistic resources, we exploit POS information and named-entities (NE). Experiments show that the translation quality can be improved by up to 1.5 BLEU points under the low-resource condition. The performance of the POS tagger is also improved using the multi-task learning scheme.", "year": 2017, "referenceCount": 27, "citationCount": 102, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2920247", "name": "J. Niehues"}, {"authorId": "4006425", "name": "Eunah Cho"}]}, {"paperId": "a662d1666ea9f4ec7d375baeedf4f364e698986c", "url": "https://www.semanticscholar.org/paper/a662d1666ea9f4ec7d375baeedf4f364e698986c", "title": "ROC analysis for predictions made by probabilistic classifiers", "abstract": "Receiver operating characteristics (ROC) analysis was originated from signal detection theory and has been introduced to machine learning community in recent years to evaluate the algorithm performance under imprecise environment. ROC graphs have become increasingly popular in machine learning, because they offer a more robust framework for evaluating classifier performance than the traditional accuracy measure. In this paper, we investigate the relation between a probabilistic classifier and its corresponding predictor in a view of ROC analysis. A method of generating ROC curves for prediction (or regression) problems is proposed and some properties of ROC curves for prediction are discussed with examples.", "year": 2005, "referenceCount": 9, "citationCount": 51, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31055300", "name": "Zengchang Qin"}]}, {"paperId": "654a162b55f0e78c595e1d9f9591bc6901b94797", "url": "https://www.semanticscholar.org/paper/654a162b55f0e78c595e1d9f9591bc6901b94797", "title": "A Comparison of Machine Learning Methods for the Diagnosis of Pigmented Skin Lesions", "abstract": "We analyze the discriminatory power of k-nearest neighbors, logistic regression, artificial neural networks (ANNs), decision tress, and support vector machines (SVMs) on the task of classifying pigmented skin lesions as common nevi, dysplastic nevi, or melanoma. Three different classification tasks were used as benchmarks: the dichotomous problem of distinguishing common nevi from dysplastic nevi and melanoma, the dichotomous problem of distinguishing melanoma from common and dysplastic nevi, and the trichotomous problem of correctly distinguishing all three classes. Using ROC analysis to measure the discriminatory power of the methods shows that excellent results for specific classification problems in the domain of pigmented skin lesions can be achieved with machine-learning methods. On both dichotomous and trichotomous tasks, logistic regression, ANNs, and SVMs performed on about the same level, with k-nearest neighbors and decision trees performing worse.", "year": 2001, "referenceCount": 28, "citationCount": 249, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1886460", "name": "S. Dreiseitl"}, {"authorId": "1397958221", "name": "L. Ohno-Machado"}, {"authorId": "2236754", "name": "H. Kittler"}, {"authorId": "2711007", "name": "S. Vinterbo"}, {"authorId": "1725454", "name": "H. Billhardt"}, {"authorId": "143780950", "name": "M. Binder"}]}, {"paperId": "f830f53a30081ccd4e1f80983651afedd6e8459e", "url": "https://www.semanticscholar.org/paper/f830f53a30081ccd4e1f80983651afedd6e8459e", "title": "Multi-class Support Vector Machine (SVM) Classifiers -- An Application in Hypothyroid Detection and Classification", "abstract": "The paper presents a Multi-class Support Vector Machine classifier and its application to hypothyroid detection and classification. Support Vector Machines (SVM) have been well known method in the machine learning community for binary classification problems. Multi-class SVMs (MCSVM) are usually implemented by combining several binary SVMs. The objective of this work is to show: first, robustness of various kind of kernels for Multi-class SVM classifier, second, a comparison of different constructing methods for Multi-class SVM, such as One-Against-One and One-Against-All, and finally comparing the classifiers' accuracy of Multi-class SVM classifier to AdaBoost and Decision Tree. The simulation results show that One-Against-All Support Vector Machines (OAASVM) are superior to One-Against-One Support Vector Machines (OAOSVM) with polynomial kernels. The accuracy of OAASVM is also higher than AdaBoost and Decision Tree classifier on hypothyroid disease datasets from UCI machine learning dataset.", "year": 2011, "referenceCount": 20, "citationCount": 95, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2417228", "name": "F. F. Chamasemani"}, {"authorId": "32530121", "name": "Y. P. Singh"}]}, {"paperId": "fcb2480ee2fe28ca697afdd192bf3ad7de05b442", "url": "https://www.semanticscholar.org/paper/fcb2480ee2fe28ca697afdd192bf3ad7de05b442", "title": "Interacting meaningfully with machine learning systems: Three experiments", "abstract": null, "year": 2009, "referenceCount": 88, "citationCount": 190, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2121662", "name": "S. Stumpf"}, {"authorId": "40051508", "name": "Vidya Rajaram"}, {"authorId": "2107914294", "name": "Lida Li"}, {"authorId": "37535697", "name": "Weng-Keen Wong"}, {"authorId": "1737204", "name": "M. Burnett"}, {"authorId": "144299726", "name": "Thomas G. Dietterich"}, {"authorId": "2054441880", "name": "Erin Sullivan"}, {"authorId": "2658798", "name": "Jonathan L. Herlocker"}]}, {"paperId": "1603f64116c544c97e16b29c3ff7fd06f25b4ae6", "url": "https://www.semanticscholar.org/paper/1603f64116c544c97e16b29c3ff7fd06f25b4ae6", "title": "Spectral–spatial multi-feature-based deep learning for hyperspectral remote sensing image classification", "abstract": null, "year": 2017, "referenceCount": 31, "citationCount": 128, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2108594617", "name": "Lizhe Wang"}, {"authorId": "2108234629", "name": "Jiabin Zhang"}, {"authorId": "145779141", "name": "P. Liu"}, {"authorId": "2840539", "name": "Kim-Kwang Raymond Choo"}, {"authorId": "152159019", "name": "F. Huang"}]}, {"paperId": "2a8193af464d6bf2599b6ceb9c8260e71fbd7797", "url": "https://www.semanticscholar.org/paper/2a8193af464d6bf2599b6ceb9c8260e71fbd7797", "title": "MACHINE LEARNING FOR DATA STREAMS", "abstract": null, "year": 2018, "referenceCount": 1, "citationCount": 75, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1762931", "name": "A. Bifet"}, {"authorId": "1745702", "name": "Ricard Gavaldà"}, {"authorId": "144282963", "name": "G. Holmes"}, {"authorId": "1737420", "name": "B. Pfahringer"}, {"authorId": "2059992293", "name": "Francis R. Bach"}]}, {"paperId": "683c1a68da7222e4aa9558084c8b4418d2c14339", "url": "https://www.semanticscholar.org/paper/683c1a68da7222e4aa9558084c8b4418d2c14339", "title": "Deep learning methods in transportation domain: a review", "abstract": "Recent years have seen a significant amount of transportation data collected from multiple sources including road sensors, probe, GPS, CCTV and incident reports. Similar to many other industries, transportation has entered the generation of big data. With a rich volume of traffic data, it is challenging to build reliable prediction models based on traditional shallow machine learning methods. Deep learning is a new state-of-the-art machine learning approach which has been of great interest in both academic research and industrial applications. This study reviews recent studies of deep learning for popular topics in processing traffic data including transportation network representation, traffic flow forecasting, traffic signal control, automatic vehicle detection, traffic incident processing, travel demand prediction, autonomous driving and driver behaviours. In general, the use of deep learning systems in transportation is still limited and there are potential limitations for utilising this advanced approach to improve prediction models.", "year": 2018, "referenceCount": 74, "citationCount": 122, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2110609816", "name": "Hoang Nguyen"}, {"authorId": "1968493", "name": "L. Kieu"}, {"authorId": "2055590073", "name": "Tao Wen"}, {"authorId": "145086896", "name": "C. Cai"}]}, {"paperId": "644f6160964feec43e86393376c42cffeca9c6ef", "url": "https://www.semanticscholar.org/paper/644f6160964feec43e86393376c42cffeca9c6ef", "title": "Short-term Mortality Prediction for Elderly Patients Using Medicare Claims Data", "abstract": "Risk prediction is central to both clinical medicine and public health. While many machine learning models have been developed to predict mortality, they are rarely applied in the clinical literature, where classification tasks typically rely on logistic regression. One reason for this is that existing machine learning models often seek to optimize predictions by incorporating features that are not present in the databases readily available to providers and policy makers, limiting generalizability and implementation. Here we tested a number of machine learning classifiers for prediction of six-month mortality in a population of elderly Medicare beneficiaries, using an administrative claims database of the kind available to the majority of health care payers and providers. We show that machine learning classifiers substantially outperform current widely-used methods of risk prediction-but only when used with an improved feature set incorporating insights from clinical medicine, developed for this study. Our work has applications to supporting patient and provider decision making at the end of life, as well as population health-oriented efforts to identify patients at high risk of poor outcomes.", "year": 2015, "referenceCount": 21, "citationCount": 46, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Mathematics", "Computer Science"], "authors": [{"authorId": "48721098", "name": "Maggie Makar"}, {"authorId": "2804918", "name": "M. Ghassemi"}, {"authorId": "2054285704", "name": "D. Cutler"}, {"authorId": "3797258", "name": "Z. Obermeyer"}]}, {"paperId": "d8fb8169517d54c9718b511649fb63d0cd97c0a2", "url": "https://www.semanticscholar.org/paper/d8fb8169517d54c9718b511649fb63d0cd97c0a2", "title": "Radiomics and Machine Learning for Radiotherapy in Head and Neck Cancers", "abstract": "Introduction: An increasing number of parameters can be considered when making decisions in oncology. Tumor characteristics can also be extracted from imaging through the use of radiomics and add to this wealth of clinical data. Machine learning can encompass these parameters and thus enhance clinical decision as well as radiotherapy workflow. Methods: We performed a description of machine learning applications at each step of treatment by radiotherapy in head and neck cancers. We then performed a systematic review on radiomics and machine learning outcome prediction models in head and neck cancers. Results: Machine Learning has several promising applications in treatment planning with automatic organ at risk delineation improvements and adaptative radiotherapy workflow automation. It may also provide new approaches for Normal Tissue Complication Probability models. Radiomics may provide additional data on tumors for improved machine learning powered predictive models, not only on survival, but also on risk of distant metastasis, in field recurrence, HPV status and extra nodal spread. However, most studies provide preliminary data requiring further validation. Conclusion: Promising perspectives arise from machine learning applications and radiomics based models, yet further data are necessary for their implementation in daily care.", "year": 2019, "referenceCount": 110, "citationCount": 64, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2072710446", "name": "P. Giraud"}, {"authorId": "48789408", "name": "P. Giraud"}, {"authorId": "13026370", "name": "A. Gasnier"}, {"authorId": "1620157413", "name": "R. El Ayachy"}, {"authorId": "2069824673", "name": "S. Kreps"}, {"authorId": "145707565", "name": "J. Foy"}, {"authorId": "1392269125", "name": "C. Durdux"}, {"authorId": "144777291", "name": "F. Huguet"}, {"authorId": "6313909", "name": "A. Burgun"}, {"authorId": "4345751", "name": "J. Bibault"}]}, {"paperId": "62f5bf45b2e702775fa2a36de45a7522bb9ff23f", "url": "https://www.semanticscholar.org/paper/62f5bf45b2e702775fa2a36de45a7522bb9ff23f", "title": "CBSA: content-based soft annotation for multimodal image retrieval using Bayes point machines", "abstract": "We propose a content-based soft annotation (CBSA) procedure for providing images with semantical labels. The annotation procedure starts with labeling a small set of training images, each with one single semantical label (e.g., forest, animal, or sky). An ensemble of binary classifiers is then trained for predicting label membership for images. The trained ensemble is applied to each individual image to give the image multiple soft labels, and each label is associated with a label membership factor. To select a base binary-classifier for CBSA, we experiment with two learning methods, support vector machines (SVMs) and Bayes point machines (BPMs), and compare their class-prediction accuracy. Our empirical study on a 116-category 25K-image set shows that the BPM-based ensemble provides better annotation quality than the SVM-based ensemble for supporting multimodal image retrievals.", "year": 2003, "referenceCount": 57, "citationCount": 503, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "33794424", "name": "E. Chang"}, {"authorId": "40603954", "name": "Kingshy Goh"}, {"authorId": "2314761", "name": "Gerard Sychay"}, {"authorId": "145394457", "name": "Gang Wu"}]}, {"paperId": "1eb75533f7795e0bcb597e293e1d08b24f1084b8", "url": "https://www.semanticscholar.org/paper/1eb75533f7795e0bcb597e293e1d08b24f1084b8", "title": "Distributions of angles in random packing on spheres", "abstract": "This paper studies the asymptotic behaviors of the pairwise angles among n randomly and uniformly distributed unit vectors in [Formula: see text] as the number of points n → ∞, while the dimension p is either fixed or growing with n. For both settings, we derive the limiting empirical distribution of the random angles and the limiting distributions of the extreme angles. The results reveal interesting differences in the two settings and provide a precise characterization of the folklore that \"all high-dimensional random vectors are almost always nearly orthogonal to each other\". Applications to statistics and machine learning and connections with some open problems in physics and mathematics are also discussed.", "year": 2013, "referenceCount": 41, "citationCount": 147, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Medicine", "Computer Science"], "authors": [{"authorId": "123970122", "name": "T. Cai"}, {"authorId": "144958605", "name": "Jianqing Fan"}, {"authorId": "24442924", "name": "Tiefeng Jiang"}]}, {"paperId": "dc62320d22a861d1d2e0eff7b150b06afc98e1f6", "url": "https://www.semanticscholar.org/paper/dc62320d22a861d1d2e0eff7b150b06afc98e1f6", "title": "Learning and Generalization: With Applications to Neural Networks", "abstract": "How does a machine learn a new concept on the basis of examples? This second edition takes account of important new developments in the field. It also deals extensively with the theory of learning control systems, now comparably mature to learning of neural networks.", "year": 2002, "referenceCount": 0, "citationCount": 180, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145271313", "name": "M. Vidyasagar"}]}, {"paperId": "d4200ce8f26606b5f20511c879d3ff4d21709b6c", "url": "https://www.semanticscholar.org/paper/d4200ce8f26606b5f20511c879d3ff4d21709b6c", "title": "A review of machine learning for the optimization of production processes", "abstract": null, "year": 2019, "referenceCount": 128, "citationCount": 97, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "150978254", "name": "D. Weichert"}, {"authorId": "94564331", "name": "Patrick Link"}, {"authorId": "2020810780", "name": "Anke Stoll"}, {"authorId": "1804144", "name": "S. Rüping"}, {"authorId": "2295665", "name": "S. Ihlenfeldt"}, {"authorId": "145057418", "name": "S. Wrobel"}]}, {"paperId": "12c7c05e9286178d93b3bb7995ba9bf38e189a67", "url": "https://www.semanticscholar.org/paper/12c7c05e9286178d93b3bb7995ba9bf38e189a67", "title": "Heart disease prediction using machine learning algorithms", "abstract": "According to recent survey by WHO (World health organization) 17.9 million people die each year because of heart related diseases and it is increasing rapidly. With the increasing population and disease, it is become a challenge to diagnosing disease and providing the appropriate treatment at the right time. But there is a light of hope that recent advances in technology have accelerated the public health sector by developing advanced functional biomedical solutions. This paper aims at analyzing the various data mining techniques namely Naive Bayes, Random Forest Classification, Decision tree and Support Vector Machine by using a qualified dataset for Heart disease prediction which is consist of various attributes like gender, age, chest pain type, blood pressure, blood sugar etc. The research includes finding the correlations between the various attributes of the dataset by utilizing the standard data mining techniques and hence using the attributes suitably to predict the chances of a heart disease. These machine learning techniques take less time for the prediction of the disease with more accuracy which will reduce the dispose of valuable lives all over the world.", "year": 2019, "referenceCount": 14, "citationCount": 85, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2157752694", "name": "M. Ali"}, {"authorId": "151487460", "name": "Md. Iftiyar Khan"}, {"authorId": "2113544519", "name": "M. A. Imran"}, {"authorId": "151431829", "name": "Musnath Siddiki"}]}, {"paperId": "544e86212be7138b17ca00262973b9e9582b4b31", "url": "https://www.semanticscholar.org/paper/544e86212be7138b17ca00262973b9e9582b4b31", "title": "Nonlinear difference-differential equations in prediction and learning theory.", "abstract": "1. Introduction.-This note introduces some nonlinear difference-differential equations which can be interpreted as a learning theory or, alternatively, as a prediction theory whose goal is to discuss the prediction of individual events, in a fixed order, and at prescribed times. The theory provides a mathematical description of the following kind of experiment. An experimenter g, confronted by a machine MlZ, presents M with a list of \"letters\" or \"events\" to be learned. Suppose, for example, that g wishes to teach 9Mt the list of letters AB, or to predict the event B, given the event A. g does this by presenting A and then B to M several times. To find out if SE has learned the list as a result of these list presentations, the letter A alone is then presented to M. If M responds with the letter B, and M does this whenever A alone is said, then we have good evidence that MR has indeed learned the list AB. Thus M learns to predict the event B whenever the event A occurs as a result of repeated presentations of the list AB. We will introduce some mathematical machines that learn lists in the above manner. These machines have some properties that have a familiar intuitive interpretation. For example, in our simplest machine, it is possible to make rigorous the heuristic statements that (1) \"practice makes perfect,\" (2) an isolated system suffers no memory loss, (3) an isolated system remembers without practicing overtly, (4) the memory of an isolated system sometimes spontaneously improves without practice, (5) all errors can be corrected, although the rate of correction is sometimes diminished by response interference due to prior learning, (6) increasing the number of response alternatives sometimes diminishes the learning rate, and so on. All of the machines we will introduce possess the same dynamical laws. Nonetheless , the exact manner in which a given machine learns and remembers depends crucially on the particular way in which the components of the machine are interconnected ; i.e., on its \"geometry.\" For example, properties (2) and (3) above do not hold in all the machines we shall describe. In this note, we will sketch some results for our simplest machine. These results, along with results for more complicated machines, are described in greater detail in another place.' 2. The Nonlinear Systems.-Each of our machines M is described in terms of a", "year": 1967, "referenceCount": 4, "citationCount": 115, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Medicine"], "authors": [{"authorId": "1682174", "name": "S. Grossberg"}]}, {"paperId": "d8df8e2c10fce631173aae694f017dd136226284", "url": "https://www.semanticscholar.org/paper/d8df8e2c10fce631173aae694f017dd136226284", "title": "Phase recovery and holographic image reconstruction using deep learning in neural networks", "abstract": null, "year": 2017, "referenceCount": 68, "citationCount": 565, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Physics"], "authors": [{"authorId": "48156295", "name": "Y. Rivenson"}, {"authorId": "2844656", "name": "Yibo Zhang"}, {"authorId": "15962378", "name": "H. Gunaydin"}, {"authorId": "2064884092", "name": "Da Teng"}, {"authorId": "2660014", "name": "A. Ozcan"}]}, {"paperId": "d944a911552edfc71fed7400d7179fac05b3f3ed", "url": "https://www.semanticscholar.org/paper/d944a911552edfc71fed7400d7179fac05b3f3ed", "title": "An Optical Communication's Perspective on Machine Learning and Its Applications", "abstract": "Machine learning (ML) has disrupted a wide range of science and engineering disciplines in recent years. ML applications in optical communications and networking are also gaining more attention, particularly in the areas of nonlinear transmission systems, optical performance monitoring, and cross-layer network optimizations for software-defined networks. However, the extent to which ML techniques can benefit optical communications and networking is not clear and this is partly due to an insufficient understanding of the nature of ML concepts. This paper aims to describe the mathematical foundations of basic ML techniques from communication theory and signal processing perspectives, which in turn will shed light on the types of problems in optical communications and networking that naturally warrant ML use. This will be followed by an overview of ongoing ML research in optical communications and networking with a focus on physical layer issues.", "year": 2019, "referenceCount": 79, "citationCount": 148, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35065845", "name": "F. Khan"}, {"authorId": "50378181", "name": "Qirui Fan"}, {"authorId": "150952716", "name": "Chao Lu"}, {"authorId": "7701297", "name": "A. Lau"}]}, {"paperId": "f98e7998dcde836087d3477713cb18e8e881bef7", "url": "https://www.semanticscholar.org/paper/f98e7998dcde836087d3477713cb18e8e881bef7", "title": "Machine Learning Aided Static Malware Analysis: A Survey and Tutorial", "abstract": null, "year": 2018, "referenceCount": 81, "citationCount": 74, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2724426", "name": "Andrii Shalaginov"}, {"authorId": "51134092", "name": "S. Banin"}, {"authorId": "2011284", "name": "A. Dehghantanha"}, {"authorId": "1681427", "name": "K. Franke"}]}, {"paperId": "2e8d3c3eaf763246578b67e521f6df3d26b291ca", "url": "https://www.semanticscholar.org/paper/2e8d3c3eaf763246578b67e521f6df3d26b291ca", "title": "Applications of Artificial Intelligence and Machine learning in smart cities", "abstract": null, "year": 2020, "referenceCount": 128, "citationCount": 194, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3104323", "name": "Zaib Ullah"}, {"authorId": "1410064789", "name": "Fadi Al-turjman"}, {"authorId": "2860068", "name": "L. Mostarda"}, {"authorId": "47165323", "name": "R. Gagliardi"}]}, {"paperId": "08463339ca5e29cb4049da570518271ca375500e", "url": "https://www.semanticscholar.org/paper/08463339ca5e29cb4049da570518271ca375500e", "title": "Multimodal Learning Analytics and Education Data Mining: Using computational technologies to measure complex learning tasks", "abstract": "New high-frequency multimodal data collection technologies and machine learning analysis techniques could offer new insights into learning, especially when students have the opportunity to generate unique, personalized artifacts, such as computer programs, robots, and solutions engineering challenges. To date most of the work on learning analytics and educational data mining has been focused on online courses and cognitive tutors, both of which provide a high degree of structure to the tasks, and are restricted to interactions that occur in front of a computer screen. In this paper, we argue that multimodal learning analytics can offer new insights into students’ learning trajectories in more complex and open-ended learning environments. We present several examples of this work and its educational application.", "year": 2016, "referenceCount": 67, "citationCount": 220, "influentialCitationCount": 17, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3181883", "name": "Paulo Blikstein"}, {"authorId": "145862204", "name": "M. Worsley"}]}, {"paperId": "62ad80eb69a687a58abd88f500ef83d7a9ec1224", "url": "https://www.semanticscholar.org/paper/62ad80eb69a687a58abd88f500ef83d7a9ec1224", "title": "The need to approximate the use-case in clinical machine learning", "abstract": "Abstract The availability of smartphone and wearable sensor technology is leading to a rapid accumulation of human subject data, and machine learning is emerging as a technique to map those data into clinical predictions. As machine learning algorithms are increasingly used to support clinical decision making, it is vital to reliably quantify their prediction accuracy. Cross-validation (CV) is the standard approach where the accuracy of such algorithms is evaluated on part of the data the algorithm has not seen during training. However, for this procedure to be meaningful, the relationship between the training and the validation set should mimic the relationship between the training set and the dataset expected for the clinical use. Here we compared two popular CV methods: record-wise and subject-wise. While the subject-wise method mirrors the clinically relevant use-case scenario of diagnosis in newly recruited subjects, the record-wise strategy has no such interpretation. Using both a publicly available dataset and a simulation, we found that record-wise CV often massively overestimates the prediction accuracy of the algorithms. We also conducted a systematic review of the relevant literature, and found that this overly optimistic method was used by almost half of the retrieved studies that used accelerometers, wearable sensors, or smartphones to predict clinical outcomes. As we move towards an era of machine learning-based diagnosis and treatment, using proper methods to evaluate their accuracy is crucial, as inaccurate results can mislead both clinicians and data scientists.", "year": 2017, "referenceCount": 41, "citationCount": 145, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3059087", "name": "Sohrab Saeb"}, {"authorId": "3146304", "name": "L. Lonini"}, {"authorId": "2226306", "name": "A. Jayaraman"}, {"authorId": "50228835", "name": "D. Mohr"}, {"authorId": "3282030", "name": "Konrad Paul Kording"}]}, {"paperId": "1d7689c8b8f7ae3a4f14cab71e4626fe3aeefa08", "url": "https://www.semanticscholar.org/paper/1d7689c8b8f7ae3a4f14cab71e4626fe3aeefa08", "title": "Convergence of Laplacian Eigenmaps", "abstract": "Geometrically based methods for various tasks of machine learning have attracted considerable attention over the last few years. In this paper we show convergence of eigenvectors of the point cloud Laplacian to the eigenfunctions of the Laplace-Beltrami operator on the underlying manifold, thus establishing the first convergence results for a spectral dimensionality reduction algorithm in the manifold setting.", "year": 2006, "referenceCount": 41, "citationCount": 273, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145520115", "name": "Mikhail Belkin"}, {"authorId": "1770745", "name": "P. Niyogi"}]}, {"paperId": "458465a9f273e524116e0c0e6278f9e1292c2e65", "url": "https://www.semanticscholar.org/paper/458465a9f273e524116e0c0e6278f9e1292c2e65", "title": "Real-time transient stability assessment model using extreme learning machine", "abstract": "In recent years, computational intelligence and machine learning techniques have gained popularity to facilitate very fast dynamic security assessment for earlier detection of the risk of blackouts. However, many of the current state-of-the-art models usually suffer from excessive training time and complex parameters tuning problems, leading to inefficiency for real-time implementation and on-line model updating. In this study, a new transient stability assessment model using the increasingly prevalent extreme learning machine theory is developed. It has significantly improved the learning speed and can enable effective on-line updating. The proposed model is examined on the New England 39-bus test system, and compared with some state-of-the-art methods in terms of computation time and prediction accuracy. The simulation results show that the proposed model possesses significant superior computation speed and competitively high accuracy.", "year": 2011, "referenceCount": 16, "citationCount": 124, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "2118040272", "name": "Yan Xu"}, {"authorId": "144402926", "name": "Z. Dong"}, {"authorId": "145734483", "name": "K. Meng"}, {"authorId": "49775519", "name": "Rui Zhang"}, {"authorId": "144568755", "name": "K. Wong"}]}, {"paperId": "11294160e46f7dc4ec5195c8a1a323a05acc510b", "url": "https://www.semanticscholar.org/paper/11294160e46f7dc4ec5195c8a1a323a05acc510b", "title": "Comparing Prediction Performance for Crash Injury Severity Among Various Machine Learning and Statistical Methods", "abstract": "Crash injury severity prediction is a promising research target in traffic safety. Traditionally, various statistical methods were used for modeling crash injury severities. In recent years, machine learning-based methods are becoming popular due to their good predictive performance. However, the machine learning-based models are usually criticized as they perform like a black-box. In this paper, we aim at comparing the predictive performance, including prediction accuracy and estimation of variable importance, among various machine learning and statistical methods with distinct modeling logic for crash severity analysis. The crash severity, road geometry, and traffic flow data were collected at freeway diverge areas in Florida. We estimated two most commonly used statistical methods which were ordered probit (OP) model and multinomial logit model, and four popular machine learning methods, including K-Nearest Neighbor, Decision Tree, Random Forest (RF), and Support Vector Machine. The correct prediction rate for each crash severity level and the overall correct prediction rate were calculated. The results showed that the machine learning methods had higher predicting accuracy than the statistical methods, though they suffered from over-fitting issue. The RF method had the best prediction in overall and severe crashes while OP was the weakest one. We compared variable importance on crash severity via perturbation-based sensitivity analyses. The results showed that the inferences of variable importance from different methods were not always consistent and should be paid careful attention.", "year": 2018, "referenceCount": 51, "citationCount": 68, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2151811241", "name": "Jian Zhang"}, {"authorId": "2109752718", "name": "Zhibin Li"}, {"authorId": "30665376", "name": "Ziyuan Pu"}, {"authorId": "71868821", "name": "Chengcheng Xu"}]}, {"paperId": "0d86fbca1fbdb7c8e5a10c2d2c5a0ff3e07eea15", "url": "https://www.semanticscholar.org/paper/0d86fbca1fbdb7c8e5a10c2d2c5a0ff3e07eea15", "title": "A Kernel Statistical Test of Independence", "abstract": "Although kernel measures of independence have been widely applied in machine learning (notably in kernel ICA), there is as yet no method to determine whether they have detected statistically significant dependence. We provide a novel test of the independence hypothesis for one particular kernel independence measure, the Hilbert-Schmidt independence criterion (HSIC). The resulting test costs O(m2), where m is the sample size. We demonstrate that this test outperforms established contingency table and functional correlation-based tests, and that this advantage is greater for multivariate data. Finally, we show the HSIC test also applies to text (and to structured data more generally), for which no other independence test presently exists.", "year": 2007, "referenceCount": 24, "citationCount": 662, "influentialCitationCount": 113, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1708497", "name": "A. Gretton"}, {"authorId": "1693668", "name": "K. Fukumizu"}, {"authorId": "37077406", "name": "C. Teo"}, {"authorId": "2143476916", "name": "Le Song"}, {"authorId": "1707625", "name": "B. Schölkopf"}, {"authorId": "46234526", "name": "Alex Smola"}]}, {"paperId": "79ac1ac6fcbb0e75e67eecefdfa2978fc4dd09f9", "url": "https://www.semanticscholar.org/paper/79ac1ac6fcbb0e75e67eecefdfa2978fc4dd09f9", "title": "'First Aid for You': getting to know your learning style using machine learning", "abstract": "Research on learning has shown that students learn differently and that they prefer to use different type of resources. Adaptive educational systems can support different learning characteristics by building a model of the student's learning behaviour and subsequently adapting the learning environment to match different needs. However major challenges exist, as it is not clear how a student model of learning style can be accurately built. One solution may be in the use of machine learning techniques. This paper presents 'First Aid For You', a novel adaptive educational system that dynamically determines learning style using machine learning techniques. The paper describes how it uses the Feider & Solomon Index of Learning Style to design an environment for different learning styles. It also describes how, as the student interacts with the learning environment, it uses the Naive Bayes algorithm to predict the student's preferred learning style and adaptively customize the learning environment.", "year": 2005, "referenceCount": 11, "citationCount": 34, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145240878", "name": "Declan Kelly"}, {"authorId": "1704775", "name": "B. Tangney"}]}, {"paperId": "b891a88f130f2fe174272c60189ebc34e6e9ea77", "url": "https://www.semanticscholar.org/paper/b891a88f130f2fe174272c60189ebc34e6e9ea77", "title": "Prediction Errors of Molecular Machine Learning Models Lower than Hybrid DFT Error.", "abstract": "We investigate the impact of choosing regressors and molecular representations for the construction of fast machine learning (ML) models of 13 electronic ground-state properties of organic molecules. The performance of each regressor/representation/property combination is assessed using learning curves which report out-of-sample errors as a function of training set size with up to ∼118k distinct molecules. Molecular structures and properties at the hybrid density functional theory (DFT) level of theory come from the QM9 database [ Ramakrishnan et al. Sci. Data 2014 , 1 , 140022 ] and include enthalpies and free energies of atomization, HOMO/LUMO energies and gap, dipole moment, polarizability, zero point vibrational energy, heat capacity, and the highest fundamental vibrational frequency. Various molecular representations have been studied (Coulomb matrix, bag of bonds, BAML and ECFP4, molecular graphs (MG)), as well as newly developed distribution based variants including histograms of distances (HD), angles (HDA/MARAD), and dihedrals (HDAD). Regressors include linear models (Bayesian ridge regression (BR) and linear regression with elastic net regularization (EN)), random forest (RF), kernel ridge regression (KRR), and two types of neural networks, graph convolutions (GC) and gated graph networks (GG). Out-of sample errors are strongly dependent on the choice of representation and regressor and molecular property. Electronic properties are typically best accounted for by MG and GC, while energetic properties are better described by HDAD and KRR. The specific combinations with the lowest out-of-sample errors in the ∼118k training set size limit are (free) energies and enthalpies of atomization (HDAD/KRR), HOMO/LUMO eigenvalue and gap (MG/GC), dipole moment (MG/GC), static polarizability (MG/GG), zero point vibrational energy (HDAD/KRR), heat capacity at room temperature (HDAD/KRR), and highest fundamental vibrational frequency (BAML/RF). We present numerical evidence that ML model predictions deviate from DFT (B3LYP) less than DFT (B3LYP) deviates from experiment for all properties. Furthermore, out-of-sample prediction errors with respect to hybrid DFT reference are on par with, or close to, chemical accuracy. The results suggest that ML models could be more accurate than hybrid DFT if explicitly electron correlated quantum (or experimental) data were available.", "year": 2017, "referenceCount": 70, "citationCount": 409, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Chemistry"], "authors": [{"authorId": "145483118", "name": "Felix A Faber"}, {"authorId": "50467552", "name": "Luke Hutchison"}, {"authorId": "46799859", "name": "B. Huang"}, {"authorId": "2058362", "name": "J. Gilmer"}, {"authorId": "2601641", "name": "S. Schoenholz"}, {"authorId": "35188630", "name": "George E. Dahl"}, {"authorId": "1689108", "name": "Oriol Vinyals"}, {"authorId": "3157072", "name": "S. Kearnes"}, {"authorId": "119508204", "name": "Patrick F. Riley"}, {"authorId": "7847508", "name": "O. A. von Lilienfeld"}]}, {"paperId": "7633c95812dea716917e8b23b84df18e7b03614e", "url": "https://www.semanticscholar.org/paper/7633c95812dea716917e8b23b84df18e7b03614e", "title": "On-line Random Forests", "abstract": "Random Forests (RFs) are frequently used in many computer vision and machine learning applications. Their popularity is mainly driven by their high computational efficiency during both training and evaluation while achieving state-of-the-art results. However, in most applications RFs are used off-line. This limits their usability for many practical problems, for instance, when training data arrives sequentially or the underlying distribution is continuously changing. In this paper, we propose a novel on-line random forest algorithm. We combine ideas from on-line bagging, extremely randomized forests and propose an on-line decision tree growing procedure. Additionally, we add a temporal weighting scheme for adaptively discarding some trees based on their out-of-bag-error in given time intervals and consequently growing of new trees. The experiments on common machine learning data sets show that our algorithm converges to the performance of the off-line RF. Additionally, we conduct experiments for visual tracking, where we demonstrate real-time state-of-the-art performance on well-known scenarios and show good performance in case of occlusions and appearance changes where we outperform trackers based on on-line boosting. Finally, we demonstrate the usability of on-line RFs on the task of interactive real-time segmentation.", "year": 2009, "referenceCount": 23, "citationCount": 510, "influentialCitationCount": 43, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1741702", "name": "Amir Saffari"}, {"authorId": "1695579", "name": "C. Leistner"}, {"authorId": "48716704", "name": "Jakob Santner"}, {"authorId": "3152684", "name": "Martin Godec"}, {"authorId": "144746444", "name": "H. Bischof"}]}, {"paperId": "83789f949e2beb92eca34da60d6f9c05ba3261f9", "url": "https://www.semanticscholar.org/paper/83789f949e2beb92eca34da60d6f9c05ba3261f9", "title": "Extreme Learning Machine With Composite Kernels for Hyperspectral Image Classification", "abstract": "Due to its simple, fast, and good generalization ability, extreme learning machine (ELM) has recently drawn increasing attention in the pattern recognition and machine learning fields. To investigate the performance of ELM on the hyperspectral images (HSIs), this paper proposes two spatial-spectral composite kernel (CK) ELM classification methods. In the proposed CK framework, the single spatial or spectral kernel consists of activation-function-based kernel and general Gaussian kernel, respectively. The proposed methods inherit the advantages of ELM and have an analytic solution to directly implement the multiclass classification. Experimental results on three benchmark hyperspectral datasets demonstrate that the proposed ELM with CK methods outperform the general ELM, SVM, and SVM with CK methods.", "year": 2015, "referenceCount": 44, "citationCount": 156, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "3049217", "name": "Yicong Zhou"}, {"authorId": "2444202", "name": "Jiangtao Peng"}, {"authorId": "2152857445", "name": "C. L. P. Chen"}]}, {"paperId": "370308ad57aa43a29df1a9500c813c13254e16cd", "url": "https://www.semanticscholar.org/paper/370308ad57aa43a29df1a9500c813c13254e16cd", "title": "Stacked Hierarchical Labeling", "abstract": null, "year": 2010, "referenceCount": 33, "citationCount": 252, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "51505748", "name": "Daniel Munoz"}, {"authorId": "1756566", "name": "J. Bagnell"}, {"authorId": "145670946", "name": "M. Hebert"}]}, {"paperId": "b564107c412bce2cae9f4793769e014f1dd8c16a", "url": "https://www.semanticscholar.org/paper/b564107c412bce2cae9f4793769e014f1dd8c16a", "title": "Machine learning in space: extending our reach", "abstract": null, "year": 2011, "referenceCount": 17, "citationCount": 22, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2299685", "name": "A. McGovern"}, {"authorId": "6541629", "name": "K. Wagstaff"}]}, {"paperId": "7700d89c3a2c898daadd111372566f7146310f5a", "url": "https://www.semanticscholar.org/paper/7700d89c3a2c898daadd111372566f7146310f5a", "title": "From What to How: An Initial Review of Publicly Available AI Ethics Tools, Methods and Research to Translate Principles into Practices", "abstract": null, "year": 2019, "referenceCount": 117, "citationCount": 230, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Sociology", "Computer Science"], "authors": [{"authorId": "1751614630", "name": "J. Morley"}, {"authorId": "1982425", "name": "L. Floridi"}, {"authorId": "40901846", "name": "Libby Kinsey"}, {"authorId": "2600242", "name": "Anat Elhalal"}]}, {"paperId": "5122eef3f21a8ea0285927fa7fe33fa7a3dadfae", "url": "https://www.semanticscholar.org/paper/5122eef3f21a8ea0285927fa7fe33fa7a3dadfae", "title": "${{\\rm E}^{2}}{\\rm LMs}$ : Ensemble Extreme Learning Machines for Hyperspectral Image Classification", "abstract": "Extreme learning machine (ELM) has attracted attentions in pattern recognition field due to its remarkable advantages such as fast operation, straightforward solution, and strong generalization. However, the performance of ELM for high-dimensional data, such as hyperspectral image, is still an open problem. Therefore, in this paper, we introduce ELM for hyperspectral image classification. Furthermore, in order to overcome the drawbacks of ELM caused by the randomness of input weights and bias, two new algorithms of ensemble extreme learning machines (Bagging-based and AdaBoost-based ELMs) are proposed for the classification task. In order to illustrate the performance of the proposed algorithms, support vector machines (SVMs) are used for evaluation and comparison. Experimental results with real hyperspectral images collected by reflective optics spectrographic image system (ROSIS) and airborne visible/infrared imaging spectrometer (AVIRIS) indicate that the proposed ensemble algorithms produce excellent classification performance in different scenarios with respect to spectral and spectral-spatial feature sets.", "year": 2014, "referenceCount": 41, "citationCount": 145, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "40087450", "name": "A. Samat"}, {"authorId": "1882431", "name": "Peijun Du"}, {"authorId": "47129972", "name": "Sicong Liu"}, {"authorId": "46276037", "name": "Jun Yu Li"}, {"authorId": "2150208546", "name": "Liang Cheng"}]}, {"paperId": "d15f9480b40956281ff330769fb179abf5a6303d", "url": "https://www.semanticscholar.org/paper/d15f9480b40956281ff330769fb179abf5a6303d", "title": "Suicide Note Classification Using Natural Language Processing: A Content Analysis", "abstract": "Suicide is the second leading cause of death among 25–34 year olds and the third leading cause of death among 15–25 year olds in the United States. In the Emergency Department, where suicidal patients often present, estimating the risk of repeated attempts is generally left to clinical judgment. This paper presents our second attempt to determine the role of computational algorithms in understanding a suicidal patient's thoughts, as represented by suicide notes. We focus on developing methods of natural language processing that distinguish between genuine and elicited suicide notes. We hypothesize that machine learning algorithms can categorize suicide notes as well as mental health professionals and psychiatric physician trainees do. The data used are comprised of suicide notes from 33 suicide completers and matched to 33 elicited notes from healthy control group members. Eleven mental health professionals and 31 psychiatric trainees were asked to decide if a note was genuine or elicited. Their decisions were compared to nine different machine-learning algorithms. The results indicate that trainees accurately classified notes 49% of the time, mental health professionals accurately classified notes 63% of the time, and the best machine learning algorithm accurately classified the notes 78% of the time. This is an important step in developing an evidence-based predictor of repeated suicide attempts because it shows that natural language processing can aid in distinguishing between classes of suicidal notes.", "year": 2010, "referenceCount": 38, "citationCount": 199, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1787579", "name": "J. Pestian"}, {"authorId": "6132923", "name": "H. Nasrallah"}, {"authorId": "1784716", "name": "P. Matykiewicz"}, {"authorId": "31607871", "name": "Aurora J Bennett"}, {"authorId": "6672398", "name": "A. Leenaars"}]}, {"paperId": "6fe68e797ea932fe27459f8e7402667959355f9d", "url": "https://www.semanticscholar.org/paper/6fe68e797ea932fe27459f8e7402667959355f9d", "title": "Byzantine-Tolerant Machine Learning", "abstract": "The growth of data, the need for scalability and the complexity of models used in modern machine learning calls for distributed implementations. Yet, as of today, distributed machine learning frameworks have largely ignored the possibility of arbitrary (i.e., Byzantine) failures. In this paper, we study the robustness to Byzantine failures at the fundamental level of stochastic gradient descent (SGD), the heart of most machine learning algorithms. Assuming a set of $n$ workers, up to $f$ of them being Byzantine, we ask how robust can SGD be, without limiting the dimension, nor the size of the parameter space. \nWe first show that no gradient descent update rule based on a linear combination of the vectors proposed by the workers (i.e, current approaches) tolerates a single Byzantine failure. We then formulate a resilience property of the update rule capturing the basic requirements to guarantee convergence despite $f$ Byzantine workers. We finally propose Krum, an update rule that satisfies the resilience property aforementioned. For a $d$-dimensional learning problem, the time complexity of Krum is $O(n^2 \\cdot (d + \\log n))$.", "year": 2017, "referenceCount": 27, "citationCount": 45, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3094352", "name": "Peva Blanchard"}, {"authorId": "9623412", "name": "El Mahdi El Mhamdi"}, {"authorId": "1727558", "name": "R. Guerraoui"}, {"authorId": "1718150", "name": "J. Stainer"}]}, {"paperId": "e494ef4e285520ba8daaeffa1626616f1e135baf", "url": "https://www.semanticscholar.org/paper/e494ef4e285520ba8daaeffa1626616f1e135baf", "title": "Model-based fault diagnosis in electric drives using machine learning", "abstract": "Electric motor and power electronics-based inverter are the major components in industrial and automotive electric drives. In this paper, we present a model-based fault diagnostics system developed using a machine learning technology for detecting and locating multiple classes of faults in an electric drive. Power electronics inverter can be considered to be the weakest link in such a system from hardware failure point of view; hence, this work is focused on detecting faults and finding which switches in the inverter cause the faults. A simulation model has been developed based on the theoretical foundations of electric drives to simulate the normal condition, all single-switch and post-short-circuit faults. A machine learning algorithm has been developed to automatically select a set of representative operating points in the (torque, speed) domain, which in turn is sent to the simulated electric drive model to generate signals for the training of a diagnostic neural network, fault diagnostic neural network (FDNN). We validated the capability of the FDNN on data generated by an experimental bench setup. Our research demonstrates that with a robust machine learning approach, a diagnostic system can be trained based on a simulated electric drive model, which can lead to a correct classification of faults over a wide operating domain.", "year": 2006, "referenceCount": 45, "citationCount": 126, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "31304755", "name": "Yi Lu Murphey"}, {"authorId": "144347027", "name": "M. Masrur"}, {"authorId": "31358642", "name": "ZhiHang Chen"}, {"authorId": "30834562", "name": "Baifang Zhang"}]}, {"paperId": "dcd3ab68bca9b3786e79c5142880d61c033a0923", "url": "https://www.semanticscholar.org/paper/dcd3ab68bca9b3786e79c5142880d61c033a0923", "title": "Large Margin Semi-supervised Learning", "abstract": "In classification, semi-supervised learning occurs when a large amount of unlabeled data is available with only a small number of labeled data. In such a situation, how to enhance predictability of classification through unlabeled data is the focus. In this article, we introduce a novel large margin semi-supervised learning methodology, using grouping information from unlabeled data, together with the concept of margins, in a form of regularization controlling the interplay between labeled and unlabeled data. Based on this methodology, we develop two specific machines involving support vector machines and ψ-learning, denoted as SSVM and SPSI, through difference convex programming. In addition, we estimate the generalization error using both labeled and unlabeled data, for tuning regularizers. Finally, our theoretical and numerical analyses indicate that the proposed methodology achieves the desired objective of delivering high performance in generalization, particularly against some strong performers.", "year": 2007, "referenceCount": 43, "citationCount": 50, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "46585202", "name": "Junhui Wang"}, {"authorId": "2266946", "name": "Xiaotong Shen"}]}, {"paperId": "c2df572eb56d57124bbbb87d1e213bfa0699e721", "url": "https://www.semanticscholar.org/paper/c2df572eb56d57124bbbb87d1e213bfa0699e721", "title": "Star-galaxy Classification Using Deep Convolutional Neural Networks", "abstract": "Most existing star-galaxy classifiers use the reduced summary information from catalogs, requiring careful feature extraction and selection. The latest advances in machine learning that use deep convolutional neural networks allow a machine to automatically learn the features directly from data, minimizing the need for input from human experts. We present a star-galaxy classification framework that uses deep convolutional neural networks (ConvNets) directly on the reduced, calibrated pixel values. Using data from the Sloan Digital Sky Survey (SDSS) and the Canada-France-Hawaii Telescope Lensing Survey (CFHTLenS), we demonstrate that ConvNets are able to produce accurate and well-calibrated probabilistic classifications that are competitive with conventional machine learning techniques. Future advances in deep learning may bring more success with current and forthcoming photometric surveys, such as the Dark Energy Survey (DES) and the Large Synoptic Survey Telescope (LSST), because deep neural networks require very little, manual feature engineering.", "year": 2016, "referenceCount": 86, "citationCount": 116, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "31717443", "name": "Edward J. Kim"}, {"authorId": "2594694", "name": "R. Brunner"}]}]}