{"total": 5120629, "offset": 5000, "next": 5100, "data": [{"paperId": "1caeddb73d1ab51e283c201dcfad5d634000e5c2", "url": "https://www.semanticscholar.org/paper/1caeddb73d1ab51e283c201dcfad5d634000e5c2", "title": "Value Regularization and Fenchel Duality", "abstract": "Regularization is an approach to function learning that balances fit and smoothness. In practice, we search for a function f with a finite representation f = Σi ci φi(·). In most treatments, the ci are the primary objects of study. We consider value regularization, constructing optimization problems in which the predicted values at the training points are the primary variables, and therefore the central objects of study. Although this is a simple change, it has profound consequences. From convex conjugacy and the theory of Fenchel duality, we derive separate optimality conditions for the regularization and loss portions of the learning problem; this technique yields clean and short derivations of standard algorithms. This framework is ideally suited to studying many other phenomena at the intersection of learning theory and optimization. We obtain a value-based variant of the representer theorem, which underscores the transductive nature of regularization in reproducing kernel Hilbert spaces. We unify and extend previous results on learning kernel functions, with very simple proofs. We analyze the use of unregularized bias terms in optimization problems, and low-rank approximations to kernel matrices, obtaining new results in these areas. In summary, the combination of value regularization and Fenchel duality are valuable tools for studying the optimization problems in machine learning.", "year": 2007, "referenceCount": 38, "citationCount": 88, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "11691394", "name": "R. Rifkin"}, {"authorId": "47167981", "name": "R. Lippert"}]}, {"paperId": "d660ef3c29d818cb9fc3d5fcd4a1a17ea2721c85", "url": "https://www.semanticscholar.org/paper/d660ef3c29d818cb9fc3d5fcd4a1a17ea2721c85", "title": "Web Usage Mining for a Better Web-Based Learning Environment", "abstract": "Web-based technology is often the technology of choice for distance education given the ease of use of the tools to browse the resources on the Web, the relative affordability of accessing the ubiquitous Web, and the simplicity of deploying and maintaining resources on the WorldWide Web. Many sophisticated web-based learning environments have been developed and are in use around the world. The same technology is being used for electronic commerce and has become extremely popular. However, while there are clever tools developed to understand online customer’s behaviours in order to increase sales and profit, there is very little done to automatically discover access patterns to understand learners’ behaviour on webbased distance learning. Educators, using on-line learning environments and tools, have very little support to evaluate learners’ activities and discriminate between different learners’ on-line behaviours. In this paper, we discuss some data mining and machine learning techniques that could be used to enhance web-based learning environments for the educator to better evaluate the leaning process, as well as for the learners to help them in their learning endeavour.", "year": 2001, "referenceCount": 20, "citationCount": 298, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "1683380", "name": "Osmar R Zaiane"}]}, {"paperId": "fb7caddac20dca012f48c90b2e1e2383f7185051", "url": "https://www.semanticscholar.org/paper/fb7caddac20dca012f48c90b2e1e2383f7185051", "title": "Interpreting Interpretability: Understanding Data Scientists' Use of Interpretability Tools for Machine Learning", "abstract": "Machine learning (ML) models are now routinely deployed in domains ranging from criminal justice to healthcare. With this newfound ubiquity, ML has moved beyond academia and grown into an engineering discipline. To that end, interpretability tools have been designed to help data scientists and machine learning practitioners better understand how ML models work. However, there has been little evaluation of the extent to which these tools achieve this goal. We study data scientists' use of two existing interpretability tools, the InterpretML implementation of GAMs and the SHAP Python package. We conduct a contextual inquiry (N=11) and a survey (N=197) of data scientists to observe how they use interpretability tools to uncover common issues that arise when building and evaluating ML models. Our results indicate that data scientists over-trust and misuse interpretability tools. Furthermore, few of our participants were able to accurately describe the visualizations output by these tools. We highlight qualitative themes for data scientists' mental models of interpretability tools. We conclude with implications for researchers and tool designers, and contextualize our findings in the social science literature.", "year": 2020, "referenceCount": 116, "citationCount": 235, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "48712213", "name": "Harmanpreet Kaur"}, {"authorId": "40900039", "name": "Harsha Nori"}, {"authorId": "2057108610", "name": "Samuel Jenkins"}, {"authorId": "145727186", "name": "R. Caruana"}, {"authorId": "1831395", "name": "H. Wallach"}, {"authorId": "4006636", "name": "Jennifer Wortman Vaughan"}]}, {"paperId": "5910ccdd6658998d3fd695945050aeaf40b2f182", "url": "https://www.semanticscholar.org/paper/5910ccdd6658998d3fd695945050aeaf40b2f182", "title": "Memory-Based Language Processing", "abstract": "Memory-based language processing--a machine learning and problem solving method for language technology--is based on the idea that the direct re-use of examples using analogical reasoning is more suited for solving language processing problems than the application of rules extracted from those examples. This book discusses the theory and practice of memory-based language processing, showing its comparative strengths over alternative methods of language modelling. Language is complex, with few generalizations, many sub-regularities and exceptions, and the advantage of memory-based language processing is that it does not abstract away from this valuable low-frequency information.", "year": 2009, "referenceCount": 11, "citationCount": 410, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1735272", "name": "Walter Daelemans"}, {"authorId": "145977875", "name": "Antal van den Bosch"}]}, {"paperId": "4c0624f476c001e40f291cdf6eb96af82bf32873", "url": "https://www.semanticscholar.org/paper/4c0624f476c001e40f291cdf6eb96af82bf32873", "title": "Amazon Machine Learning", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 19, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": null, "authors": []}, {"paperId": "22499d33e81a9bc63bc45ac682c1f26498048425", "url": "https://www.semanticscholar.org/paper/22499d33e81a9bc63bc45ac682c1f26498048425", "title": "Template Attacks vs. Machine Learning Revisited (and the Curse of Dimensionality in Side-Channel Analysis)", "abstract": null, "year": 2015, "referenceCount": 36, "citationCount": 120, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39319437", "name": "Liran Lerman"}, {"authorId": "2759945", "name": "R. Poussier"}, {"authorId": "1772497", "name": "Gianluca Bontempi"}, {"authorId": "1802747", "name": "O. Markowitch"}, {"authorId": "1706533", "name": "François-Xavier Standaert"}]}, {"paperId": "ea384dcb1c833ce42bafe9470b0a18edc9b77744", "url": "https://www.semanticscholar.org/paper/ea384dcb1c833ce42bafe9470b0a18edc9b77744", "title": "TEACHING MACHINES AND PROGRAMMED LEARNING, A SOURCE BOOK.", "abstract": null, "year": 1960, "referenceCount": 1, "citationCount": 154, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50066563", "name": "A. A. Lumsdaine"}, {"authorId": "31813000", "name": "R. Glaser"}]}, {"paperId": "cb9ca08029e9b3213de82de89bc2ea774c76b635", "url": "https://www.semanticscholar.org/paper/cb9ca08029e9b3213de82de89bc2ea774c76b635", "title": "Machine learning enables detection of early-stage colorectal cancer by whole-genome sequencing of plasma cell-free DNA", "abstract": null, "year": 2018, "referenceCount": 41, "citationCount": 73, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "8752174", "name": "Nathan Wan"}, {"authorId": "10976564", "name": "D. Weinberg"}, {"authorId": "2144898556", "name": "Tzu-Yu Liu"}, {"authorId": "2000850", "name": "K. Niehaus"}, {"authorId": "47835468", "name": "D. Delubac"}, {"authorId": "47747831", "name": "A. Kannan"}, {"authorId": "40657009", "name": "Brandon White"}, {"authorId": "6107055", "name": "E. Ariazi"}, {"authorId": "2069434604", "name": "Mitch Bailey"}, {"authorId": "52137537", "name": "Marvin Bertin"}, {"authorId": "50002286", "name": "Nathan Boley"}, {"authorId": "2059067891", "name": "D. Bowen"}, {"authorId": "73588537", "name": "James Cregg"}, {"authorId": "2059345669", "name": "Adam Drake"}, {"authorId": "38358556", "name": "R. Ennis"}, {"authorId": "121464478", "name": "S. Fransen"}, {"authorId": "40103273", "name": "Erik Gafni"}, {"authorId": "47742759", "name": "L. Hansen"}, {"authorId": "100577004", "name": "Yaping Liu"}, {"authorId": "47747298", "name": "Gabriel L. Otte"}, {"authorId": "87583095", "name": "Jennifer Pecson"}, {"authorId": "46879424", "name": "Brandon J. Rice"}, {"authorId": "34454752", "name": "Gabriel E. Sanderson"}, {"authorId": "35541771", "name": "Aarushi Sharma"}, {"authorId": "37434610", "name": "J. S. John"}, {"authorId": "144240877", "name": "Catherina Tang"}, {"authorId": "39746192", "name": "A. Tzou"}, {"authorId": "144823500", "name": "L. Young"}, {"authorId": "5707004", "name": "G. Putcha"}, {"authorId": "1983211", "name": "I. Haque"}]}, {"paperId": "ffe00c7ecdebc4d59074120205a76c3433a17083", "url": "https://www.semanticscholar.org/paper/ffe00c7ecdebc4d59074120205a76c3433a17083", "title": "Graph Kernels for RDF Data", "abstract": null, "year": 2012, "referenceCount": 30, "citationCount": 96, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34822220", "name": "Uta Lösch"}, {"authorId": "1699107", "name": "Stephan Bloehdorn"}, {"authorId": "1748257", "name": "Achim Rettinger"}]}, {"paperId": "0752ae56f80af6f69ddab7db2b46161f44e03ebf", "url": "https://www.semanticscholar.org/paper/0752ae56f80af6f69ddab7db2b46161f44e03ebf", "title": "Classifying large data sets using SVMs with hierarchical clusters", "abstract": "Support vector machines (SVMs) have been promising methods for classification and regression analysis because of their solid mathematical foundations which convery several salient properties that other methods hardly provide. However, despite the prominent properties of SVMs, they are not as favored for large-scale data mining as for pattern recognition or machine learning because the training complexity of SVMs is highly dependent on the size of a data set. Many real-world data mining applications involve millions or billions of data records where even multiple scans of the entire data are too expensive to perform. This paper presents a new method, Clustering-Based SVM (CB-SVM), which is specifically designed for handling very large data sets. CB-SVM applies a hierarchical micro-clustering algorithm that scans the entire data set only once to provide an SVM with high quality samples that carry the statistical summaries of the data such that the summaries maximize the benefit of learning the SVM. CB-SVM tries to generate the best SVM boundary for very large data sets given limited amount of resources. Our experiments on synthetic and real data sets show that CB-SVM is highly scalable for very large data sets while also generating high classification accuracy.", "year": 2003, "referenceCount": 27, "citationCount": 345, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1723357", "name": "Hwanjo Yu"}, {"authorId": "49500141", "name": "Jiong Yang"}, {"authorId": "145325584", "name": "Jiawei Han"}]}, {"paperId": "17a5868dc7abfa9495af6b1ae71042a006238ebc", "url": "https://www.semanticscholar.org/paper/17a5868dc7abfa9495af6b1ae71042a006238ebc", "title": "Input Warping for Bayesian Optimization of Non-Stationary Functions", "abstract": "Bayesian optimization has proven to be a highly effective methodology for the global optimization of unknown, expensive and multimodal functions. The ability to accurately model distributions over functions is critical to the effectiveness of Bayesian optimization. Although Gaussian processes provide a flexible prior over functions, there are various classes of functions that remain difficult to model. One of the most frequently occurring of these is the class of non-stationary functions. The optimization of the hyperparameters of machine learning algorithms is a problem domain in which parameters are often manually transformed a priori, for example by optimizing in \"log-space,\" to mitigate the effects of spatially-varying length scale. We develop a methodology for automatically learning a wide family of bijective transformations or warpings of the input space using the Beta cumulative distribution function. We further extend the warping framework to multi-task Bayesian optimization so that multiple tasks can be warped into a jointly stationary space. On a set of challenging benchmark optimization tasks, we observe that the inclusion of warping greatly improves on the state-of-the-art, producing better results faster and more reliably.", "year": 2014, "referenceCount": 41, "citationCount": 191, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "144108062", "name": "Jasper Snoek"}, {"authorId": "1754860", "name": "Kevin Swersky"}, {"authorId": "1804104", "name": "R. Zemel"}, {"authorId": "1722180", "name": "Ryan P. Adams"}]}, {"paperId": "f3eda875e14bf933759f3b777131a4a9973537b4", "url": "https://www.semanticscholar.org/paper/f3eda875e14bf933759f3b777131a4a9973537b4", "title": "Data-driven science and engineering: machine learning, dynamical systems, and control", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 368, "influentialCitationCount": 50, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153929250", "name": "T. Peters"}]}, {"paperId": "b44928816cf5afec15613315749f0a0114be8704", "url": "https://www.semanticscholar.org/paper/b44928816cf5afec15613315749f0a0114be8704", "title": "Machine Learning, Machine Vision, and the Brain", "abstract": "The problem of learning is arguably at the very core of the problem of intelligence, both biological and artificial. In this article, we review our work over the last 10 years in the area of supervised learning, focusing on three interlinked directions of research -- (1) theory, (2) engineering applications (making intelligent software), and (3) neuroscience (understanding the brain's mechanisms of learnings) -- that contribute to and complement each other.", "year": 1999, "referenceCount": 40, "citationCount": 36, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1685292", "name": "T. Poggio"}, {"authorId": "3564227", "name": "C. Shelton"}]}, {"paperId": "2f7f5d0e989c74d6279e2620e10e8d0b0c021cb7", "url": "https://www.semanticscholar.org/paper/2f7f5d0e989c74d6279e2620e10e8d0b0c021cb7", "title": "S4: Distributed Stream Computing Platform", "abstract": "S4 is a general-purpose, distributed, scalable, partially fault-tolerant, pluggable platform that allows programmers to easily develop applications for processing continuous unbounded streams of data. Keyed data events are routed with affinity to Processing Elements (PEs), which consume the events and do one or both of the following: (1) emit one or more events which may be consumed by other PEs, (2) publish results. The architecture resembles the Actors model, providing semantics of encapsulation and location transparency, thus allowing applications to be massively concurrent while exposing a simple programming interface to application developers. In this paper, we outline the S4 architecture in detail, describe various applications, including real-life deployments. Our design is primarily driven by large scale applications for data mining and machine learning in a production environment. We show that the S4 design is surprisingly flexible and lends itself to run in large clusters built with commodity hardware.", "year": 2010, "referenceCount": 17, "citationCount": 959, "influentialCitationCount": 43, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115641", "name": "L. Neumeyer"}, {"authorId": "2064096900", "name": "B. Robbins"}, {"authorId": "2144011217", "name": "Anish Nair"}, {"authorId": "2073139181", "name": "Anand Kesari"}]}, {"paperId": "7d878fe31b9b57f75071586d83cdec2e8b81e039", "url": "https://www.semanticscholar.org/paper/7d878fe31b9b57f75071586d83cdec2e8b81e039", "title": "Fréchet ChemNet Distance: A Metric for Generative Models for Molecules in Drug Discovery", "abstract": "The new wave of successful generative models in machine learning has increased the interest in deep learning driven de novo drug design. However, method comparison is difficult because of various flaws of the currently employed evaluation metrics. We propose an evaluation metric for generative models called Fréchet ChemNet distance (FCD). The advantage of the FCD over previous metrics is that it can detect whether generated molecules are diverse and have similar chemical and biological properties as real molecules.", "year": 2018, "referenceCount": 29, "citationCount": 143, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Biology", "Mathematics", "Medicine"], "authors": [{"authorId": "32764807", "name": "Kristina Preuer"}, {"authorId": "30578364", "name": "Philipp Renz"}, {"authorId": "2465270", "name": "Thomas Unterthiner"}, {"authorId": "3308557", "name": "S. Hochreiter"}, {"authorId": "1994964", "name": "G. Klambauer"}]}, {"paperId": "76faaf292c6d9dc29d3a99300a7fdd7a35d6d107", "url": "https://www.semanticscholar.org/paper/76faaf292c6d9dc29d3a99300a7fdd7a35d6d107", "title": "Online and Linear-Time Attention by Enforcing Monotonic Alignments", "abstract": "Recurrent neural network models with an attention mechanism have proven to be extremely effective on a wide variety of sequence-to-sequence problems. However, the fact that soft attention mechanisms perform a pass over the entire input sequence when producing each element in the output sequence precludes their use in online settings and results in a quadratic time complexity. Based on the insight that the alignment between input and output sequence elements is monotonic in many problems of interest, we propose an end-to-end differentiable method for learning monotonic alignments which, at test time, enables computing attention online and in linear time. We validate our approach on sentence summarization, machine translation, and online speech recognition problems and achieve results competitive with existing sequence-to-sequence models.", "year": 2017, "referenceCount": 61, "citationCount": 201, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2402716", "name": "Colin Raffel"}, {"authorId": "1707242", "name": "Minh-Thang Luong"}, {"authorId": "35025299", "name": "Peter J. Liu"}, {"authorId": "39571582", "name": "Ron J. Weiss"}, {"authorId": "2396681", "name": "D. Eck"}]}, {"paperId": "86833e4f3d28a25c4e40a030c89de5bb422e582f", "url": "https://www.semanticscholar.org/paper/86833e4f3d28a25c4e40a030c89de5bb422e582f", "title": "Systematic literature review of machine learning based software development effort estimation models", "abstract": null, "year": 2012, "referenceCount": 137, "citationCount": 368, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2113341566", "name": "Jianfeng Wen"}, {"authorId": "2019921", "name": "Shixian Li"}, {"authorId": "2108651032", "name": "Zhiyong Lin"}, {"authorId": "49994748", "name": "Yong Hu"}, {"authorId": "2110927092", "name": "Changqing Huang"}]}, {"paperId": "052252e5d5523e9b6488f0f6022bf3621f44e0be", "url": "https://www.semanticscholar.org/paper/052252e5d5523e9b6488f0f6022bf3621f44e0be", "title": "Unrestricted Adversarial Examples", "abstract": "We introduce a two-player contest for evaluating the safety and robustness of machine learning systems, with a large prize pool. Unlike most prior work in ML robustness, which studies norm-constrained adversaries, we shift our focus to unconstrained adversaries. Defenders submit machine learning models, and try to achieve high accuracy and coverage on non-adversarial data while making no confident mistakes on adversarial inputs. Attackers try to subvert defenses by finding arbitrary unambiguous inputs where the model assigns an incorrect label with high confidence. We propose a simple unambiguous dataset (\"bird-or- bicycle\") to use as part of this contest. We hope this contest will help to more comprehensively evaluate the worst-case adversarial risk of machine learning models.", "year": 2018, "referenceCount": 20, "citationCount": 82, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "31035595", "name": "Tom B. Brown"}, {"authorId": "2483738", "name": "Nicholas Carlini"}, {"authorId": "151505981", "name": "Chiyuan Zhang"}, {"authorId": "2061321863", "name": "Catherine Olsson"}, {"authorId": "145791315", "name": "P. Christiano"}, {"authorId": "153440022", "name": "Ian J. Goodfellow"}]}, {"paperId": "cd28cd3a66f19a5d85d1d9ad9a9c853b76e882fa", "url": "https://www.semanticscholar.org/paper/cd28cd3a66f19a5d85d1d9ad9a9c853b76e882fa", "title": "SVM-based generalized multiple-instance learning via approximate box counting", "abstract": "The multiple-instance learning (MIL) model has been very successful in application areas such as drug discovery and content-based image-retrieval. Recently, a generalization of this model and an algorithm for this generalization were introduced, showing significant advantages over the conventional MIL model in certain application areas. Unfortunately, this algorithm is inherently inefficient, preventing scaling to high dimensions. We reformulate this algorithm using a kernel for a support vector machine, reducing its time complexity from exponential to polynomial. Computing the kernel is equivalent to counting the number of axis-parallel boxes in a discrete, bounded space that contain at least one point from each of two multisets P and Q. We show that this problem is #P-complete, but then give a fully polynomial randomized approximation scheme (FPRAS) for it. Finally, we empirically evaluate our kernel.", "year": 2004, "referenceCount": 22, "citationCount": 95, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1682525", "name": "Qingping Tao"}, {"authorId": "93847855", "name": "S. Scott"}, {"authorId": "1795424", "name": "N. V. Vinodchandran"}, {"authorId": "31621435", "name": "T. T. Osugi"}]}, {"paperId": "66fc1552c6fb6608c703baaf499686180593d80e", "url": "https://www.semanticscholar.org/paper/66fc1552c6fb6608c703baaf499686180593d80e", "title": "Compressed-Domain Ship Detection on Spaceborne Optical Image Using Deep Neural Network and Extreme Learning Machine", "abstract": "Ship detection on spaceborne images has attracted great interest in the applications of maritime security and traffic control. Optical images stand out from other remote sensing images in object detection due to their higher resolution and more visualized contents. However, most of the popular techniques for ship detection from optical spaceborne images have two shortcomings: 1) Compared with infrared and synthetic aperture radar images, their results are affected by weather conditions, like clouds and ocean waves, and 2) the higher resolution results in larger data volume, which makes processing more difficult. Most of the previous works mainly focus on solving the first problem by improving segmentation or classification with complicated algorithms. These methods face difficulty in efficiently balancing performance and complexity. In this paper, we propose a ship detection approach to solving the aforementioned two issues using wavelet coefficients extracted from JPEG2000 compressed domain combined with deep neural network (DNN) and extreme learning machine (ELM). Compressed domain is adopted for fast ship candidate extraction, DNN is exploited for high-level feature representation and classification, and ELM is used for efficient feature pooling and decision making. Extensive experiments demonstrate that, in comparison with the existing relevant state-of-the-art approaches, the proposed method requires less detection time and achieves higher detection accuracy.", "year": 2015, "referenceCount": 54, "citationCount": 334, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2967405", "name": "Jiexiong Tang"}, {"authorId": "7175017", "name": "Chenwei Deng"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "2130614", "name": "Baojun Zhao"}]}, {"paperId": "425eb6b97480afc0f918c583980896559ba881f3", "url": "https://www.semanticscholar.org/paper/425eb6b97480afc0f918c583980896559ba881f3", "title": "Secure Logistic Regression Based on Homomorphic Encryption: Design and Evaluation", "abstract": "Background Learning a model without accessing raw data has been an intriguing idea to security and machine learning researchers for years. In an ideal setting, we want to encrypt sensitive data to store them on a commercial cloud and run certain analyses without ever decrypting the data to preserve privacy. Homomorphic encryption technique is a promising candidate for secure data outsourcing, but it is a very challenging task to support real-world machine learning tasks. Existing frameworks can only handle simplified cases with low-degree polynomials such as linear means classifier and linear discriminative analysis. Objective The goal of this study is to provide a practical support to the mainstream learning models (eg, logistic regression). Methods We adapted a novel homomorphic encryption scheme optimized for real numbers computation. We devised (1) the least squares approximation of the logistic function for accuracy and efficiency (ie, reduce computation cost) and (2) new packing and parallelization techniques. Results Using real-world datasets, we evaluated the performance of our model and demonstrated its feasibility in speed and memory consumption. For example, it took approximately 116 minutes to obtain the training model from the homomorphically encrypted Edinburgh dataset. In addition, it gives fairly accurate predictions on the testing dataset. Conclusions We present the first homomorphically encrypted logistic regression outsourcing model based on the critical observation that the precision loss of classification models is sufficiently small so that the decision plan stays still.", "year": 2018, "referenceCount": 45, "citationCount": 164, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "50619349", "name": "Miran Kim"}, {"authorId": "11977411", "name": "Yongsoo Song"}, {"authorId": "49184748", "name": "Shuang Wang"}, {"authorId": "9689501", "name": "Yuhou Xia"}, {"authorId": "1935336", "name": "Xiaoqian Jiang"}]}, {"paperId": "dfdb5068507f64bf448857680fd6773ef08f0f21", "url": "https://www.semanticscholar.org/paper/dfdb5068507f64bf448857680fd6773ef08f0f21", "title": "Feature Learning for Activity Recognition in Ubiquitous Computing", "abstract": "Feature extraction for activity recognition in context-aware ubiquitous computing applications is usually a heuristic process, informed by underlying domain knowledge. Relying on such explicit knowledge is problematic when aiming to generalize across different application domains. We investigate the potential of recent machine learning methods for discovering universal features for context-aware applications of activity recognition. We also describe an alternative data representation based on the empirical cumulative distribution function of the raw data, which effectively abstracts from absolute values. Experiments on accelerometer data from four publicly available activity recognition datasets demonstrate the significant potential of our approach to address both contemporary activity recognition tasks and next generation problems such as skill assessment and the detection of novel activities.", "year": 2011, "referenceCount": 21, "citationCount": 322, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2191750", "name": "T. Plötz"}, {"authorId": "3128867", "name": "N. Hammerla"}, {"authorId": "145171812", "name": "P. Olivier"}]}, {"paperId": "382043e17fba5c43c8a0af895cf754b82fa350d8", "url": "https://www.semanticscholar.org/paper/382043e17fba5c43c8a0af895cf754b82fa350d8", "title": "Heterogeneity-aware Distributed Parameter Servers", "abstract": "We study distributed machine learning in heterogeneous environments in this work. We first conduct a systematic study of existing systems running distributed stochastic gradient descent; we find that, although these systems work well in homogeneous environments, they can suffer performance degradation, sometimes up to 10x, in heterogeneous environments where stragglers are common because their synchronization protocols cannot fit a heterogeneous setting. Our first contribution is a heterogeneity-aware algorithm that uses a constant learning rate schedule for updates before adding them to the global parameter. This allows us to suppress stragglers' harm on robust convergence. As a further improvement, our second contribution is a more sophisticated learning rate schedule that takes into consideration the delayed information of each update. We theoretically prove the valid convergence of both approaches and implement a prototype system in the production cluster of our industrial partner Tencent Inc. We validate the performance of this prototype using a range of machine-learning workloads. Our prototype is 2-12x faster than other state-of-the-art systems, such as Spark, Petuum, and TensorFlow; and our proposed algorithm takes up to 6x fewer iterations to converge.", "year": 2017, "referenceCount": 47, "citationCount": 168, "influentialCitationCount": 28, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3452475", "name": "Jiawei Jiang"}, {"authorId": "144585959", "name": "B. Cui"}, {"authorId": "1776014", "name": "Ce Zhang"}, {"authorId": "2697681", "name": "Lele Yu"}]}, {"paperId": "36845e5d13e6d8698561d416b694122cfa754332", "url": "https://www.semanticscholar.org/paper/36845e5d13e6d8698561d416b694122cfa754332", "title": "Aequitas: A Bias and Fairness Audit Toolkit", "abstract": "Recent work has raised concerns on the risk of unintended bias in AI systems being used nowadays that can affect individuals unfairly based on race, gender or religion, among other possible characteristics. While a lot of bias metrics and fairness definitions have been proposed in recent years, there is no consensus on which metric/definition should be used and there are very few available resources to operationalize them. Therefore, despite recent awareness, auditing for bias and fairness when developing and deploying AI systems is not yet a standard practice. We present Aequitas, an open source bias and fairness audit toolkit that is an intuitive and easy to use addition to the machine learning workflow, enabling users to seamlessly test models for several bias and fairness metrics in relation to multiple population sub-groups. Aequitas facilitates informed and equitable decisions around developing and deploying algorithmic decision making systems for both data scientists, machine learning researchers and policymakers.", "year": 2018, "referenceCount": 29, "citationCount": 155, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2266550", "name": "Pedro Saleiro"}, {"authorId": "2064395768", "name": "Benedict Kuester"}, {"authorId": "2053987304", "name": "Abby Stevens"}, {"authorId": "2064076204", "name": "Ari Anisfeld"}, {"authorId": "117010066", "name": "Loren Hinkson"}, {"authorId": "116944217", "name": "J. London"}, {"authorId": "1791498", "name": "R. Ghani"}]}, {"paperId": "a0239cbe1f72f6731712539f2a5dc4adde83e156", "url": "https://www.semanticscholar.org/paper/a0239cbe1f72f6731712539f2a5dc4adde83e156", "title": "Machine Learning for Multimodal Interaction , 4th International Workshop, MLMI 2007, Brno, Czech Republic, June 28-30, 2007, Revised Selected Papers", "abstract": null, "year": 2008, "referenceCount": 0, "citationCount": 157, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "65858184", "name": "Mlmi"}, {"authorId": "1797819", "name": "Andrei Popescu-Belis"}, {"authorId": "145086187", "name": "S. Renals"}, {"authorId": "1733733", "name": "H. Bourlard"}]}, {"paperId": "00c977884a7d532833f22ca46eede5a7301f6153", "url": "https://www.semanticscholar.org/paper/00c977884a7d532833f22ca46eede5a7301f6153", "title": "Chimera: Large-Scale Classification using Machine Learning, Rules, and Crowdsourcing", "abstract": "Large-scale classification is an increasingly critical Big Data problem. So far, however, very little has been published on how this is done in practice. In this paper we describe Chimera, our solution to classify tens of millions of products into 5000+ product types at WalmartLabs. We show that at this scale, many conventional assumptions regarding learning and crowdsourcing break down, and that existing solutions cease to work. We describe how Chimera employs a combination of learning, rules (created by in-house analysts), and crowdsourcing to achieve accurate, continuously improving, and cost-effective classification. We discuss a set of lessons learned for other similar Big Data systems. In particular, we argue that at large scales crowdsourcing is critical, but must be used in combination with learning, rules, and in-house analysts. We also argue that using rules (in conjunction with learning) is a must, and that more research attention should be paid to helping analysts create and manage (tens of thousands of) rules more effectively.", "year": 2014, "referenceCount": 33, "citationCount": 106, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2145963681", "name": "Chong Sun"}, {"authorId": "2916169", "name": "Narasimhan Rampalli"}, {"authorId": "2143416154", "name": "Frank Yang"}, {"authorId": "3030274", "name": "A. Doan"}]}, {"paperId": "85d261e296613445288de495c456b3489307e04f", "url": "https://www.semanticscholar.org/paper/85d261e296613445288de495c456b3489307e04f", "title": "A comparative study on machine learning based algorithms for prediction of motorcycle crash severity", "abstract": "Motorcycle crash severity is under-researched in Ghana. Thus, the probable risk factors and association between these factors and motorcycle crash severity outcomes is not known. Traditional statistical models have intrinsic assumptions and pre-defined correlations that, if flouted, can generate inaccurate results. In this study, machine learning based algorithms were employed to predict and classify motorcycle crash severity. Machine learning based techniques are non-parametric models without the presumption of relationships between endogenous and exogenous variables. The main aim of this research is to evaluate and compare different approaches to modeling motorcycle crash severity as well as investigating the effect of risk factors on the injury outcomes of motorcycle crashes. Motorcycle crash dataset between 2011 and 2015 was extracted from the National Road Traffic Crash Database at the Building and Road Research Institute (BRRI) in Ghana. The dataset was classified into four injury severity categories: fatal, hospitalized, injured, and damage-only. Three machine learning based models were developed: J48 Decision Tree Classifier, Random Forest (RF) and Instance-Based learning with parameter k (IBk) were employed to model the severity of injury in a motorcycle crash. These machine learning algorithms were validated using 10-fold cross-validation technique. The three machine learning based algorithms were compared with one another and the statistical model: multinomial logit model (MNLM). Also, the relative importance analysis of the attribute was conducted to determine the impact of these attributes on injury severity outcomes. The results of the study reveal that the predictions of machine learning algorithms are superior to the MNLM in accuracy and effectiveness, and the RF-based algorithms show the overall best agreement with the experimental data out of the three machine learning algorithms, for its global optimization and extrapolation ability. Location type, time of the crash, settlement type, collision partner, collision type, road separation, road surface type, the day of the week, and road shoulder condition were found as the critical determinants of motorcycle crash injury severity.", "year": 2019, "referenceCount": 90, "citationCount": 48, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "51287236", "name": "Lukuman Wahab"}, {"authorId": "1895601", "name": "Haobin Jiang"}]}, {"paperId": "05be2c7905beacf7c6e47fe7c4c141bb61cc48a6", "url": "https://www.semanticscholar.org/paper/05be2c7905beacf7c6e47fe7c4c141bb61cc48a6", "title": "Using Machine Learning To Cocreate Value Through Dynamic Customer Engagement In A Brand Loyalty Program", "abstract": "Hospitality venues traditionally use historical data from customers for their customer relationship management systems, but now they can also collect real-time data and automated procedures to make dynamic decisions and predictions about customer behavior. Machine learning is an example of automated processes that create insights into cocreation of value through dynamic customer engagement. To show the merits of automation, machine learning was implemented at a major hospitality venue and compared with traditional methods to identify what customers value in a loyalty program. The results show that machine learning processes are superior in identifying customers who find value in specific promotions. This research deepens practical and theoretical understanding of machine learning in the customer engagement-to-value loyalty chain and in the customer engagement construct that uses a dynamic customer engagement model.", "year": 2019, "referenceCount": 35, "citationCount": 50, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Business"], "authors": [{"authorId": "95000277", "name": "Ajay Aluri"}, {"authorId": "39686605", "name": "Bradley S. Price"}, {"authorId": "143605797", "name": "Nancy H. McIntyre"}]}, {"paperId": "f194de79b86394f88bfdfeb9e6165e51cf83924d", "url": "https://www.semanticscholar.org/paper/f194de79b86394f88bfdfeb9e6165e51cf83924d", "title": "The \"What\" and \"How\" of Learning in Design", "abstract": "Machine learning in design offers tremendous potential to actively support designers in all of their problem solving and knowledge requirement activities. This article surveys what designers and their systems have accomplished so far using machine learning techniques.", "year": 1997, "referenceCount": 36, "citationCount": 54, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1692021", "name": "A. Duffy"}]}, {"paperId": "e6b9fc7aa2996e7afc91c7f223460f9ded85e2da", "url": "https://www.semanticscholar.org/paper/e6b9fc7aa2996e7afc91c7f223460f9ded85e2da", "title": "Client Selection for Federated Learning with Heterogeneous Resources in Mobile Edge", "abstract": "We envision a mobile edge computing (MEC) framework for machine learning (ML) technologies, which leverages distributed client data and computation resources for training high-performance ML models while preserving client privacy. Toward this future goal, this work aims to extend Federated Learning (FL), a decentralized learning framework that enables privacy-preserving training of models, to work with heterogeneous clients in a practical cellular network. The FL protocol iteratively asks random clients to download a trainable model from a server, update it with own data, and upload the updated model to the server, while asking the server to aggregate multiple client updates to further improve the model. While clients in this protocol are free from disclosing own private data, the overall training process can become inefficient when some clients are with limited computational resources (i.e., requiring longer update time) or under poor wireless channel conditions (longer upload time). Our new FL protocol, which we refer to as FedCS, mitigates this problem and performs FL efficiently while actively managing clients based on their resource conditions. Specifically, FedCS solves a client selection problem with resource constraints, which allows the server to aggregate as many client updates as possible and to accelerate performance improvement in ML models. We conducted an experimental evaluation using publicly-available large-scale image datasets to train deep neural networks on MEC environment simulations. The experimental results show that FedCS is able to complete its training process in a significantly shorter time compared to the original FL protocol.", "year": 2018, "referenceCount": 20, "citationCount": 597, "influentialCitationCount": 56, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3037568", "name": "T. Nishio"}, {"authorId": "1899753", "name": "Ryo Yonetani"}]}, {"paperId": "954db9aa9f141ce9719d9ffc76c7677b27d9e45f", "url": "https://www.semanticscholar.org/paper/954db9aa9f141ce9719d9ffc76c7677b27d9e45f", "title": "Learning to track 3D human motion from silhouettes", "abstract": "We describe a sparse Bayesian regression method for recovering 3D human body motion directly from silhouettes extracted from monocular video sequences. No detailed body shape model is needed, and realism is ensured by training on real human motion capture data. The tracker estimates 3D body pose by using Relevance Vector Machine regression to combine a learned autoregressive dynamical model with robust shape descriptors extracted automatically from image silhouettes. We studied several different combination methods, the most effective being to learn a nonlinear observation-update correction based on joint regression with respect to the predicted state and the observations. We demonstrate the method on a 54-parameter full body pose model, both quantitatively using motion capture based test sequences, and qualitatively on a test video sequence.", "year": 2004, "referenceCount": 26, "citationCount": 110, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145984136", "name": "A. Agarwal"}, {"authorId": "1756114", "name": "B. Triggs"}]}, {"paperId": "9f75623e40c4e97b6488a385c37d345518d112d9", "url": "https://www.semanticscholar.org/paper/9f75623e40c4e97b6488a385c37d345518d112d9", "title": "A Sparse Structure Learning Algorithm for Gaussian Bayesian Network Identification from High-Dimensional Data", "abstract": "Structure learning of Bayesian Networks (BNs) is an important topic in machine learning. Driven by modern applications in genetics and brain sciences, accurate and efficient learning of large-scale BN structures from high-dimensional data becomes a challenging problem. To tackle this challenge, we propose a Sparse Bayesian Network (SBN) structure learning algorithm that employs a novel formulation involving one L1-norm penalty term to impose sparsity and another penalty term to ensure that the learned BN is a Directed Acyclic Graph (DAG)&#x2014;a required property of BNs. Through both theoretical analysis and extensive experiments on 11 moderate and large benchmark networks with various sample sizes, we show that SBN leads to improved learning accuracy, scalability, and efficiency as compared with 10 existing popular BN learning algorithms. We apply SBN to a real-world application of brain connectivity modeling for Alzheimer's disease (AD) and reveal findings that could lead to advancements in AD research.", "year": 2013, "referenceCount": 84, "citationCount": 60, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2118017940", "name": "Shuai Huang"}, {"authorId": "51173652", "name": "Jing Li"}, {"authorId": "144030870", "name": "Jieping Ye"}, {"authorId": "145215543", "name": "A. Fleisher"}, {"authorId": "1752005", "name": "Kewei Chen"}, {"authorId": "145179495", "name": "Teresa Wu"}, {"authorId": "1802991", "name": "E. Reiman"}]}, {"paperId": "bff6740a39528658154edd747fb17c402d5f12e3", "url": "https://www.semanticscholar.org/paper/bff6740a39528658154edd747fb17c402d5f12e3", "title": "Similarity encoding for learning with dirty categorical variables", "abstract": null, "year": 2018, "referenceCount": 54, "citationCount": 112, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2066688699", "name": "Patricio Cerda"}, {"authorId": "3025780", "name": "G. Varoquaux"}, {"authorId": "143674326", "name": "B. Kégl"}]}, {"paperId": "1aa084d7d017e1d7cdc055c73f078a1e718088a8", "url": "https://www.semanticscholar.org/paper/1aa084d7d017e1d7cdc055c73f078a1e718088a8", "title": "Application of Metamorphic Testing to Supervised Classifiers", "abstract": "Many applications in the field of scientific computing - such as computational biology, computational linguistics, and others - depend on Machine Learning algorithms to provide important core functionality to support solutions in the particular problem domains. However, it is difficult to test such applications because often there is no \"test oracle\" to indicate what the correct output should be for arbitrary input. To help address the quality of such software, in this paper we present a technique for testing the implementations of supervised machine learning classification algorithms on which such scientific computing software depends. Our technique is based on an approach called \"metamorphic testing\", which has been shown to be effective in such cases. More importantly, we demonstrate that our technique not only serves the purpose of verification, but also can be applied in validation. In addition to presenting our technique, we describe a case study we performed on a real-world machine learning application framework, and discuss how programmers implementing machine learning algorithms can avoid the common pitfalls discovered in our study. We also discuss how our findings can be of use to other areas outside scientific computing, as well.", "year": 2009, "referenceCount": 24, "citationCount": 87, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "145415788", "name": "Xiaoyuan Xie"}, {"authorId": "144003410", "name": "J. W. Ho"}, {"authorId": "1824613", "name": "Christian Murphy"}, {"authorId": "1694056", "name": "G. Kaiser"}, {"authorId": "144380518", "name": "Baowen Xu"}, {"authorId": "144587401", "name": "T. Chen"}]}, {"paperId": "ef4f4cadea21b4d6d7a4c82c251d879db34d35a5", "url": "https://www.semanticscholar.org/paper/ef4f4cadea21b4d6d7a4c82c251d879db34d35a5", "title": "Machine Learning of Hierarchical Clustering to Segment 2D and 3D Images", "abstract": "We aim to improve segmentation through the use of machine learning tools during region agglomeration. We propose an active learning approach for performing hierarchical agglomerative segmentation from superpixels. Our method combines multiple features at all scales of the agglomerative process, works for data with an arbitrary number of dimensions, and scales to very large datasets. We advocate the use of variation of information to measure segmentation accuracy, particularly in 3D electron microscopy (EM) images of neural tissue, and using this metric demonstrate an improvement over competing algorithms in EM and natural images.", "year": 2013, "referenceCount": 50, "citationCount": 136, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine", "Physics"], "authors": [{"authorId": "1398851518", "name": "Juan Nunez-Iglesias"}, {"authorId": "2071246681", "name": "Ryan Kennedy"}, {"authorId": "1807477", "name": "T. Parag"}, {"authorId": "46865129", "name": "Jianbo Shi"}, {"authorId": "1978940", "name": "D. Chklovskii"}]}, {"paperId": "425b18de3b4d233ed5494a8c601eeb6cb82ae4e5", "url": "https://www.semanticscholar.org/paper/425b18de3b4d233ed5494a8c601eeb6cb82ae4e5", "title": "Corporate default forecasting with machine learning", "abstract": null, "year": 2020, "referenceCount": 28, "citationCount": 77, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153810345", "name": "Mirko Moscatelli"}, {"authorId": "100924316", "name": "Fabio Parlapiano"}, {"authorId": "1644033476", "name": "Simone Narizzano"}, {"authorId": "1644029881", "name": "Gianluca Viggiano"}]}, {"paperId": "5d5b12aeea6e3ce0aa71c98610780c810b94922f", "url": "https://www.semanticscholar.org/paper/5d5b12aeea6e3ce0aa71c98610780c810b94922f", "title": "Predicting network attack patterns in SDN using machine learning approach", "abstract": "An experimental setup of 32 honeypots reported 17M login attempts originating from 112 different countries and over 6000 distinct source IP addresses. Due to decoupled control and data plane, Software Defined Networks (SDN) can handle these increasing number of attacks by blocking those network connections at the switch level. However, the challenge lies in defining the set of rules on the SDN controller to block malicious network connections. Historical network attack data can be used to automatically identify and block the malicious connections. There are a few existing open-source software tools to monitor and limit the number of login attempts per source IP address one-by-one. However, these solutions cannot efficiently act against a chain of attacks that comprises multiple IP addresses used by each attacker. In this paper, we propose using machine learning algorithms, trained on historical network attack data, to identify the potential malicious connections and potential attack destinations. We use four widely-known machine learning algorithms: C4.5, Bayesian Network (BayesNet), Decision Table (DT), and Naive-Bayes to predict the host that will be attacked based on the historical data. Experimental results show that average prediction accuracy of 91.68% is attained using Bayesian Networks.", "year": 2016, "referenceCount": 25, "citationCount": 97, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2849311", "name": "Saurav Nanda"}, {"authorId": "1922579", "name": "Faheem Zafari"}, {"authorId": "35154473", "name": "C. DeCusatis"}, {"authorId": "10763275", "name": "Eric Wedaa"}, {"authorId": "2144025", "name": "B. Yang"}]}, {"paperId": "8260246ff9ca16f478bc7e9a0f62b88315905acf", "url": "https://www.semanticscholar.org/paper/8260246ff9ca16f478bc7e9a0f62b88315905acf", "title": "Learning surface molecular structures via machine vision", "abstract": null, "year": 2017, "referenceCount": 44, "citationCount": 74, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144432098", "name": "M. Ziatdinov"}, {"authorId": "2354060", "name": "A. Maksov"}, {"authorId": "37455773", "name": "Sergei V. Kalinin"}]}, {"paperId": "b067701cf2a2d54ecde7b4e9c25b843d787b66c2", "url": "https://www.semanticscholar.org/paper/b067701cf2a2d54ecde7b4e9c25b843d787b66c2", "title": "Machine Learning Meta-analysis of Large Metagenomic Datasets: Tools and Biological Insights", "abstract": "Shotgun metagenomic analysis of the human associated microbiome provides a rich set of microbial features for prediction and biomarker discovery in the context of human diseases and health conditions. However, the use of such high-resolution microbial features presents new challenges, and validated computational tools for learning tasks are lacking. Moreover, classification rules have scarcely been validated in independent studies, posing questions about the generality and generalization of disease-predictive models across cohorts. In this paper, we comprehensively assess approaches to metagenomics-based prediction tasks and for quantitative assessment of the strength of potential microbiome-phenotype associations. We develop a computational framework for prediction tasks using quantitative microbiome profiles, including species-level relative abundances and presence of strain-specific markers. A comprehensive meta-analysis, with particular emphasis on generalization across cohorts, was performed in a collection of 2424 publicly available metagenomic samples from eight large-scale studies. Cross-validation revealed good disease-prediction capabilities, which were in general improved by feature selection and use of strain-specific markers instead of species-level taxonomic abundance. In cross-study analysis, models transferred between studies were in some cases less accurate than models tested by within-study cross-validation. Interestingly, the addition of healthy (control) samples from other studies to training sets improved disease prediction capabilities. Some microbial species (most notably Streptococcus anginosus) seem to characterize general dysbiotic states of the microbiome rather than connections with a specific disease. Our results in modelling features of the “healthy” microbiome can be considered a first step toward defining general microbial dysbiosis. The software framework, microbiome profiles, and metadata for thousands of samples are publicly available at http://segatalab.cibio.unitn.it/tools/metaml.", "year": 2016, "referenceCount": 81, "citationCount": 326, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "46922390", "name": "Edoardo Pasolli"}, {"authorId": "34431144", "name": "D. Truong"}, {"authorId": "145299758", "name": "Fa Malik"}, {"authorId": "144549028", "name": "L. Waldron"}, {"authorId": "47429813", "name": "N. Segata"}]}, {"paperId": "665e0de518a80cfcf8c8b0e051f8e0823ca647c0", "url": "https://www.semanticscholar.org/paper/665e0de518a80cfcf8c8b0e051f8e0823ca647c0", "title": "Accurate molecular polarizabilities with coupled cluster theory and machine learning", "abstract": "Significance The dipole polarizability of molecules and materials is central to several physical phenomena, modeling techniques, and the interpretation of many experiments. Its accurate evaluation from first principles requires quantum chemistry methods that are often too demanding for routine use. The highly accurate calculations reported herein provide a much-needed benchmark of the accuracy of hybrid density functional theory (DFT) as well as training data for a machine-learning model that can predict the polarizability tensor with an error that is about 50% smaller than DFT. This framework provides an accurate, inexpensive, and transferable strategy for estimating the polarizabilities of molecules containing dozens of atoms, and therefore removes a considerable obstacle to accurate and reliable atomistic-based modeling of matter. The molecular dipole polarizability describes the tendency of a molecule to change its dipole moment in response to an applied electric field. This quantity governs key intra- and intermolecular interactions, such as induction and dispersion; plays a vital role in determining the spectroscopic signatures of molecules; and is an essential ingredient in polarizable force fields. Compared with other ground-state properties, an accurate prediction of the molecular polarizability is considerably more difficult, as this response quantity is quite sensitive to the underlying electronic structure description. In this work, we present highly accurate quantum mechanical calculations of the static dipole polarizability tensors of 7,211 small organic molecules computed using linear response coupled cluster singles and doubles theory (LR-CCSD). Using a symmetry-adapted machine-learning approach, we demonstrate that it is possible to predict the LR-CCSD molecular polarizabilities of these small molecules with an error that is an order of magnitude smaller than that of hybrid density functional theory (DFT) at a negligible computational cost. The resultant model is robust and transferable, yielding molecular polarizabilities for a diverse set of 52 larger molecules (including challenging conjugated systems, carbohydrates, small drugs, amino acids, nucleobases, and hydrocarbon isomers) at an accuracy that exceeds that of hybrid DFT. The atom-centered decomposition implicit in our machine-learning approach offers some insight into the shortcomings of DFT in the prediction of this fundamental quantity of interest.", "year": 2018, "referenceCount": 65, "citationCount": 95, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Physics"], "authors": [{"authorId": "6287077", "name": "D. Wilkins"}, {"authorId": "3371253", "name": "Andrea Grisafi"}, {"authorId": "2152919397", "name": "Yang Yang"}, {"authorId": "6380715", "name": "K. Lao"}, {"authorId": "2097280402", "name": "Robert A. DiStasio"}, {"authorId": "1917770", "name": "M. Ceriotti"}]}, {"paperId": "c86f3129a739c055f39f7e51bfa9ce43c790dec6", "url": "https://www.semanticscholar.org/paper/c86f3129a739c055f39f7e51bfa9ce43c790dec6", "title": "Screening for Prediabetes Using Machine Learning Models", "abstract": "The global prevalence of diabetes is rapidly increasing. Studies support the necessity of screening and interventions for prediabetes, which could result in serious complications and diabetes. This study aimed at developing an intelligence-based screening model for prediabetes. Data from the Korean National Health and Nutrition Examination Survey (KNHANES) were used, excluding subjects with diabetes. The KNHANES 2010 data (n = 4685) were used for training and internal validation, while data from KNHANES 2011 (n = 4566) were used for external validation. We developed two models to screen for prediabetes using an artificial neural network (ANN) and support vector machine (SVM) and performed a systematic evaluation of the models using internal and external validation. We compared the performance of our models with that of a screening score model based on logistic regression analysis for prediabetes that had been developed previously. The SVM model showed the areas under the curve of 0.731 in the external datasets, which is higher than those of the ANN model (0.729) and the screening score model (0.712), respectively. The prescreening methods developed in this study performed better than the screening score model that had been developed previously and may be more effective method for prediabetes screening.", "year": 2014, "referenceCount": 53, "citationCount": 67, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "3268580", "name": "Soo Beom Choi"}, {"authorId": "2152201929", "name": "W. Kim"}, {"authorId": "2222183", "name": "T. Yoo"}, {"authorId": "2952569", "name": "J. Park"}, {"authorId": "2339797", "name": "Jai Won Chung"}, {"authorId": "7857253", "name": "Yong‐ho Lee"}, {"authorId": "2064464215", "name": "Eun Seok Kang"}, {"authorId": "1390822898", "name": "Deok Won Kim"}]}, {"paperId": "d1b5a6f7b908b34105fea8ce302a03a840ee3496", "url": "https://www.semanticscholar.org/paper/d1b5a6f7b908b34105fea8ce302a03a840ee3496", "title": "Variational Inference for Latent Variables and Uncertain Inputs in Gaussian Processes", "abstract": "The Gaussian process latent variable model (GP-LVM) provides a flexible approach for non-linear dimensionality reduction that has been widely applied. However, the current approach for training GP-LVMs is based on maximum likelihood, where the latent projection variables are maximised over rather than integrated out. In this paper we present a Bayesian method for training GP-LVMs by introducing a non-standard variational inference framework that allows to approximately integrate out the latent variables and subsequently train a GP-LVM by maximising an analytic lower bound on the exact marginal likelihood. We apply this method for learning a GP-LVM from i.i.d. observations and for learning non-linear dynamical systems where the observations are temporally correlated. We show that a benefit of the variational Bayesian procedure is its robustness to overfitting and its ability to automatically select the dimensionality of the non-linear latent space. The resulting framework is generic, flexible and easy to extend for other purposes, such as Gaussian process regression with uncertain or partially missing inputs. We demonstrate our method on synthetic data and standard machine learning benchmarks, as well as challenging real world datasets, including high resolution video data.", "year": 2016, "referenceCount": 85, "citationCount": 124, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "3106771", "name": "A. Damianou"}, {"authorId": "1722732", "name": "M. Titsias"}, {"authorId": "145306271", "name": "Neil D. Lawrence"}]}, {"paperId": "4db4f1af1b94fbd5defa0fa0010fdc449dd1e96c", "url": "https://www.semanticscholar.org/paper/4db4f1af1b94fbd5defa0fa0010fdc449dd1e96c", "title": "Learning Heuristics for the TSP by Policy Gradient", "abstract": null, "year": 2018, "referenceCount": 24, "citationCount": 169, "influentialCitationCount": 27, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46213987", "name": "Michel Deudon"}, {"authorId": "46253275", "name": "Pierre Cournut"}, {"authorId": "8651990", "name": "Alexandre Lacoste"}, {"authorId": "2070610", "name": "Y. Adulyasak"}, {"authorId": "2719301", "name": "Louis-Martin Rousseau"}]}, {"paperId": "6c2c04c7ae9158311da6b1eee99a7edfed213460", "url": "https://www.semanticscholar.org/paper/6c2c04c7ae9158311da6b1eee99a7edfed213460", "title": "The acquisition of syntactic knowledge", "abstract": "This landmark work in computational linguistics is of great importance both theoretically and practically because it shows that much of English grammar can be learned by a simple program.The Acquisition of Syntactic Knowledge investigates the central questions of human and machine cognition: How do people learn language? How can we get a machine to learn language? It first presents an explicit computational model of language acquisition which can actually learn rules of English syntax given a sequence of grammatical, but otherwise unprepared, sentences.It shows that natural languages are designed to be easily learned and easily processed-an exciting breakthrough from the point of view of artificial intelligence and the design of expert systems because it shows how extensive knowledge might be acquired automatically, without outside intervention. Computationally, the book demonstrates how constraints that may be reasonably assumed to aid sentence processing also aid language acquisition.Chapters in the book's second part apply computational methods to the general problem of developmental growth, particularly the thorny problem of the interaction between innate genetic endowment and environmental input, with the intent of uncovering the constraints on the acquisition of syntactic knowledge. A number of \"mini-theories\" of learning are incorporated in this study of syntax with results that should appeal to a wide range of scholarly interests. These include how lexical categories, phonological rule systems, and phrase structure rules are learned; the role of semantic-syntactic interaction in language acquisition; how a \"parameter setting\" model may be formalized as a learning procedure; how multiple constraints (from syntax, thematic knowledge, or phrase structure) interact to aid acquisition; how transformational-type rules may be learned; and, the role of lexical ambiguity in language acquisition.Robert Berwick is an assistant professor in the Department of Electrical Engineering and Computer Science at MIT. The Acquisition of Syntactic Knowledge is sixteenth in the Artificial Intelligence Series, edited by Patrick Winston and Michael Brady.", "year": 1985, "referenceCount": 4, "citationCount": 767, "influentialCitationCount": 54, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3086368", "name": "R. Berwick"}]}, {"paperId": "b2904c7b2c0ceab4e78ec93b20aafb9d67242f8a", "url": "https://www.semanticscholar.org/paper/b2904c7b2c0ceab4e78ec93b20aafb9d67242f8a", "title": "3D Human Pose Machines with Self-Supervised Learning", "abstract": "Driven by recent computer vision and robotic applications, recovering 3D human poses has become increasingly important and attracted growing interests. In fact, completing this task is quite challenging due to the diverse appearances, viewpoints, occlusions and inherently geometric ambiguities inside monocular images. Most of the existing methods focus on designing some elaborate priors /constraints to directly regress 3D human poses based on the corresponding 2D human pose-aware features or 2D pose predictions. However, due to the insufficient 3D pose data for training and the domain gap between 2D space and 3D space, these methods have limited scalabilities for all practical scenarios (e.g., outdoor scene). Attempt to address this issue, this paper proposes a simple yet effective self-supervised correction mechanism to learn all intrinsic structures of human poses from abundant images. Specifically, the proposed mechanism involves two dual learning tasks, i.e., the 2D-to-3D pose transformation and 3D-to-2D pose projection, to serve as a bridge between 3D and 2D human poses in a type of “free” self-supervision for accurate 3D human pose estimation. The 2D-to-3D pose implies to sequentially regress intermediate 3D poses by transforming the pose representation from the 2D domain to the 3D domain under the sequence-dependent temporal context, while the 3D-to-2D pose projection contributes to refining the intermediate 3D poses by maintaining geometric consistency between the 2D projections of 3D poses and the estimated 2D poses. Therefore, these two dual learning tasks enable our model to adaptively learn from 3D human pose data and external large-scale 2D human pose data. We further apply our self-supervised correction mechanism to develop a 3D human pose machine, which jointly integrates the 2D spatial relationship, temporal smoothness of predictions and 3D geometric knowledge. Extensive evaluations on the Human3.6M and HumanEva-I benchmarks demonstrate the superior performance and efficiency of our framework over all the compared competing methods.", "year": 2019, "referenceCount": 62, "citationCount": 50, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "3170394", "name": "Keze Wang"}, {"authorId": "1737218", "name": "Liang Lin"}, {"authorId": "19217972", "name": "Chenhan Jiang"}, {"authorId": "2005026919", "name": "C. Qian"}, {"authorId": "145402398", "name": "Pengxu Wei"}]}, {"paperId": "c8ffe876bfbe85231b236a9af35ad7a2d2ccfcef", "url": "https://www.semanticscholar.org/paper/c8ffe876bfbe85231b236a9af35ad7a2d2ccfcef", "title": "Structured labeling for facilitating concept evolution in machine learning", "abstract": "Labeling data is a seemingly simple task required for training many machine learning systems, but is actually fraught with problems. This paper introduces the notion of concept evolution, the changing nature of a person's underlying concept (the abstract notion of the target class a person is labeling for, e.g., spam email, travel related web pages) which can result in inconsistent labels and thus be detrimental to machine learning. We introduce two structured labeling solutions, a novel technique we propose for helping people define and refine their concept in a consistent manner as they label. Through a series of five experiments, including a controlled lab study, we illustrate the impact and dynamics of concept evolution in practice and show that structured labeling helps people label more consistently in the presence of concept evolution than traditional labeling.", "year": 2014, "referenceCount": 47, "citationCount": 94, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1847827", "name": "T. Kulesza"}, {"authorId": "1719124", "name": "Saleema Amershi"}, {"authorId": "145727186", "name": "R. Caruana"}, {"authorId": "2243968", "name": "Danyel Fisher"}, {"authorId": "36730993", "name": "Denis Xavier Charles"}]}, {"paperId": "fec18520144b8707a5e4cbbad00e5b63caabfbf3", "url": "https://www.semanticscholar.org/paper/fec18520144b8707a5e4cbbad00e5b63caabfbf3", "title": "A tutorial on conformal prediction", "abstract": "Conformal prediction uses past experience to determine precise levels of confidence in new predictions. Given an error probability e, together with a method that makes a prediction ŷ of a label y, it produces a set of labels, typically containing ŷ, that also contains y with probability 1 \u0096 e. Conformal prediction can be applied to any method for producing ŷ: a nearest-neighbor method, a support-vector machine, ridge regression, etc. \n \nConformal prediction is designed for an on-line setting in which labels are predicted successively, each one being revealed before the next is predicted. The most novel and valuable feature of conformal prediction is that if the successive examples are sampled independently from the same distribution, then the successive predictions will be right 1 \u0096 e of the time, even though they are based on an accumulating data set rather than on independent data sets. \n \nIn addition to the model under which successive examples are sampled independently, other on-line compression models can also use conformal prediction. The widely used Gaussian linear model is one of these. \n \nThis tutorial presents a self-contained account of the theory of conformal prediction and works through several numerical examples. A more comprehensive treatment of the topic is provided in Algorithmic Learning in a Random World, by Vladimir Vovk, Alex Gammerman, and Glenn Shafer (Springer, 2005).", "year": 2007, "referenceCount": 36, "citationCount": 565, "influentialCitationCount": 62, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145500409", "name": "G. Shafer"}, {"authorId": "145675281", "name": "V. Vovk"}]}, {"paperId": "45a56bda00a6842a62eea44da86802d98ceee511", "url": "https://www.semanticscholar.org/paper/45a56bda00a6842a62eea44da86802d98ceee511", "title": "Universal Approximation with Convex Optimization: Gimmick or Reality? [Discussion Forum]", "abstract": "This paper surveys in a tutorial fashion the recent history of universal learning machines starting with the multilayer perceptron. The big push in recent years has been on the design of universal learning machines using optimization methods linear in the parameters, such as the Echo State Network, the Extreme Learning Machine and the Kernel Adaptive filter. We call this class of learning machines convex universal learning machines or CULMs. The purpose of the paper is to compare the methods behind these CULMs, highlighting their features using concepts of vector spaces (i.e. basis functions and projections), which are easy to understand by the computational intelligence community. We illustrate how two of the CULMs behave in a simple example, and we conclude that indeed it is practical to create universal mappers with convex adaptation, which is an improvement over backpropagation.", "year": 2015, "referenceCount": 65, "citationCount": 55, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143961030", "name": "J. Príncipe"}, {"authorId": "2108424611", "name": "Badong Chen"}]}, {"paperId": "336c0a9b0988e2279552b2ba513418e2c231df6b", "url": "https://www.semanticscholar.org/paper/336c0a9b0988e2279552b2ba513418e2c231df6b", "title": "DeepLoc: prediction of protein subcellular localization using deep learning", "abstract": "Motivation The prediction of eukaryotic protein subcellular localization is a well‐studied topic in bioinformatics due to its relevance in proteomics research. Many machine learning methods have been successfully applied in this task, but in most of them, predictions rely on annotation of homologues from knowledge databases. For novel proteins where no annotated homologues exist, and for predicting the effects of sequence variants, it is desirable to have methods for predicting protein properties from sequence information only. Results Here, we present a prediction algorithm using deep neural networks to predict protein subcellular localization relying only on sequence information. At its core, the prediction model uses a recurrent neural network that processes the entire protein sequence and an attention mechanism identifying protein regions important for the subcellular localization. The model was trained and tested on a protein dataset extracted from one of the latest UniProt releases, in which experimentally annotated proteins follow more stringent criteria than previously. We demonstrate that our model achieves a good accuracy (78% for 10 categories; 92% for membrane‐bound or soluble), outperforming current state‐of‐the‐art algorithms, including those relying on homology information. Availability and implementation The method is available as a web server at http://www.cbs.dtu.dk/services/DeepLoc. Example code is available at https://github.com/JJAlmagro/subcellular_localization. The dataset is available at http://www.cbs.dtu.dk/services/DeepLoc/data.php. Contact jjalma@dtu.dk", "year": 2017, "referenceCount": 31, "citationCount": 615, "influentialCitationCount": 46, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "6573842", "name": "J. J. A. Armenteros"}, {"authorId": "1402816540", "name": "C. Sønderby"}, {"authorId": "1388358166", "name": "Søren Kaae Sønderby"}, {"authorId": "145416108", "name": "H. Nielsen"}, {"authorId": "1724252", "name": "O. Winther"}]}, {"paperId": "c21d790ea956b65faa026301079138644fb756d4", "url": "https://www.semanticscholar.org/paper/c21d790ea956b65faa026301079138644fb756d4", "title": "Defying the gravity of learning curve: a characteristic of nearest neighbour anomaly detectors", "abstract": null, "year": 2016, "referenceCount": 25, "citationCount": 33, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "35212893", "name": "K. Ting"}, {"authorId": "1704749", "name": "T. Washio"}, {"authorId": "16243802", "name": "Jonathan R. Wells"}, {"authorId": "1694176", "name": "Sunil Aryal"}]}, {"paperId": "e0a9287d3004e95b36630476faab72c18684d731", "url": "https://www.semanticscholar.org/paper/e0a9287d3004e95b36630476faab72c18684d731", "title": "On neurobiological, neuro-fuzzy, machine learning, and statistical pattern recognition techniques", "abstract": "In this paper, we propose two new neuro-fuzzy schemes, one for classification and one for clustering problems. The classification scheme is based on Simpson's fuzzy min-max method (1992, 1993) and relaxes some assumptions he makes. This enables our scheme to handle mutually nonexclusive classes. The neuro-fuzzy clustering scheme is a multiresolution algorithm that is modeled after the mechanics of human pattern recognition. We also present data from an exhaustive comparison of these techniques with neural, statistical, machine learning, and other traditional approaches to pattern recognition applications. The data sets used for comparisons include those from the machine learning repository at the University of California, Irvine. We find that our proposed schemes compare quite well with the existing techniques, and in addition offer the advantages of one-pass learning and online adaptation.", "year": 1997, "referenceCount": 80, "citationCount": 86, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "145029954", "name": "A. Joshi"}, {"authorId": "3118728", "name": "Narendran Ramakrishman"}, {"authorId": "1682549", "name": "E. Houstis"}, {"authorId": "34227915", "name": "Purdue R. Rice"}]}, {"paperId": "b60c01a144bce0eb0a3a7411ae4a74ab5ad4bcb3", "url": "https://www.semanticscholar.org/paper/b60c01a144bce0eb0a3a7411ae4a74ab5ad4bcb3", "title": "Development of Concrete Bridge Rating Prototype Expert System with Machine Learning", "abstract": "Efforts to develop practical expert systems have mostly concentrated on how to implement experience-based machine learning successfully. Recently several active research projects on machine learning have been undertaken from the viewpoint of knowledge-based management. The aim of this study is to develop the Concrete Bridge Rating (Diagnosis) Prototype Expert System with machine learning, employing the combination of a neural network and bidirectional associative memories (BAM). The introduction of machine learning into this system facilitates knowledge-based refinement. By applying the system to an actual in-service bridge, it has been verified that the machine learning method employed that uses the results of questionnaire surveys involving bridge experts is effective for the system.", "year": 1997, "referenceCount": 9, "citationCount": 41, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "3241094", "name": "M. Kushida"}, {"authorId": "3331799", "name": "A. Miyamoto"}, {"authorId": "2061220107", "name": "Kazuya Kinoshita"}]}, {"paperId": "12f0a5268975d535761d99819856992f7021780b", "url": "https://www.semanticscholar.org/paper/12f0a5268975d535761d99819856992f7021780b", "title": "Transcend: Detecting Concept Drift in Malware Classification Models", "abstract": "Building machine learning models of malware behavior is widely accepted as a panacea towards effective malware classification. A crucial requirement for building sustainable learning models, though, is to train on a wide variety of malware samples. Unfortunately, malware evolves rapidly and it thus becomes hard—if not impossible—to generalize learning models to reflect future, previously-unseen behaviors. Consequently, most malware classifiers become unsustainable in the long run, becoming rapidly antiquated as malware continues to evolve. In this work, we propose Transcend, a framework to identify aging classification models in vivo during deployment, much before the machine learning model’s performance starts to degrade. This is a significant departure from conventional approaches that retrain aging models retrospectively when poor performance is observed. Our approach uses a statistical comparison of samples seen during deployment with those used to train the model, thereby building metrics for prediction quality. We show how Transcend can be used to identify concept drift based on two separate case studies on Android andWindows malware, raising a red flag before the model starts making consistently poor decisions due to out-of-date training.", "year": 2017, "referenceCount": 24, "citationCount": 168, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2329376", "name": "Roberto Jordaney"}, {"authorId": "145619083", "name": "K. Sharad"}, {"authorId": "2204534", "name": "Santanu Kumar Dash"}, {"authorId": "47197423", "name": "Zhi Wang"}, {"authorId": "40349808", "name": "D. Papini"}, {"authorId": "1796115", "name": "I. Nouretdinov"}, {"authorId": "2189170", "name": "L. Cavallaro"}]}, {"paperId": "7ea9c3c042b0e3423a2110cddbe7926f8b661bfd", "url": "https://www.semanticscholar.org/paper/7ea9c3c042b0e3423a2110cddbe7926f8b661bfd", "title": "Two supervised learning approaches for name disambiguation in author citations", "abstract": "Due to name abbreviations, identical names, name misspellings, and pseudonyms in publications or bibliographies (citations), an author may have multiple names and multiple authors may share the same name. Such name ambiguity affects the performance of document retrieval, Web search, database integration, and may cause improper attribution to authors. We investigate two supervised learning approaches to disambiguate authors in the citations. One approach uses the naive Bayes probability model, a generative model; the other uses support vector machines (SVMs) [V. Vapnik (1995)] and the vector space representation of citations, a discriminative model. Both approaches utilize three types of citation attributes: coauthor names, the title of the paper, and the title of the journal or proceeding. We illustrate these two approaches on two types of data, one collected from the Web, mainly publication lists from homepages, the other collected from the DBLP citation databases.", "year": 2004, "referenceCount": 52, "citationCount": 388, "influentialCitationCount": 44, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144910499", "name": "Hui Han"}, {"authorId": "145157784", "name": "C. Lee Giles"}, {"authorId": "145203884", "name": "H. Zha"}, {"authorId": "2168863006", "name": "Cheng Li"}, {"authorId": "1731462", "name": "Kostas Tsioutsiouliklis"}]}, {"paperId": "39a2213edfe830139e338957edc9dd501e478013", "url": "https://www.semanticscholar.org/paper/39a2213edfe830139e338957edc9dd501e478013", "title": "Machine learning and big data analytics in bipolar disorder: A position paper from the International Society for Bipolar Disorders Big Data Task Force", "abstract": "The International Society for Bipolar Disorders Big Data Task Force assembled leading researchers in the field of bipolar disorder (BD), machine learning, and big data with extensive experience to evaluate the rationale of machine learning and big data analytics strategies for BD.", "year": 2019, "referenceCount": 146, "citationCount": 57, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "6726432", "name": "I. Passos"}, {"authorId": "1404475067", "name": "P. Ballester"}, {"authorId": "1394833592", "name": "Rodrigo C. Barros"}, {"authorId": "1400579984", "name": "D. Librenza-Garcia"}, {"authorId": "145321317", "name": "B. Mwangi"}, {"authorId": "2071277728", "name": "B. Birmaher"}, {"authorId": "4374437", "name": "E. Brietzke"}, {"authorId": "2421793", "name": "T. Hajek"}, {"authorId": "14009475", "name": "C. L. López Jaramillo"}, {"authorId": "4291984", "name": "R. Mansur"}, {"authorId": "145779969", "name": "M. Alda"}, {"authorId": "2454765", "name": "B. Haarman"}, {"authorId": "8473133", "name": "E. Isometsa"}, {"authorId": "145628926", "name": "R. Lam"}, {"authorId": "8030249", "name": "R. McIntyre"}, {"authorId": "2356244", "name": "L. Minuzzi"}, {"authorId": "2915804", "name": "L. Kessing"}, {"authorId": "4378601", "name": "L. Yatham"}, {"authorId": "144295169", "name": "A. Duffy"}, {"authorId": "145688648", "name": "F. Kapczinski"}]}, {"paperId": "4f9ab6d7f5f6ffe32995bcdd9112ae52a93d4bb5", "url": "https://www.semanticscholar.org/paper/4f9ab6d7f5f6ffe32995bcdd9112ae52a93d4bb5", "title": "Learning search control knowledge: An explanation-based approach", "abstract": null, "year": 1991, "referenceCount": 28, "citationCount": 59, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1403909670", "name": "Roland Zito-Wolf"}]}, {"paperId": "bdcab784aeb123bde9428e1c5f9656370b82d0cb", "url": "https://www.semanticscholar.org/paper/bdcab784aeb123bde9428e1c5f9656370b82d0cb", "title": "OIL PRICE PREDICTORS: MACHINE LEARNING APPROACH", "abstract": "The paper proposes a machine-learning approach to predict oil price. Market participants can forecast prices using such factors as: US key rate, US dollar index, S and P500 index, Volatility index, US consumer price index. After analyzing the results and comparing the accuracy of the model first, we can conclude that oil prices in 2019-2022 will have a slight upward trend and will generally be stable. At the time of the fall in June 2012 the price of Brent fell to a minimum of 17 months. The reason for this was the weak demand for oil futures, which was caused by poor data on the state of the US labor market.", "year": 2019, "referenceCount": 27, "citationCount": 60, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "2613255", "name": "Jaehyung An"}, {"authorId": "3886903", "name": "A. Mikhaylov"}, {"authorId": "2076654905", "name": "N. Moiseev"}]}, {"paperId": "fd6e4d74b8df1eed41a0915c5d760fe3cfa58278", "url": "https://www.semanticscholar.org/paper/fd6e4d74b8df1eed41a0915c5d760fe3cfa58278", "title": "Systematic Evaluation of Privacy Risks of Machine Learning Models", "abstract": "Machine learning models are prone to memorizing sensitive data, making them vulnerable to membership inference attacks in which an adversary aims to guess if an input sample was used to train the model. In this paper, we show that prior work on membership inference attacks may severely underestimate the privacy risks by relying solely on training custom neural network classifiers to perform attacks and focusing only on the aggregate results over data samples, such as the attack accuracy. To overcome these limitations, we first propose to benchmark membership inference privacy risks by improving existing non-neural network based inference attacks and proposing a new inference attack method based on a modification of prediction entropy. We also propose benchmarks for defense mechanisms by accounting for adaptive adversaries with knowledge of the defense and also accounting for the trade-off between model accuracy and privacy risks. Using our benchmark attacks, we demonstrate that existing defense approaches are not as effective as previously reported. \nNext, we introduce a new approach for fine-grained privacy analysis by formulating and deriving a new metric called the privacy risk score. Our privacy risk score metric measures an individual sample's likelihood of being a training member, which allows an adversary to perform membership inference attacks with high confidence. We experimentally validate the effectiveness of the privacy risk score metric and demonstrate that the distribution of the privacy risk score across individual samples is heterogeneous. Finally, we perform an in-depth investigation for understanding why certain samples have high privacy risk scores, including correlations with model sensitivity, generalization error, and feature embeddings. Our work emphasizes the importance of a systematic and rigorous evaluation of privacy risks of machine learning models.", "year": 2020, "referenceCount": 61, "citationCount": 99, "influentialCitationCount": 26, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "144173853", "name": "Liwei Song"}, {"authorId": "143615345", "name": "Prateek Mittal"}]}, {"paperId": "d881016c6c327d022b43beb1e5e30522bfedf5b8", "url": "https://www.semanticscholar.org/paper/d881016c6c327d022b43beb1e5e30522bfedf5b8", "title": "On Machine Learning Methods for Chinese Document Categorization", "abstract": null, "year": 2003, "referenceCount": 26, "citationCount": 74, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109546112", "name": "Ji He"}, {"authorId": "144362750", "name": "A. Tan"}, {"authorId": "1679749", "name": "C. Tan"}]}, {"paperId": "6837b4ea2c242fa86099fb752e760760a3155d17", "url": "https://www.semanticscholar.org/paper/6837b4ea2c242fa86099fb752e760760a3155d17", "title": "A contemporary review of machine learning in otolaryngology–head and neck surgery", "abstract": "One of the key challenges with big data is leveraging the complex network of information to yield useful clinical insights. The confluence of massive amounts of health data and a desire to make inferences and insights on these data has produced a substantial amount of interest in machine‐learning analytic methods. There has been a drastic increase in the otolaryngology literature volume describing novel applications of machine learning within the past 5 years. In this timely contemporary review, we provide an overview of popular machine‐learning techniques, and review recent machine‐learning applications in otolaryngology–head and neck surgery including neurotology, head and neck oncology, laryngology, and rhinology. Investigators have realized significant success in validated models with model sensitivities and specificities approaching 100%. Challenges remain in the implementation of machine‐learning algorithms. This may be in part the unfamiliarity of these techniques to clinician leaders on the front lines of patient care. Spreading awareness and confidence in machine learning will follow with further validation and proof‐of‐value analyses that demonstrate model performance superiority over established methods. We are poised to see a greater influx of machine‐learning applications to clinical problems in otolaryngology–head and neck surgery, and it is prudent for providers to understand the potential benefits and limitations of these technologies. Laryngoscope, 130:45–51, 2020", "year": 2020, "referenceCount": 42, "citationCount": 43, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2980995", "name": "Matthew G. Crowson"}, {"authorId": "30966735", "name": "Jonathan Ranisau"}, {"authorId": "5840004", "name": "A. Eskander"}, {"authorId": "47617780", "name": "A. Babier"}, {"authorId": "2113743892", "name": "Bin Xu"}, {"authorId": "2205954", "name": "R. Kahmke"}, {"authorId": "2108263959", "name": "Joseph M. Chen"}, {"authorId": "40362741", "name": "T. Chan"}]}, {"paperId": "37ffc25bc4d839a6c414362a51e8a11ce8df75a8", "url": "https://www.semanticscholar.org/paper/37ffc25bc4d839a6c414362a51e8a11ce8df75a8", "title": "A support vector machine approach to credit scoring", "abstract": "Driven by the need to allocate capital in a profitable way and by the recently suggested Basel II regulations, financial institutions are being more and more obliged to build credit scoring models assessing the risk of default of their clients. Many techniques have been suggested to tackle this problem. Support Vector Machines (SVMs) is a promising new technique that has recently emanated from different domains such as applied statistics, neural networks and machine learning. In this paper, we experiment with least squares support vector machines (LS-SVMs), a recently modified version of SVMs, and report significantly better results when contrasted with the classical techniques.", "year": 2003, "referenceCount": 14, "citationCount": 116, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Economics"], "authors": [{"authorId": "1738575", "name": "T. V. Gestel"}, {"authorId": "1720683", "name": "B. Baesens"}, {"authorId": "2414491", "name": "J. Garcia"}, {"authorId": "2016261", "name": "P. V. Dijcke"}]}, {"paperId": "214bb2e60990ee1c8f396a0f29a93af187f951c2", "url": "https://www.semanticscholar.org/paper/214bb2e60990ee1c8f396a0f29a93af187f951c2", "title": "The Value of Collaboration in Convex Machine Learning with Differential Privacy", "abstract": "In this paper, we apply machine learning to distributed private data owned by multiple data owners, entities with access to non-overlapping training datasets. We use noisy, differentially-private gradients to minimize the fitness cost of the machine learning model using stochastic gradient descent. We quantify the quality of the trained model, using the fitness cost, as a function of privacy budget and size of the distributed datasets to capture the trade-off between privacy and utility in machine learning. This way, we can predict the outcome of collaboration among privacy-aware data owners prior to executing potentially computationally-expensive machine learning algorithms. Particularly, we show that the difference between the fitness of the trained machine learning model using differentially-private gradient queries and the fitness of the trained machine model in the absence of any privacy concerns is inversely proportional to the size of the training datasets squared and the privacy budget squared. We successfully validate the performance prediction with the actual performance of the proposed privacy-aware learning algorithms, applied to: financial datasets for determining interest rates of loans using regression; and detecting credit card frauds using support vector machines.", "year": 2019, "referenceCount": 35, "citationCount": 44, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2068343830", "name": "Nan Wu"}, {"authorId": "145788331", "name": "Farhad Farokhi"}, {"authorId": "2153149908", "name": "David B. Smith"}, {"authorId": "1708760", "name": "M. Kâafar"}]}, {"paperId": "831682a23727fdc4b343cf28dc41fc8842ad2314", "url": "https://www.semanticscholar.org/paper/831682a23727fdc4b343cf28dc41fc8842ad2314", "title": "Applications of inductive logic programming", "abstract": "Techniques of machine learning have been successfully applied to various problems [1, 12]. Most of these applications rely on attribute-based learning, exemplified by the induction of decision trees as in the program C4.5 [20]. Broadly speaking, attribute-based learning also includes such approaches to learning as neural networks and nearest neighbor techniques. The advantages of attribute-based learning are: relative simplicity, efficiency, and existence of effective techniques for handling noisy data. However, attribute-based learning is limited to non-relational descriptions of objects in the sense that the learned descriptions do not specify relations among the objects' parts. Attribute-based learning thus has two strong limitations:the background knowledge can be expressed in rather limited form, and\nthe lack of relations makes the concept description language inappropriate for some domains.\n", "year": 1995, "referenceCount": 78, "citationCount": 143, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1725040", "name": "I. Bratko"}, {"authorId": "33654217", "name": "R. King"}]}, {"paperId": "f76757cb35e45b06fb585ca65372e0ff99d2aea3", "url": "https://www.semanticscholar.org/paper/f76757cb35e45b06fb585ca65372e0ff99d2aea3", "title": "A survey on the state-of-the-art machine learning models in the context of NLP", "abstract": "Machine learning and Statistical techniques are powerful analysis tools yet to be incorporated in the new multidisciplinary field diversely termed as natural language processing (NLP) or computational linguistic. The linguistic knowledge may be ambiguous or contains ambiguity; therefore, various NLP tasks are carried out in order to resolve the ambiguity in speech and language processing.The current prevailing techniques for addressing various NLP tasks as a supervised learning are hidden Markov models (HMM), conditional random field (CRF), maximum entropy models (MaxEnt), support vector machines (SVM), Naive Bays, and deep learning (DL).The goal of this survey paper is to highlight ambiguity in speech and language processing, to provide brief overview of basic categories of linguistic knowledge, to discuss different existing machine learning models and their classification into different categories and finally to provide a comprehensive review of different state of the art machine learning models with the goal that new researchers look into these techniques and depending on these, develops advance techniques. In this survey we reviewed how avantgrademachine learning models can help in this dilemma.", "year": 2016, "referenceCount": 69, "citationCount": 60, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50057811", "name": "Wahab Khan"}, {"authorId": "40247823", "name": "Ali Daud"}, {"authorId": "49142053", "name": "J. Nasir"}, {"authorId": "1742471", "name": "Tehmina Amjad"}]}, {"paperId": "311624152e5e554b26954d284827f13d293028dc", "url": "https://www.semanticscholar.org/paper/311624152e5e554b26954d284827f13d293028dc", "title": "Incorporating Contextual Cues in Trainable Models for Coreference Resolution", "abstract": "We propose a method that incorporates various novel contextual cues into a machine learning for resolving coreference. Distinct characteristics of our model are (i) incorporating more linguistic features capturing contextual information that is more sophisticated than what is offered in Centering Theory, and (ii) a tournament model for selecting a referent. Our experiments show that this model significantly outperforms earlier machine learning approaches, such as Soon et al. (2001).", "year": 2003, "referenceCount": 31, "citationCount": 77, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "34611748", "name": "R. Iida"}, {"authorId": "3040648", "name": "Kentaro Inui"}, {"authorId": "36514372", "name": "Hiroya Takamura"}, {"authorId": "1681502", "name": "Yuji Matsumoto"}]}, {"paperId": "6d1f04cfa4e6eac26480f57cebb0a6d785793440", "url": "https://www.semanticscholar.org/paper/6d1f04cfa4e6eac26480f57cebb0a6d785793440", "title": "Machine Learning Line Bundle Cohomology", "abstract": "We investigate different approaches to machine learning of line bundle cohomology on complex surfaces as well as on Calabi‐Yau three‐folds. Standard function learning based on simple fully connected networks with logistic sigmoids is reviewed and its main features and shortcomings are discussed. It has been observed recently that line bundle cohomology can be described by dividing the Picard lattice into certain regions in each of which the cohomology dimension is described by a polynomial formula. Based on this structure, we set up a network capable of identifying the regions and their associated polynomials, thereby effectively generating a conjecture for the correct cohomology formula. For complex surfaces, we also set up a network which learns certain rigid divisors which appear in a recently discovered master formula for cohomology dimensions.", "year": 2019, "referenceCount": 35, "citationCount": 44, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics"], "authors": [{"authorId": "144548725", "name": "Callum R. Brodie"}, {"authorId": "87992492", "name": "A. Constantin"}, {"authorId": "104153693", "name": "R. Deen"}, {"authorId": "144879990", "name": "A. Lukas"}]}, {"paperId": "93e0179597f07d0a981ec87a042efce2dcd5c954", "url": "https://www.semanticscholar.org/paper/93e0179597f07d0a981ec87a042efce2dcd5c954", "title": "Predicting interfacial thermal resistance by machine learning", "abstract": null, "year": 2019, "referenceCount": 102, "citationCount": 58, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115679781", "name": "Yen‐Ju Wu"}, {"authorId": "144567627", "name": "Lei Fang"}, {"authorId": "153018856", "name": "Yibin Xu"}]}, {"paperId": "44583de19ecedbd0608db9bdb88ab526bc81204f", "url": "https://www.semanticscholar.org/paper/44583de19ecedbd0608db9bdb88ab526bc81204f", "title": "Adaptive Retrieval Agents: Internalizing Local Context and Scaling up to the Web", "abstract": null, "year": 2000, "referenceCount": 92, "citationCount": 178, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143653472", "name": "F. Menczer"}, {"authorId": "1682655", "name": "R. Belew"}]}, {"paperId": "6b99169ec76b44e13ffccc5d7a49ef1ee8f5a1c0", "url": "https://www.semanticscholar.org/paper/6b99169ec76b44e13ffccc5d7a49ef1ee8f5a1c0", "title": "Investigating How Experienced UX Designers Effectively Work with Machine Learning", "abstract": "Machine learning (ML) plays an increasingly important role in improving a user's experience. However, most UX practitioners face challenges in understanding ML's capabilities or envisioning what it might be. We interviewed 13 designers who had many years of experience designing the UX of ML-enhanced products and services. We probed them to characterize their practices. They shared they do not view themselves as ML experts, nor do they think learning more about ML would make them better designers. Instead, our participants appeared to be the most successful when they engaged in ongoing collaboration with data scientists to help envision what to make and when they embraced a data-centric culture. We discuss the implications of these findings in terms of UX education and as opportunities for additional design research in support of UX designers working with ML.", "year": 2018, "referenceCount": 40, "citationCount": 101, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2117860470", "name": "Qian Yang"}, {"authorId": "40602785", "name": "Alex Sciuto"}, {"authorId": "145308025", "name": "J. Zimmerman"}, {"authorId": "145174228", "name": "J. Forlizzi"}, {"authorId": "1792714", "name": "Aaron Steinfeld"}]}, {"paperId": "2daf5109b8587812da6b4d1de87daef3a1db595b", "url": "https://www.semanticscholar.org/paper/2daf5109b8587812da6b4d1de87daef3a1db595b", "title": "A Comparative Assessment Between Three Machine Learning Models and Their Performance Comparison by Bivariate and Multivariate Statistical Methods in Groundwater Potential Mapping", "abstract": null, "year": 2015, "referenceCount": 77, "citationCount": 168, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "2266626", "name": "Seyed Amir Naghibi"}, {"authorId": "2858616", "name": "H. Pourghasemi"}]}, {"paperId": "9d7761d1f6f41871898768c4a42369dbff87a370", "url": "https://www.semanticscholar.org/paper/9d7761d1f6f41871898768c4a42369dbff87a370", "title": "A survey on learning from data streams: current and future trends", "abstract": null, "year": 2012, "referenceCount": 62, "citationCount": 144, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143931014", "name": "João Gama"}]}, {"paperId": "cea2cf0a4305fd7dde80ba589349a8484374fc53", "url": "https://www.semanticscholar.org/paper/cea2cf0a4305fd7dde80ba589349a8484374fc53", "title": "Deep Learning for Tomato Diseases: Classification and Symptoms Visualization", "abstract": "ABSTRACT Several studies have invested in machine learning classifiers to protect plants from diseases by processing leaf images. Most of the proposed classifiers are trained and evaluated with small datasets, focusing on the extraction of hand-crafted features from image to classify the leaves. In this study, we have used a large dataset compared to the state-of-the art. Here, the dataset contains 14,828 images of tomato leaves infected with nine diseases. To train our classifier, we have introduced the Convolutional Neural Network (CNN) as a learning algorithm. One of the biggest advantages of CNN is the automatic extraction of features by processing directly the raw images. To analyze the proposed deep model, we have used visualization methods to understand symptoms and to localize disease regions in leaf. The obtained results are encouraging, reaching 99.18% of accuracy, which ourperforms dramatically shallow models, and they can be used as a practical tool for farmers to protect tomato against disease.", "year": 2017, "referenceCount": 28, "citationCount": 331, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "19306813", "name": "M. Brahimi"}, {"authorId": "3006590", "name": "K. Boukhalfa"}, {"authorId": "1719148", "name": "A. Moussaoui"}]}, {"paperId": "fc631a07be3d90571f2b29a71ecbb1abab0b76e8", "url": "https://www.semanticscholar.org/paper/fc631a07be3d90571f2b29a71ecbb1abab0b76e8", "title": "Migration and stopover in a small pelagic seabird, the Manx shearwater Puffinus puffinus: insights from machine learning", "abstract": "The migratory movements of seabirds (especially smaller species) remain poorly understood, despite their role as harvesters of marine ecosystems on a global scale and their potential as indicators of ocean health. Here we report a successful attempt, using miniature archival light loggers (geolocators), to elucidate the migratory behaviour of the Manx shearwater Puffinus puffinus, a small (400 g) Northern Hemisphere breeding procellariform that undertakes a trans-equatorial, trans-Atlantic migration. We provide details of over-wintering areas, of previously unobserved marine stopover behaviour, and the long-distance movements of females during their pre-laying exodus. Using salt-water immersion data from a subset of loggers, we introduce a method of behaviour classification based on Bayesian machine learning techniques. We used both supervised and unsupervised machine learning to classify each bird's daily activity based on simple properties of the immersion data. We show that robust activity states emerge, characteristic of summer feeding, winter feeding and active migration. These can be used to classify probable behaviour throughout the annual cycle, highlighting the likely functional significance of stopovers as refuelling stages.", "year": 2009, "referenceCount": 36, "citationCount": 241, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "116354588", "name": "T. Guilford"}, {"authorId": "47674434", "name": "J. Meade"}, {"authorId": "49738198", "name": "J. Willis"}, {"authorId": "35013053", "name": "R. Phillips"}, {"authorId": "145288444", "name": "D. Boyle"}, {"authorId": "2106886653", "name": "S. Roberts"}, {"authorId": "144787479", "name": "M. Collett"}, {"authorId": "144500047", "name": "R. Freeman"}, {"authorId": "4682082", "name": "C. Perrins"}]}, {"paperId": "4607e1fd2ad392e503f7e34fd80a5d40277e0048", "url": "https://www.semanticscholar.org/paper/4607e1fd2ad392e503f7e34fd80a5d40277e0048", "title": "Designing Contestability: Interaction Design, Machine Learning, and Mental Health", "abstract": "We describe the design of an automated assessment and training tool for psychotherapists to illustrate challenges with creating interactive machine learning (ML) systems, particularly in contexts where human life, livelihood, and wellbeing are at stake. We explore how existing theories of interaction design and machine learning apply to the psychotherapy context, and identify \"contestability\" as a new principle for designing systems that evaluate human behavior. Finally, we offer several strategies for making ML systems more accountable to human actors.", "year": 2017, "referenceCount": 36, "citationCount": 61, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Engineering"], "authors": [{"authorId": "35187446", "name": "Tad Hirsch"}, {"authorId": "17697412", "name": "Kritzia Merced"}, {"authorId": "145254843", "name": "Shrikanth S. Narayanan"}, {"authorId": "3170117", "name": "Zac E. Imel"}, {"authorId": "2863328", "name": "David C. Atkins"}]}, {"paperId": "858549b00245aadc92f91a2540f01398f5f389ae", "url": "https://www.semanticscholar.org/paper/858549b00245aadc92f91a2540f01398f5f389ae", "title": "A solution to the learning dilemma for recurrent networks of spiking neurons", "abstract": null, "year": 2019, "referenceCount": 139, "citationCount": 191, "influentialCitationCount": 33, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "3401407", "name": "G. Bellec"}, {"authorId": "65825675", "name": "Franz Scherr"}, {"authorId": "2259829", "name": "Anand Subramoney"}, {"authorId": "152713243", "name": "Elias Hajek"}, {"authorId": "40898078", "name": "Darjan Salaj"}, {"authorId": "2073142", "name": "R. Legenstein"}, {"authorId": "145247053", "name": "W. Maass"}]}, {"paperId": "a7e4d5b16deb11c942068a2341e34d214865181f", "url": "https://www.semanticscholar.org/paper/a7e4d5b16deb11c942068a2341e34d214865181f", "title": "Recurrent Neural Network Attention Mechanisms for Interpretable System Log Anomaly Detection", "abstract": "Deep learning has recently demonstrated state-of-the art performance on key tasks related to the maintenance of computer systems, such as intrusion detection, denial of service attack detection, hardware and software system failures, and malware detection. In these contexts, model interpretability is vital for administrator and analyst to trust and act on the automated analysis of machine learning models. Deep learning methods have been criticized as black box oracles which allow limited insight into decision factors. In this work we seek to bridge the gap between the impressive performance of deep learning models and the need for interpretable model introspection. To this end we present recurrent neural network (RNN) language models augmented with attention for anomaly detection in system logs. Our methods are generally applicable to any computer system and logging source. By incorporating attention variants into our RNN language models we create opportunities for model introspection and analysis without sacrificing state-of-the art performance. We demonstrate model performance and illustrate model interpretability on an intrusion detection task using the Los Alamos National Laboratory (LANL) cyber security dataset, reporting upward of 0.99 area under the receiver operator characteristic curve despite being trained only on a single day's worth of data.", "year": 2018, "referenceCount": 23, "citationCount": 123, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2111024153", "name": "Andy Brown"}, {"authorId": "9583852", "name": "Aaron Tuor"}, {"authorId": "144156036", "name": "Brian Hutchinson"}, {"authorId": "145416907", "name": "Nicole Nichols"}]}, {"paperId": "a5b4b34eab08f1995eecbd5f61dee7d65593529b", "url": "https://www.semanticscholar.org/paper/a5b4b34eab08f1995eecbd5f61dee7d65593529b", "title": "Reasoning Under Uncertainty: Towards Collaborative Interactive Machine Learning", "abstract": null, "year": 2016, "referenceCount": 88, "citationCount": 24, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2066498285", "name": "Sebastian Robert"}, {"authorId": "144172902", "name": "S. Büttner"}, {"authorId": "1735388", "name": "C. Röcker"}, {"authorId": "1749801", "name": "Andreas Holzinger"}]}, {"paperId": "2ec46fba5b9516db48284e9fc5ea06e18f322191", "url": "https://www.semanticscholar.org/paper/2ec46fba5b9516db48284e9fc5ea06e18f322191", "title": "A Review on Conventional Machine Learning vs Deep Learning", "abstract": "In now days, deep learning has become a prominent and emerging research area in computer vision applications. Deep learning permits the multiple layers models for computation to learn representations of data by processing in their original form while it is not possible in conventional machine learning. These methods surprisingly improved the accuracy of various image processing domains such as speech recognition, face recognition, object detection and in biomedical applications. Deep neural networks (DNN) such as convolutional neural network (CNN) provide tremendous results in processing of images and videos, while another approach of deep network i.e. recurrent neural network (RNN) gives better performance with sequential data such as text and speech.", "year": 2018, "referenceCount": 33, "citationCount": 53, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2057112556", "name": "Nitin Kumar Chauhan"}, {"authorId": "3078804", "name": "Krishnavir Singh"}]}, {"paperId": "db6ad6ded1cfa26fdc7437f27fb823ec533e96fe", "url": "https://www.semanticscholar.org/paper/db6ad6ded1cfa26fdc7437f27fb823ec533e96fe", "title": "Deep Learning: A Comprehensive Overview on Techniques, Taxonomy, Applications and Research Directions", "abstract": null, "year": 2021, "referenceCount": 177, "citationCount": 121, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3456687", "name": "I. Sarker"}]}, {"paperId": "d298f3e23aa2bafe4daade554b6300dc1a1d548e", "url": "https://www.semanticscholar.org/paper/d298f3e23aa2bafe4daade554b6300dc1a1d548e", "title": "JUNIPR: a framework for unsupervised machine learning in particle physics", "abstract": null, "year": 2018, "referenceCount": 75, "citationCount": 98, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics"], "authors": [{"authorId": "39552848", "name": "A. Andreassen"}, {"authorId": "10734982", "name": "Ilya Feige"}, {"authorId": "2064566025", "name": "C. Frye"}, {"authorId": "2063178", "name": "M. Schwartz"}]}, {"paperId": "61e06615f6cee5ed1ba7d22b801925b69a45653b", "url": "https://www.semanticscholar.org/paper/61e06615f6cee5ed1ba7d22b801925b69a45653b", "title": "The Values Encoded in Machine Learning Research", "abstract": "Machine learning currently exerts an outsized influence on the world, increasingly affecting institutional practices and impacted communities. It is therefore critical that we question vague conceptions of the field as value-neutral or universally beneficial, and investigate what specific values the field is advancing. In this paper, we first introduce a method and annotation scheme for studying the values encoded in documents such as research papers. Applying the scheme, we analyze 100 highly cited machine learning papers published at premier machine learning conferences, ICML and NeurIPS. We annotate key features of papers which reveal their values: their justification for their choice of project, which attributes of their project they uplift, their consideration of potential negative consequences, and their institutional affiliations and funding sources. We find that few of the papers justify how their project connects to a societal need (15%) and far fewer discuss negative potential (1%). Through line-by-line content analysis, we identify 59 values that are uplifted in ML research, and, of these, we find that the papers most frequently justify and assess themselves based on Performance, Generalization, Quantitative evidence, Efficiency, Building on past work, and Novelty. We present extensive textual evidence and identify key themes in the definitions and operationalization of these values. Notably, we find systematic textual evidence that these top values are being defined and applied with assumptions and implications generally supporting the centralization of power. Finally, we find increasingly close ties between these highly cited papers and tech companies and elite universities.", "year": 2021, "referenceCount": 183, "citationCount": 58, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8318698", "name": "A. Birhane"}, {"authorId": "13014201", "name": "Pratyusha Kalluri"}, {"authorId": "35540755", "name": "Dallas Card"}, {"authorId": "27377925", "name": "William Agnew"}, {"authorId": "1441101651", "name": "Ravit Dotan"}, {"authorId": "2115910347", "name": "Michelle Bao"}]}, {"paperId": "caca686e8a35f5aec63ec97c75d20e41693341fd", "url": "https://www.semanticscholar.org/paper/caca686e8a35f5aec63ec97c75d20e41693341fd", "title": "A Probabilistic Approach to WLAN User Location Estimation", "abstract": null, "year": 2002, "referenceCount": 35, "citationCount": 964, "influentialCitationCount": 76, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143952169", "name": "T. Roos"}, {"authorId": "143727307", "name": "Petri Myllymäki"}, {"authorId": "1834766", "name": "H. Tirri"}, {"authorId": "2465762", "name": "P. Misikangas"}, {"authorId": "50195627", "name": "Juha Sievänen"}]}, {"paperId": "ed3c5d481d28315618777fe82d0fa1b9a849d5bc", "url": "https://www.semanticscholar.org/paper/ed3c5d481d28315618777fe82d0fa1b9a849d5bc", "title": "Automated Cognitive Health Assessment Using Smart Home Monitoring of Complex Tasks", "abstract": "One of the many services that intelligent systems can provide is the automated assessment of resident well-being. We hypothesize that the functional health of individuals, or ability of individuals to perform activities independently without assistance, can be estimated by tracking their activities using smart home technologies. In this paper, we introduce a machine-learning-based method to assess activity quality in smart homes. To validate our approach, we quantify activity quality for 179 volunteer participants who performed a complex, interweaved set of activities in our smart home apartment. We compare our automated assessment of task quality with direct observation scores. We also assess the ability of machine-learning techniques to predict the cognitive health of the participants based on these automated scores. We believe that this capability is an important step in understanding everyday functional health of individuals in their home environments.", "year": 2013, "referenceCount": 50, "citationCount": 151, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3410479", "name": "Prafulla N. Dawadi"}, {"authorId": "144758070", "name": "D. Cook"}, {"authorId": "1390122703", "name": "M. Schmitter-Edgecombe"}]}, {"paperId": "208f0e4195e22e8079ee894397b7a3d1ce99091b", "url": "https://www.semanticscholar.org/paper/208f0e4195e22e8079ee894397b7a3d1ce99091b", "title": "Identifying implementation bugs in machine learning based image classifiers using metamorphic testing", "abstract": "We have recently witnessed tremendous success of Machine Learning (ML) in practical applications. Computer vision, speech recognition and language translation have all seen a near human level performance. We expect, in the near future, most business applications will have some form of ML. However, testing such applications is extremely challenging and would be very expensive if we follow today's methodologies. In this work, we present an articulation of the challenges in testing ML based applications. We then present our solution approach, based on the concept of Metamorphic Testing, which aims to identify implementation bugs in ML based image classifiers. We have developed metamorphic relations for an application based on Support Vector Machine and a Deep Learning based application. Empirical validation showed that our approach was able to catch 71% of the implementation bugs in the ML applications.", "year": 2018, "referenceCount": 37, "citationCount": 120, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "15854877", "name": "Anurag Dwarakanath"}, {"authorId": "2059931153", "name": "Manish Ahuja"}, {"authorId": "51123546", "name": "Samarth Sikand"}, {"authorId": "51126776", "name": "Raghotham M. Rao"}, {"authorId": "145471941", "name": "R. Bose"}, {"authorId": "2071149341", "name": "Neville Dubash"}, {"authorId": "49424498", "name": "Sanjay Podder"}]}, {"paperId": "b2dcc1df22f72dfa4fd838ea6d40fc9d558f0160", "url": "https://www.semanticscholar.org/paper/b2dcc1df22f72dfa4fd838ea6d40fc9d558f0160", "title": "SLAQ: quality-driven scheduling for distributed machine learning", "abstract": "Training machine learning (ML) models with large datasets can incur significant resource contention on shared clusters. This training typically involves many iterations that continually improve the quality of the model. Yet in exploratory settings, better models can be obtained faster by directing resources to jobs with the most potential for improvement. We describe SLAQ, a cluster scheduling system for approximate ML training jobs that aims to maximize the overall job quality. When allocating cluster resources, SLAQ explores the quality-runtime trade-offs across multiple jobs to maximize system-wide quality improvement. To do so, SLAQ leverages the iterative nature of ML training algorithms, by collecting quality and resource usage information from concurrent jobs, and then generating highly-tailored quality-improvement predictions for future iterations. Experiments show that SLAQ achieves an average quality improvement of up to 73% and an average delay reduction of up to 44% on a large set of ML training jobs, compared to resource fairness schedulers.", "year": 2017, "referenceCount": 59, "citationCount": 99, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2051632731", "name": "Haoyu Zhang"}, {"authorId": "26315993", "name": "Logan Stafman"}, {"authorId": "46782066", "name": "Andrew Or"}, {"authorId": "3122063", "name": "M. Freedman"}]}, {"paperId": "1d88acd3cfeae7c17f79ef15827ea3f90818913e", "url": "https://www.semanticscholar.org/paper/1d88acd3cfeae7c17f79ef15827ea3f90818913e", "title": "A Unified Framework for Reservoir Computing and Extreme Learning Machines based on a Single Time-delayed Neuron", "abstract": null, "year": 2015, "referenceCount": 35, "citationCount": 100, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1840047", "name": "S. Ortin"}, {"authorId": "144524298", "name": "M. C. Soriano"}, {"authorId": "145682718", "name": "L. Pesquera"}, {"authorId": "145711155", "name": "D. Brunner"}, {"authorId": "97884061", "name": "D. San-Martín"}, {"authorId": "1795232", "name": "Ingo Fischer"}, {"authorId": "2034306", "name": "C. Mirasso"}, {"authorId": "144614855", "name": "J. Gutiérrez"}]}, {"paperId": "bf00b773e06729baa3dfdbbff61e60af332e3758", "url": "https://www.semanticscholar.org/paper/bf00b773e06729baa3dfdbbff61e60af332e3758", "title": "Comparing Heuristic and Machine Learning Approaches for Metric-Based Code Smell Detection", "abstract": "Code smells represent poor implementation choices performed by developers when enhancing source code. Their negative impact on source code maintainability and comprehensibility has been widely shown in the past and several techniques to automatically detect them have been devised. Most of these techniques are based on heuristics, namely they compute a set of code metrics and combine them by creating detection rules; while they have a reasonable accuracy, a recent trend is represented by the use of machine learning where code metrics are used as predictors of the smelliness of code artefacts. Despite the recent advances in the field, there is still a noticeable lack of knowledge of whether machine learning can actually be more accurate than traditional heuristic-based approaches. To fill this gap, in this paper we propose a large-scale study to empirically compare the performance of heuristic-based and machine-learning-based techniques for metric-based code smell detection. We consider five code smell types and compare machine learning models with DECOR, a state-of-the-art heuristic-based approach. Key findings emphasize the need of further research aimed at improving the effectiveness of both machine learning and heuristic approaches for code smell detection: while DECOR generally achieves better performance than a machine learning baseline, its precision is still too low to make it usable in practice.", "year": 2019, "referenceCount": 98, "citationCount": 47, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "133972345", "name": "Fabiano Pecorelli"}, {"authorId": "34946033", "name": "Fabio Palomba"}, {"authorId": "50515157", "name": "Dario Di Nucci"}, {"authorId": "145818752", "name": "A. D. Lucia"}]}, {"paperId": "324f40c043eaec4795cff9e33294f4e3b40b41d2", "url": "https://www.semanticscholar.org/paper/324f40c043eaec4795cff9e33294f4e3b40b41d2", "title": "Learning Nondeterministic Classifiers", "abstract": "Nondeterministic classifiers are defined as those allowed to predict more than one class for some entries from an input space. Given that the true class should be included in predictions and the number of classes predicted should be as small as possible, these kind of classifiers can be considered as Information Retrieval (IR) procedures. In this paper, we propose a family of IR loss functions to measure the performance of nondeterministic learners. After discussing such measures, we derive an algorithm for learning optimal nondeterministic hypotheses. Given an entry from the input space, the algorithm requires the posterior probabilities to compute the subset of classes with the lowest expected loss. From a general point of view, nondeterministic classifiers provide an improvement in the proportion of predictions that include the true class compared to their deterministic counterparts; the price to be paid for this increase is usually a tiny proportion of predictions with more than one class. The paper includes an extensive experimental study using three deterministic learners to estimate posterior probabilities: a multiclass Support Vector Machine (SVM), a Logistic Regression, and a Naive Bayes. The data sets considered comprise both UCI multi-class learning tasks and microarray expressions of different kinds of cancer. We successfully compare nondeterministic classifiers with other alternative approaches. Additionally, we shall see how the quality of posterior probabilities (measured by the Brier score) determines the goodness of nondeterministic predictions.", "year": 2009, "referenceCount": 28, "citationCount": 71, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2258395", "name": "J. J. Coz"}, {"authorId": "153457862", "name": "J. Díez"}, {"authorId": "1685079", "name": "A. Bahamonde"}]}, {"paperId": "842ba35a690282acde75643bb1935a9b8b630b1e", "url": "https://www.semanticscholar.org/paper/842ba35a690282acde75643bb1935a9b8b630b1e", "title": "Learning from untrusted data", "abstract": "The vast majority of theoretical results in machine learning and statistics assume that the training data is a reliable reflection of the phenomena to be learned. Similarly, most learning techniques used in practice are brittle to the presence of large amounts of biased or malicious data. Motivated by this, we consider two frameworks for studying estimation, learning, and optimization in the presence of significant fractions of arbitrary data. The first framework, list-decodable learning, asks whether it is possible to return a list of answers such that at least one is accurate. For example, given a dataset of n points for which an unknown subset of αn points are drawn from a distribution of interest, and no assumptions are made about the remaining (1 - α)n points, is it possible to return a list of poly(1/α) answers? The second framework, which we term the semi-verified model, asks whether a small dataset of trusted data (drawn from the distribution in question) can be used to extract accurate information from a much larger but untrusted dataset (of which only an α-fraction is drawn from the distribution). We show strong positive results in both settings, and provide an algorithm for robust learning in a very general stochastic optimization setting. This result has immediate implications for robustly estimating the mean of distributions with bounded second moments, robustly learning mixtures of such distributions, and robustly finding planted partitions in random graphs in which significant portions of the graph have been perturbed by an adversary.", "year": 2016, "referenceCount": 49, "citationCount": 237, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1745732", "name": "M. Charikar"}, {"authorId": "5164568", "name": "J. Steinhardt"}, {"authorId": "1806083", "name": "G. Valiant"}]}, {"paperId": "e3b25bd5e69701eac7613e9dbfba8e074f824749", "url": "https://www.semanticscholar.org/paper/e3b25bd5e69701eac7613e9dbfba8e074f824749", "title": "Predictable and precise template-free CRISPR editing of pathogenic variants", "abstract": null, "year": 2018, "referenceCount": 36, "citationCount": 323, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Biology", "Medicine"], "authors": [{"authorId": "1491793237", "name": "Max W. Shen"}, {"authorId": "47090103", "name": "Mandana Arbab"}, {"authorId": "144371116", "name": "Jonathan Y. Hsu"}, {"authorId": "47662796", "name": "D. Worstell"}, {"authorId": "48566244", "name": "Sannie J. Culbertson"}, {"authorId": "26968899", "name": "Olga Krabbe"}, {"authorId": "2480457", "name": "C. Cassa"}, {"authorId": "2949942", "name": "David R. Liu"}, {"authorId": "145253803", "name": "D. Gifford"}, {"authorId": "31903094", "name": "R. Sherwood"}]}, {"paperId": "f354310098e09c1e1dc88758fca36767fd9d084d", "url": "https://www.semanticscholar.org/paper/f354310098e09c1e1dc88758fca36767fd9d084d", "title": "Learning methods for generic object recognition with invariance to pose and lighting", "abstract": "We assess the applicability of several popular learning methods for the problem of recognizing generic visual categories with invariance to pose, lighting, and surrounding clutter. A large dataset comprising stereo image pairs of 50 uniform-colored toys under 36 azimuths, 9 elevations, and 6 lighting conditions was collected (for a total of 194,400 individual images). The objects were 10 instances of 5 generic categories: four-legged animals, human figures, airplanes, trucks, and cars. Five instances of each category were used for training, and the other five for testing. Low-resolution grayscale images of the objects with various amounts of variability and surrounding clutter were used for training and testing. Nearest neighbor methods, support vector machines, and convolutional networks, operating on raw pixels or on PCA-derived features were tested. Test error rates for unseen object instances placed on uniform backgrounds were around 13% for SVM and 7% for convolutional nets. On a segmentation/recognition task with highly cluttered images, SVM proved impractical, while convolutional nets yielded 16/7% error. A real-time version of the system was implemented that can detect and classify objects in natural scenes at around 10 frames per second.", "year": 2004, "referenceCount": 31, "citationCount": 1379, "influentialCitationCount": 152, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1688882", "name": "Yann LeCun"}, {"authorId": "13919023", "name": "F. Huang"}, {"authorId": "52184096", "name": "L. Bottou"}]}, {"paperId": "0033fabb9f9dad4bdaa81470593601d9506d2812", "url": "https://www.semanticscholar.org/paper/0033fabb9f9dad4bdaa81470593601d9506d2812", "title": "Tensor Networks for Dimensionality Reduction and Large-scale Optimization: Part 1 Low-Rank Tensor Decompositions", "abstract": "Modern applications in engineering and data science are increasinglybased on multidimensional data of exceedingly high volume, variety,and structural richness. However, standard machine learning algorithmstypically scale exponentially with data volume and complexityof cross-modal couplings - the so called curse of dimensionality -which is prohibitive to the analysis of large-scale, multi-modal andmulti-relational datasets. Given that such data are often efficientlyrepresented as multiway arrays or tensors, it is therefore timely andvaluable for the multidisciplinary machine learning and data analyticcommunities to review low-rank tensor decompositions and tensor networksas emerging tools for dimensionality reduction and large scaleoptimization problems. Our particular emphasis is on elucidating that,by virtue of the underlying low-rank approximations, tensor networkshave the ability to alleviate the curse of dimensionality in a numberof applied areas. In Part 1 of this monograph we provide innovativesolutions to low-rank tensor network decompositions and easy to interpretgraphical representations of the mathematical operations ontensor networks. Such a conceptual insight allows for seamless migrationof ideas from the flat-view matrices to tensor network operationsand vice versa, and provides a platform for further developments, practicalapplications, and non-Euclidean extensions. It also permits theintroduction of various tensor network operations without an explicitnotion of mathematical expressions, which may be beneficial for manyresearch communities that do not directly rely on multilinear algebra.Our focus is on the Tucker and tensor train TT decompositions andtheir extensions, and on demonstrating the ability of tensor networksto provide linearly or even super-linearly e.g., logarithmically scalablesolutions, as illustrated in detail in Part 2 of this monograph.", "year": 2016, "referenceCount": 279, "citationCount": 324, "influentialCitationCount": 21, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145683892", "name": "A. Cichocki"}, {"authorId": "1777061", "name": "Namgil Lee"}, {"authorId": "1738205", "name": "I. Oseledets"}, {"authorId": "9377326", "name": "A. Phan"}, {"authorId": "144251712", "name": "Qibin Zhao"}, {"authorId": "9368519", "name": "D. Mandic"}]}, {"paperId": "f5e0a45ff6a33c6fb178d8e48673499aea32b681", "url": "https://www.semanticscholar.org/paper/f5e0a45ff6a33c6fb178d8e48673499aea32b681", "title": "Automatic detection of learner’s affect from conversational cues", "abstract": null, "year": 2008, "referenceCount": 134, "citationCount": 346, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1383996606", "name": "S. D’Mello"}, {"authorId": "2122336", "name": "Scotty D. Craig"}, {"authorId": "32642534", "name": "Amy M. Witherspoon"}, {"authorId": "2184400", "name": "Bethany McDaniel"}, {"authorId": "1769251", "name": "A. Graesser"}]}, {"paperId": "786e1a7288023b88f2cde65058ffdfbbc40fbc9d", "url": "https://www.semanticscholar.org/paper/786e1a7288023b88f2cde65058ffdfbbc40fbc9d", "title": "Machine learning analysis of whole mouse brain vasculature", "abstract": null, "year": 2020, "referenceCount": 57, "citationCount": 122, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2290751", "name": "Mihail I. Todorov"}, {"authorId": "1561434672", "name": "Johannes C. Paetzold"}, {"authorId": "3402354", "name": "Oliver Schoppe"}, {"authorId": "14162293", "name": "G. Tetteh"}, {"authorId": "1561461499", "name": "Suprosanna Shit"}, {"authorId": "152572016", "name": "Velizar Efremov"}, {"authorId": "1561533878", "name": "Katalin Todorov-Völgyi"}, {"authorId": "153495253", "name": "M. Düring"}, {"authorId": "2087823", "name": "M. Dichgans"}, {"authorId": "34929811", "name": "M. Piraud"}, {"authorId": "143893221", "name": "Bjoern H Menze"}, {"authorId": "5340706", "name": "Ali Ertürk"}]}, {"paperId": "c97a189dae51cb015cb649d6dbbf5a82966806e7", "url": "https://www.semanticscholar.org/paper/c97a189dae51cb015cb649d6dbbf5a82966806e7", "title": "Surveying the reach and maturity of machine learning and artificial intelligence in astronomy", "abstract": "Machine learning (automated processes that learn by example in order to classify, predict, discover, or generate new data) and artificial intelligence (methods by which a computer makes decisions or discoveries that would usually require human intelligence) are now firmly established in astronomy. Every week, new applications of machine learning and artificial intelligence are added to a growing corpus of work. Random forests, support vector machines, and neural networks are now having a genuine impact for applications as diverse as discovering extrasolar planets, transient objects, quasars, and gravitationally lensed systems, forecasting solar activity, and distinguishing between signals and instrumental effects in gravitational wave astronomy. This review surveys contemporary, published literature on machine learning and artificial intelligence in astronomy and astrophysics. Applications span seven main categories of activity: classification, regression, clustering, forecasting, generation, discovery, and the development of new scientific insights. These categories form the basis of a hierarchy of maturity, as the use of machine learning and artificial intelligence emerges, progresses, or becomes established.", "year": 2019, "referenceCount": 353, "citationCount": 45, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "2040500", "name": "C. Fluke"}, {"authorId": "2052756989", "name": "C. Jacobs"}]}, {"paperId": "144a0f13ea5fedcc6f142b9845fc99e61fd99eb3", "url": "https://www.semanticscholar.org/paper/144a0f13ea5fedcc6f142b9845fc99e61fd99eb3", "title": "Multi-class protein fold recognition using support vector machines and neural networks", "abstract": "MOTIVATION\nProtein fold recognition is an important approach to structure discovery without relying on sequence similarity. We study this approach with new multi-class classification methods and examined many issues important for a practical recognition system.\n\n\nRESULTS\nMost current discriminative methods for protein fold prediction use the one-against-others method, which has the well-known 'False Positives' problem. We investigated two new methods: the unique one-against-others and the all-against-all methods. Both improve prediction accuracy by 14-110% on a dataset containing 27 SCOP folds. We used the Support Vector Machine (SVM) and the Neural Network (NN) learning methods as base classifiers. SVMs converges fast and leads to high accuracy. When scores of multiple parameter datasets are combined, majority voting reduces noise and increases recognition accuracy. We examined many issues involved with large number of classes, including dependencies of prediction accuracy on the number of folds and on the number of representatives in a fold. Overall, recognition systems achieve 56% fold prediction accuracy on a protein test dataset, where most of the proteins have below 25% sequence identity with the proteins used in training.", "year": 2001, "referenceCount": 31, "citationCount": 890, "influentialCitationCount": 136, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1737469", "name": "C. Ding"}, {"authorId": "2601999", "name": "I. Dubchak"}]}, {"paperId": "093c3b389384812ea16f1ad18ce6c5f43c4f7106", "url": "https://www.semanticscholar.org/paper/093c3b389384812ea16f1ad18ce6c5f43c4f7106", "title": "Automatically Tracking Metadata and Provenance of Machine Learning Experiments", "abstract": "We present a lightweight system to extract, store and manage metadata and provenance information of common artifacts in machine learning (ML) experiments: datasets, models, predictions, evaluations and training runs. Our system accelerates users in their ML workflow, and provides a basis for comparability and repeatability of ML experiments. We achieve this by tracking the lineage of produced artifacts and automatically extracting metadata such as hyperparameters of models, schemas of datasets or layouts of deep neural networks. Our system provides a general declarative representation of said ML artifacts, is integrated with popular frameworks such as MXNet, SparkML and scikit-learn, and meets the demands of various production use cases at Amazon.", "year": 2017, "referenceCount": 25, "citationCount": 93, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2180399", "name": "Sebastian Schelter"}, {"authorId": "34357261", "name": "Joos-Hendrik Böse"}, {"authorId": "2979890", "name": "Johannes Kirschnick"}, {"authorId": "2067591173", "name": "Thoralf Klein"}, {"authorId": "1792476", "name": "Stephan Seufert"}]}, {"paperId": "bc89a6fbf43cf911f71e5428d0b4a70fa5a40be9", "url": "https://www.semanticscholar.org/paper/bc89a6fbf43cf911f71e5428d0b4a70fa5a40be9", "title": "A Human-Centered Agenda for Intelligible Machine Learning", "abstract": "To build machine learning systems that are reliable, trustworthy, and fair, we must be able to provide relevant stakeholders with an understanding of how these systems work. Yet what makes a system “intelligible” is difficult to pin down. Intelligibility is a fundamentally human-centered concept that lacks a one-size-fits-all solution. Although many intelligibility techniques have been proposed in the machine learning literature, there are many more open questions about how best to provide stakeholders with the information they need to achieve their desired goals. In this chapter, we begin with an overview of the intelligible machine learning landscape and give several examples of the diverse ways in which needs for intelligibility can arise. We provide an overview of the techniques for achieving intelligibility that have been proposed in the machine learning literature. We discuss the importance of taking a human-centered strategy when designing intelligibility techniques or when verifying that these techniques achieve their intended goals. We also argue that the notion of intelligibility should be expanded beyond machine learning models to other components of machine learning systems, such as datasets and performance metrics. Finally, we emphasize the necessity of tight integration between the machine learning and human–computer interaction communities.", "year": 2021, "referenceCount": 69, "citationCount": 40, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "4006636", "name": "Jennifer Wortman Vaughan"}, {"authorId": "1831395", "name": "H. Wallach"}]}, {"paperId": "e4e35f7150db8c3828dd6089c6dc0dc7f0b56bdd", "url": "https://www.semanticscholar.org/paper/e4e35f7150db8c3828dd6089c6dc0dc7f0b56bdd", "title": "Mining Text Data", "abstract": null, "year": 2012, "referenceCount": 614, "citationCount": 1058, "influentialCitationCount": 47, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1682418", "name": "C. Aggarwal"}, {"authorId": "1736467", "name": "ChengXiang Zhai"}]}, {"paperId": "577308fe84f429bafc53f90a891cc1549393dc3f", "url": "https://www.semanticscholar.org/paper/577308fe84f429bafc53f90a891cc1549393dc3f", "title": "iPathology: Robotic Applications and Management of Plants and Plant Diseases", "abstract": "The rapid development of new technologies and the changing landscape of the online world (e.g., Internet of Things (IoT), Internet of All, cloud-based solutions) provide a unique opportunity for developing automated and robotic systems for urban farming, agriculture, and forestry. Technological advances in machine vision, global positioning systems, laser technologies, actuators, and mechatronics have enabled the development and implementation of robotic systems and intelligent technologies for precision agriculture. Herein, we present and review robotic applications on plant pathology and management, and emerging agricultural technologies for intra-urban agriculture. Greenhouse advanced management systems and technologies have been greatly developed in the last years, integrating IoT and WSN (Wireless Sensor Network). Machine learning, machine vision, and AI (Artificial Intelligence) have been utilized and applied in agriculture for automated and robotic farming. Intelligence technologies, using machine vision/learning, have been developed not only for planting, irrigation, weeding (to some extent), pruning, and harvesting, but also for plant disease detection and identification. However, plant disease detection still represents an intriguing challenge, for both abiotic and biotic stress. Many recognition methods and technologies for identifying plant disease symptoms have been successfully developed; still, the majority of them require a controlled environment for data acquisition to avoid false positives. Machine learning methods (e.g., deep and transfer learning) present promising results for improving image processing and plant symptom identification. Nevertheless, diagnostic specificity is a challenge for microorganism control and should drive the development of mechatronics and robotic solutions for disease management.", "year": 2017, "referenceCount": 94, "citationCount": 78, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "2580557", "name": "Y. Ampatzidis"}, {"authorId": "32963523", "name": "L. Bellis"}, {"authorId": "3392511", "name": "A. Luvisi"}]}]}