{"total": 5120630, "offset": 5100, "next": 5200, "data": [{"paperId": "c98bcc8689c34d72fd0b696f2a49e7f86d151782", "url": "https://www.semanticscholar.org/paper/c98bcc8689c34d72fd0b696f2a49e7f86d151782", "title": "An introduction to domain adaptation and transfer learning", "abstract": "In machine learning, if the training data is an unbiased sample of an underlying distribution, then the learned classification function will make accurate predictions for new samples. However, if the training data is not an unbiased sample, then there will be differences between how the training data is distributed and how the test data is distributed. Standard classifiers cannot cope with changes in data distributions between training and test phases, and will not perform well. Domain adaptation and transfer learning are sub-fields within machine learning that are concerned with accounting for these types of changes. Here, we present an introduction to these fields, guided by the question: when and how can a classifier generalize from a source to a target domain? We will start with a brief introduction into risk minimization, and how transfer learning and domain adaptation expand upon this framework. Following that, we discuss three special cases of data set shift, namely prior, covariate and concept shift. For more complex domain shifts, there are a wide variety of approaches. These are categorized into: importance-weighting, subspace mapping, domain-invariant spaces, feature augmentation, minimax estimators and robust algorithms. A number of points will arise, which we will discuss in the last section. We conclude with the remark that many open questions will have to be addressed before transfer learners and domain-adaptive classifiers become practical.", "year": 2018, "referenceCount": 241, "citationCount": 166, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3191461", "name": "Wouter M. Kouw"}]}, {"paperId": "c6d6cfc15883cf1696eefe8d02e3f8b441299e9d", "url": "https://www.semanticscholar.org/paper/c6d6cfc15883cf1696eefe8d02e3f8b441299e9d", "title": "Detecting the nature of change in an urban environment : A comparison of machine learning algorithms", "abstract": "The performance of different machine learning algorithms for detecting the nature of change was compared. To choose the best algorithms for a specific task, users are advised to consider not only classification accuracy, but also comprehensibility, compactness, and robustness in training and classification. The purpose of this paper is to provide information to users so that they can choose the best algorithms for specific tasks. To alleviate the problem of obtaining enough training data, simulated training data were generated from single-date images. A one-pass classification with four machine learning algorithms, namely, Multi-Layer Perceptrons (MLP), Learning Vector Quantization (LVQ), Decision Tree Classifiers (DTC), and the Maximum-Likelihood Classifier (MLC), were tested. Recognition rates, ease of use, and degree of automation of the four algorithms were assessed. The results showed that the incorporation of cross-combined simulated training data enhanced the detection of nature of change. Compared to conventional post-classification comparison methods, LVQ and DTC did better in terms of overall accuracy. In terms of average accuracy of the change classes, LVQ was the best performer. DTC was the easiest to use and the most robust in training. MLP procedures were the most difficult to replicate.", "year": 2001, "referenceCount": 30, "citationCount": 158, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Geography"], "authors": [{"authorId": "27026134", "name": "J. Chan"}, {"authorId": "40392393", "name": "Kwok-Ping Chan"}, {"authorId": "2537677", "name": "A. Yeh"}]}, {"paperId": "39264be15daa49511d32723d74fa9c48673ebddc", "url": "https://www.semanticscholar.org/paper/39264be15daa49511d32723d74fa9c48673ebddc", "title": "Machine Learning for 5G/B5G Mobile and Wireless Communications: Potential, Limitations, and Future Directions", "abstract": "Driven by the demand to accommodate today’s growing mobile traffic, 5G is designed to be a key enabler and a leading infrastructure provider in the information and communication technology industry by supporting a variety of forthcoming services with diverse requirements. Considering the ever-increasing complexity of the network, and the emergence of novel use cases such as autonomous cars, industrial automation, virtual reality, e-health, and several intelligent applications, machine learning (ML) is expected to be essential to assist in making the 5G vision conceivable. This paper focuses on the potential solutions for 5G from an ML-perspective. First, we establish the fundamental concepts of supervised, unsupervised, and reinforcement learning, taking a look at what has been done so far in the adoption of ML in the context of mobile and wireless communication, organizing the literature in terms of the types of learning. We then discuss the promising approaches for how ML can contribute to supporting each target 5G network requirement, emphasizing its specific use cases and evaluating the impact and limitations they have on the operation of the network. Lastly, this paper investigates the potential features of Beyond 5G (B5G), providing future research directions for how ML can contribute to realizing B5G. This article is intended to stimulate discussion on the role that ML can play to overcome the limitations for a wide deployment of autonomous 5G/B5G mobile and wireless communications.", "year": 2019, "referenceCount": 199, "citationCount": 156, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1404253416", "name": "Manuel Eugenio Morocho-Cayamcela"}, {"authorId": "8385587", "name": "Haeyoung Lee"}, {"authorId": "143779068", "name": "W. Lim"}]}, {"paperId": "cb4e83b334601b958a3ec502e0be6d07bfebe6ae", "url": "https://www.semanticscholar.org/paper/cb4e83b334601b958a3ec502e0be6d07bfebe6ae", "title": "A Comparison of Sentiment Analysis Techniques: Polarizing Movie Blogs", "abstract": null, "year": 2008, "referenceCount": 24, "citationCount": 178, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "24338929", "name": "M. Annett"}, {"authorId": "46474310", "name": "Grzegorz Kondrak"}]}, {"paperId": "311624152e5e554b26954d284827f13d293028dc", "url": "https://www.semanticscholar.org/paper/311624152e5e554b26954d284827f13d293028dc", "title": "Incorporating Contextual Cues in Trainable Models for Coreference Resolution", "abstract": "We propose a method that incorporates various novel contextual cues into a machine learning for resolving coreference. Distinct characteristics of our model are (i) incorporating more linguistic features capturing contextual information that is more sophisticated than what is offered in Centering Theory, and (ii) a tournament model for selecting a referent. Our experiments show that this model significantly outperforms earlier machine learning approaches, such as Soon et al. (2001).", "year": 2003, "referenceCount": 31, "citationCount": 77, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "34611748", "name": "R. Iida"}, {"authorId": "3040648", "name": "Kentaro Inui"}, {"authorId": "36514372", "name": "Hiroya Takamura"}, {"authorId": "1681502", "name": "Yuji Matsumoto"}]}, {"paperId": "cec81c1acbc36503108337a74d845008d5e68f70", "url": "https://www.semanticscholar.org/paper/cec81c1acbc36503108337a74d845008d5e68f70", "title": "Machine Learning for Prediction in Electronic Health Data.", "abstract": "Machine learning for prediction in electronic health data has been deployed for many clinical questions during the last decade. Machine learning methods may excel at finding new features or nonlinear relationships in the data, as well as handling settings with more predictor variables than observations. However, the usefulness of both these data and machine learning has varied. Electronic health data often have quality issues (eg, missingness, misclassification, measurement error), and machine learning may perform similarly to standard techniques for some research questions. Ensembles (running multiple algorithms and either selecting the single best algorithm or creating a weighted average) can help mitigate the latter concern. Using several machine learning tools, Wong et al1 predicted delirium risk for newly hospitalized patients with high-dimensional electronic health record data at a large academic health institution. They compared these approaches with a questionnaire-based scoring system and found improved performance for machine learning with respect to several metrics calculated in a single holdout sample. Their article is a step toward updating delirium risk prediction. It also provides an opportunity to discuss 2 key issues in the current state of machine learning for prediction in electronic health data: evaluation and generalizability. The machine learning researchers who develop novel algorithms for prediction and the clinical teams interested in implementing them are frequently and unfortunately 2 nonintersecting groups. Thus, these algorithms may originally be built and evaluated in the machine learning literature based on metrics that are less clinically useful than other choices. Computer scientists and statisticians may optimize to achieve the best area under the receiver operating characteristic curve (AUC), but what a clinical team might need is high sensitivity or positive predictive value. Worse yet, algorithms can have misleading performance when evaluated only along 1 or 2 dimensions. For example, high AUC, accuracy, and positive predictive values can be accompanied by near-zero levels of sensitivity and specificity. It can also be essential to calculate metrics like the percentage of true cases in the top risk percentile.2 This is especially important when a goal of the tool is to target high-risk patients for interventions. Wong and colleagues1 helpfully compute AUC, positive predictive values, sensitivity, and specificity. However, one accepted standard for evaluation that should be adopted in future clinical machine learning applications is K-fold cross-validation (eg, with K = 10) rather than the single holdout validation sample in their article. K-fold cross-validation involves K successive mutually exclusive validation sets where the algorithm fitting is iteratively performed on the nonvalidation data (ie, training set). At the end, each observation in the full data has a predicted value that was obtained from when it was part of a validation set. Typically, metrics calculated based on these K-fold cross-validated predicted values will more effectively assess overfitting and have lower variance.3 Of course, assessing the generalizability of a prediction algorithm goes well beyond using crossvalidated metrics to evaluate overfitting. Wong et al1 carefully discussed a number of limitations in their work, including the lack of external validation in other health systems. As in similar studies, the step from good performance in the study to a generalizable algorithm is vast and sometimes may not be feasible. Patients receiving treatment in varied care settings or geographic regions simply may require tailored tools. Recognizing the need for unique tools in different populations is not inherently negative, but one of many considerations not magically solved by using machine learning. Even those algorithms that prove to be generalizable may quickly become outdated as treatment patterns or physician incentives to code health conditions change.4 Increased social tolerance for certain + Related article", "year": 2018, "referenceCount": 11, "citationCount": 54, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "48345067", "name": "Sherri Rose"}]}, {"paperId": "66fc1552c6fb6608c703baaf499686180593d80e", "url": "https://www.semanticscholar.org/paper/66fc1552c6fb6608c703baaf499686180593d80e", "title": "Compressed-Domain Ship Detection on Spaceborne Optical Image Using Deep Neural Network and Extreme Learning Machine", "abstract": "Ship detection on spaceborne images has attracted great interest in the applications of maritime security and traffic control. Optical images stand out from other remote sensing images in object detection due to their higher resolution and more visualized contents. However, most of the popular techniques for ship detection from optical spaceborne images have two shortcomings: 1) Compared with infrared and synthetic aperture radar images, their results are affected by weather conditions, like clouds and ocean waves, and 2) the higher resolution results in larger data volume, which makes processing more difficult. Most of the previous works mainly focus on solving the first problem by improving segmentation or classification with complicated algorithms. These methods face difficulty in efficiently balancing performance and complexity. In this paper, we propose a ship detection approach to solving the aforementioned two issues using wavelet coefficients extracted from JPEG2000 compressed domain combined with deep neural network (DNN) and extreme learning machine (ELM). Compressed domain is adopted for fast ship candidate extraction, DNN is exploited for high-level feature representation and classification, and ELM is used for efficient feature pooling and decision making. Extensive experiments demonstrate that, in comparison with the existing relevant state-of-the-art approaches, the proposed method requires less detection time and achieves higher detection accuracy.", "year": 2015, "referenceCount": 54, "citationCount": 334, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2967405", "name": "Jiexiong Tang"}, {"authorId": "7175017", "name": "Chenwei Deng"}, {"authorId": "145678691", "name": "G. Huang"}, {"authorId": "2130614", "name": "Baojun Zhao"}]}, {"paperId": "c92b4dd2d227c6cbe175de43f629bd74c0d50af1", "url": "https://www.semanticscholar.org/paper/c92b4dd2d227c6cbe175de43f629bd74c0d50af1", "title": "Constraint Programming for Data Mining and Machine Learning", "abstract": "\n \n Machine learning and data mining have become aware that using constraints when learning patterns and rules can be very useful. To this end, a large number of special purpose systems and techniques have been developed for solving such constraint-based mining and learning problems. These techniques have, so far, been developed independently of the general purpose tools and principles of constraint programming known within the field of artificial intelligence. This paper shows that off-the-shelf constraint programming techniques can be applied to various pattern mining and rule learning problems (cf. also (De Raedt, Guns, and Nijssen 2008; Nijssen, Guns, and De Raedt 2009)). This does not only lead to methodologies that are more general and flexible, but also provides new insights into the underlying mining problems that allow us to improve the state-of-the-art in data mining. Such a combination of constraint programming and data mining raises a number of interesting new questions and challenges.\n \n", "year": 2010, "referenceCount": 22, "citationCount": 70, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1740042", "name": "L. D. Raedt"}, {"authorId": "1834512", "name": "Tias Guns"}, {"authorId": "1702481", "name": "Siegfried Nijssen"}]}, {"paperId": "5e61d3b1e4d8567f2bed772c1ff95e159cce9be1", "url": "https://www.semanticscholar.org/paper/5e61d3b1e4d8567f2bed772c1ff95e159cce9be1", "title": "Engagement detection in online learning: a review", "abstract": null, "year": 2019, "referenceCount": 102, "citationCount": 109, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145197398", "name": "M. A. Dewan"}, {"authorId": "1738331", "name": "M. Murshed"}, {"authorId": "1757617", "name": "F. Lin"}]}, {"paperId": "f4f9c7a52882e46fef6bca5e4732f3ca7ddefc65", "url": "https://www.semanticscholar.org/paper/f4f9c7a52882e46fef6bca5e4732f3ca7ddefc65", "title": "BioSeq-Analysis: a platform for DNA, RNA and protein sequence analysis based on machine learning approaches", "abstract": "With the avalanche of biological sequences generated in the post-genomic age, one of the most challenging problems is how to computationally analyze their structures and functions. Machine learning techniques are playing key roles in this field. Typically, predictors based on machine learning techniques contain three main steps: feature extraction, predictor construction and performance evaluation. Although several Web servers and stand-alone tools have been developed to facilitate the biological sequence analysis, they only focus on individual step. In this regard, in this study a powerful Web server called BioSeq-Analysis (http://bioinformatics.hitsz.edu.cn/BioSeq-Analysis/) has been proposed to automatically complete the three main steps for constructing a predictor. The user only needs to upload the benchmark data set. BioSeq-Analysis can generate the optimized predictor based on the benchmark data set, and the performance measures can be reported as well. Furthermore, to maximize user's convenience, its stand-alone program was also released, which can be downloaded from http://bioinformatics.hitsz.edu.cn/BioSeq-Analysis/download/, and can be directly run on Windows, Linux and UNIX. Applied to three sequence analysis tasks, experimental results showed that the predictors generated by BioSeq-Analysis even outperformed some state-of-the-art methods. It is anticipated that BioSeq-Analysis will become a useful tool for biological sequence analysis.", "year": 2019, "referenceCount": 118, "citationCount": 226, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "47655556", "name": "Bin Liu"}]}, {"paperId": "9d7761d1f6f41871898768c4a42369dbff87a370", "url": "https://www.semanticscholar.org/paper/9d7761d1f6f41871898768c4a42369dbff87a370", "title": "A survey on learning from data streams: current and future trends", "abstract": null, "year": 2012, "referenceCount": 62, "citationCount": 144, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143931014", "name": "João Gama"}]}, {"paperId": "7ea9c3c042b0e3423a2110cddbe7926f8b661bfd", "url": "https://www.semanticscholar.org/paper/7ea9c3c042b0e3423a2110cddbe7926f8b661bfd", "title": "Two supervised learning approaches for name disambiguation in author citations", "abstract": "Due to name abbreviations, identical names, name misspellings, and pseudonyms in publications or bibliographies (citations), an author may have multiple names and multiple authors may share the same name. Such name ambiguity affects the performance of document retrieval, Web search, database integration, and may cause improper attribution to authors. We investigate two supervised learning approaches to disambiguate authors in the citations. One approach uses the naive Bayes probability model, a generative model; the other uses support vector machines (SVMs) [V. Vapnik (1995)] and the vector space representation of citations, a discriminative model. Both approaches utilize three types of citation attributes: coauthor names, the title of the paper, and the title of the journal or proceeding. We illustrate these two approaches on two types of data, one collected from the Web, mainly publication lists from homepages, the other collected from the DBLP citation databases.", "year": 2004, "referenceCount": 52, "citationCount": 388, "influentialCitationCount": 44, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144910499", "name": "Hui Han"}, {"authorId": "145157784", "name": "C. Lee Giles"}, {"authorId": "145203884", "name": "H. Zha"}, {"authorId": "2168863006", "name": "Cheng Li"}, {"authorId": "1731462", "name": "Kostas Tsioutsiouliklis"}]}, {"paperId": "ea384dcb1c833ce42bafe9470b0a18edc9b77744", "url": "https://www.semanticscholar.org/paper/ea384dcb1c833ce42bafe9470b0a18edc9b77744", "title": "TEACHING MACHINES AND PROGRAMMED LEARNING, A SOURCE BOOK.", "abstract": null, "year": 1960, "referenceCount": 1, "citationCount": 154, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50066563", "name": "A. A. Lumsdaine"}, {"authorId": "31813000", "name": "R. Glaser"}]}, {"paperId": "cb9ca08029e9b3213de82de89bc2ea774c76b635", "url": "https://www.semanticscholar.org/paper/cb9ca08029e9b3213de82de89bc2ea774c76b635", "title": "Machine learning enables detection of early-stage colorectal cancer by whole-genome sequencing of plasma cell-free DNA", "abstract": null, "year": 2018, "referenceCount": 41, "citationCount": 73, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "8752174", "name": "Nathan Wan"}, {"authorId": "10976564", "name": "D. Weinberg"}, {"authorId": "2144898556", "name": "Tzu-Yu Liu"}, {"authorId": "2000850", "name": "K. Niehaus"}, {"authorId": "47835468", "name": "D. Delubac"}, {"authorId": "47747831", "name": "A. Kannan"}, {"authorId": "40657009", "name": "Brandon White"}, {"authorId": "6107055", "name": "E. Ariazi"}, {"authorId": "2069434604", "name": "Mitch Bailey"}, {"authorId": "52137537", "name": "Marvin Bertin"}, {"authorId": "50002286", "name": "Nathan Boley"}, {"authorId": "2059067891", "name": "D. Bowen"}, {"authorId": "73588537", "name": "James Cregg"}, {"authorId": "2059345669", "name": "Adam Drake"}, {"authorId": "38358556", "name": "R. Ennis"}, {"authorId": "121464478", "name": "S. Fransen"}, {"authorId": "40103273", "name": "Erik Gafni"}, {"authorId": "47742759", "name": "L. Hansen"}, {"authorId": "100577004", "name": "Yaping Liu"}, {"authorId": "47747298", "name": "Gabriel L. Otte"}, {"authorId": "87583095", "name": "Jennifer Pecson"}, {"authorId": "46879424", "name": "Brandon J. Rice"}, {"authorId": "34454752", "name": "Gabriel E. Sanderson"}, {"authorId": "35541771", "name": "Aarushi Sharma"}, {"authorId": "37434610", "name": "J. S. John"}, {"authorId": "144240877", "name": "Catherina Tang"}, {"authorId": "39746192", "name": "A. Tzou"}, {"authorId": "144823500", "name": "L. Young"}, {"authorId": "5707004", "name": "G. Putcha"}, {"authorId": "1983211", "name": "I. Haque"}]}, {"paperId": "bc26e1272340c4493ab74f9d831144ba224cab36", "url": "https://www.semanticscholar.org/paper/bc26e1272340c4493ab74f9d831144ba224cab36", "title": "Scalable Active Learning for Multiclass Image Classification", "abstract": "Machine learning techniques for computer vision applications like object recognition, scene classification, etc., require a large number of training samples for satisfactory performance. Especially when classification is to be performed over many categories, providing enough training samples for each category is infeasible. This paper describes new ideas in multiclass active learning to deal with the training bottleneck, making it easier to train large multiclass image classification systems. First, we propose a new interaction modality for training which requires only yes-no type binary feedback instead of a precise category label. The modality is especially powerful in the presence of hundreds of categories. For the proposed modality, we develop a Value-of-Information (VOI) algorithm that chooses informative queries while also considering user annotation cost. Second, we propose an active selection measure that works with many categories and is extremely fast to compute. This measure is employed to perform a fast seed search before computing VOI, resulting in an algorithm that scales linearly with dataset size. Third, we use locality sensitive hashing to provide a very fast approximation to active learning, which gives sublinear time scaling, allowing application to very large datasets. The approximation provides up to two orders of magnitude speedups with little loss in accuracy. Thorough empirical evaluation of classification accuracy, noise sensitivity, imbalanced data, and computational performance on a diverse set of image datasets demonstrates the strengths of the proposed algorithms.", "year": 2012, "referenceCount": 55, "citationCount": 121, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1692604", "name": "Ajay J. Joshi"}, {"authorId": "29905643", "name": "F. Porikli"}, {"authorId": "1696163", "name": "N. Papanikolopoulos"}]}, {"paperId": "3e3bfbb3f6dbc83b98dc8e3c95c97039ef99837c", "url": "https://www.semanticscholar.org/paper/3e3bfbb3f6dbc83b98dc8e3c95c97039ef99837c", "title": "Machine learning regression algorithms for biophysical parameter retrieval: Opportunities for Sentinel-2 and -3", "abstract": null, "year": 2012, "referenceCount": 79, "citationCount": 369, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2069785", "name": "J. Verrelst"}, {"authorId": "2068089675", "name": "J. Muñoz"}, {"authorId": "144377450", "name": "L. Alonso"}, {"authorId": "1752914", "name": "J. Delegido"}, {"authorId": "2263798", "name": "J. P. Rivera"}, {"authorId": "1397959153", "name": "G. Camps-Valls"}, {"authorId": "144394874", "name": "J. Moreno"}]}, {"paperId": "309910c14208c0bc739e6a935530d524a5f86a8a", "url": "https://www.semanticscholar.org/paper/309910c14208c0bc739e6a935530d524a5f86a8a", "title": "Estimating pixel-scale land cover classification confidence using nonparametric machine learning methods", "abstract": "Conventional approaches to accuracy assessment for land cover maps produced from remote sensing use either confusion matrices or the Kappa statistic to quantify map quality. These approaches yield global or class-specific measures of map quality by comparing classification results with independent ground-truth data. In most maps, considerable spatial variation is present in the accuracy of land cover labels that is not captured by these statistics. To date, this issue has rarely been addressed in the land cover remote sensing literature. The authors present a method to estimate pixel-scale land cover classification confidence using nonparametric machine learning methods. The method is based on recent theoretical developments from the domains of statistics and machine learning that explain the machine learning technique known as \"boosting\" as being equivalent to additive logistic regression. As a result, results from classification algorithms that use boosting can be assigned classification confidences based on probability estimates assigned to them using this theory. they test this approach using three different data sets. Their results demonstrate that classification errors tend to have low classification confidence while correctly classified pixels tend to have higher confidence. Thus, the method described in this paper may be used as a basis for providing spatially explicit maps of classification quality. This type of information will provide substantial additional information regarding map quality relative to more conventional quality measures and should be useful to end-users of map products derived from remote sensing.", "year": 2001, "referenceCount": 58, "citationCount": 102, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40299392", "name": "D. McIver"}, {"authorId": "33917772", "name": "M. Friedl"}]}, {"paperId": "8459ac50a61132f6429ac4249a579716e1b88dff", "url": "https://www.semanticscholar.org/paper/8459ac50a61132f6429ac4249a579716e1b88dff", "title": "Weakly Supervised Classification For High Energy Physics", "abstract": null, "year": 2017, "referenceCount": 56, "citationCount": 95, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Mathematics"], "authors": [{"authorId": "32273391", "name": "L. Dery"}, {"authorId": "3085579", "name": "B. Nachman"}, {"authorId": "73462120", "name": "F. Rubbo"}, {"authorId": "69907043", "name": "A. Schwartzman"}]}, {"paperId": "62b2c160394ec8f26f3016a9459add3f630b371f", "url": "https://www.semanticscholar.org/paper/62b2c160394ec8f26f3016a9459add3f630b371f", "title": "Different scaling of linear models and deep learning in UKBiobank brain images versus machine-learning datasets", "abstract": null, "year": 2020, "referenceCount": 83, "citationCount": 100, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "122513917", "name": "Marc-Andre Schulz"}, {"authorId": "145198313", "name": "B. Yeo"}, {"authorId": "1717958", "name": "J. Vogelstein"}, {"authorId": "1405315915", "name": "Janaina Mourao-Miranada"}, {"authorId": "3955759", "name": "J. Kather"}, {"authorId": "3282030", "name": "Konrad Paul Kording"}, {"authorId": "38498866", "name": "Blake A. Richards"}, {"authorId": "1700231", "name": "D. Bzdok"}]}, {"paperId": "2bdcc58c11eae925097deb551f29793a179f3bfc", "url": "https://www.semanticscholar.org/paper/2bdcc58c11eae925097deb551f29793a179f3bfc", "title": "Machine learning in the string landscape", "abstract": null, "year": 2017, "referenceCount": 47, "citationCount": 55, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "51302715", "name": "Jonathan Carifio"}, {"authorId": "101967346", "name": "J. Halverson"}, {"authorId": "31637487", "name": "Dmitri V. Krioukov"}, {"authorId": "1902525", "name": "B. Nelson"}]}, {"paperId": "5e7047851d05b2ecef5de451dda5404acda726de", "url": "https://www.semanticscholar.org/paper/5e7047851d05b2ecef5de451dda5404acda726de", "title": "Learning from Protein Structure with Geometric Vector Perceptrons", "abstract": "Learning on 3D structures of large biomolecules is emerging as a distinct area in machine learning, but there has yet to emerge a unifying network architecture that simultaneously leverages the graph-structured and geometric aspects of the problem domain. To address this gap, we introduce geometric vector perceptrons, which extend standard dense layers to operate on collections of Euclidean vectors. Graph neural networks equipped with such layers are able to perform both geometric and relational reasoning on efficient and natural representations of macromolecular structure. We demonstrate our approach on two important problems in learning from protein structure: model quality assessment and computational protein design. Our approach improves over existing classes of architectures, including state-of-the-art graph-based and voxel-based methods.", "year": 2020, "referenceCount": 48, "citationCount": 81, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Biology", "Mathematics"], "authors": [{"authorId": "2064253810", "name": "Bowen Jing"}, {"authorId": "2269018", "name": "Stephan Eismann"}, {"authorId": "8844033", "name": "Patricia Suriana"}, {"authorId": "144531620", "name": "Raphael J. L. Townshend"}, {"authorId": "2561280", "name": "R. Dror"}]}, {"paperId": "7177edea5d1116fe5473c3e6ff41a48c91f402aa", "url": "https://www.semanticscholar.org/paper/7177edea5d1116fe5473c3e6ff41a48c91f402aa", "title": "Mitigating the compiler optimization phase-ordering problem using machine learning", "abstract": "Today's compilers have a plethora of optimizations to choose from, and the correct choice of optimizations can have a significant impact on the performance of the code being optimized. Furthermore, choosing the correct order in which to apply those optimizations has been a long standing problem in compilation research. Each of these optimizations interacts with the code and in turn with all other optimizations in complicated ways. Traditional compilers typically apply the same set of optimization in a fixed order to all functions in a program, without regard the code being optimized.\n Understanding the interactions of optimizations is very important in determining a good solution to the phase-ordering problem. This paper develops a new approach that automatically selects good optimization orderings on a per method basis within a dynamic compiler. Our approach formulates the phase-ordering problem as a Markov process and uses a characterization of the current state of the code being optimized to creating a better solution to the phase ordering problem. Our technique uses neuro-evolution to construct an artificial neural network that is capable of predicting beneficial optimization ordering for a piece of code that is being optimized. We implemented our technique in Jikes RVM and achieved significant improvements on a set of standard Java benchmarks over a well-engineered fixed order.", "year": 2012, "referenceCount": 29, "citationCount": 120, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144347192", "name": "Sameer Kulkarni"}, {"authorId": "1874233", "name": "J. Cavazos"}]}, {"paperId": "db6ad6ded1cfa26fdc7437f27fb823ec533e96fe", "url": "https://www.semanticscholar.org/paper/db6ad6ded1cfa26fdc7437f27fb823ec533e96fe", "title": "Deep Learning: A Comprehensive Overview on Techniques, Taxonomy, Applications and Research Directions", "abstract": null, "year": 2021, "referenceCount": 177, "citationCount": 121, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3456687", "name": "I. Sarker"}]}, {"paperId": "208f0e4195e22e8079ee894397b7a3d1ce99091b", "url": "https://www.semanticscholar.org/paper/208f0e4195e22e8079ee894397b7a3d1ce99091b", "title": "Identifying implementation bugs in machine learning based image classifiers using metamorphic testing", "abstract": "We have recently witnessed tremendous success of Machine Learning (ML) in practical applications. Computer vision, speech recognition and language translation have all seen a near human level performance. We expect, in the near future, most business applications will have some form of ML. However, testing such applications is extremely challenging and would be very expensive if we follow today's methodologies. In this work, we present an articulation of the challenges in testing ML based applications. We then present our solution approach, based on the concept of Metamorphic Testing, which aims to identify implementation bugs in ML based image classifiers. We have developed metamorphic relations for an application based on Support Vector Machine and a Deep Learning based application. Empirical validation showed that our approach was able to catch 71% of the implementation bugs in the ML applications.", "year": 2018, "referenceCount": 37, "citationCount": 120, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "15854877", "name": "Anurag Dwarakanath"}, {"authorId": "2059931153", "name": "Manish Ahuja"}, {"authorId": "51123546", "name": "Samarth Sikand"}, {"authorId": "51126776", "name": "Raghotham M. Rao"}, {"authorId": "145471941", "name": "R. Bose"}, {"authorId": "2071149341", "name": "Neville Dubash"}, {"authorId": "49424498", "name": "Sanjay Podder"}]}, {"paperId": "aad41c3828185b8d3e89b73867476b63ad0b9383", "url": "https://www.semanticscholar.org/paper/aad41c3828185b8d3e89b73867476b63ad0b9383", "title": "Neural Models for Information Retrieval", "abstract": "Neural ranking models for information retrieval (IR) use shallow or deep neural networks to rank search results in response to a query. Traditional learning to rank models employ machine learning techniques over hand-crafted IR features. By contrast, neural models learn representations of language from raw text that can bridge the gap between query and document vocabulary. Unlike classical IR models, these new machine learning based approaches are data-hungry, requiring large scale training data before they can be deployed. This tutorial introduces basic concepts and intuitions behind neural IR models, and places them in the context of traditional retrieval models. We begin by introducing fundamental concepts of IR and different neural and non-neural approaches to learning vector representations of text. We then review shallow neural IR methods that employ pre-trained neural term embeddings without learning the IR task end-to-end. We introduce deep neural networks next, discussing popular deep architectures. Finally, we review the current DNN models for information retrieval. We conclude with a discussion on potential future directions for neural IR.", "year": 2017, "referenceCount": 231, "citationCount": 137, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "116506812", "name": "Bhaskar Mitra"}, {"authorId": "1703980", "name": "Nick Craswell"}]}, {"paperId": "c15d04e562e00e8da1affe4ae9409da6b355da55", "url": "https://www.semanticscholar.org/paper/c15d04e562e00e8da1affe4ae9409da6b355da55", "title": "Machine-Learning-Accelerated Perovskite Crystallization", "abstract": null, "year": 2020, "referenceCount": 44, "citationCount": 53, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Materials Science"], "authors": [{"authorId": "81480327", "name": "J. Kirman"}, {"authorId": "152163135", "name": "Andrew K. Johnston"}, {"authorId": "34980936", "name": "D. Kuntz"}, {"authorId": "8067750", "name": "M. Askerka"}, {"authorId": "2145975240", "name": "Yuan Gao"}, {"authorId": "39862007", "name": "P. Todorović"}, {"authorId": "13280820", "name": "Dongxin Ma"}, {"authorId": "3952444", "name": "G. Privé"}, {"authorId": "1799992", "name": "E. Sargent"}]}, {"paperId": "3babafe0c2d2b5109a31ec79fa38ffa3caba9709", "url": "https://www.semanticscholar.org/paper/3babafe0c2d2b5109a31ec79fa38ffa3caba9709", "title": "Ship localization in Santa Barbara Channel using machine learning classifiers.", "abstract": "Machine learning classifiers are shown to outperform conventional matched field processing for a deep water (600 m depth) ocean acoustic-based ship range estimation problem in the Santa Barbara Channel Experiment when limited environmental information is known. Recordings of three different ships of opportunity on a vertical array were used as training and test data for the feed-forward neural network and support vector machine classifiers, demonstrating the feasibility of machine learning methods to locate unseen sources. The classifiers perform well up to 10 km range whereas the conventional matched field processing fails at about 4 km range without accurate environmental information.", "year": 2017, "referenceCount": 17, "citationCount": 59, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "8792988", "name": "Haiqiang Niu"}, {"authorId": "15018343", "name": "Emma Ozanich"}, {"authorId": "1929240", "name": "P. Gerstoft"}]}, {"paperId": "82f7073b503143cf3ed4d59dca2f206ba18a31b9", "url": "https://www.semanticscholar.org/paper/82f7073b503143cf3ed4d59dca2f206ba18a31b9", "title": "Optimizing Federated Learning on Non-IID Data with Reinforcement Learning", "abstract": "The widespread deployment of machine learning applications in ubiquitous environments has sparked interests in exploiting the vast amount of data stored on mobile devices. To preserve data privacy, Federated Learning has been proposed to learn a shared model by performing distributed training locally on participating devices and aggregating the local models into a global one. However, due to the limited network connectivity of mobile devices, it is not practical for federated learning to perform model updates and aggregation on all participating devices in parallel. Besides, data samples across all devices are usually not independent and identically distributed (IID), posing additional challenges to the convergence and speed of federated learning. In this paper, we propose Favor, an experience-driven control framework that intelligently chooses the client devices to participate in each round of federated learning to counterbalance the bias introduced by non-IID data and to speed up convergence. Through both empirical and mathematical analysis, we observe an implicit connection between the distribution of training data on a device and the model weights trained based on those data, which enables us to profile the data distribution on that device based on its uploaded model weights. We then propose a mechanism based on deep Q-learning that learns to select a subset of devices in each communication round to maximize a reward that encourages the increase of validation accuracy and penalizes the use of more communication rounds. With extensive experiments performed in PyTorch, we show that the number of communication rounds required in federated learning can be reduced by up to 49% on the MNIST dataset, 23% on FashionMNIST, and 42% on CIFAR-10, as compared to the Federated Averaging algorithm.", "year": 2020, "referenceCount": 18, "citationCount": 236, "influentialCitationCount": 27, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39483391", "name": "Hao Wang"}, {"authorId": "2005216177", "name": "Zakhary Kaplan"}, {"authorId": "1714907", "name": "Di Niu"}, {"authorId": "91269142", "name": "Baochun Li"}]}, {"paperId": "a8156a77ec99bff4dbb914d9153600fb51e51fd0", "url": "https://www.semanticscholar.org/paper/a8156a77ec99bff4dbb914d9153600fb51e51fd0", "title": "Support Vector Machines", "abstract": null, "year": 2002, "referenceCount": 0, "citationCount": 71, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "1680188", "name": "T. Joachims"}]}, {"paperId": "b78f6724ecd6a037655759d893482b020fd56a6f", "url": "https://www.semanticscholar.org/paper/b78f6724ecd6a037655759d893482b020fd56a6f", "title": "Parallel extreme learning machine for regression based on MapReduce", "abstract": null, "year": 2013, "referenceCount": 18, "citationCount": 149, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144131275", "name": "Qing He"}, {"authorId": "2863471", "name": "Tianfeng Shang"}, {"authorId": "1799525", "name": "Fuzhen Zhuang"}, {"authorId": "145000409", "name": "Zhongzhi Shi"}]}, {"paperId": "214bb2e60990ee1c8f396a0f29a93af187f951c2", "url": "https://www.semanticscholar.org/paper/214bb2e60990ee1c8f396a0f29a93af187f951c2", "title": "The Value of Collaboration in Convex Machine Learning with Differential Privacy", "abstract": "In this paper, we apply machine learning to distributed private data owned by multiple data owners, entities with access to non-overlapping training datasets. We use noisy, differentially-private gradients to minimize the fitness cost of the machine learning model using stochastic gradient descent. We quantify the quality of the trained model, using the fitness cost, as a function of privacy budget and size of the distributed datasets to capture the trade-off between privacy and utility in machine learning. This way, we can predict the outcome of collaboration among privacy-aware data owners prior to executing potentially computationally-expensive machine learning algorithms. Particularly, we show that the difference between the fitness of the trained machine learning model using differentially-private gradient queries and the fitness of the trained machine model in the absence of any privacy concerns is inversely proportional to the size of the training datasets squared and the privacy budget squared. We successfully validate the performance prediction with the actual performance of the proposed privacy-aware learning algorithms, applied to: financial datasets for determining interest rates of loans using regression; and detecting credit card frauds using support vector machines.", "year": 2019, "referenceCount": 35, "citationCount": 44, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2068343830", "name": "Nan Wu"}, {"authorId": "145788331", "name": "Farhad Farokhi"}, {"authorId": "2153149908", "name": "David B. Smith"}, {"authorId": "1708760", "name": "M. Kâafar"}]}, {"paperId": "e55a12818d7b65f3b728059ab8937c30bfa2b694", "url": "https://www.semanticscholar.org/paper/e55a12818d7b65f3b728059ab8937c30bfa2b694", "title": "Gesture modeling and recognition using finite state machines", "abstract": "We propose a state-based approach to gesture learning and recognition. Using spatial clustering and temporal alignment, each gesture is defined to be an ordered sequence of states in spatial-temporal space. The 2D image positions of the centers of the head and both hands of the user are used as features; these are located by a color-based tracking method. From training data of a given gesture, we first learn the spatial information and then group the data into segments that are automatically aligned temporally. The temporal information is further integrated to build a finite state machine (FSM) recognizer. Each gesture has a FSM corresponding to it. The computational efficiency of the FSM recognizers allows us to achieve real-time on-line performance. We apply this technique to build an experimental system that plays a game of \"Simon Says\" with the user.", "year": 2000, "referenceCount": 11, "citationCount": 269, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8824068", "name": "P. Hong"}, {"authorId": "153652752", "name": "Thomas S. Huang"}, {"authorId": "144097660", "name": "M. Turk"}]}, {"paperId": "0bff8898e3ebb1ab67fd20b5db00c6cb1938e6c3", "url": "https://www.semanticscholar.org/paper/0bff8898e3ebb1ab67fd20b5db00c6cb1938e6c3", "title": "Learning to combine foveal glimpses with a third-order Boltzmann machine", "abstract": "We describe a model based on a Boltzmann machine with third-order connections that can learn how to accumulate information about a shape over several fixations. The model uses a retina that only has enough high resolution pixels to cover a small area of the image, so it must decide on a sequence of fixations and it must combine the \"glimpse\" at each fixation with the location of the fixation before integrating the information with information from other glimpses of the same object. We evaluate this model on a synthetic dataset and two image classification datasets, showing that it can perform at least as well as a model trained on whole images.", "year": 2010, "referenceCount": 24, "citationCount": 385, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1777528", "name": "H. Larochelle"}, {"authorId": "1695689", "name": "Geoffrey E. Hinton"}]}, {"paperId": "b7718c7bb0d970a978a45ace93ba51a802d2d5c0", "url": "https://www.semanticscholar.org/paper/b7718c7bb0d970a978a45ace93ba51a802d2d5c0", "title": "The influence of negative training set size on machine learning-based virtual screening", "abstract": null, "year": 2014, "referenceCount": 26, "citationCount": 55, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "7008299", "name": "Rafał Kurczab"}, {"authorId": "2946779", "name": "Sabina Smusz"}, {"authorId": "2375698", "name": "A. Bojarski"}]}, {"paperId": "f9eacf0bb25e35fdacc4c4a9a06b66757168dbdf", "url": "https://www.semanticscholar.org/paper/f9eacf0bb25e35fdacc4c4a9a06b66757168dbdf", "title": "Reproducibility standards for machine learning in the life sciences.", "abstract": null, "year": 2021, "referenceCount": 17, "citationCount": 53, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "41070189", "name": "Benjamin J. Heil"}, {"authorId": "35290352", "name": "M. M. Hoffman"}, {"authorId": "1796516", "name": "F. Markowetz"}, {"authorId": "2180463", "name": "Su-In Lee"}, {"authorId": "2104940", "name": "C. Greene"}, {"authorId": "35099275", "name": "S. Hicks"}]}, {"paperId": "a72af788be16139536d3f19a2381c4504de7ae6b", "url": "https://www.semanticscholar.org/paper/a72af788be16139536d3f19a2381c4504de7ae6b", "title": "A Machine Learning Methodology for Diagnosing Chronic Kidney Disease", "abstract": "Chronic kidney disease (CKD) is a global health problem with high morbidity and mortality rate, and it induces other diseases. Since there are no obvious symptoms during the early stages of CKD, patients often fail to notice the disease. Early detection of CKD enables patients to receive timely treatment to ameliorate the progression of this disease. Machine learning models can effectively aid clinicians achieve this goal due to their fast and accurate recognition performance. In this study, we propose a machine learning methodology for diagnosing CKD. The CKD data set was obtained from the University of California Irvine (UCI) machine learning repository, which has a large number of missing values. KNN imputation was used to fill in the missing values, which selects several complete samples with the most similar measurements to process the missing data for each incomplete sample. Missing values are usually seen in real-life medical situations because patients may miss some measurements for various reasons. After effectively filling out the incomplete data set, six machine learning algorithms (logistic regression, random forest, support vector machine, k-nearest neighbor, naive Bayes classifier and feed forward neural network) were used to establish models. Among these machine learning models, random forest achieved the best performance with 99.75% diagnosis accuracy. By analyzing the misjudgments generated by the established models, we proposed an integrated model that combines logistic regression and random forest by using perceptron, which could achieve an average accuracy of 99.83% after ten times of simulation. Hence, we speculated that this methodology could be applicable to more complicated clinical data for disease diagnosis.", "year": 2020, "referenceCount": 35, "citationCount": 62, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1491639926", "name": "Jiongming Qin"}, {"authorId": "2118537154", "name": "Lin Chen"}, {"authorId": "2108173123", "name": "Yuhua Liu"}, {"authorId": "50557626", "name": "Chuanjun Liu"}, {"authorId": "15939357", "name": "Changhao Feng"}, {"authorId": "2146711235", "name": "Bin Chen"}]}, {"paperId": "5910ccdd6658998d3fd695945050aeaf40b2f182", "url": "https://www.semanticscholar.org/paper/5910ccdd6658998d3fd695945050aeaf40b2f182", "title": "Memory-Based Language Processing", "abstract": "Memory-based language processing--a machine learning and problem solving method for language technology--is based on the idea that the direct re-use of examples using analogical reasoning is more suited for solving language processing problems than the application of rules extracted from those examples. This book discusses the theory and practice of memory-based language processing, showing its comparative strengths over alternative methods of language modelling. Language is complex, with few generalizations, many sub-regularities and exceptions, and the advantage of memory-based language processing is that it does not abstract away from this valuable low-frequency information.", "year": 2009, "referenceCount": 11, "citationCount": 410, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1735272", "name": "Walter Daelemans"}, {"authorId": "145977875", "name": "Antal van den Bosch"}]}, {"paperId": "ae85a32fb402effb4f1a2bde1d40243c66fd1096", "url": "https://www.semanticscholar.org/paper/ae85a32fb402effb4f1a2bde1d40243c66fd1096", "title": "Hate speech detection in the Indonesian language: A dataset and preliminary study", "abstract": "The objective of our work is to detect hate speech in the Indonesian language. As far as we know, the research on this subject is still very rare. The only research we found has created a dataset for hate speech against religion, but the quality of this dataset is inadequate. Our research aimed to create a new dataset that covers hate speech in general, including hatred for religion, race, ethnicity, and gender. In addition, we also conducted a preliminary study using machine learning approach. Machine learning so far is the most frequently used approach in classifying text. We compared the performance of several features and machine learning algorithms for hate speech detection. Features that extracted were word n-gram with n=l and n=2, character n-gram with n=3 and n=4, and negative sentiment. The classification was performed using Naïve Bayes, Support Vector Machine, Bayesian Logistic Regression, and Random Forest Decision Tree. An F-measure of 93.5% was achieved when using word n-gram feature with Random Forest Decision Tree algorithm. Results also show that word n-gram feature outperformed character n-gram.", "year": 2017, "referenceCount": 11, "citationCount": 108, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2683858", "name": "Ika Alfina"}, {"authorId": "2072451661", "name": "Rio Mulia"}, {"authorId": "2656725", "name": "M. I. Fanany"}, {"authorId": "41037202", "name": "Yudo Ekanata"}]}, {"paperId": "408b3539cad0d5ca5f74ab60d4ed0b290f133a84", "url": "https://www.semanticscholar.org/paper/408b3539cad0d5ca5f74ab60d4ed0b290f133a84", "title": "Comparing Boosting and Bagging Techniques With Noisy and Imbalanced Data", "abstract": "This paper compares the performance of several boosting and bagging techniques in the context of learning from imbalanced and noisy binary-class data. Noise and class imbalance are two well-established data characteristics encountered in a wide range of data mining and machine learning initiatives. The learning algorithms studied in this paper, which include SMOTEBoost, RUSBoost, Exactly Balanced Bagging, and Roughly Balanced Bagging, combine boosting or bagging with data sampling to make them more effective when data are imbalanced. These techniques are evaluated in a comprehensive suite of experiments, for which nearly four million classification models were trained. All classifiers are assessed using seven different performance metrics, providing a complete perspective on the performance of these techniques, and results are tested for statistical significance via analysis-of-variance modeling. The experiments show that the bagging techniques generally outperform boosting, and hence in noisy data environments, bagging is the preferred method for handling class imbalance.", "year": 2011, "referenceCount": 46, "citationCount": 241, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1725285", "name": "T. Khoshgoftaar"}, {"authorId": "3328057", "name": "J. V. Hulse"}, {"authorId": "1690347", "name": "A. Napolitano"}]}, {"paperId": "93e0179597f07d0a981ec87a042efce2dcd5c954", "url": "https://www.semanticscholar.org/paper/93e0179597f07d0a981ec87a042efce2dcd5c954", "title": "Predicting interfacial thermal resistance by machine learning", "abstract": null, "year": 2019, "referenceCount": 102, "citationCount": 58, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2115679781", "name": "Yen‐Ju Wu"}, {"authorId": "144567627", "name": "Lei Fang"}, {"authorId": "153018856", "name": "Yibin Xu"}]}, {"paperId": "299d674c1a257ecbf1110ba06845167e522eb572", "url": "https://www.semanticscholar.org/paper/299d674c1a257ecbf1110ba06845167e522eb572", "title": "To address surface reaction network complexity using scaling relations machine learning and DFT calculations", "abstract": null, "year": 2017, "referenceCount": 34, "citationCount": 299, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "3352278", "name": "Zachary W. Ulissi"}, {"authorId": "7819934", "name": "Andrew J. Medford"}, {"authorId": "2784394", "name": "T. Bligaard"}, {"authorId": "1397051203", "name": "J. Nørskov"}]}, {"paperId": "464656fc6431f1db8b2e0b0b3093a5df1cb7958e", "url": "https://www.semanticscholar.org/paper/464656fc6431f1db8b2e0b0b3093a5df1cb7958e", "title": "Interpretability of machine learning models and representations: an introduction", "abstract": "Interpretability is often a major concern in machine learning. Although many authors agree with this statement, interpretability is often tackled with intuitive arguments, distinct (yet related) terms and heuristic quantifications. This short survey aims to clarify the concepts related to interpretability and emphasises the distinction between interpreting models and representations, as well as heuristic-based and user-based approaches.", "year": 2016, "referenceCount": 29, "citationCount": 85, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "8533198", "name": "A. Bibal"}, {"authorId": "1786603", "name": "Benoît Frénay"}]}, {"paperId": "e0a9287d3004e95b36630476faab72c18684d731", "url": "https://www.semanticscholar.org/paper/e0a9287d3004e95b36630476faab72c18684d731", "title": "On neurobiological, neuro-fuzzy, machine learning, and statistical pattern recognition techniques", "abstract": "In this paper, we propose two new neuro-fuzzy schemes, one for classification and one for clustering problems. The classification scheme is based on Simpson's fuzzy min-max method (1992, 1993) and relaxes some assumptions he makes. This enables our scheme to handle mutually nonexclusive classes. The neuro-fuzzy clustering scheme is a multiresolution algorithm that is modeled after the mechanics of human pattern recognition. We also present data from an exhaustive comparison of these techniques with neural, statistical, machine learning, and other traditional approaches to pattern recognition applications. The data sets used for comparisons include those from the machine learning repository at the University of California, Irvine. We find that our proposed schemes compare quite well with the existing techniques, and in addition offer the advantages of one-pass learning and online adaptation.", "year": 1997, "referenceCount": 80, "citationCount": 86, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "145029954", "name": "A. Joshi"}, {"authorId": "3118728", "name": "Narendran Ramakrishman"}, {"authorId": "1682549", "name": "E. Houstis"}, {"authorId": "34227915", "name": "Purdue R. Rice"}]}, {"paperId": "21ad6fda64e3749692dc73b32278bd47ed415acb", "url": "https://www.semanticscholar.org/paper/21ad6fda64e3749692dc73b32278bd47ed415acb", "title": "Active learning in multimedia annotation and retrieval: A survey", "abstract": "Active learning is a machine learning technique that selects the most informative samples for labeling and uses them as training data. It has been widely explored in multimedia research community for its capability of reducing human annotation effort. In this article, we provide a survey on the efforts of leveraging active learning in multimedia annotation and retrieval. We mainly focus on two application domains: image/video annotation and content-based image retrieval. We first briefly introduce the principle of active learning and then we analyze the sample selection criteria. We categorize the existing sample selection strategies used in multimedia annotation and retrieval into five criteria: risk reduction, uncertainty, diversity, density and relevance. We then introduce several classification models used in active learning-based multimedia annotation and retrieval, including semi-supervised learning, multilabel learning and multiple instance learning. We also provide a discussion on several future trends in this research direction. In particular, we discuss cost analysis of human annotation and large-scale interactive multimedia annotation.", "year": 2011, "referenceCount": 95, "citationCount": 238, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2146057887", "name": "Meng Wang"}, {"authorId": "143863244", "name": "Xiansheng Hua"}]}, {"paperId": "e3b25bd5e69701eac7613e9dbfba8e074f824749", "url": "https://www.semanticscholar.org/paper/e3b25bd5e69701eac7613e9dbfba8e074f824749", "title": "Predictable and precise template-free CRISPR editing of pathogenic variants", "abstract": null, "year": 2018, "referenceCount": 36, "citationCount": 323, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Biology", "Medicine"], "authors": [{"authorId": "1491793237", "name": "Max W. Shen"}, {"authorId": "47090103", "name": "Mandana Arbab"}, {"authorId": "144371116", "name": "Jonathan Y. Hsu"}, {"authorId": "47662796", "name": "D. Worstell"}, {"authorId": "48566244", "name": "Sannie J. Culbertson"}, {"authorId": "26968899", "name": "Olga Krabbe"}, {"authorId": "2480457", "name": "C. Cassa"}, {"authorId": "2949942", "name": "David R. Liu"}, {"authorId": "145253803", "name": "D. Gifford"}, {"authorId": "31903094", "name": "R. Sherwood"}]}, {"paperId": "ea22871302da564c1b5c7ee8fc5f0839133198ff", "url": "https://www.semanticscholar.org/paper/ea22871302da564c1b5c7ee8fc5f0839133198ff", "title": "Quantum Generative Adversarial Learning.", "abstract": "Generative adversarial networks represent a powerful tool for classical machine learning: a generator tries to create statistics for data that mimics those of a true data set, while a discriminator tries to discriminate between the true and fake data. The learning process for generator and discriminator can be thought of as an adversarial game, and under reasonable assumptions, the game converges to the point where the generator generates the same statistics as the true data and the discriminator is unable to discriminate between the true and the generated data. This Letter introduces the notion of quantum generative adversarial networks, where the data consist either of quantum states or of classical data, and the generator and discriminator are equipped with quantum information processors. We show that the unique fixed point of the quantum adversarial game also occurs when the generator produces the same statistics as the data. Neither the generator nor the discriminator perform quantum tomography; linear programing drives them to the optimal. Since quantum systems are intrinsically probabilistic, the proof of the quantum case is different from-and simpler than-the classical case. We show that, when the data consist of samples of measurements made on high-dimensional spaces, quantum adversarial networks may exhibit an exponential advantage over classical adversarial networks.", "year": 2018, "referenceCount": 21, "citationCount": 231, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Physics"], "authors": [{"authorId": "145762777", "name": "S. Lloyd"}, {"authorId": "2260031", "name": "C. Weedbrook"}]}, {"paperId": "bc89a6fbf43cf911f71e5428d0b4a70fa5a40be9", "url": "https://www.semanticscholar.org/paper/bc89a6fbf43cf911f71e5428d0b4a70fa5a40be9", "title": "A Human-Centered Agenda for Intelligible Machine Learning", "abstract": "To build machine learning systems that are reliable, trustworthy, and fair, we must be able to provide relevant stakeholders with an understanding of how these systems work. Yet what makes a system “intelligible” is difficult to pin down. Intelligibility is a fundamentally human-centered concept that lacks a one-size-fits-all solution. Although many intelligibility techniques have been proposed in the machine learning literature, there are many more open questions about how best to provide stakeholders with the information they need to achieve their desired goals. In this chapter, we begin with an overview of the intelligible machine learning landscape and give several examples of the diverse ways in which needs for intelligibility can arise. We provide an overview of the techniques for achieving intelligibility that have been proposed in the machine learning literature. We discuss the importance of taking a human-centered strategy when designing intelligibility techniques or when verifying that these techniques achieve their intended goals. We also argue that the notion of intelligibility should be expanded beyond machine learning models to other components of machine learning systems, such as datasets and performance metrics. Finally, we emphasize the necessity of tight integration between the machine learning and human–computer interaction communities.", "year": 2021, "referenceCount": 69, "citationCount": 40, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "4006636", "name": "Jennifer Wortman Vaughan"}, {"authorId": "1831395", "name": "H. Wallach"}]}, {"paperId": "9d531d27cd6163fbf9d6ee0ede577b4342f77c62", "url": "https://www.semanticscholar.org/paper/9d531d27cd6163fbf9d6ee0ede577b4342f77c62", "title": "Using Supervised Machine Learning to Code Policy Issues", "abstract": "Content analysis of political communication usually covers large amounts of material and makes the study of dynamics in issue salience a costly enterprise. In this article, we present a supervised machine learning approach for the automatic coding of policy issues, which we apply to news articles and parliamentary questions. Comparing computer-based annotations with human annotations shows that our method approaches the performance of human coders. Furthermore, we investigate the capability of an automatic coding tool, which is based on supervised machine learning, to generalize across contexts. We conclude by highlighting implications for methodological advances and empirical theory testing.", "year": 2015, "referenceCount": 15, "citationCount": 75, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Sociology"], "authors": [{"authorId": "2423093", "name": "Bjorn Burscher"}, {"authorId": "72580502", "name": "R. Vliegenthart"}, {"authorId": "51913730", "name": "C. D. de Vreese"}]}, {"paperId": "26d11d2eab9b9842130e1fef2ce6f6e22324556d", "url": "https://www.semanticscholar.org/paper/26d11d2eab9b9842130e1fef2ce6f6e22324556d", "title": "Coronavirus (COVID-19) Classification using CT Images by Machine Learning Methods", "abstract": "This study presents early phase detection of Coronavirus (COVID-19), which is named by World Health Organization (WHO), by machine learning methods. The detection process was implemented on abdominal Computed Tomography (CT) images. The expert radiologists detected from CT images that COVID-19 shows different behaviours from other viral pneumonia. Therefore, the clinical experts specify that COVID-19 virus needs to be diagnosed in early phase. For detection of the COVID-19, four different datasets were formed by taking patches sized as 16x16, 32x32, 48x48, 64x64 from 150 CT images. The feature extraction process was applied to patches to increase the classification performance. Grey Level Co-occurrence Matrix (GLCM), Local Directional Pattern (LDP), Grey Level Run Length Matrix (GLRLM), Grey-Level Size Zone Matrix (GLSZM), and Discrete Wavelet Transform (DWT) algorithms were used as feature extraction methods. Support Vector Machines (SVM) classified the extracted features. 2-fold, 5-fold and 10-fold cross-validations were implemented during the classification process. Sensitivity, specificity, accuracy, precision, and F-score metrics were used to evaluate the classification performance. The best classification accuracy was obtained as 99.68% with 10-fold cross-validation and GLSZM feature extraction method.", "year": 2020, "referenceCount": 32, "citationCount": 245, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "27841306", "name": "Mücahid Barstugan"}, {"authorId": "40704934", "name": "U. Ozkaya"}, {"authorId": "51426877", "name": "Ş. Öztürk"}]}, {"paperId": "a20f3dfc9142b48b924e68ee22ba259a0d621bb2", "url": "https://www.semanticscholar.org/paper/a20f3dfc9142b48b924e68ee22ba259a0d621bb2", "title": "AirSim: High-Fidelity Visual and Physical Simulation for Autonomous Vehicles", "abstract": null, "year": 2017, "referenceCount": 35, "citationCount": 1112, "influentialCitationCount": 164, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47973411", "name": "S. Shah"}, {"authorId": "1780951", "name": "Debadeepta Dey"}, {"authorId": "145634273", "name": "C. Lovett"}, {"authorId": "2189118", "name": "Ashish Kapoor"}]}, {"paperId": "f50f097c55f1afa67efd4b1d3217751646d66eaf", "url": "https://www.semanticscholar.org/paper/f50f097c55f1afa67efd4b1d3217751646d66eaf", "title": "Interpersonal Synchrony: A Survey of Evaluation Methods across Disciplines", "abstract": "Synchrony refers to individuals' temporal coordination during social interactions. The analysis of this phenomenon is complex, requiring the perception and integration of multimodal communicative signals. The evaluation of synchrony has received multidisciplinary attention because of its role in early development, language learning, and social connection. Originally studied by developmental psychologists, synchrony has now captured the interest of researchers in such fields as social signal processing, robotics, and machine learning. This paper emphasizes the current questions asked by synchrony evaluation and the state-of-the-art related methods. First, we present definitions and functions of synchrony in youth and adulthood. Next, we review the noncomputational and computational approaches of annotating, evaluating, and modeling interactional synchrony. Finally, the current limitations and future research directions in the fields of developmental robotics, social robotics, and clinical studies are discussed.", "year": 2012, "referenceCount": 158, "citationCount": 349, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Psychology"], "authors": [{"authorId": "2729370", "name": "E. Delaherche"}, {"authorId": "1680828", "name": "M. Chetouani"}, {"authorId": "153344543", "name": "A. Mahdhaoui"}, {"authorId": "1402522992", "name": "C. Saint-Georges"}, {"authorId": "2241189", "name": "Sylvie Viaux"}, {"authorId": "2106390686", "name": "D. Cohen"}]}, {"paperId": "3b816a180de101ec87ebe293d1138f5f5f15fae0", "url": "https://www.semanticscholar.org/paper/3b816a180de101ec87ebe293d1138f5f5f15fae0", "title": "Pattern recognition with machine learning on optical microscopy images of typical metallurgical microstructures", "abstract": null, "year": 2018, "referenceCount": 47, "citationCount": 79, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "4131617", "name": "D. Bulgarevich"}, {"authorId": "100535293", "name": "S. Tsukamoto"}, {"authorId": "31441029", "name": "T. Kasuya"}, {"authorId": "35497321", "name": "M. Demura"}, {"authorId": "2005930350", "name": "M. Watanabe"}]}, {"paperId": "f01049c187806b3a7794b11219b7a3ce3f5bf692", "url": "https://www.semanticscholar.org/paper/f01049c187806b3a7794b11219b7a3ce3f5bf692", "title": "The Russian Theory of Activity: Current Applications To Design and Learning", "abstract": "Contents: E.A. Fleishman, Foreword. The Concept of Work Activity. Self-Regulation of Activity. Information Processing. Design of the Human Machine System. Representative Examples of Russian Ergonomics Studies. System-Structural Analysis and Design of Work Activity. Learning and Training. Other Theories of Learning From Activity Viewpoint. Characteristics of the Work Process.", "year": 1997, "referenceCount": 8, "citationCount": 122, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "70091035", "name": "G. Z. Bednyĭ"}, {"authorId": "145597119", "name": "D. Meister"}]}, {"paperId": "45f3219d3880dd222ddd5d7633b36fb1696403dc", "url": "https://www.semanticscholar.org/paper/45f3219d3880dd222ddd5d7633b36fb1696403dc", "title": "Three machine learning techniques for automatic determination of rules to control locomotion", "abstract": "Automatic prediction of gait events (e,g,, heel contact, flat foot, initiation of the swing, etc.) and corresponding profiles of the activations of muscles is important for real-time control of locomotion. This paper presents three supervised machine learning (ML) techniques for prediction of the activation patterns of muscles and sensory data, based on the history of sensory data, for walking assisted by a functional electrical stimulation (FES). Those ML's are: (1) a multilayer perceptron with Levenberg-Marquardt modification of backpropagation learning algorithm; (2) an adaptive-network-based fuzzy inference system (ANFIS); and (3) a combination of an entropy minimization type of inductive learning (IL) technique and a radial basis function (RBF) type of artificial neural network with orthogonal least squares learning algorithm. Here we show the prediction of the activation of the knee flexor muscles and the knee joint angle for seven consecutive strides based on the history of the knee joint angle and the ground reaction forces. The data used for training and testing of ML's was obtained from a simulation of walking assisted with an FES system. The ability of generating rules for an FES controller was selected as the most important criterion when comparing the ML's. Other criteria such as generalization of results, computational complexity, and learning rate mere also considered. The minimal number of rules and the most explicit and comprehensible rules were obtained by ANFIS. The best generalization was obtained by the IL and RBF network.", "year": 1999, "referenceCount": 84, "citationCount": 116, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "5651357", "name": "S. Jonić"}, {"authorId": "2141977064", "name": "T. Jankovic"}, {"authorId": "2095389691", "name": "V. Gajic"}, {"authorId": "14670167", "name": "D. Popvić"}]}, {"paperId": "7cbe4b20e36b97ab51b04224f4261db0ad51291e", "url": "https://www.semanticscholar.org/paper/7cbe4b20e36b97ab51b04224f4261db0ad51291e", "title": "Machine perception and learning of complex social systems", "abstract": "The study of complex social systems has traditionally been an arduous process, involving extensive surveys, interviews, ethnographic studies, or analysis of online behavior. Today, however, it is possible to use the unprecedented amount of information generated by pervasive mobile phones to provide insights into the dynamics of both individual and group behavior. Information such as continuous proximity, location, communication and activity data, has been gathered from the phones of 100 human subjects at MIT. Systematic measurements from these 100 people over the course of eight months have generated one of the largest datasets of continuous human behavior ever collected, representing over 300,000 hours of daily activity. In this thesis we describe how this data can be used to uncover regular rules and structure in behavior of both individuals and organizations, infer relationships between subjects, verify selfreport survey data, and study social network dynamics. By combining theoretical models with rich and systematic measurements, we show it is possible to gain insight into the underlying behavior of complex social systems. Thesis Supervisor: Alex P. Pentland Title: Toshiba Professor of Media Arts and Sciences, MIT.", "year": 2005, "referenceCount": 120, "citationCount": 137, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2724608", "name": "N. Eagle"}]}, {"paperId": "c6cf69976f1abc19e4ee4f138d8a49c0e5803b3d", "url": "https://www.semanticscholar.org/paper/c6cf69976f1abc19e4ee4f138d8a49c0e5803b3d", "title": "Learning machines and sleeping brains: Automatic sleep stage classification using decision-tree multi-class support vector machines", "abstract": null, "year": 2015, "referenceCount": 86, "citationCount": 237, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2274531", "name": "Tarek Lajnef"}, {"authorId": "2716472", "name": "S. Chaibi"}, {"authorId": "145310561", "name": "P. Ruby"}, {"authorId": "1889169", "name": "P. Aguera"}, {"authorId": "4160775", "name": "Jean-Baptiste Eichenlaub"}, {"authorId": "3146042", "name": "M. Samet"}, {"authorId": "2480885", "name": "A. Kachouri"}, {"authorId": "1714811", "name": "K. Jerbi"}]}, {"paperId": "ed03a982c9963cc8bcf12d802bd7843db9a5c542", "url": "https://www.semanticscholar.org/paper/ed03a982c9963cc8bcf12d802bd7843db9a5c542", "title": "Authorship Attribution and Verification with Many Authors and Limited Data", "abstract": "Most studies in statistical or machine learning based authorship attribution focus on two or a few authors. This leads to an overestimation of the importance of the features extracted from the training data and found to be discriminating for these small sets of authors. Most studies also use sizes of training data that are unrealistic for situations in which stylometry is applied (e.g., forensics), and thereby overestimate the accuracy of their approach in these situations. A more realistic interpretation of the task is as an authorship verification problem that we approximate by pooling data from many different authors as negative examples. In this paper, we show, on the basis of a new corpus with 145 authors, what the effect is of many authors on feature selection and learning, and show robustness of a memory-based learning approach in doing authorship attribution and verification with many authors and limited training data when compared to eager learning methods such as SVMs and maximum entropy learning.", "year": 2008, "referenceCount": 30, "citationCount": 168, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1746388", "name": "Kim Luyckx"}, {"authorId": "1735272", "name": "Walter Daelemans"}]}, {"paperId": "3c8ab284ca6e315be0def549b7d64c28af678861", "url": "https://www.semanticscholar.org/paper/3c8ab284ca6e315be0def549b7d64c28af678861", "title": "A comparative study on Thai word segmentation approaches", "abstract": "In this paper, we analyze and compare various approaches for Thai word segmentation. The word segmentation approaches could be classified into two distinct types, dictionary based (DCB) and machine learning based (MLB). The DCB approach relies on a set of terms for parsing and segmenting input texts. Whereas the MLB approach relies on a model trained from a corpus by using machine learning techniques. We compare between two algorithms from the DCB approach: longest-matching and maximal matching, and four algorithms from the MLB approach: Naive Bayes (NB), decision tree, support vector machine (SVM), and conditional random field (CRF). From the experimental results, the DCB approach yielded better performance than the NB, decision tree and SVM algorithms from the MLB approach. However, the best performance was obtained from the CRF algorithm with the precision and recall of 95.79% and 94.98%, respectively.", "year": 2008, "referenceCount": 14, "citationCount": 104, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2815356", "name": "C. Haruechaiyasak"}, {"authorId": "2533998", "name": "S. Kongyoung"}, {"authorId": "3441850", "name": "M. Dailey"}]}, {"paperId": "a17dfcb044539b1c59f078c382262fb2eb70905e", "url": "https://www.semanticscholar.org/paper/a17dfcb044539b1c59f078c382262fb2eb70905e", "title": "Applications Of Multi-Objective Evolutionary Algorithms", "abstract": "An Introduction to Multi-Objective Evolutionary Algorithms and Their Applications Optimal Design of Industrial Electromagnetic Devices: A Multiobjective Evolutionary Approach Using a Particle Swarm Optimizer with a Multi-Objective Selection Scheme to Design Combinational Logic Circuits Automatic Control System Design via a Multiobjective Evolutionary Algorithm Evolutionary Multi-Objective Optimization of Trusses A Multi-Objective Evolutionary Algorithm for the Covering Tour Problem Multiobjective Aerodynamic Design and Visualization of Supersonic Wings by Using Adaptive Range Multiobjective Genetic Algorithms Mutli-Objective Spectroscopic Data Analysis of Inertial Confinement Fusion Implosion Cores: Plasma Gradient Determination On Machine Learning with Multiobjective Genetic Optimization and other papers.", "year": 2004, "referenceCount": 0, "citationCount": 401, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "145485250", "name": "C. Coello"}, {"authorId": "144799804", "name": "G. Lamont"}]}, {"paperId": "42dea2a24629bd4b1b56619536e263b078becddd", "url": "https://www.semanticscholar.org/paper/42dea2a24629bd4b1b56619536e263b078becddd", "title": "Towards Synthesizing Complex Programs From Input-Output Examples", "abstract": "In recent years, deep learning techniques have been developed to improve the performance of program synthesis from input-output examples. Albeit its significant progress, the programs that can be synthesized by state-of-the-art approaches are still simple in terms of their complexity. In this work, we move a significant step forward along this direction by proposing a new class of challenging tasks in the domain of program synthesis from input-output examples: learning a context-free parser from pairs of input programs and their parse trees. We show that this class of tasks are much more challenging than previously studied tasks, and the test accuracy of existing approaches is almost 0%. \nWe tackle the challenges by developing three novel techniques inspired by three novel observations, which reveal the key ingredients of using deep learning to synthesize a complex program. First, the use of a non-differentiable machine is the key to effectively restrict the search space. Thus our proposed approach learns a neural program operating a domain-specific non-differentiable machine. Second, recursion is the key to achieve generalizability. Thus, we bake-in the notion of recursion in the design of our non-differentiable machine. Third, reinforcement learning is the key to learn how to operate the non-differentiable machine, but it is also hard to train the model effectively with existing reinforcement learning algorithms from a cold boot. We develop a novel two-phase reinforcement learning-based search algorithm to overcome this issue. In our evaluation, we show that using our novel approach, neural parsing programs can be learned to achieve 100% test accuracy on test inputs that are 500x longer than the training samples.", "year": 2017, "referenceCount": 37, "citationCount": 42, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1425082935", "name": "Xinyun Chen"}, {"authorId": "2118484320", "name": "Chang Liu"}, {"authorId": "143711382", "name": "D. Song"}]}, {"paperId": "6b1e75abeae1f5d3c3bdaee554b1122b77549eda", "url": "https://www.semanticscholar.org/paper/6b1e75abeae1f5d3c3bdaee554b1122b77549eda", "title": "Forecasting Corn Yield With Machine Learning Ensembles", "abstract": "The emergence of new technologies to synthesize and analyze big data with high-performance computing has increased our capacity to more accurately predict crop yields. Recent research has shown that machine learning (ML) can provide reasonable predictions faster and with higher flexibility compared to simulation crop modeling. However, a single machine learning model can be outperformed by a “committee” of models (machine learning ensembles) that can reduce prediction bias, variance, or both and is able to better capture the underlying distribution of the data. Yet, there are many aspects to be investigated with regard to prediction accuracy, time of the prediction, and scale. The earlier the prediction during the growing season the better, but this has not been thoroughly investigated as previous studies considered all data available to predict yields. This paper provides a machine leaning based framework to forecast corn yields in three US Corn Belt states (Illinois, Indiana, and Iowa) considering complete and partial in-season weather knowledge. Several ensemble models are designed using blocked sequential procedure to generate out-of-bag predictions. The forecasts are made in county-level scale and aggregated for agricultural district and state level scales. Results show that the proposed optimized weighted ensemble and the average ensemble are the most precise models with RRMSE of 9.5%. Stacked LASSO makes the least biased predictions (MBE of 53 kg/ha), while other ensemble models also outperformed the base learners in terms of bias. On the contrary, although random k-fold cross-validation is replaced by blocked sequential procedure, it is shown that stacked ensembles perform not as good as weighted ensemble models for time series data sets as they require the data to be non-IID to perform favorably. Comparing our proposed model forecasts with the literature demonstrates the acceptable performance of forecasts made by our proposed ensemble model. Results from the scenario of having partial in-season weather knowledge reveals that decent yield forecasts with RRMSE of 9.2% can be made as early as June 1st. Moreover, it was shown that the proposed model performed better than individual models and benchmark ensembles at agricultural district and state-level scales as well as county-level scale. To find the marginal effect of each input feature on the forecasts made by the proposed ensemble model, a methodology is suggested that is the basis for finding feature importance for the ensemble model. The findings suggest that weather features corresponding to weather in weeks 18–24 (May 1st to June 1st) are the most important input features.", "year": 2020, "referenceCount": 237, "citationCount": 54, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Mathematics"], "authors": [{"authorId": "26938970", "name": "Mohsen Shahhosseini"}, {"authorId": "2617141", "name": "Guiping Hu"}, {"authorId": "3476034", "name": "S. Archontoulis"}]}, {"paperId": "187110ea2bb38456b73fc50399bd7ce5f622702a", "url": "https://www.semanticscholar.org/paper/187110ea2bb38456b73fc50399bd7ce5f622702a", "title": "Discriminative Least Squares Regression for Multiclass Classification and Feature Selection", "abstract": "This paper presents a framework of discriminative least squares regression (LSR) for multiclass classification and feature selection. The core idea is to enlarge the distance between different classes under the conceptual framework of LSR. First, a technique called ε-dragging is introduced to force the regression targets of different classes moving along opposite directions such that the distances between classes can be enlarged. Then, the ε-draggings are integrated into the LSR model for multiclass classification. Our learning framework, referred to as discriminative LSR, has a compact model form, where there is no need to train two-class machines that are independent of each other. With its compact form, this model can be naturally extended for feature selection. This goal is achieved in terms of L2,1 norm of matrix, generating a sparse learning model for feature selection. The model for multiclass classification and its extension for feature selection are finally solved elegantly and efficiently. Experimental evaluation over a range of benchmark datasets indicates the validity of our method.", "year": 2012, "referenceCount": 66, "citationCount": 310, "influentialCitationCount": 47, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Medicine", "Computer Science"], "authors": [{"authorId": "1683738", "name": "Shiming Xiang"}, {"authorId": "144962210", "name": "F. Nie"}, {"authorId": "3182192", "name": "Gaofeng Meng"}, {"authorId": "144809241", "name": "Chunhong Pan"}, {"authorId": "14966740", "name": "Changshui Zhang"}]}, {"paperId": "ffe00c7ecdebc4d59074120205a76c3433a17083", "url": "https://www.semanticscholar.org/paper/ffe00c7ecdebc4d59074120205a76c3433a17083", "title": "Graph Kernels for RDF Data", "abstract": null, "year": 2012, "referenceCount": 30, "citationCount": 96, "influentialCitationCount": 12, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34822220", "name": "Uta Lösch"}, {"authorId": "1699107", "name": "Stephan Bloehdorn"}, {"authorId": "1748257", "name": "Achim Rettinger"}]}, {"paperId": "c97a189dae51cb015cb649d6dbbf5a82966806e7", "url": "https://www.semanticscholar.org/paper/c97a189dae51cb015cb649d6dbbf5a82966806e7", "title": "Surveying the reach and maturity of machine learning and artificial intelligence in astronomy", "abstract": "Machine learning (automated processes that learn by example in order to classify, predict, discover, or generate new data) and artificial intelligence (methods by which a computer makes decisions or discoveries that would usually require human intelligence) are now firmly established in astronomy. Every week, new applications of machine learning and artificial intelligence are added to a growing corpus of work. Random forests, support vector machines, and neural networks are now having a genuine impact for applications as diverse as discovering extrasolar planets, transient objects, quasars, and gravitationally lensed systems, forecasting solar activity, and distinguishing between signals and instrumental effects in gravitational wave astronomy. This review surveys contemporary, published literature on machine learning and artificial intelligence in astronomy and astrophysics. Applications span seven main categories of activity: classification, regression, clustering, forecasting, generation, discovery, and the development of new scientific insights. These categories form the basis of a hierarchy of maturity, as the use of machine learning and artificial intelligence emerges, progresses, or becomes established.", "year": 2019, "referenceCount": 353, "citationCount": 45, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "2040500", "name": "C. Fluke"}, {"authorId": "2052756989", "name": "C. Jacobs"}]}, {"paperId": "6f05b2c715e333c0d47227906ca091d966bba887", "url": "https://www.semanticscholar.org/paper/6f05b2c715e333c0d47227906ca091d966bba887", "title": "Bayesian Canonical correlation analysis", "abstract": "Canonical correlation analysis (CCA) is a classical method for seeking correlations between two multivariate data sets. During the last ten years, it has received more and more attention in the machine learning community in the form of novel computational formulations and a plethora of applications. We review recent developments in Bayesian models and inference methods for CCA which are attractive for their potential in hierarchical extensions and for coping with the combination of large dimensionalities and small sample sizes. The existing methods have not been particularly successful in fulfilling the promise yet; we introduce a novel efficient solution that imposes group-wise sparsity to estimate the posterior of an extended model which not only extracts the statistical dependencies (correlations) between data sets but also decomposes the data into shared and data set-specific components. In statistics literature the model is known as inter-battery factor analysis (IBFA), for which we now provide a Bayesian treatment.", "year": 2013, "referenceCount": 78, "citationCount": 170, "influentialCitationCount": 29, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1718725", "name": "Arto Klami"}, {"authorId": "40210701", "name": "S. Virtanen"}, {"authorId": "1711144", "name": "Samuel Kaski"}]}, {"paperId": "858549b00245aadc92f91a2540f01398f5f389ae", "url": "https://www.semanticscholar.org/paper/858549b00245aadc92f91a2540f01398f5f389ae", "title": "A solution to the learning dilemma for recurrent networks of spiking neurons", "abstract": null, "year": 2019, "referenceCount": 139, "citationCount": 191, "influentialCitationCount": 33, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "3401407", "name": "G. Bellec"}, {"authorId": "65825675", "name": "Franz Scherr"}, {"authorId": "2259829", "name": "Anand Subramoney"}, {"authorId": "152713243", "name": "Elias Hajek"}, {"authorId": "40898078", "name": "Darjan Salaj"}, {"authorId": "2073142", "name": "R. Legenstein"}, {"authorId": "145247053", "name": "W. Maass"}]}, {"paperId": "64e76a22692fa6f5761a70adbc58f44e9078520e", "url": "https://www.semanticscholar.org/paper/64e76a22692fa6f5761a70adbc58f44e9078520e", "title": "Supervised machine learning tools: a tutorial for clinicians", "abstract": "In an increasingly data-driven world, artificial intelligence is expected to be a key tool for converting big data into tangible benefits and the healthcare domain is no exception to this. Machine learning aims to identify complex patterns in multi-dimensional data and use these uncovered patterns to classify new unseen cases or make data-driven predictions. In recent years, deep neural networks have shown to be capable of producing results that considerably exceed those of conventional machine learning methods for various classification and regression tasks. In this paper, we provide an accessible tutorial of the most important supervised machine learning concepts and methods, including deep learning, which are potentially the most relevant for the medical domain. We aim to take some of the mystery out of machine learning and depict how machine learning models can be useful for medical applications. Finally, this tutorial provides a few practical suggestions for how to properly design a machine learning model for a generic medical problem.", "year": 2020, "referenceCount": 121, "citationCount": 34, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Physics", "Computer Science"], "authors": [{"authorId": "118572818", "name": "L. L. Lo Vercio"}, {"authorId": "2064865946", "name": "Kimberly Amador"}, {"authorId": "48265042", "name": "Jordan J. Bannister"}, {"authorId": "1741948854", "name": "Sebastian Crites"}, {"authorId": "2068311955", "name": "Alejandro Gutierrez"}, {"authorId": "40288514", "name": "M. E. MacDonald"}, {"authorId": "1993152016", "name": "Jasmine A. Moore"}, {"authorId": "98092716", "name": "Pauline Mouches"}, {"authorId": "1471427330", "name": "Deepthi Rajashekar"}, {"authorId": "1729565222", "name": "Serena Schimert"}, {"authorId": "1730375", "name": "N. Subbanna"}, {"authorId": "1659218788", "name": "Anup Tuladhar"}, {"authorId": "1993230080", "name": "Nanjia Wang"}, {"authorId": "1752177", "name": "M. Wilms"}, {"authorId": "31764579", "name": "Anthony J. Winder"}, {"authorId": "144578371", "name": "N. Forkert"}]}, {"paperId": "4a83b5a3967457b4f6d55396833f43aa3d97ff81", "url": "https://www.semanticscholar.org/paper/4a83b5a3967457b4f6d55396833f43aa3d97ff81", "title": "Machine fault classification: a neural network approach", "abstract": "This paper presents a neural network approach for machine fault diagnosis. Specifically, two tasks are explained and discussed: (1) a neural network-based machine fault diagnosis model is developed using the back propagation (BP) learning paradigm; (2) network training efficiency is studied by varying the learning rate and learning momentum of the activation function. The results are presented and discussed.", "year": 1992, "referenceCount": 12, "citationCount": 56, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "4265272", "name": "G. Knapp"}, {"authorId": "2464624", "name": "Hsu-Pin Wang"}]}, {"paperId": "e4a5da3f7911df60c1c5d3ba26c677d8120979b6", "url": "https://www.semanticscholar.org/paper/e4a5da3f7911df60c1c5d3ba26c677d8120979b6", "title": "Machine learning use in predicting interior spruce wood density utilizing progeny test information", "abstract": null, "year": 2017, "referenceCount": 99, "citationCount": 63, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2396554", "name": "Konstantinos Demertzis"}, {"authorId": "1809248", "name": "L. Iliadis"}, {"authorId": "2644382", "name": "S. Avramidis"}, {"authorId": "1390133344", "name": "Y. El-Kassaby"}]}, {"paperId": "b6ea2f79b735844b1333905bd0279ab11b849608", "url": "https://www.semanticscholar.org/paper/b6ea2f79b735844b1333905bd0279ab11b849608", "title": "Evolving hybrid ensembles of learning machines for better generalisation", "abstract": null, "year": 2006, "referenceCount": 58, "citationCount": 148, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35988382", "name": "A. Chandra"}, {"authorId": "143901532", "name": "X. Yao"}]}, {"paperId": "29a6ebfb06bd4051ad87784b728430f917b1effb", "url": "https://www.semanticscholar.org/paper/29a6ebfb06bd4051ad87784b728430f917b1effb", "title": "Intelligent Behavior in Problem-Solving Machines", "abstract": "As one step in the study of intelligent behavior in machines, the authors consider the particular case of a machine that can prove theorems in elementary Euclidean plane geometry. The device uses no advanced decision algorithm, but relies rather on rudimentary mathematics and \"ingenuity\" in the manner, for example, of a clever high-school student. \n \nThis paper discusses heuristic methods and learning machines and introduces the concept of a theory machine as an extension of a theorem-proving machine.", "year": 1958, "referenceCount": 3, "citationCount": 76, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "2969408", "name": "H. Gelernter"}, {"authorId": "143635905", "name": "N. Rochester"}]}, {"paperId": "425eb6b97480afc0f918c583980896559ba881f3", "url": "https://www.semanticscholar.org/paper/425eb6b97480afc0f918c583980896559ba881f3", "title": "Secure Logistic Regression Based on Homomorphic Encryption: Design and Evaluation", "abstract": "Background Learning a model without accessing raw data has been an intriguing idea to security and machine learning researchers for years. In an ideal setting, we want to encrypt sensitive data to store them on a commercial cloud and run certain analyses without ever decrypting the data to preserve privacy. Homomorphic encryption technique is a promising candidate for secure data outsourcing, but it is a very challenging task to support real-world machine learning tasks. Existing frameworks can only handle simplified cases with low-degree polynomials such as linear means classifier and linear discriminative analysis. Objective The goal of this study is to provide a practical support to the mainstream learning models (eg, logistic regression). Methods We adapted a novel homomorphic encryption scheme optimized for real numbers computation. We devised (1) the least squares approximation of the logistic function for accuracy and efficiency (ie, reduce computation cost) and (2) new packing and parallelization techniques. Results Using real-world datasets, we evaluated the performance of our model and demonstrated its feasibility in speed and memory consumption. For example, it took approximately 116 minutes to obtain the training model from the homomorphically encrypted Edinburgh dataset. In addition, it gives fairly accurate predictions on the testing dataset. Conclusions We present the first homomorphically encrypted logistic regression outsourcing model based on the critical observation that the precision loss of classification models is sufficiently small so that the decision plan stays still.", "year": 2018, "referenceCount": 45, "citationCount": 164, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "50619349", "name": "Miran Kim"}, {"authorId": "11977411", "name": "Yongsoo Song"}, {"authorId": "49184748", "name": "Shuang Wang"}, {"authorId": "9689501", "name": "Yuhou Xia"}, {"authorId": "1935336", "name": "Xiaoqian Jiang"}]}, {"paperId": "74ca8e0a2035d3bbe586de9ee9060f79804565b9", "url": "https://www.semanticscholar.org/paper/74ca8e0a2035d3bbe586de9ee9060f79804565b9", "title": "Autonomic machine learning platform", "abstract": null, "year": 2019, "referenceCount": 15, "citationCount": 43, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2110231879", "name": "K. Lee"}, {"authorId": "102680652", "name": "Jaesoo Yoo"}, {"authorId": "51967113", "name": "Sang-Wook Kim"}, {"authorId": "30603322", "name": "Jee-Hyong Lee"}, {"authorId": "3307781", "name": "Jiman Hong"}]}, {"paperId": "c34a06c2bfae860330e9b09eae2508cc78555b02", "url": "https://www.semanticscholar.org/paper/c34a06c2bfae860330e9b09eae2508cc78555b02", "title": "Roadmap on emerging hardware and technology for machine learning", "abstract": "Recent progress in artificial intelligence is largely attributed to the rapid development of machine learning, especially in the algorithm and neural network models. However, it is the performance of the hardware, in particular the energy efficiency of a computing system that sets the fundamental limit of the capability of machine learning. Data-centric computing requires a revolution in hardware systems, since traditional digital computers based on transistors and the von Neumann architecture were not purposely designed for neuromorphic computing. A hardware platform based on emerging devices and new architecture is the hope for future computing with dramatically improved throughput and energy efficiency. Building such a system, nevertheless, faces a number of challenges, ranging from materials selection, device optimization, circuit fabrication and system integration, to name a few. The aim of this Roadmap is to present a snapshot of emerging hardware technologies that are potentially beneficial for machine learning, providing the Nanotechnology readers with a perspective of challenges and opportunities in this burgeoning field.", "year": 2020, "referenceCount": 163, "citationCount": 63, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Materials Science", "Medicine"], "authors": [{"authorId": "144499811", "name": "Q. Xia"}, {"authorId": "1989985", "name": "K. Berggren"}, {"authorId": "31560969", "name": "K. Likharev"}, {"authorId": "144455360", "name": "D. Strukov"}, {"authorId": "2152630916", "name": "Hao Jiang"}, {"authorId": "144492720", "name": "T. Mikolajick"}, {"authorId": "1793153", "name": "D. Querlioz"}, {"authorId": "2106862", "name": "M. Salinga"}, {"authorId": "2054916870", "name": "John R. Erickson"}, {"authorId": "2552578", "name": "Shuang Pi"}, {"authorId": "144903485", "name": "F. Xiong"}, {"authorId": "47476951", "name": "Peng Lin"}, {"authorId": "2047503990", "name": "Can Li"}, {"authorId": "6308510", "name": "S. Xiong"}, {"authorId": "152724002", "name": "B. Hoskins"}, {"authorId": "36910177", "name": "M. Daniels"}, {"authorId": "3300084", "name": "A. Madhavan"}, {"authorId": "144384210", "name": "James W. Liddle"}, {"authorId": "30841058", "name": "J. McClelland"}, {"authorId": "3566342", "name": "Yuchao Yang"}, {"authorId": "38546300", "name": "J. Rupp"}, {"authorId": "3760690", "name": "S. Nonnenmann"}, {"authorId": "9113208", "name": "Nanbo Gong"}, {"authorId": "145210800", "name": "Kwang-Ting Cheng"}, {"authorId": "1822088162", "name": "Miguel Angel Lastras Montaño"}, {"authorId": "145658964", "name": "A. Talin"}, {"authorId": "4044901", "name": "A. Salleo"}, {"authorId": "2694890", "name": "B. Shastri"}, {"authorId": "31299426", "name": "T. Ferreira de Lima"}, {"authorId": "2304580", "name": "A. Tait"}, {"authorId": "4013480", "name": "Yichen Shen"}, {"authorId": "51209743", "name": "H. Meng"}, {"authorId": "1432641166", "name": "C. Roques-Carmes"}, {"authorId": "2148766464", "name": "Zengguang Cheng"}, {"authorId": "1771881", "name": "H. Bhaskaran"}, {"authorId": "119794253", "name": "D. Jariwala"}, {"authorId": "2144396736", "name": "Han Wang"}, {"authorId": "46939936", "name": "K. Segall"}, {"authorId": "46425347", "name": "J. Shainline"}, {"authorId": "152905474", "name": "J. Yang"}, {"authorId": "143884690", "name": "K. Roy"}, {"authorId": "145058489", "name": "S. Datta"}, {"authorId": "10225325", "name": "A. Raychowdhury"}]}, {"paperId": "f5e0a45ff6a33c6fb178d8e48673499aea32b681", "url": "https://www.semanticscholar.org/paper/f5e0a45ff6a33c6fb178d8e48673499aea32b681", "title": "Automatic detection of learner’s affect from conversational cues", "abstract": null, "year": 2008, "referenceCount": 134, "citationCount": 346, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1383996606", "name": "S. D’Mello"}, {"authorId": "2122336", "name": "Scotty D. Craig"}, {"authorId": "32642534", "name": "Amy M. Witherspoon"}, {"authorId": "2184400", "name": "Bethany McDaniel"}, {"authorId": "1769251", "name": "A. Graesser"}]}, {"paperId": "01cb4071a0a43aeef63e5d568ad5afe1fb8b2411", "url": "https://www.semanticscholar.org/paper/01cb4071a0a43aeef63e5d568ad5afe1fb8b2411", "title": "Domain Separation Networks", "abstract": "The cost of large scale data collection and annotation often makes the application of machine learning algorithms to new tasks or datasets prohibitively expensive. One approach circumventing this cost is training models on synthetic data where annotations are provided automatically. Despite their appeal, such models often fail to generalize from synthetic to real images, necessitating domain adaptation algorithms to manipulate these models before they can be successfully applied. Existing approaches focus either on mapping representations from one domain to the other, or on learning to extract features that are invariant to the domain from which they were extracted. However, by focusing only on creating a mapping or shared representation between the two domains, they ignore the individual characteristics of each domain. We hypothesize that explicitly modeling what is unique to each domain can improve a model's ability to extract domain-invariant features. Inspired by work on private-shared component analysis, we explicitly learn to extract image representations that are partitioned into two subspaces: one component which is private to each domain and one which is shared across domains. Our model is trained to not only perform the task we care about in the source domain, but also to use the partitioned representation to reconstruct the images from both domains. Our novel architecture results in a model that outperforms the state-of-the-art on a range of unsupervised domain adaptation scenarios and additionally produces visualizations of the private and shared representations enabling interpretation of the domain adaptation process.", "year": 2016, "referenceCount": 34, "citationCount": 1045, "influentialCitationCount": 122, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2732737", "name": "Konstantinos Bousmalis"}, {"authorId": "2814229", "name": "George Trigeorgis"}, {"authorId": "2286640", "name": "N. Silberman"}, {"authorId": "1707347", "name": "Dilip Krishnan"}, {"authorId": "1761978", "name": "D. Erhan"}]}, {"paperId": "5feaa06ff389b385095beb28483ce4c6c3fe4414", "url": "https://www.semanticscholar.org/paper/5feaa06ff389b385095beb28483ce4c6c3fe4414", "title": "Generalized Bradley-Terry Models and Multi-Class Probability Estimates", "abstract": "The Bradley-Terry model for obtaining individual skill from paired comparisons has been popular in many areas. In machine learning, this model is related to multi-class probability estimates by coupling all pairwise classification results. Error correcting output codes (ECOC) are a general framework to decompose a multi-class problem to several binary problems. To obtain probability estimates under this framework, this paper introduces a generalized Bradley-Terry model in which paired individual comparisons are extended to paired team comparisons. We propose a simple algorithm with convergence proofs to solve the model and obtain individual skill. Experiments on synthetic and re al data demonstrate that the algorithm is useful for obtaining multi-class probability estimates. Moreover, we discuss four extensions of the proposed model: 1) weighted individual skill, 2) home-field advantage, 3) ties, and 4) comparisons with more than two teams.", "year": 2006, "referenceCount": 29, "citationCount": 169, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1734755", "name": "Tzu-Kuo Huang"}, {"authorId": "2567246", "name": "R. C. Weng"}, {"authorId": "1711460", "name": "Chih-Jen Lin"}]}, {"paperId": "de017ec1ab6a2fafb6cf9665c5d2d3efd27f142e", "url": "https://www.semanticscholar.org/paper/de017ec1ab6a2fafb6cf9665c5d2d3efd27f142e", "title": "The upside of uncertainty: Identification of lithology contact zones from airborne geophysics and satellite data using random forests and support vector machines", "abstract": "ABSTRACTInductive machine learning algorithms attempt to recognize patterns in, and generalize from empirical data. They provide a practical means of predicting lithology, or other spatially varying physical features, from multidimensional geophysical data sets. It is for this reason machine learning approaches are increasing in popularity for geophysical data inference. A key motivation for their use is the ease with which uncertainty measures can be estimated for nonprobabilistic algorithms. We have compared and evaluated the abilities of two nonprobabilistic machine learning algorithms, random forests (RF) and support vector machines (SVM), to recognize ambiguous supervised classification predictions using uncertainty calculated from estimates of class membership probabilities. We formulated a method to establish optimal uncertainty threshold values to identify and isolate the maximum number of incorrect predictions while preserving most of the correct classifications. This is illustrated using a case ...", "year": 2013, "referenceCount": 80, "citationCount": 64, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1840787", "name": "M. Cracknell"}, {"authorId": "36882569", "name": "A. Reading"}]}, {"paperId": "6c1309a5cb147856f785253d99424685cf5c12fc", "url": "https://www.semanticscholar.org/paper/6c1309a5cb147856f785253d99424685cf5c12fc", "title": "Reinforcement learning for true adaptive traffic signal control", "abstract": "The ability to exert real-time, adaptive control of transportation processes is the core of many intelligent transportation systems decision support tools. Reinforcement learning, an artificial intelligence approach undergoing development in the machine- learning community, offers key advantages in this regard. The ability of a control agent to learn relationships between control actions and their effect on the environment while pursuing a goal is a distinct improvement over prespecified models of the environment. Prespecified models are a prerequisite of conventional control methods and their accuracy limits the performance of control agents. This paper contains an introduction to Q-learning, a simple yet powerful reinforcement learning algorithm, and presents a case study involving application to traffic signal control. Encouraging results of the application to an isolated traffic signal, particularly under variable traffic conditions, are presented. A broader research effort is outlined, including extension to linear and networked signal systems and integration with dynamic route guidance. The research objective involves optimal control of heavily congested traffic across a two-dimensional road network—a challenging task for conventional traffic signal control methodologies.", "year": 2003, "referenceCount": 26, "citationCount": 408, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "1770243", "name": "B. Abdulhai"}, {"authorId": "98155768", "name": "R. Pringle"}, {"authorId": "69037486", "name": "G. J. Karakoulas"}]}, {"paperId": "cf945bc31c74212bfc756559b447bef0cd0b14ba", "url": "https://www.semanticscholar.org/paper/cf945bc31c74212bfc756559b447bef0cd0b14ba", "title": "Applied machine learning: Forecasting heat load in district heating system", "abstract": null, "year": 2016, "referenceCount": 23, "citationCount": 132, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "121263896", "name": "S. Idowu"}, {"authorId": "8773876", "name": "S. Saguna"}, {"authorId": "2044546", "name": "C. Åhlund"}, {"authorId": "2509535", "name": "O. Schelén"}]}, {"paperId": "7ac7b6dbcf5107c7ad0ce29161f60c2834a06795", "url": "https://www.semanticscholar.org/paper/7ac7b6dbcf5107c7ad0ce29161f60c2834a06795", "title": "Alignment for Advanced Machine Learning Systems", "abstract": "We survey eight research areas organized around one question: As learning systems become increasingly intelligent and autonomous, what design principles can best ensure that their behavior is aligned with the interests of the operators? We focus on two major technical obstacles to AI alignment: the challenge of specifying the right kind of objective functions, and the challenge of designing AI systems that avoid unintended consequences and undesirable behavior even in cases where the objective function does not line up perfectly with the intentions of the designers. Open problems surveyed in this research proposal include: How can we train reinforcement learners to take actions that are more amenable to meaningful assessment by intelligent overseers? What kinds of objective functions incentivize a system to “not have an overly large impact” or “not have many side effects”? We discuss these questions, related work, and potential directions for future research, with the goal of highlighting relevant research topics in machine learning that appear tractable today.", "year": 2020, "referenceCount": 109, "citationCount": 58, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144364160", "name": "Jessica Taylor"}, {"authorId": "2542795", "name": "Eliezer Yudkowsky"}, {"authorId": "2254026", "name": "Patrick LaVictoire"}, {"authorId": "2651789", "name": "Andrew Critch"}]}, {"paperId": "72db4f5be89655b13e943f60566e65ae4d437344", "url": "https://www.semanticscholar.org/paper/72db4f5be89655b13e943f60566e65ae4d437344", "title": "Learning-based imaging through scattering media.", "abstract": "We present a machine-learning-based method for single-shot imaging through scattering media. The inverse scattering process was calculated based on a nonlinear regression algorithm by learning a number of training object-speckle pairs. In the experimental demonstration, multilayer phase objects between scattering plates were reconstructed from intensity measurements. Our approach enables model-free sensing, where it is not necessary to know the sensing processes/models.", "year": 2016, "referenceCount": 14, "citationCount": 133, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Medicine"], "authors": [{"authorId": "3614205", "name": "R. Horisaki"}, {"authorId": "2065889114", "name": "Ryosuke Takagi"}, {"authorId": "2063601", "name": "J. Tanida"}]}, {"paperId": "665e0de518a80cfcf8c8b0e051f8e0823ca647c0", "url": "https://www.semanticscholar.org/paper/665e0de518a80cfcf8c8b0e051f8e0823ca647c0", "title": "Accurate molecular polarizabilities with coupled cluster theory and machine learning", "abstract": "Significance The dipole polarizability of molecules and materials is central to several physical phenomena, modeling techniques, and the interpretation of many experiments. Its accurate evaluation from first principles requires quantum chemistry methods that are often too demanding for routine use. The highly accurate calculations reported herein provide a much-needed benchmark of the accuracy of hybrid density functional theory (DFT) as well as training data for a machine-learning model that can predict the polarizability tensor with an error that is about 50% smaller than DFT. This framework provides an accurate, inexpensive, and transferable strategy for estimating the polarizabilities of molecules containing dozens of atoms, and therefore removes a considerable obstacle to accurate and reliable atomistic-based modeling of matter. The molecular dipole polarizability describes the tendency of a molecule to change its dipole moment in response to an applied electric field. This quantity governs key intra- and intermolecular interactions, such as induction and dispersion; plays a vital role in determining the spectroscopic signatures of molecules; and is an essential ingredient in polarizable force fields. Compared with other ground-state properties, an accurate prediction of the molecular polarizability is considerably more difficult, as this response quantity is quite sensitive to the underlying electronic structure description. In this work, we present highly accurate quantum mechanical calculations of the static dipole polarizability tensors of 7,211 small organic molecules computed using linear response coupled cluster singles and doubles theory (LR-CCSD). Using a symmetry-adapted machine-learning approach, we demonstrate that it is possible to predict the LR-CCSD molecular polarizabilities of these small molecules with an error that is an order of magnitude smaller than that of hybrid density functional theory (DFT) at a negligible computational cost. The resultant model is robust and transferable, yielding molecular polarizabilities for a diverse set of 52 larger molecules (including challenging conjugated systems, carbohydrates, small drugs, amino acids, nucleobases, and hydrocarbon isomers) at an accuracy that exceeds that of hybrid DFT. The atom-centered decomposition implicit in our machine-learning approach offers some insight into the shortcomings of DFT in the prediction of this fundamental quantity of interest.", "year": 2018, "referenceCount": 65, "citationCount": 95, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Physics"], "authors": [{"authorId": "6287077", "name": "D. Wilkins"}, {"authorId": "3371253", "name": "Andrea Grisafi"}, {"authorId": "2152919397", "name": "Yang Yang"}, {"authorId": "6380715", "name": "K. Lao"}, {"authorId": "2097280402", "name": "Robert A. DiStasio"}, {"authorId": "1917770", "name": "M. Ceriotti"}]}, {"paperId": "523b12db4004b89284387f978c2af8ae0e79d54b", "url": "https://www.semanticscholar.org/paper/523b12db4004b89284387f978c2af8ae0e79d54b", "title": "Knowledge Matters: Importance of Prior Information for Optimization", "abstract": "We explore the effect of introducing prior information into the intermediate level of neural networks for a learning task on which all the state-of-the-art machine learning algorithms tested failed to learn. We motivate our work from the hypothesis that humans learn such intermediate concepts from other individuals via a form of supervision or guidance using a curriculum. The experiments we have conducted provide positive evidence in favor of this hypothesis. In our experiments, a two-tiered MLP architecture is trained on a dataset with 64x64 binary inputs images, each image with three sprites. The final task is to decide whether all the sprites are the same or one of them is different. Sprites are pentomino tetris shapes and they are placed in an image with different locations using scaling and rotation transformations. The first part of the two-tiered MLP is pre-trained with intermediate-level targets being the presence of sprites at each location, while the second part takes the output of the first part as input and predicts the final task's target binary event. The two-tiered MLP architecture, with a few tens of thousand examples, was able to learn the task perfectly, whereas all other algorithms (include unsupervised pre-training, but also traditional algorithms like SVMs, decision trees and boosting) all perform no better than chance. We hypothesize that the optimization difficulty involved when the intermediate pre-training is not performed is due to the {\\em composition} of two highly non-linear tasks. Our findings are also consistent with hypotheses on cultural learning inspired by the observations of optimization problems with deep learning, presumably because of effective local minima.", "year": 2013, "referenceCount": 65, "citationCount": 150, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1854385", "name": "Çaglar Gülçehre"}, {"authorId": "1751762", "name": "Yoshua Bengio"}]}, {"paperId": "570948aca9ba058da1a42d7dc7101326092d8be1", "url": "https://www.semanticscholar.org/paper/570948aca9ba058da1a42d7dc7101326092d8be1", "title": "A learning interface agent for scheduling meetings", "abstract": "This paper describes a Learning Interface Agent for a meeting scheduling application. The agent employs Machine Learning techniques to customize itself to the user’s personal scheduling rules and preferences by observing the user’s actions and receiving direct userfeedback. Our approach provides the user with sophisticated control over the gradual delegation of scheduling tasks to the agent, as a trust relationship is built. We report upon an experiment in which a collection of such assistants became gradually more helpful to their users through the use of memory-based and reinforcement learning. The experimental data reported upon demonstrate that the learning approach to building intelligent interface agents is a very promising one which has several advantages over more standard approaches.", "year": 1993, "referenceCount": 12, "citationCount": 192, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2683445", "name": "Robyn Kozierok"}, {"authorId": "1701876", "name": "P. Maes"}]}, {"paperId": "c1eea18c70325f1ae381b3efa7d6dc50c649c69c", "url": "https://www.semanticscholar.org/paper/c1eea18c70325f1ae381b3efa7d6dc50c649c69c", "title": "Intelligent Parkinson Disease Prediction Using Machine Learning Algorithms", "abstract": "Diagnosis of the Parkinson disease through machine learning approache provides better understanding from PD dataset in the present decade. Orange v2.0b and weka v3.4.10 has been used in the present experimentation for the statistical analysis, classification, Evaluation and unsupervised learning methods. Voice dataset for Parkinson disease has been retrieved from UCI Machine learning repository from Center for Machine Learning and Intelligent Systems. The dataset contains name, MDVP:Fo(Hz), MDVP:Fhi(Hz), MDVP:Flo(Hz), MDVP:Jitter(%), MDVP: Jitter(Abs), MDVP:RAP, MDVP:PPQ, Jitter:DDP, MDVP:Shimmer, MDVP:Shimmer(dB), Shimmer:APQ3, Shimmer:APQ5, MDVP:APQ, Shimmer:DDA, NHR, HNR, status, RPDE, DFA, spread1, spread2, D2, PPE attributes. The parallel coordinates shows higher variation in Parkinson disease dataset. SVM has shown good accuracy (88.9%) compared to Majority and k-NN algorithms. Classification algorithm like Random Forest has shown good accuracy (90.26) and Naive Bayes has shown least accuracy (69.23. Higher number of clusters in healthy dataset in Fo and less number in diseased data has been predicted by Hierarchal clustering and SOM.", "year": 2013, "referenceCount": 15, "citationCount": 54, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2151493349", "name": "M. Rao"}, {"authorId": "9293181", "name": "G. V. L. Narayana"}, {"authorId": "144350988", "name": "D. Kaladhar"}, {"authorId": "145014843", "name": "T. Vital"}]}, {"paperId": "64c2c0f40e3bda752fe5c5d130d4cfe62d68af54", "url": "https://www.semanticscholar.org/paper/64c2c0f40e3bda752fe5c5d130d4cfe62d68af54", "title": "Byzantine-Robust Federated Machine Learning through Adaptive Model Averaging", "abstract": "Federated learning enables training collaborative machine learning models at scale with many participants whilst preserving the privacy of their datasets. Standard federated learning techniques are vulnerable to Byzantine failures, biased local datasets, and poisoning attacks. In this paper we introduce Adaptive Federated Averaging, a novel algorithm for robust federated learning that is designed to detect failures, attacks, and bad updates provided by participants in a collaborative model. We propose a Hidden Markov Model to model and learn the quality of model updates provided by each participant during training. In contrast to existing robust federated learning schemes, we propose a robust aggregation rule that detects and discards bad or malicious local model updates at each training iteration. This includes a mechanism that blocks unwanted participants, which also increases the computational and communication efficiency. Our experimental evaluation on 4 real datasets show that our algorithm is significantly more robust to faulty, noisy and malicious participants, whilst being computationally more efficient than other state-of-the-art robust federated learning methods such as Multi-KRUM and coordinate-wise median.", "year": 2019, "referenceCount": 26, "citationCount": 69, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1399031454", "name": "Luis Muñoz-González"}, {"authorId": "84511897", "name": "Kenneth T. Co"}, {"authorId": "1791748", "name": "Emil C. Lupu"}]}, {"paperId": "121f46b8c1a4f837fc439a8cd74d8afc96d1d0c5", "url": "https://www.semanticscholar.org/paper/121f46b8c1a4f837fc439a8cd74d8afc96d1d0c5", "title": "A CNN–LSTM model for gold price time-series forecasting", "abstract": null, "year": 2020, "referenceCount": 44, "citationCount": 190, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9266879", "name": "I. Livieris"}, {"authorId": "66066672", "name": "Emmanuel G. Pintelas"}, {"authorId": "1725504", "name": "P. Pintelas"}]}, {"paperId": "4c0624f476c001e40f291cdf6eb96af82bf32873", "url": "https://www.semanticscholar.org/paper/4c0624f476c001e40f291cdf6eb96af82bf32873", "title": "Amazon Machine Learning", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 19, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": null, "authors": []}, {"paperId": "69e3fe81fa48e99bcbaebfaed7839848e186ac25", "url": "https://www.semanticscholar.org/paper/69e3fe81fa48e99bcbaebfaed7839848e186ac25", "title": "Learning to match ontologies on the Semantic Web", "abstract": null, "year": 2003, "referenceCount": 47, "citationCount": 584, "influentialCitationCount": 42, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3030274", "name": "A. Doan"}, {"authorId": "2224716", "name": "J. Madhavan"}, {"authorId": "2944471", "name": "Robin Dhamankar"}, {"authorId": "1740213", "name": "Pedro M. Domingos"}, {"authorId": "1770962", "name": "A. Halevy"}]}, {"paperId": "b2dcc1df22f72dfa4fd838ea6d40fc9d558f0160", "url": "https://www.semanticscholar.org/paper/b2dcc1df22f72dfa4fd838ea6d40fc9d558f0160", "title": "SLAQ: quality-driven scheduling for distributed machine learning", "abstract": "Training machine learning (ML) models with large datasets can incur significant resource contention on shared clusters. This training typically involves many iterations that continually improve the quality of the model. Yet in exploratory settings, better models can be obtained faster by directing resources to jobs with the most potential for improvement. We describe SLAQ, a cluster scheduling system for approximate ML training jobs that aims to maximize the overall job quality. When allocating cluster resources, SLAQ explores the quality-runtime trade-offs across multiple jobs to maximize system-wide quality improvement. To do so, SLAQ leverages the iterative nature of ML training algorithms, by collecting quality and resource usage information from concurrent jobs, and then generating highly-tailored quality-improvement predictions for future iterations. Experiments show that SLAQ achieves an average quality improvement of up to 73% and an average delay reduction of up to 44% on a large set of ML training jobs, compared to resource fairness schedulers.", "year": 2017, "referenceCount": 59, "citationCount": 99, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2051632731", "name": "Haoyu Zhang"}, {"authorId": "26315993", "name": "Logan Stafman"}, {"authorId": "46782066", "name": "Andrew Or"}, {"authorId": "3122063", "name": "M. Freedman"}]}, {"paperId": "6b88333518c780a60a39732b1f020cb1cbd09260", "url": "https://www.semanticscholar.org/paper/6b88333518c780a60a39732b1f020cb1cbd09260", "title": "Prediction Policy Problems.", "abstract": "Most empirical policy work focuses on causal inference. We argue an important class of policy problems does not require causal inference but instead requires predictive inference. Solving these \"prediction policy problems\" requires more than simple regression techniques, since these are tuned to generating unbiased estimates of coefficients rather than minimizing prediction error. We argue that new developments in the field of \"machine learning\" are particularly useful for addressing these prediction problems. We use an example from health policy to illustrate the large potential social welfare gains from improved prediction.", "year": 2015, "referenceCount": 37, "citationCount": 405, "influentialCitationCount": 20, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Economics"], "authors": [{"authorId": "3371403", "name": "J. Kleinberg"}, {"authorId": "50197963", "name": "J. Ludwig"}, {"authorId": "2062143", "name": "S. Mullainathan"}, {"authorId": "3797258", "name": "Z. Obermeyer"}]}, {"paperId": "6a060a59e0595ca487d89f70281dcc8a40fd36f6", "url": "https://www.semanticscholar.org/paper/6a060a59e0595ca487d89f70281dcc8a40fd36f6", "title": "The promise of machine learning in predicting treatment outcomes in psychiatry", "abstract": "For many years, psychiatrists have tried to understand factors involved in response to medications or psychotherapies, in order to personalize their treatment choices. There is now a broad and growing interest in the idea that we can develop models to personalize treatment decisions using new statistical approaches from the field of machine learning and applying them to larger volumes of data. In this pursuit, there has been a paradigm shift away from experimental studies to confirm or refute specific hypotheses towards a focus on the overall explanatory power of a predictive model when tested on new, unseen datasets. In this paper, we review key studies using machine learning to predict treatment outcomes in psychiatry, ranging from medications and psychotherapies to digital interventions and neurobiological treatments. Next, we focus on some new sources of data that are being used for the development of predictive models based on machine learning, such as electronic health records, smartphone and social media data, and on the potential utility of data from genetics, electrophysiology, neuroimaging and cognitive testing. Finally, we discuss how far the field has come towards implementing prediction tools in real‐world clinical practice. Relatively few retrospective studies to‐date include appropriate external validation procedures, and there are even fewer prospective studies testing the clinical feasibility and effectiveness of predictive models. Applications of machine learning in psychiatry face some of the same ethical challenges posed by these techniques in other areas of medicine or computer science, which we discuss here. In short, machine learning is a nascent but important approach to improve the effectiveness of mental health care, and several prospective clinical studies suggest that it may be working already.", "year": 2021, "referenceCount": 239, "citationCount": 68, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "6609752", "name": "A. Chekroud"}, {"authorId": "82934036", "name": "Julia Bondar"}, {"authorId": "145171115", "name": "Jaime Delgadillo"}, {"authorId": "2659843", "name": "Gavin Doherty"}, {"authorId": "83024519", "name": "Akash R. Wasil"}, {"authorId": "38565406", "name": "M. Fokkema"}, {"authorId": "34221966", "name": "Z. Cohen"}, {"authorId": "145763736", "name": "D. Belgrave"}, {"authorId": "4423584", "name": "R. DeRubeis"}, {"authorId": "2046648", "name": "R. Iniesta"}, {"authorId": "5672681", "name": "D. Dwyer"}, {"authorId": "6047002", "name": "Karmel W. Choi"}]}, {"paperId": "5145a5c8fb950ff52d3ad991d9c1d9886d726451", "url": "https://www.semanticscholar.org/paper/5145a5c8fb950ff52d3ad991d9c1d9886d726451", "title": "On the Prospects for a (Deep) Learning Health Care System", "abstract": "In 1976, Maxmen1 predicted that artificial intelligence (AI) in the 21st century would usher in “the postphysician era,” with health care provided by paramedics and computers. Today, the mass extinction of physicians remains unlikely. However, as outlined by Hinton2 in a related Viewpoint, the emergence of a radically different approach to AI, called deep learning, has the potential to effect major changes in clinical medicine and health care delivery. This Viewpoint reviews some of the factors driving wide adoption of deep learning and other forms of machine learning in the health ecosystem.", "year": 2018, "referenceCount": 19, "citationCount": 140, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "144625283", "name": "C. Naylor"}]}, {"paperId": "ca57ef2df50711787c2be7c3c910e8874b0b856b", "url": "https://www.semanticscholar.org/paper/ca57ef2df50711787c2be7c3c910e8874b0b856b", "title": "Interpretable Machine Learning", "abstract": null, "year": 2019, "referenceCount": 0, "citationCount": 19, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46216076", "name": "Bradley C. Boehmke"}, {"authorId": "35664117", "name": "Brandon M. Greenwell"}]}, {"paperId": "711d306909d394172f0d7735c6d253e0838e3c5e", "url": "https://www.semanticscholar.org/paper/711d306909d394172f0d7735c6d253e0838e3c5e", "title": "A learning agent for wireless news access", "abstract": "We describe a user interface for wireless information devices, specifically designed to facilitate learning about users' individual interests in daily news stories. User feedback is collected unobtrusively to form the basis for a content-based machine learning algorithm. As a result, the described system can adapt to users' individual interests, reduce the amount of information that needs to be transmitted, and help users access relevant information with minimal effort.", "year": 2000, "referenceCount": 11, "citationCount": 134, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1691741", "name": "Daniel Billsus"}, {"authorId": "1694780", "name": "M. Pazzani"}, {"authorId": "2108206346", "name": "James Chen"}]}, {"paperId": "6ee1181b36af21e226e4c7c6fcb82bda63c1363a", "url": "https://www.semanticscholar.org/paper/6ee1181b36af21e226e4c7c6fcb82bda63c1363a", "title": "pCAMP: Performance Comparison of Machine Learning Packages on the Edges", "abstract": "Machine learning has changed the computing paradigm. Products today are built with machine intelligence as a central attribute, and consumers are beginning to expect near-human interaction with the appliances they use. However, much of the deep learning revolution has been limited to the cloud. Recently, several machine learning packages based on edge devices have been announced which aim to offload the computing to the edges. However, little research has been done to evaluate these packages on the edges, making it difficult for end users to select an appropriate pair of software and hardware. In this paper, we make a performance comparison of several state-of-the-art machine learning packages on the edges, including TensorFlow, Caffe2, MXNet, PyTorch, and TensorFlow Lite. We focus on evaluating the latency, memory footprint, and energy of these tools with two popular types of neural networks on different edge devices. This evaluation not only provides a reference to select appropriate combinations of hardware and software packages for end users but also points out possible future directions to optimize packages for developers.", "year": 2019, "referenceCount": 29, "citationCount": 67, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2153648026", "name": "Xingzhou Zhang"}, {"authorId": "2118420197", "name": "Yifan Wang"}, {"authorId": "38737155", "name": "Weisong Shi"}]}, {"paperId": "79a8674b05b045b459cf6eeba3b4687da1878fcd", "url": "https://www.semanticscholar.org/paper/79a8674b05b045b459cf6eeba3b4687da1878fcd", "title": "Risk-Aware Machine Learning Classifier for Skin Lesion Diagnosis", "abstract": "Knowing when a machine learning system is not confident about its prediction is crucial in medical domains where safety is critical. Ideally, a machine learning algorithm should make a prediction only when it is highly certain about its competency, and refer the case to physicians otherwise. In this paper, we investigate how Bayesian deep learning can improve the performance of the machine–physician team in the skin lesion classification task. We used the publicly available HAM10000 dataset, which includes samples from seven common skin lesion categories: Melanoma (MEL), Melanocytic Nevi (NV), Basal Cell Carcinoma (BCC), Actinic Keratoses and Intraepithelial Carcinoma (AKIEC), Benign Keratosis (BKL), Dermatofibroma (DF), and Vascular (VASC) lesions. Our experimental results show that Bayesian deep networks can boost the diagnostic performance of the standard DenseNet-169 model from 81.35% to 83.59% without incurring additional parameters or heavy computation. More importantly, a hybrid physician–machine workflow reaches a classification accuracy of 90% while only referring 35% of the cases to physicians. The findings are expected to generalize to other medical diagnosis applications. We believe that the availability of risk-aware machine learning methods will enable a wider adoption of machine learning technology in clinical settings.", "year": 2019, "referenceCount": 77, "citationCount": 49, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "27588412", "name": "Aryan Mobiny"}, {"authorId": "2109435489", "name": "Aditi Singh"}, {"authorId": "151497174", "name": "Hien Van Nguyen"}]}, {"paperId": "d696f22560388393c170cf5c6f214466c921f2ce", "url": "https://www.semanticscholar.org/paper/d696f22560388393c170cf5c6f214466c921f2ce", "title": "Glaucoma Progression Detection Using Structural Retinal Nerve Fiber Layer Measurements and Functional Visual Field Points", "abstract": "Machine learning classifiers were employed to detect glaucomatous progression using longitudinal series of structural data extracted from retinal nerve fiber layer thickness measurements and visual functional data recorded from standard automated perimetry tests. Using the collected data, a longitudinal feature vector was created for each patient's eye by computing the norm 1 difference vector of the data at the baseline and at each follow-up visit. The longitudinal features from each patient's eye were then fed to the machine learning classifier to classify each eye as stable or progressed over time. This study was performed using several machine learning classifiers including Bayesian, Lazy, Meta, and Tree, composing different families. Combinations of structural and functional features were selected and ranked to determine the relative effectiveness of each feature. Finally, the outcomes of the classifiers were assessed by several performance metrics and the effectiveness of structural and functional features were analyzed.", "year": 2014, "referenceCount": 47, "citationCount": 79, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1732890", "name": "Siamak Yousefi"}, {"authorId": "32618175", "name": "M. Goldbaum"}, {"authorId": "2841631", "name": "M. Balasubramanian"}, {"authorId": "144437435", "name": "T. Jung"}, {"authorId": "2418684", "name": "R. Weinreb"}, {"authorId": "2688841", "name": "F. Medeiros"}, {"authorId": "2306091", "name": "L. Zangwill"}, {"authorId": "2912106", "name": "J. Liebmann"}, {"authorId": "2389101", "name": "C. Girkin"}, {"authorId": "2375070", "name": "C. Bowd"}]}, {"paperId": "bd7d537f837cd33f7b5b5d650e4850fabb8492c7", "url": "https://www.semanticscholar.org/paper/bd7d537f837cd33f7b5b5d650e4850fabb8492c7", "title": "Advances in Hyperspectral Image Classification: Earth Monitoring with Statistical Learning Methods", "abstract": "The technological evolution of optical sensors over the last few decades has provided remote sensing analysts with rich spatial, spectral, and temporal information. In particular, the increase in spectral resolution of hyperspectral images (HSIs) and infrared sounders opens the doors to new application domains and poses new methodological challenges in data analysis. HSIs allow the characterization of objects of interest (e.g., land-cover classes) with unprecedented accuracy, and keeps inventories up to date. Improvements in spectral resolution have called for advances in signal processing and exploitation algorithms. This article focuses on the challenging problem of hyperspectral image classification, which has recently gained in popularity and attracted the interest of other scientific disciplines such as machine learning, image processing, and computer vision. In the remote sensing community, the term classification is used to denote the process that assigns single pixels to a set of classes, while the term segmentation is used for methods aggregating pixels into objects and then assigned to a class.", "year": 2013, "referenceCount": 44, "citationCount": 579, "influentialCitationCount": 11, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1397959153", "name": "G. Camps-Valls"}, {"authorId": "2977931", "name": "D. Tuia"}, {"authorId": "1698844", "name": "L. Bruzzone"}, {"authorId": "1682001", "name": "J. Benediktsson"}]}]}