{"total": 5120671, "offset": 5600, "next": 5700, "data": [{"paperId": "633664376ffadc1396d86e476925121ac3d4cf86", "url": "https://www.semanticscholar.org/paper/633664376ffadc1396d86e476925121ac3d4cf86", "title": "Learning message-passing inference machines for structured prediction", "abstract": "Nearly every structured prediction problem in computer vision requires approximate inference due to large and complex dependencies among output labels. While graphical models provide a clean separation between modeling and inference, learning these models with approximate inference is not well understood. Furthermore, even if a good model is learned, predictions are often inaccurate due to approximations. In this work, instead of performing inference over a graphical model, we instead consider the inference procedure as a composition of predictors. Specifically, we focus on message-passing algorithms, such as Belief Propagation, and show how they can be viewed as procedures that sequentially predict label distributions at each node over a graph. Given labeled graphs, we can then train the sequence of predictors to output the correct labeling s. The result no longer corresponds to a graphical model but simply defines an inference procedure, with strong theoretical properties, that can be used to classify new graphs. We demonstrate the scalability and efficacy of our approach on 3D point cloud classification and 3D surface estimation from single images.", "year": 2011, "referenceCount": 24, "citationCount": 123, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1700433", "name": "Stéphane Ross"}, {"authorId": "51505748", "name": "Daniel Munoz"}, {"authorId": "145670946", "name": "M. Hebert"}, {"authorId": "1756566", "name": "J. Bagnell"}]}, {"paperId": "188f8f6f70947215a9dfeebb0b577155e0d3d339", "url": "https://www.semanticscholar.org/paper/188f8f6f70947215a9dfeebb0b577155e0d3d339", "title": "1399 H&E-stained sentinel lymph node sections of breast cancer patients: the CAMELYON dataset", "abstract": "Abstract Background The presence of lymph node metastases is one of the most important factors in breast cancer prognosis. The most common way to assess regional lymph node status is the sentinel lymph node procedure. The sentinel lymph node is the most likely lymph node to contain metastasized cancer cells and is excised, histopathologically processed, and examined by a pathologist. This tedious examination process is time-consuming and can lead to small metastases being missed. However, recent advances in whole-slide imaging and machine learning have opened an avenue for analysis of digitized lymph node sections with computer algorithms. For example, convolutional neural networks, a type of machine-learning algorithm, can be used to automatically detect cancer metastases in lymph nodes with high accuracy. To train machine-learning models, large, well-curated datasets are needed. Results We released a dataset of 1,399 annotated whole-slide images (WSIs) of lymph nodes, both with and without metastases, in 3 terabytes of data in the context of the CAMELYON16 and CAMELYON17 Grand Challenges. Slides were collected from five medical centers to cover a broad range of image appearance and staining variations. Each WSI has a slide-level label indicating whether it contains no metastases, macro-metastases, micro-metastases, or isolated tumor cells. Furthermore, for 209 WSIs, detailed hand-drawn contours for all metastases are provided. Last, open-source software tools to visualize and interact with the data have been made available. Conclusions A unique dataset of annotated, whole-slide digital histopathology images has been provided with high potential for re-use.", "year": 2018, "referenceCount": 31, "citationCount": 191, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "145959882", "name": "G. Litjens"}, {"authorId": "47520063", "name": "Péter Bándi"}, {"authorId": "2140338217", "name": "Babak Ehteshami Bejnordi"}, {"authorId": "9560760", "name": "Oscar G. F. Geessink"}, {"authorId": "145382775", "name": "M. Balkenhol"}, {"authorId": "2708651", "name": "P. Bult"}, {"authorId": "5215048", "name": "A. Halilovic"}, {"authorId": "37793573", "name": "M. Hermsen"}, {"authorId": "2140392017", "name": "Rob van de Loo"}, {"authorId": "40550331", "name": "R. Vogels"}, {"authorId": "7219708", "name": "Quirine F Manson"}, {"authorId": "6897402", "name": "N. Stathonikos"}, {"authorId": "9544490", "name": "A. Baidoshvili"}, {"authorId": "2140337812", "name": "Paul van Diest"}, {"authorId": "3911099", "name": "C. Wauters"}, {"authorId": "2140392015", "name": "Marcory van Dijk"}, {"authorId": "2140391814", "name": "Jeroen van der Laak"}]}, {"paperId": "7e987654eae5f1b216e2c549c4390742bfc758e2", "url": "https://www.semanticscholar.org/paper/7e987654eae5f1b216e2c549c4390742bfc758e2", "title": "Name Translation in Statistical Machine Translation - Learning When to Transliterate", "abstract": "We present a method to transliterate names in the framework of end-to-end statistical machine translation. The system is trained to learn when to transliterate. For Arabic to English MT, we developed and trained a transliterator on a bitext of 7 million sentences and Google’s English terabyte ngrams and achieved better name translation accuracy than 3 out of 4 professional translators. The paper also includes a discussion of challenges in name translation evaluation.", "year": 2008, "referenceCount": 24, "citationCount": 126, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1791311", "name": "U. Hermjakob"}, {"authorId": "152971314", "name": "Kevin Knight"}, {"authorId": "1722360", "name": "Hal Daumé"}]}, {"paperId": "9342fdbb95ef2f2aa6643f943c3c2446191aafb5", "url": "https://www.semanticscholar.org/paper/9342fdbb95ef2f2aa6643f943c3c2446191aafb5", "title": "Breast cancer outcome prediction with tumour tissue images and machine learning", "abstract": null, "year": 2019, "referenceCount": 50, "citationCount": 58, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "6631265", "name": "Riku Turkki"}, {"authorId": "119926613", "name": "Dmitrii Byckhov"}, {"authorId": "27356802", "name": "M. Lundin"}, {"authorId": "144226307", "name": "J. Isola"}, {"authorId": "145684256", "name": "S. Nordling"}, {"authorId": "6530840", "name": "P. Kovanen"}, {"authorId": "5479615", "name": "C. Verrill"}, {"authorId": "47104901", "name": "K. von Smitten"}, {"authorId": "3810567", "name": "H. Joensuu"}, {"authorId": "144016816", "name": "J. Lundin"}, {"authorId": "6447321", "name": "N. Linder"}]}, {"paperId": "d8d0d81dbe9dd74918b62d7230b5df6343134480", "url": "https://www.semanticscholar.org/paper/d8d0d81dbe9dd74918b62d7230b5df6343134480", "title": "Imaging and machine learning techniques for diagnosis of Alzheimer’s disease", "abstract": "Abstract Alzheimer’s disease (AD) is a common health problem in elderly people. There has been considerable research toward the diagnosis and early detection of this disease in the past decade. The sensitivity of biomarkers and the accuracy of the detection techniques have been defined to be the key to an accurate diagnosis. This paper presents a state-of-the-art review of the research performed on the diagnosis of AD based on imaging and machine learning techniques. Different segmentation and machine learning techniques used for the diagnosis of AD are reviewed including thresholding, supervised and unsupervised learning, probabilistic techniques, Atlas-based approaches, and fusion of different image modalities. More recent and powerful classification techniques such as the enhanced probabilistic neural network of Ahmadlou and Adeli should be investigated with the goal of improving the diagnosis accuracy. A combination of different image modalities can help improve the diagnosis accuracy rate. Research is needed on the combination of modalities to discover multi-modal biomarkers.", "year": 2016, "referenceCount": 161, "citationCount": 69, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3296202", "name": "G. Mirzaei"}, {"authorId": "1402038422", "name": "Anahita Adeli"}, {"authorId": "1750050", "name": "H. Adeli"}]}, {"paperId": "5bb42872f2ffe9d51c0142e7a1e23b7a63c80e1e", "url": "https://www.semanticscholar.org/paper/5bb42872f2ffe9d51c0142e7a1e23b7a63c80e1e", "title": "Using communication to reduce locality in distributed multiagent learning", "abstract": "Abstract. This paper attempts to bridge the fields of machine learning, robotics, and distributed AI. It discusses the use of communication in reducing the undesirable effects of locality in fully distributed multi-agent systems with multiple agents robots learning in parallel while interacting with each other. Two key problems, hidden state and credit assignment, are addressed by applying local undirected broadcast communication in a dual role: as sensing and as reinforcement. The methodology is demonstrated on two multi-robot learning experiments. The first describes learning a tightly-coupled coordination task with two robots, the second a loosely-coupled task with four robots learning social rules. Communication is used to (1) share sensory data to overcome hidden state and (2) share reinforcement to overcome the credit assignment problem between the agents and bridge the gap between local individual and global group pay-off.", "year": 1997, "referenceCount": 41, "citationCount": 155, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1742183", "name": "M. Matarić"}]}, {"paperId": "6e80e4b2f2a09bdbc20c63af5d85e6fc333746a0", "url": "https://www.semanticscholar.org/paper/6e80e4b2f2a09bdbc20c63af5d85e6fc333746a0", "title": "Causability and explainability of artificial intelligence in medicine", "abstract": "Explainable artificial intelligence (AI) is attracting much interest in medicine. Technically, the problem of explainability is as old as AI itself and classic AI represented comprehensible retraceable approaches. However, their weakness was in dealing with uncertainties of the real world. Through the introduction of probabilistic learning, applications became increasingly successful, but increasingly opaque. Explainable AI deals with the implementation of transparency and traceability of statistical black‐box machine learning methods, particularly deep learning (DL). We argue that there is a need to go beyond explainable AI. To reach a level of explainable medicine we need causability. In the same way that usability encompasses measurements for the quality of use, causability encompasses measurements for the quality of explanations. In this article, we provide some necessary definitions to discriminate between explainability and causability as well as a use‐case of DL interpretation and of human explanation in histopathology. The main contribution of this article is the notion of causability, which is differentiated from explainability in that causability is a property of a person, while explainability is a property of a system", "year": 2019, "referenceCount": 108, "citationCount": 518, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1749801", "name": "Andreas Holzinger"}, {"authorId": "2328333", "name": "G. Langs"}, {"authorId": "46960380", "name": "H. Denk"}, {"authorId": "1738635", "name": "K. Zatloukal"}, {"authorId": "2151194287", "name": "Heimo Müller"}]}, {"paperId": "ed0616c039241e89f56696a96ca998ccaeec2407", "url": "https://www.semanticscholar.org/paper/ed0616c039241e89f56696a96ca998ccaeec2407", "title": "A Machine Learning System to Improve Heart Failure Patient Assistance", "abstract": "In this paper, we present a clinical decision support system (CDSS) for the analysis of heart failure (HF) patients, providing various outputs such as an HF severity evaluation, HF-type prediction, as well as a management interface that compares the different patients' follow-ups. The whole system is composed of a part of intelligent core and of an HF special-purpose management tool also providing the function to act as interface for the artificial intelligence training and use. To implement the smart intelligent functions, we adopted a machine learning approach. In this paper, we compare the performance of a neural network (NN), a support vector machine, a system with fuzzy rules genetically produced, and a classification and regression tree and its direct evolution, which is the random forest, in analyzing our database. Best performances in both HF severity evaluation and HF-type prediction functions are obtained by using the random forest algorithm. The management tool allows the cardiologist to populate a “supervised database” suitable for machine learning during his or her regular outpatient consultations. The idea comes from the fact that in literature there are a few databases of this type, and they are not scalable to our case.", "year": 2014, "referenceCount": 25, "citationCount": 80, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2056466685", "name": "Gabriele Guidi"}, {"authorId": "35142795", "name": "M. C. Pettenati"}, {"authorId": "3350505", "name": "P. Melillo"}, {"authorId": "2387863", "name": "E. Iadanza"}]}, {"paperId": "359dfdfea38f645d5fa49efc846a3b5ebce317fe", "url": "https://www.semanticscholar.org/paper/359dfdfea38f645d5fa49efc846a3b5ebce317fe", "title": "The Doctor Just Won't Accept That!", "abstract": "Calls to arms to build interpretable models express a well-founded discomfort with machine learning. Should a software agent that does not even know what a loan is decide who qualifies for one? Indeed, we ought to be cautious about injecting machine learning (or anything else, for that matter) into applications where there may be a significant risk of causing social harm. However, claims that stakeholders \"just won't accept that!\" do not provide a sufficient foundation for a proposed field of study. For the field of interpretable machine learning to advance, we must ask the following questions: What precisely won't various stakeholders accept? What do they want? Are these desiderata reasonable? Are they feasible? In order to answer these questions, we'll have to give real-world problems and their respective stakeholders greater consideration.", "year": 2017, "referenceCount": 3, "citationCount": 73, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Psychology"], "authors": [{"authorId": "32219137", "name": "Zachary Chase Lipton"}]}, {"paperId": "533d0a70fcf2c0fa07dfb7dcce6b7ff3e1fb650b", "url": "https://www.semanticscholar.org/paper/533d0a70fcf2c0fa07dfb7dcce6b7ff3e1fb650b", "title": "A comprehensive assessment of sequence-based and template-based methods for protein contact prediction", "abstract": "MOTIVATION\nPair-wise residue-residue contacts in proteins can be predicted from both threading templates and sequence-based machine learning. However, most structure modeling approaches only use the template-based contact predictions in guiding the simulations; this is partly because the sequence-based contact predictions are usually considered to be less accurate than that by threading. With the rapid progress in sequence databases and machine-learning techniques, it is necessary to have a detailed and comprehensive assessment of the contact-prediction methods in different template conditions.\n\n\nRESULTS\nWe develop two methods for protein-contact predictions: SVM-SEQ is a sequence-based machine learning approach which trains a variety of sequence-derived features on contact maps; SVM-LOMETS collects consensus contact predictions from multiple threading templates. We test both methods on the same set of 554 proteins which are categorized into 'Easy', 'Medium', 'Hard' and 'Very Hard' targets based on the evolutionary and structural distance between templates and targets. For the Easy and Medium targets, SVM-LOMETS obviously outperforms SVM-SEQ; but for the Hard and Very Hard targets, the accuracy of the SVM-SEQ predictions is higher than that of SVM-LOMETS by 12-25%. If we combine the SVM-SEQ and SVM-LOMETS predictions together, the total number of correctly predicted contacts in the Hard proteins will increase by more than 60% (or 70% for the long-range contact with a sequence separation > or =24), compared with SVM-LOMETS alone. The advantage of SVM-SEQ is also shown in the CASP7 free modeling targets where the SVM-SEQ is around four times more accurate than SVM-LOMETS in the long-range contact prediction. These data demonstrate that the state-of-the-art sequence-based contact prediction has reached a level which may be helpful in assisting tertiary structure modeling for the targets which do not have close structure templates. The maximum yield should be obtained by the combination of both sequence- and template-based predictions.", "year": 2008, "referenceCount": 51, "citationCount": 190, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "47403471", "name": "Sitao Wu"}, {"authorId": "41071620", "name": "Yang Zhang"}]}, {"paperId": "486edf39b88ad34db11628887a9e7b799ece43b9", "url": "https://www.semanticscholar.org/paper/486edf39b88ad34db11628887a9e7b799ece43b9", "title": "Extreme re-balancing for SVMs: a case study", "abstract": "There are many practical applications where learning from single class examples is either, the only possible solution, or has a distinct performance advantage. The first case occurs when obtaining examples of a second class is difficult, e.g., classifying sites of \"interest\" based on web accesses. The second situation is exemplified by the gene knock-out experiments for understanding Aryl Hydrocarbon Receptor signalling pathway that provided the data for the second task of the KDD 2002 Cup, where minority one-class SVMs significantly outperform models learnt using examples from both classes.This paper explores the limits of supervised learning of a two class discrimination from data with heavily unbalanced class proportions. We focus on the case of supervised learning with support vector machines. We consider the impact of both sampling and weighting imbalance compensation techniques and then extend the balancing to extreme situations when one of the classes is ignored completely and the learning is accomplished using examples from a single class.Our investigation with the data for KDD 2002 Cup as well as text benchmarks such as Reuters Newswire shows that there is a consistent pattern of performance differences between one and two-class learning for all SVMs investigated, and these patterns persist even with aggressive dimensionality reduction through automated feature selection. Using insight gained from the above analysis, we generate synthetic data showing similar pattern of performance.", "year": 2004, "referenceCount": 24, "citationCount": 340, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1693373", "name": "Bhavani Raskutti"}, {"authorId": "97484233", "name": "A. Kowalczyk"}]}, {"paperId": "9784d4e17ac6b6821a9d18de8f743db3d2e7d407", "url": "https://www.semanticscholar.org/paper/9784d4e17ac6b6821a9d18de8f743db3d2e7d407", "title": "Research Paper: BioTagger-GM: A Gene/Protein Name Recognition System", "abstract": "OBJECTIVES\nBiomedical named entity recognition (BNER) is a critical component in automated systems that mine biomedical knowledge in free text. Among different types of entities in the domain, gene/protein would be the most studied one for BNER. Our goal is to develop a gene/protein name recognition system BioTagger-GM that exploits rich information in terminology sources using powerful machine learning frameworks and system combination.\n\n\nDESIGN\nBioTagger-GM consists of four main components: (1) dictionary lookup-gene/protein names in BioThesaurus and biomedical terms in UMLS Metathesaurus are tagged in text, (2) machine learning-machine learning systems are trained using dictionary lookup results as one type of feature, (3) post-processing-heuristic rules are used to correct recognition errors, and (4) system combination-a voting scheme is used to combine recognition results from multiple systems.\n\n\nMEASUREMENTS\nThe BioCreAtIvE II Gene Mention (GM) corpus was used to evaluate the proposed method. To test its general applicability, the method was also evaluated on the JNLPBA corpus modified for gene/protein name recognition. The performance of the systems was evaluated through cross-validation tests and measured using precision, recall, and F-Measure.\n\n\nRESULTS\nBioTagger-GM achieved an F-Measure of 0.8887 on the BioCreAtIvE II GM corpus, which is higher than that of the first-place system in the BioCreAtIvE II challenge. The applicability of the method was also confirmed on the modified JNLPBA corpus.\n\n\nCONCLUSION\nThe results suggest that terminology sources, powerful machine learning frameworks, and system combination can be integrated to build an effective BNER system.", "year": 2009, "referenceCount": 63, "citationCount": 82, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "38346263", "name": "Manabu Torii"}, {"authorId": "34653423", "name": "Zhang-Zhi Hu"}, {"authorId": "1744726", "name": "Cathy H. Wu"}, {"authorId": "50793079", "name": "Hongfang Liu"}]}, {"paperId": "a95ddae9fba7413bcba58665b53598913c0cd477", "url": "https://www.semanticscholar.org/paper/a95ddae9fba7413bcba58665b53598913c0cd477", "title": "Diabetes Prediction using Machine Learning Algorithms", "abstract": null, "year": 2019, "referenceCount": 6, "citationCount": 69, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153087346", "name": "A. Mujumdar"}, {"authorId": "3097602", "name": "V. Vaidehi"}]}, {"paperId": "c3785192f68164a30a17ccbaec8a8802854d2a2f", "url": "https://www.semanticscholar.org/paper/c3785192f68164a30a17ccbaec8a8802854d2a2f", "title": "Eclectic Rule-Extraction from Support Vector Machines", "abstract": "Support vector machines (SVMs) have shown superior performance compared to other machine learning techniques, especially in classification problems. Yet one limitation of SVMs is the lack of an explanation capability which is crucial in some applications, e.g. in the medical and security domains. In this paper, a novel approach for eclectic rule- extraction from support vector machines is presented. This approach utilizes the knowledge acquired by the SVM and represented in its support vectors as well as the parameters associated with them. The approach includes three stages; training, propositional rule- extraction and rule quality evaluation. Results from four different experiments have demonstrated the value of the approach for extracting comprehensible rules of high accuracy and fidelity.", "year": 2005, "referenceCount": 22, "citationCount": 143, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2950480", "name": "N. Barakat"}, {"authorId": "1715247", "name": "J. Diederich"}]}, {"paperId": "71c5e50687ecb957f3b6534744464fe77ce3e9d4", "url": "https://www.semanticscholar.org/paper/71c5e50687ecb957f3b6534744464fe77ce3e9d4", "title": "An Analytic Center Machine", "abstract": null, "year": 2002, "referenceCount": 25, "citationCount": 29, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1824282", "name": "T. Trafalis"}, {"authorId": "1973881", "name": "A. Malyscheff"}]}, {"paperId": "330d56c3641cddd8c78440e768cd80795f23cab4", "url": "https://www.semanticscholar.org/paper/330d56c3641cddd8c78440e768cd80795f23cab4", "title": "Unsupervised Learning of Goal Spaces for Intrinsically Motivated Goal Exploration", "abstract": "Intrinsically motivated goal exploration algorithms enable machines to discover repertoires of policies that produce a diversity of effects in complex environments. These exploration algorithms have been shown to allow real world robots to acquire skills such as tool use in high-dimensional continuous state and action spaces. However, they have so far assumed that self-generated goals are sampled in a specifically engineered feature space, limiting their autonomy. In this work, we propose to use deep representation learning algorithms to learn an adequate goal space. This is a developmental 2-stage approach: first, in a perceptual learning stage, deep learning algorithms use passive raw sensor observations of world changes to learn a corresponding latent space; then goal exploration happens in a second stage by sampling goals in this latent space. We present experiments where a simulated robot arm interacts with an object, and we show that exploration algorithms using such learned representations can match the performance obtained using engineered representations.", "year": 2018, "referenceCount": 55, "citationCount": 82, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "46848496", "name": "Alexandre Péré"}, {"authorId": "2781532", "name": "Sébastien Forestier"}, {"authorId": "3211142", "name": "Olivier Sigaud"}, {"authorId": "1720664", "name": "P. Oudeyer"}]}, {"paperId": "f33d5692f2305f108d2d9a35e558a441529949b5", "url": "https://www.semanticscholar.org/paper/f33d5692f2305f108d2d9a35e558a441529949b5", "title": "Developing an intelligent data discriminating system of anti-money laundering based on SVM", "abstract": "Statistical learning theory (SLT) is introduced to improve the embarrassments of anti-money laundering (AML) intelligence collection. A set of unusual behavior detection algorithm is presented in this paper based on support vector machine (SVM) in order to take the place of traditional predefined-rule suspicious transaction data filtering system. It could efficiently surmount the worst forms of suspicious data analyzing and reporting mechanism among bank branches including enormous data volume, dimensionality disorder with massive variances and feature overload.", "year": 2005, "referenceCount": 6, "citationCount": 78, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2112533630", "name": "Jun Tang"}, {"authorId": "2111612292", "name": "Jian Yin"}]}, {"paperId": "574890ef2e3ea7921c06500f458f5b56ef09ffac", "url": "https://www.semanticscholar.org/paper/574890ef2e3ea7921c06500f458f5b56ef09ffac", "title": "Asynchronous Federated Learning for Geospatial Applications", "abstract": null, "year": 2018, "referenceCount": 8, "citationCount": 71, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153287200", "name": "Michael R. Sprague"}, {"authorId": "2805195", "name": "A. Jalalirad"}, {"authorId": "35330865", "name": "Marco Scavuzzo"}, {"authorId": "66930184", "name": "Catalin Capota"}, {"authorId": "2217478", "name": "M. Neun"}, {"authorId": "27522693", "name": "L. Do"}, {"authorId": "2058236577", "name": "Michael Kopp"}]}, {"paperId": "5940b6a654300ed7bd6e495407b2002e5b33ba98", "url": "https://www.semanticscholar.org/paper/5940b6a654300ed7bd6e495407b2002e5b33ba98", "title": "Gossip Learning as a Decentralized Alternative to Federated Learning", "abstract": null, "year": 2019, "referenceCount": 18, "citationCount": 65, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1772091", "name": "István Hegedüs"}, {"authorId": "50644385", "name": "Gábor Danner"}, {"authorId": "1723641", "name": "M. Jelasity"}]}, {"paperId": "9e754f7d176b4199bcaaad673a05bfc5c4e6a53e", "url": "https://www.semanticscholar.org/paper/9e754f7d176b4199bcaaad673a05bfc5c4e6a53e", "title": "Optimizing Network Performance in Distributed Machine Learning", "abstract": "To cope with the ever growing availability of training data, there have been several proposals to scale machine learning computation beyond a single server and distribute it across a cluster. While this enables reducing the training time, the observed speed up is often limited by network bottlenecks. \n \nTo address this, we design MLNET, a host-based communication layer that aims to improve the network performance of distributed machine learning systems. This is achieved through a combination of traffic reduction techniques (to diminish network load in the core and at the edges) and traffic management (to reduce average training time). A key feature of MLNET is its compatibility with existing hardware and software infrastructure so it can be immediately deployed. \n \nWe describe the main techniques underpinning MLNET and show through simulation that the overall training time can be reduced by up to 78%. While preliminary, our results indicate the critical role played by the network and the benefits of introducing a new communication layer to increase the performance of distributed machine learning systems.", "year": 2015, "referenceCount": 43, "citationCount": 50, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "32214483", "name": "Luo Mai"}, {"authorId": "2107093521", "name": "C. Hong"}, {"authorId": "1912518", "name": "Paolo Costa"}]}, {"paperId": "4ceb589c609d819bcc77524ab49d0c5e8625fa74", "url": "https://www.semanticscholar.org/paper/4ceb589c609d819bcc77524ab49d0c5e8625fa74", "title": "Classification of Rockburst in Underground Projects: Comparison of Ten Supervised Learning Methods", "abstract": "AbstractRockburst prediction is of crucial importance to the design and construction of many underground projects. Insufficient knowledge, lack of characterizing information, and noisy data restrain rock mechanics engineers from achieving optimal prediction results. In this paper, a data set of 246 rockburst events was examined for rockburst classification using supervised learning (SL) methods. The data set was analyzed with 8 potentially relevant indicators. Eleven algorithms from 10 categories of SL algorithms were evaluated for their ability to learn rockburst, including linear discriminant analysis (LDA), quadratic discriminant analysis (QDA), partial least-squares discriminant analysis (PLSDA), naive Bayes (NB), k-nearest neighbor (KNN), multilayer perceptron neural network (MLPNN), classification tree (CT), support vector machine (SVM), random forest (RF), and gradient-boosting machine (GBM). The data set was randomly split into two parts: training (70%) and test (30%). A 10-fold cross-validation (...", "year": 2016, "referenceCount": 97, "citationCount": 227, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "48128486", "name": "Jian Zhou"}, {"authorId": "121856720", "name": "Xibing Li"}, {"authorId": "70301994", "name": "H. Mitri"}]}, {"paperId": "4b9955402487fce0a69a8dcf4df177b2169d15ab", "url": "https://www.semanticscholar.org/paper/4b9955402487fce0a69a8dcf4df177b2169d15ab", "title": "Artificial intelligence in medical imaging of the liver", "abstract": "Artificial intelligence (AI), particularly deep learning algorithms, is gaining extensive attention for its excellent performance in image-recognition tasks. They can automatically make a quantitative assessment of complex medical image characteristics and achieve an increased accuracy for diagnosis with higher efficiency. AI is widely used and getting increasingly popular in the medical imaging of the liver, including radiology, ultrasound, and nuclear medicine. AI can assist physicians to make more accurate and reproductive imaging diagnosis and also reduce the physicians’ workload. This article illustrates basic technical knowledge about AI, including traditional machine learning and deep learning algorithms, especially convolutional neural networks, and their clinical application in the medical imaging of liver diseases, such as detecting and evaluating focal liver lesions, facilitating treatment, and predicting liver treatment response. We conclude that machine-assisted medical services will be a promising solution for future liver medical care. Lastly, we discuss the challenges and future directions of clinical application of deep learning techniques.", "year": 2019, "referenceCount": 65, "citationCount": 90, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2157516233", "name": "Li-Qiang Zhou"}, {"authorId": "2110271911", "name": "Jia-Yu Wang"}, {"authorId": "2116495420", "name": "Song-Yuan Yu"}, {"authorId": "82254265", "name": "Ge-Ge Wu"}, {"authorId": "2114826983", "name": "Qi Wei"}, {"authorId": "80240642", "name": "Youbin Deng"}, {"authorId": "48661908", "name": "Xingxing Wu"}, {"authorId": "144359513", "name": "X. Cui"}, {"authorId": "145281006", "name": "C. Dietrich"}]}, {"paperId": "0662db8ec063f14507b43e4f93884c0d0e051d68", "url": "https://www.semanticscholar.org/paper/0662db8ec063f14507b43e4f93884c0d0e051d68", "title": "Neural Paraphrase Generation with Stacked Residual LSTM Networks", "abstract": "In this paper, we propose a novel neural approach for paraphrase generation. Conventional paraphrase generation methods either leverage hand-written rules and thesauri-based alignments, or use statistical machine learning principles. To the best of our knowledge, this work is the first to explore deep learning models for paraphrase generation. Our primary contribution is a stacked residual LSTM network, where we add residual connections between LSTM layers. This allows for efficient training of deep LSTMs. We evaluate our model and other state-of-the-art deep learning models on three different datasets: PPDB, WikiAnswers, and MSCOCO. Evaluation results demonstrate that our model outperforms sequence to sequence, attention-based, and bi-directional LSTM models on BLEU, METEOR, TER, and an embedding-based sentence similarity metric.", "year": 2016, "referenceCount": 55, "citationCount": 217, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "40014058", "name": "Aaditya Prakash"}, {"authorId": "37187331", "name": "Sadid A. Hasan"}, {"authorId": "1694037", "name": "Kathy Lee"}, {"authorId": "1878942", "name": "Vivek Datla"}, {"authorId": "2845895", "name": "Ashequl Qadir"}, {"authorId": "1491628881", "name": "Joey Liu"}, {"authorId": "2211973", "name": "Oladimeji Farri"}]}, {"paperId": "726814ed8eb9f0377c0b616f1dd8e8db704b2674", "url": "https://www.semanticscholar.org/paper/726814ed8eb9f0377c0b616f1dd8e8db704b2674", "title": "Genetic-based machine learning systems are competitive for pattern recognition", "abstract": null, "year": 2008, "referenceCount": 106, "citationCount": 55, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1398964794", "name": "Albert Orriols-Puig"}, {"authorId": "145512049", "name": "J. Casillas"}, {"authorId": "1399458171", "name": "Ester Bernadó-Mansilla"}]}, {"paperId": "f2195d5e740cb452210c1a20391d0ad21697b77f", "url": "https://www.semanticscholar.org/paper/f2195d5e740cb452210c1a20391d0ad21697b77f", "title": "A Hybrid Algorithm for Convex Semidefinite Optimization", "abstract": "We present a hybrid algorithm for optimizing a convex, smooth function over the cone of positive semidefinite matrices. Our algorithm converges to the global optimal solution and can be used to solve general large-scale semidefinite programs and hence can be readily applied to a variety of machine learning problems. We show experimental results on three machine learning problems (matrix completion, metric learning, and sparse PCA) . Our approach outperforms state-of-the-art algorithms.", "year": 2012, "referenceCount": 23, "citationCount": 59, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "40941971", "name": "S. Laue"}]}, {"paperId": "e2d09159e54a53bb3b02e9265c0e63631d8d7d8a", "url": "https://www.semanticscholar.org/paper/e2d09159e54a53bb3b02e9265c0e63631d8d7d8a", "title": "A Framework for robustness Certification of Smoothed Classifiers using F-Divergences", "abstract": "Formal verification techniques that compute provable guarantees on properties of machine learning models, like robustness to norm-bounded adversarial perturbations, have yielded impressive results. Although most techniques developed so far requires knowledge of the architecture of the machine learning model and remains hard to scale to complex prediction pipelines, the method of randomized smoothing has been shown to overcome many of these obstacles. By requiring only black-box access to the underlying model, randomized smoothing scales to large architectures and is agnostic to the internals of the network. However, past work on randomized smoothing has focused on restricted classes of smoothing measures or perturbations (like Gaussian or discrete) and has only been able to prove robustness with respect to simple norm bounds. In this paper we introduce a general framework for proving robustness properties of smoothed machine learning models in the black-box setting. Specifically, we extend randomized smoothing procedures to handle arbitrary smoothing measures and prove robustness of the smoothed classifier by using $f$-divergences. Our methodology achieves state-of-the-art}certified robustness on MNIST, CIFAR-10 and ImageNet and also audio classification task, Librispeech, with respect to several classes of adversarial perturbations.", "year": 2020, "referenceCount": 29, "citationCount": 46, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1729912", "name": "Krishnamurthy Dvijotham"}, {"authorId": "9200194", "name": "Jamie Hayes"}, {"authorId": "1718064", "name": "B. Balle"}, {"authorId": "145116464", "name": "J. Z. Kolter"}, {"authorId": "32399256", "name": "Chongli Qin"}, {"authorId": "145350541", "name": "A. György"}, {"authorId": "2066515966", "name": "Kai Y. Xiao"}, {"authorId": "2071666", "name": "Sven Gowal"}, {"authorId": "143967473", "name": "Pushmeet Kohli"}]}, {"paperId": "64cafa409918e126d874b6e19ed7b5608e7ad3e6", "url": "https://www.semanticscholar.org/paper/64cafa409918e126d874b6e19ed7b5608e7ad3e6", "title": "Support vector machine classification with indefinite kernels", "abstract": null, "year": 2007, "referenceCount": 44, "citationCount": 130, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1695275", "name": "Ronny Luss"}, {"authorId": "1387902104", "name": "A. d’Aspremont"}]}, {"paperId": "11cc9604f09c9bac06c84ec1fe87c25c3b40a570", "url": "https://www.semanticscholar.org/paper/11cc9604f09c9bac06c84ec1fe87c25c3b40a570", "title": "Fiber tractography using machine learning", "abstract": "We present a fiber tractography approach based on a random forest classification and voting process, guiding each step of the streamline progression by directly processing raw diffusion-weighted signal intensities. For comparison to the state-of-the-art, i.e. tractography pipelines that rely on mathematical modeling, we performed a quantitative and qualitative evaluation with multiple phantom and in vivo experiments, including a comparison to the 96 submissions of the ISMRM tractography challenge 2015. The results demonstrate the vast potential of machine learning for fiber tractography.", "year": 2017, "referenceCount": 72, "citationCount": 40, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "2388315", "name": "P. Neher"}, {"authorId": "40638665", "name": "Marc-Alexandre Côté"}, {"authorId": "37525982", "name": "Jean-Christophe Houde"}, {"authorId": "1788574", "name": "M. Descoteaux"}, {"authorId": "1397951928", "name": "Klaus Maier-Hein"}]}, {"paperId": "e1b4d814f106f33ea9939a85de8d9edba266ad1c", "url": "https://www.semanticscholar.org/paper/e1b4d814f106f33ea9939a85de8d9edba266ad1c", "title": "A Review on Support Vector Machine for Data Classification", "abstract": "185 All Rights Reserved © 2012 IJARCET Abstract-With increasing amounts of data being generated by businesses and researchers there is a need for fast, accurate and robust algorithms for data analysis. Improvements in databases technology, computing performance and artificial intelligence have contributed to the development of intelligent data analysis. Support vector machines are a specific type of machine learning algorithm that are among the most widelyused for many statistical learning problems, such as spam filtering, text classification, handwriting analysis, face and object recognition, and countless others. Support vector machines have also come into widespread use in practically every area of bioinformatics within the last ten years, and their area of influence continues to expand today. The support vector machine has been developed as robust tool for classification and regression in noisy, complex domains. The two key features of support vector machines are generalization theory, which leads to a principled way to choose an hypothesis; and, kernel functions, which introduce nonlinearity in the hypothesis space without explicitly requiring a non-linear algorithm.", "year": 2012, "referenceCount": 17, "citationCount": 107, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "73061226", "name": "H. Bhavsar"}, {"authorId": "145696723", "name": "Mahesh Panchal"}]}, {"paperId": "371322935e635ff56c10a74395b6b66a7487fa83", "url": "https://www.semanticscholar.org/paper/371322935e635ff56c10a74395b6b66a7487fa83", "title": "Deep Multitask Learning for Railway Track Inspection", "abstract": "Railroad tracks need to be periodically inspected and monitored to ensure safe transportation. Automated track inspection using computer vision and pattern recognition methods has recently shown the potential to improve safety by allowing for more frequent inspections while reducing human errors. Achieving full automation is still very challenging due to the number of different possible failure modes, as well as the broad range of image variations that can potentially trigger false alarms. In addition, the number of defective components is very small, so not many training examples are available for the machine to learn a robust anomaly detector. In this paper, we show that detection performance can be improved by combining multiple detectors within a multitask learning framework. We show that this approach results in improved accuracy for detecting defects on railway ties and fasteners.", "year": 2015, "referenceCount": 54, "citationCount": 246, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "2067146341", "name": "Xavier Gibert"}, {"authorId": "1741177", "name": "Vishal M. Patel"}, {"authorId": "9215658", "name": "R. Chellappa"}]}, {"paperId": "3f0130a2a7a9887b840e25cffc70729787b0d0e7", "url": "https://www.semanticscholar.org/paper/3f0130a2a7a9887b840e25cffc70729787b0d0e7", "title": "Studying depression using imaging and machine learning methods", "abstract": null, "year": 2015, "referenceCount": 66, "citationCount": 123, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Psychology", "Medicine"], "authors": [{"authorId": "50556016", "name": "Meenal J. Patel"}, {"authorId": "40508775", "name": "Alexander M Khalaf"}, {"authorId": "2390570", "name": "H. Aizenstein"}]}, {"paperId": "1d8a78f3f740a01905e925aeb7937df010dfa1df", "url": "https://www.semanticscholar.org/paper/1d8a78f3f740a01905e925aeb7937df010dfa1df", "title": "Machine Learning in Healthcare Data Analysis: A Survey", "abstract": "In recent years, healthcare data analysis is becoming one of the most promising research areas. Healthcare includes data in various types such as clinical data, Omics data, and Sensor data. Clinical data includes electronic health records which store patient records collected during ongoing treatment. Omics data is one of the high dimensional data comprising genome, transcriptome and proteome data types. Sensor data is collected from various wearable and wireless sensor devices. To handle this raw data manually is very difficult. For analysis of data, machine learning is emerged as a significant tool. Machine learning uses various statistical techniques and advanced algorithms to predict the results of healthcare data more precisely. In machine learning different types of algorithms like supervised, unsupervised and reinforcement are used for analysis. In this paper, different types of machine learning algorithms are described. Then use of machine learning algorithms for analyzing various healthcare data are surveyed.", "year": 2019, "referenceCount": 33, "citationCount": 37, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1379985491", "name": "Arwinder Dhillon"}, {"authorId": "2144287098", "name": "Ashima Singh"}]}, {"paperId": "9a3fdd2b4dce8f3814d0f3de626b3eebe9f80fb3", "url": "https://www.semanticscholar.org/paper/9a3fdd2b4dce8f3814d0f3de626b3eebe9f80fb3", "title": "Robust Model Predictive Control of Nonlinear Systems With Unmodeled Dynamics and Bounded Uncertainties Based on Neural Networks", "abstract": "This paper presents a neural network approach to robust model predictive control (MPC) for constrained discrete-time nonlinear systems with unmodeled dynamics affected by bounded uncertainties. The exact nonlinear model of underlying process is not precisely known, but a partially known nominal model is available. This partially known nonlinear model is first decomposed to an affine term plus an unknown high-order term via Jacobian linearization. The linearization residue combined with unmodeled dynamics is then modeled using an extreme learning machine via supervised learning. The minimax methodology is exploited to deal with bounded uncertainties. The minimax optimization problem is reformulated as a convex minimization problem and is iteratively solved by a two-layer recurrent neural network. The proposed neurodynamic approach to nonlinear MPC improves the computational efficiency and sheds a light for real-time implementability of MPC technology. Simulation results are provided to substantiate the effectiveness and characteristics of the proposed approach.", "year": 2014, "referenceCount": 67, "citationCount": 119, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2152531798", "name": "Zheng Yan"}, {"authorId": "48093899", "name": "Jun Wang"}]}, {"paperId": "78201113a852abba42a94b6d7b6098fb261f8759", "url": "https://www.semanticscholar.org/paper/78201113a852abba42a94b6d7b6098fb261f8759", "title": "\"What is relevant in a text document?\": An interpretable machine learning approach", "abstract": "Text documents can be described by a number of abstract concepts such as semantic category, writing style, or sentiment. Machine learning (ML) models have been trained to automatically map documents to these abstract concepts, allowing to annotate very large text collections, more than could be processed by a human in a lifetime. Besides predicting the text’s category very accurately, it is also highly desirable to understand how and why the categorization process takes place. In this paper, we demonstrate that such understanding can be achieved by tracing the classification decision back to individual words using layer-wise relevance propagation (LRP), a recently developed technique for explaining predictions of complex non-linear classifiers. We train two word-based ML models, a convolutional neural network (CNN) and a bag-of-words SVM classifier, on a topic categorization task and adapt the LRP method to decompose the predictions of these models onto words. Resulting scores indicate how much individual words contribute to the overall classification decision. This enables one to distill relevant information from text documents without an explicit semantic information extraction step. We further use the word-wise relevance scores for generating novel vector-based document representations which capture semantic information. Based on these document vectors, we introduce a measure of model explanatory power and show that, although the SVM and CNN models perform similarly in terms of classification accuracy, the latter exhibits a higher level of explainability which makes it more comprehensible for humans and potentially more useful for other applications.", "year": 2016, "referenceCount": 47, "citationCount": 234, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "3422375", "name": "L. Arras"}, {"authorId": "153403454", "name": "F. Horn"}, {"authorId": "144535526", "name": "G. Montavon"}, {"authorId": "145034054", "name": "K. Müller"}, {"authorId": "1699054", "name": "W. Samek"}]}, {"paperId": "1cd61ce9ac9b63ba6ffa1f4732926d4b153aa344", "url": "https://www.semanticscholar.org/paper/1cd61ce9ac9b63ba6ffa1f4732926d4b153aa344", "title": "Exploiting Context for Biomedical Entity Recognition: From Syntax to the Web", "abstract": "We describe a machine learning system for the recognition of names in biomedical texts. The system makes extensive use of local and syntactic features within the text, as well as external resources including the web and gazetteers. It achieves an F-score of 70% on the Coling 2004 NLPBA/BioNLP shared task of identifying five biomedical named entities in the GENIA corpus.", "year": 2004, "referenceCount": 13, "citationCount": 164, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2784228", "name": "J. Finkel"}, {"authorId": "3175660", "name": "S. Dingare"}, {"authorId": "122619312", "name": "Huy Nguyen"}, {"authorId": "2742475", "name": "M. Nissim"}, {"authorId": "144783904", "name": "Christopher D. Manning"}, {"authorId": "5259944", "name": "Gail Sinclair"}]}, {"paperId": "061a3b79f51007fc12b133761683b03687d73c74", "url": "https://www.semanticscholar.org/paper/061a3b79f51007fc12b133761683b03687d73c74", "title": "Feature Engineering for Machine Learning and Data Analytics", "abstract": null, "year": 2018, "referenceCount": 0, "citationCount": 109, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153827249", "name": "G. Dong"}, {"authorId": "2146397025", "name": "Huan Liu"}]}, {"paperId": "748c4f1945b0d994ecef38c8aac01db1c6dc7029", "url": "https://www.semanticscholar.org/paper/748c4f1945b0d994ecef38c8aac01db1c6dc7029", "title": "Model-Contrastive Federated Learning", "abstract": "Federated learning enables multiple parties to collaboratively train a machine learning model without communicating their local data. A key challenge in federated learning is to handle the heterogeneity of local data distribution across parties. Although many studies have been proposed to address this challenge, we find that they fail to achieve high performance in image datasets with deep learning models. In this paper, we propose MOON: model-contrastive federated learning. MOON is a simple and effective federated learning framework. The key idea of MOON is to utilize the similarity between model representations to correct the local training of individual parties, i.e., conducting contrastive learning in model-level. Our extensive experiments show that MOON significantly outperforms the other state-of-the-art federated learning algorithms on various image classification tasks.", "year": 2021, "referenceCount": 48, "citationCount": 124, "influentialCitationCount": 32, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2108107022", "name": "Qinbin Li"}, {"authorId": "143824511", "name": "Bingsheng He"}, {"authorId": "143711382", "name": "D. Song"}]}, {"paperId": "3b7d120c0e801ef318bc9c607a0789f175637c7f", "url": "https://www.semanticscholar.org/paper/3b7d120c0e801ef318bc9c607a0789f175637c7f", "title": "OpenFace 2.0: Facial Behavior Analysis Toolkit", "abstract": "Over the past few years, there has been an increased interest in automatic facial behavior analysis and understanding. We present OpenFace 2.0 - a tool intended for computer vision and machine learning researchers, affective computing community and people interested in building interactive applications based on facial behavior analysis. OpenFace 2.0 is an extension of OpenFace toolkit and is capable of more accurate facial landmark detection, head pose estimation, facial action unit recognition, and eye-gaze estimation. The computer vision algorithms which represent the core of OpenFace 2.0 demonstrate state-of-the-art results in all of the above mentioned tasks. Furthermore, our tool is capable of real-time performance and is able to run from a simple webcam without any specialist hardware. Finally, unlike a lot of modern approaches or toolkits, OpenFace 2.0 source code for training models and running them is freely available for research purposes.", "year": 2018, "referenceCount": 87, "citationCount": 825, "influentialCitationCount": 152, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1756344", "name": "T. Baltrušaitis"}, {"authorId": "144802290", "name": "Amir Zadeh"}, {"authorId": "144529448", "name": "Y. Lim"}, {"authorId": "49933077", "name": "Louis-Philippe Morency"}]}, {"paperId": "30423f985355d74295546f1d14ed2ddd33cdef99", "url": "https://www.semanticscholar.org/paper/30423f985355d74295546f1d14ed2ddd33cdef99", "title": "Bayesian Optimization with Robust Bayesian Neural Networks", "abstract": "Bayesian optimization is a prominent method for optimizing expensive-to-evaluate black-box functions that is widely applied to tuning the hyperparameters of machine learning algorithms. Despite its successes, the prototypical Bayesian optimization approach - using Gaussian process models - does not scale well to either many hyperparameters or many function evaluations. Attacking this lack of scalability and flexibility is thus one of the key challenges of the field. We present a general approach for using flexible parametric models (neural networks) for Bayesian optimization, staying as close to a truly Bayesian treatment as possible. We obtain scalability through stochastic gradient Hamiltonian Monte Carlo, whose robustness we improve via a scale adaptation. Experiments including multi-task Bayesian optimization with 21 tasks, parallel optimization of deep neural networks and deep reinforcement learning show the power and flexibility of this approach.", "year": 2016, "referenceCount": 34, "citationCount": 325, "influentialCitationCount": 37, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2060551", "name": "J. T. Springenberg"}, {"authorId": "145227684", "name": "Aaron Klein"}, {"authorId": "2154062", "name": "S. Falkner"}, {"authorId": "144661829", "name": "F. Hutter"}]}, {"paperId": "8b37164a8d710c601b9a4139d9c46dcd20c3346d", "url": "https://www.semanticscholar.org/paper/8b37164a8d710c601b9a4139d9c46dcd20c3346d", "title": "Auto-Sklearn 2.0: The Next Generation", "abstract": "Automated Machine Learning, which supports practitioners and researchers with the tedious task of manually designing machine learning pipelines, has recently achieved substantial success. In this paper we introduce new Automated Machine Learning (AutoML) techniques motivated by our winning submission to the second ChaLearn AutoML challenge, PoSH Auto-sklearn. For this, we extend Auto-sklearn with a new, simpler meta-learning technique, improve its way of handling iterative algorithms and enhance it with a successful bandit strategy for budget allocation. Furthermore, we go one step further and study the design space of AutoML itself and propose a solution towards truly hand-free AutoML. Together, these changes give rise to the next generation of our AutoML system, Auto-sklearn (2.0). We verify the improvement by these additions in a large experimental study on 39 AutoML benchmark datasets and conclude the paper by comparing to Auto-sklearn (1.0), reducing the regret by up to a factor of five.", "year": 2020, "referenceCount": 92, "citationCount": 63, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2868444", "name": "Matthias Feurer"}, {"authorId": "2607675", "name": "Katharina Eggensperger"}, {"authorId": "2154062", "name": "S. Falkner"}, {"authorId": "145963266", "name": "M. Lindauer"}, {"authorId": "144661829", "name": "F. Hutter"}]}, {"paperId": "0903d301eb35c8ebb0d805f5cca1fa2690e2c8a9", "url": "https://www.semanticscholar.org/paper/0903d301eb35c8ebb0d805f5cca1fa2690e2c8a9", "title": "Classification, Parameter Estimation and State Estimation: An Engineering Approach Using MATLAB, 2nd Edition", "abstract": "The past decade has witnessed epic growth in image processing and intelligent computer vision technology. Advancements in machine learning methods—especially among adaboost varieties and particle filtering methods—have made machine learning in intelligent computer vision more accurate and reliable than ever before. The need for expert coverage of the state of the art in this burgeoning field has never been greater, and this book satisfies that need. Fully updated and extensively revised, this 2nd Edition of the popular guide provides designers, data analysts, researchers and advanced post-graduates with a fundamental yet wholly practical introduction to intelligent computer vision. The authors walk you through the basics of computer vision, past and present, and they explore the more subtle intricacies of intelligent computer vision, with an emphasis on intelligent measurement systems. Using many timely, real-world examples, they explain and vividly demonstrate the latest developments in image and video processing techniques and technologies for machine learning in computer vision systems, including:", "year": 2017, "referenceCount": 0, "citationCount": 74, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "4453577", "name": "D. Ridder"}, {"authorId": "2743835", "name": "D. Tax"}, {"authorId": "1693511", "name": "B. Lei"}, {"authorId": "2436057", "name": "Guangzhu Xu"}, {"authorId": "145309491", "name": "M. Feng"}, {"authorId": "40596220", "name": "Y. Zou"}, {"authorId": "1760937", "name": "F. Heijden"}]}, {"paperId": "52679f4ab520b642d996c4fe7da2f6450b316dd2", "url": "https://www.semanticscholar.org/paper/52679f4ab520b642d996c4fe7da2f6450b316dd2", "title": "Information Extraction A Multidisciplinary Approach to an Emerging Information Technology", "abstract": null, "year": 1997, "referenceCount": 0, "citationCount": 223, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "82976280", "name": "Scie"}, {"authorId": "1802339", "name": "M. Pazienza"}]}, {"paperId": "725e9d3b209f93e93abfe19cb5ba592e66888aa7", "url": "https://www.semanticscholar.org/paper/725e9d3b209f93e93abfe19cb5ba592e66888aa7", "title": "Towards detection of phishing websites on client-side using machine learning based approach", "abstract": null, "year": 2018, "referenceCount": 28, "citationCount": 96, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31772983", "name": "A. Jain"}, {"authorId": "144901889", "name": "B. Gupta"}]}, {"paperId": "c99121a270a4155e809a92113ebb18bcf687c2b0", "url": "https://www.semanticscholar.org/paper/c99121a270a4155e809a92113ebb18bcf687c2b0", "title": "Why Does Deep and Cheap Learning Work So Well?", "abstract": null, "year": 2016, "referenceCount": 77, "citationCount": 497, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Computer Science", "Mathematics"], "authors": [{"authorId": "10273964", "name": "Henry W. Lin"}, {"authorId": "2011933", "name": "Max Tegmark"}]}, {"paperId": "0bcaaa60f9fda35e269151edc67e3bba58dd6af8", "url": "https://www.semanticscholar.org/paper/0bcaaa60f9fda35e269151edc67e3bba58dd6af8", "title": "Don't Jump Through Hoops and Remove Those Loops: SVRG and Katyusha are Better Without the Outer Loop", "abstract": "The stochastic variance-reduced gradient method (SVRG) and its accelerated variant (Katyusha) have attracted enormous attention in the machine learning community in the last few years due to their superior theoretical properties and empirical behaviour on training supervised machine learning models via the empirical risk minimization paradigm. A key structural element in both of these methods is the inclusion of an outer loop at the beginning of which a full pass over the training data is made in order to compute the exact gradient, which is then used to construct a variance-reduced estimator of the gradient. In this work we design {\\em loopless variants} of both of these methods. In particular, we remove the outer loop and replace its function by a coin flip performed in each iteration designed to trigger, with a small probability, the computation of the gradient. We prove that the new methods enjoy the same superior theoretical convergence properties as the original methods. However, we demonstrate through numerical experiments that our methods have substantially superior practical behavior.", "year": 2019, "referenceCount": 30, "citationCount": 93, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "152307988", "name": "D. Kovalev"}, {"authorId": "2066680718", "name": "Samuel Horváth"}, {"authorId": "2662221", "name": "Peter Richtárik"}]}, {"paperId": "5bf1c02270296e84e32cc873028e6f724090e6ee", "url": "https://www.semanticscholar.org/paper/5bf1c02270296e84e32cc873028e6f724090e6ee", "title": "Inverse design of photonic topological state via machine learning", "abstract": "The photonics topological state plays an important role in recent optical physics and has led to devices with robust properties. However, the design of optical structures with the target topological states is a challenge for current research. Here, we propose an approach to achieve this goal by exploiting machine learning technologies. In our work, we focus on Zak phases, which are the topological properties of one-dimensional photonics crystals. After learning the principle between the geometrical parameters and the Zak phases, the neural network can obtain the appropriate structures of photonics crystals by applying the objective Zak phase properties. Our work would give more insights into the application of machine learning on the inverse design of the complex material properties and could be extended to other fields, i.e., advanced phononics devices.", "year": 2019, "referenceCount": 42, "citationCount": 70, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47341608", "name": "Yang Long"}, {"authorId": "46606082", "name": "Jie Ren"}, {"authorId": "2110469617", "name": "Yunhui Li"}, {"authorId": "47666603", "name": "Hong Chen"}]}, {"paperId": "877374c2913b787ee9f958f39e31c75d39ebcc15", "url": "https://www.semanticscholar.org/paper/877374c2913b787ee9f958f39e31c75d39ebcc15", "title": "Spectrum Sensing for Cognitive Radio : State-of-the-Art and Recent Advances", "abstract": "The ever-increasing demand for higher data rates in wireless communications in the face of limited or underutilized spectral resources has motivated the introduction of cognitive radio. Traditionally, licensed spectrum is allocated over relatively long time periods and is intended to be used only by licensees. Various measurements of spectrum utilization have shown substantial unused resources in frequency, time, and space [1], [2]. The concept behind cognitive radio is to exploit these underutilized spectral resources by reusing unused spectrum in an opportunistic manner [3], [4]. The phrase cognitive radio is usually attributed to Mitola [4], but the idea of using learning and sensing machines to probe the radio spectrum was envisioned several decades earlier (cf., [5]).", "year": 2012, "referenceCount": 84, "citationCount": 986, "influentialCitationCount": 43, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2983295", "name": "Erik Axell"}, {"authorId": "143668698", "name": "G. Leus"}, {"authorId": "1701766", "name": "E. Larsson"}, {"authorId": "145967056", "name": "H. Poor"}]}, {"paperId": "3a5b2487be2a592f4b3cbd41c091599d82a4868c", "url": "https://www.semanticscholar.org/paper/3a5b2487be2a592f4b3cbd41c091599d82a4868c", "title": "Gradient Estimators for Implicit Models", "abstract": "Implicit models, which allow for the generation of samples but not for point-wise evaluation of probabilities, are omnipresent in real-world problems tackled by machine learning and a hot topic of current research. Some examples include data simulators that are widely used in engineering and scientific research, generative adversarial networks (GANs) for image synthesis, and hot-off-the-press approximate inference techniques relying on implicit distributions. The majority of existing approaches to learning implicit models rely on approximating the intractable distribution or optimisation objective for gradient-based optimisation, which is liable to produce inaccurate updates and thus poor models. This paper alleviates the need for such approximations by proposing the Stein gradient estimator, which directly estimates the score function of the implicitly defined distribution. The efficacy of the proposed estimator is empirically demonstrated by examples that include meta-learning for approximate inference, and entropy regularised GANs that provide improved sample diversity.", "year": 2017, "referenceCount": 63, "citationCount": 73, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2672661", "name": "Yingzhen Li"}, {"authorId": "145369890", "name": "Richard E. Turner"}]}, {"paperId": "90b4d439de2ffdb38cf6949804b446afe33bb57d", "url": "https://www.semanticscholar.org/paper/90b4d439de2ffdb38cf6949804b446afe33bb57d", "title": "Privacy: a machine learning view", "abstract": "The problem of disseminating a data set for machine learning while controlling the disclosure of data source identity is described using a commuting diagram of functions. This formalization is used to present and analyze an optimization problem balancing privacy and data utility requirements. The analysis points to the application of a generalization mechanism for maintaining privacy in view of machine learning needs. We present new proofs of NP-hardness of the problem of minimizing information loss while satisfying a set of privacy requirements, both with and without the addition of a particular uniform coding requirement. As an initial analysis of the approximation properties of the problem, we show that the cell suppression problem with a constant number of attributes can be approximated within a constant. As a side effect, proofs of NP-hardness of the minimum k-union, maximum k-intersection, and parallel versions of these are presented. Bounded versions of these problems are also shown to be approximable within a constant.", "year": 2004, "referenceCount": 35, "citationCount": 39, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2711007", "name": "S. Vinterbo"}]}, {"paperId": "e24d061209b55da8e2120dd5aa6ecaa9cba812c3", "url": "https://www.semanticscholar.org/paper/e24d061209b55da8e2120dd5aa6ecaa9cba812c3", "title": "Discrete sequence prediction and its applications", "abstract": null, "year": 1992, "referenceCount": 30, "citationCount": 50, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "29961301", "name": "P. Laird"}, {"authorId": "2983354", "name": "R. Saul"}]}, {"paperId": "a8d7df993fc0b76c9ba2bce269429209620074ec", "url": "https://www.semanticscholar.org/paper/a8d7df993fc0b76c9ba2bce269429209620074ec", "title": "Soft Margin Multiple Kernel Learning", "abstract": "Multiple kernel learning (MKL) has been proposed for kernel methods by learning the optimal kernel from a set of predefined base kernels. However, the traditional L1MKL method often achieves worse results than the simplest method using the average of base kernels (i.e., average kernel) in some practical applications. In order to improve the effectiveness of MKL, this paper presents a novel soft margin perspective for MKL. Specifically, we introduce an additional slack variable called kernel slack variable to each quadratic constraint of MKL, which corresponds to one support vector machine model using a single base kernel. We first show that L1MKL can be deemed as hard margin MKL, and then we propose a novel soft margin framework for MKL. Three commonly used loss functions, including the hinge loss, the square hinge loss, and the square loss, can be readily incorporated into this framework, leading to the new soft margin MKL objective functions. Many existing MKL methods can be shown as special cases under our soft margin framework. For example, the hinge loss soft margin MKL leads to a new box constraint for kernel combination coefficients. Using different hyper-parameter values for this formulation, we can inherently bridge the method using average kernel, L1MKL, and the hinge loss soft margin MKL. The square hinge loss soft margin MKL unifies the family of elastic net constraint/regularizer based approaches; and the square loss soft margin MKL incorporates L2MKL naturally. Moreover, we also develop efficient algorithms for solving both the hinge loss and square hinge loss soft margin MKL. Comprehensive experimental studies for various MKL algorithms on several benchmark data sets and two real world applications, including video action recognition and event recognition demonstrate that our proposed algorithms can efficiently achieve an effective yet sparse solution for MKL.", "year": 2013, "referenceCount": 61, "citationCount": 121, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2658750", "name": "Xinxing Xu"}, {"authorId": "1807998", "name": "I. Tsang"}, {"authorId": "38188040", "name": "Dong Xu"}]}, {"paperId": "2e079604c7a00c43f06e214280cea18a89dcecef", "url": "https://www.semanticscholar.org/paper/2e079604c7a00c43f06e214280cea18a89dcecef", "title": "Bayesian Optimization and Semiparametric Models with Applications to Assistive Technology", "abstract": "Bayesian Optimization and Semiparametric Models with Applications to Assistive Technology Jasper Snoek Doctor of Philosophy Graduate Department of Computer Science University of Toronto 2013 Advances in machine learning are having a profound impact on disciplines spanning the sciences. Assistive technology and health informatics are fields for which minor improvements achieved through leveraging more advanced machine learning algorithms can translate to major real world impact. However, successful application of machine learning currently requires broad domain knowledge to determine which model is appropriate for a given task, and model specific expertise to configure a model to a problem of interest. A major motivation for this thesis was: How can we make machine learning more accessible to assistive technology and health informatics researchers? Naturally, a complementary goal is to make machine learning more accessible in general. Specifically, in this thesis we explore how to automate the role of a machine learning expert through automatically adapting models and adjusting parameters to a given task of interest. This thesis consists of a number of contributions towards solving this challenging open problem in machine learning and these are empirically validated on four real-world applications. Through an interesting theoretical link between two seemingly disparate latent variable models, we create a hybrid model that allows one to flexibly interpolate over a parametric unsupervised neural network, a classification neural network and a non-parametric Gaussian process. We demonstrate empirically that this non-parametrically guided autoencoder allows one to learn a latent representation that is more useful for a given task of interest.", "year": 2014, "referenceCount": 158, "citationCount": 45, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "144108062", "name": "Jasper Snoek"}]}, {"paperId": "c203603b35936f3b9add4160b979f8c7173c48e4", "url": "https://www.semanticscholar.org/paper/c203603b35936f3b9add4160b979f8c7173c48e4", "title": "A molecular map of mesenchymal tumors", "abstract": null, "year": 2005, "referenceCount": 60, "citationCount": 132, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine"], "authors": [{"authorId": "145097191", "name": "S. Henderson"}, {"authorId": "3333048", "name": "D. Guiliano"}, {"authorId": "4056452", "name": "N. Presneau"}, {"authorId": "48279764", "name": "S. McLean"}, {"authorId": "6705127", "name": "R. Frow"}, {"authorId": "153612171", "name": "S. Vujovic"}, {"authorId": "114915329", "name": "John Anderson"}, {"authorId": "2322405", "name": "N. Sebire"}, {"authorId": "35913895", "name": "J. Whelan"}, {"authorId": "15915839", "name": "Nicholas N Athanasou"}, {"authorId": "145422000", "name": "A. Flanagan"}, {"authorId": "5369203", "name": "C. Boshoff"}]}, {"paperId": "86006acb8650fe9c2a2b056e5271d9b525e09c3c", "url": "https://www.semanticscholar.org/paper/86006acb8650fe9c2a2b056e5271d9b525e09c3c", "title": "Artificial Intelligence's White Guy Problem", "abstract": "According to some prominent voices in the tech world, artificial intelligence presents a looming existential threat to humanity: Warnings by luminaries like Elon Musk and Nick Bostrom about “the singularity” – when machines become smarter than humans – have attracted millions of dollars and spawned a multitude of conferences. But this hand-wringing is a distraction from the very real problems with artificial intelligence today, which may already be exacerbating inequality in the workplace, at home and in our legal and judicial systems. Sexism, racism and other forms of discrimination are being built into the machine-learning algorithms that underlie the technology behind many “intelligent” systems that shape how we are categorized and advertised to.", "year": 2016, "referenceCount": 0, "citationCount": 161, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Sociology"], "authors": [{"authorId": "48024382", "name": "K. Crawford"}]}, {"paperId": "8c00586169ceed105859daaf9114abbc8f3deb22", "url": "https://www.semanticscholar.org/paper/8c00586169ceed105859daaf9114abbc8f3deb22", "title": "GURLS: a least squares library for supervised learning", "abstract": "We present GURLS, a least squares, modular, easy-to-extend software library for efficient supervised learning. GURLS is targeted to machine learning practitioners, as well as non-specialists. It offers a number state-of-the-art training strategies for medium and large-scale learning, and routines for efficient model selection. The library is particularly well suited for multi-output problems (multi-category/multi-label). GURLS is currently available in two independent implementations: Matlab and C++. It takes advantage of the favorable properties of regularized least squares algorithm to exploit advanced tools in linear algebra. Routines to handle computations with very large matrices by means of memory-mapped storage and distributed task execution are available. The package is distributed under the BSD license and is available for download at https://github.com/LCSL/GURLS.", "year": 2013, "referenceCount": 5, "citationCount": 60, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2844530", "name": "A. Tacchetti"}, {"authorId": "1943221", "name": "Pavan Kumar Mallapragada"}, {"authorId": "2066439448", "name": "M. Santoro"}, {"authorId": "1690976", "name": "L. Rosasco"}]}, {"paperId": "3cb054f909511575e3ee69d3da2d3fc9ff8f43f3", "url": "https://www.semanticscholar.org/paper/3cb054f909511575e3ee69d3da2d3fc9ff8f43f3", "title": "Machine learning and feature selection for drug response prediction in precision oncology applications", "abstract": null, "year": 2018, "referenceCount": 74, "citationCount": 106, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "49740220", "name": "Mehreen Ali"}, {"authorId": "1728404", "name": "T. Aittokallio"}]}, {"paperId": "6555977f0d5f993e0bee7c2ec3d1fc819057da15", "url": "https://www.semanticscholar.org/paper/6555977f0d5f993e0bee7c2ec3d1fc819057da15", "title": "Data Management in Machine Learning: Challenges, Techniques, and Systems", "abstract": "Large-scale data analytics using statistical machine learning (ML), popularly called advanced analytics, underpins many modern data-driven applications. The data management community has been working for over a decade on tackling data management-related challenges that arise in ML workloads, and has built several systems for advanced analytics. This tutorial provides a comprehensive review of such systems and analyzes key data management challenges and techniques. We focus on three complementary lines of work: (1) integrating ML algorithms and languages with existing data systems such as RDBMSs, (2) adapting data management-inspired techniques such as query optimization, partitioning, and compression to new systems that target ML workloads, and (3) combining data management and ML ideas to build systems that improve ML lifecycle-related tasks. Finally, we identify key open data management challenges for future research in this important area.", "year": 2017, "referenceCount": 112, "citationCount": 91, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2119303314", "name": "Arun Kumar"}, {"authorId": "40237241", "name": "Matthias Boehm"}, {"authorId": "9125547", "name": "Jun Yang"}]}, {"paperId": "d3a3bf2e01b216d20a6e5a1f2bb7d050d687e069", "url": "https://www.semanticscholar.org/paper/d3a3bf2e01b216d20a6e5a1f2bb7d050d687e069", "title": "Twin support vector machines based on fruit fly optimization algorithm", "abstract": null, "year": 2016, "referenceCount": 30, "citationCount": 50, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145613107", "name": "Shifei Ding"}, {"authorId": "3376545", "name": "Xiekai Zhang"}, {"authorId": "3230060", "name": "Junzhao Yu"}]}, {"paperId": "89857aa151a6e196fe9c2a7d011cff74547a3eee", "url": "https://www.semanticscholar.org/paper/89857aa151a6e196fe9c2a7d011cff74547a3eee", "title": "Automatic Vandalism Detection in Wikipedia : Towards a Machine Learning Approach", "abstract": "Since the end of 2006 several autonomous bots are, or have been, running on Wikipedia to keep the encyclopedia free from vandalism and other damaging edits. These expert systems, however, are far from optimal and should be improved to relieve the human editors from the burden of manually reverting such edits. We investigate the possibility of using machine learning techniques to build an autonomous system capable to distinguish vandalism from legitimate edits. We highlight the results of a small but important step in this direction by applying commonly known machine learning algorithms using a straightforward feature representation. Despite the promising results, this study reveals that elementary features, which are also used by the current approaches to fight vandalism, are not sufficient to build such a system. They will need to be accompanied by additional information which, among other things, incorporates the semantics of a", "year": 2008, "referenceCount": 17, "citationCount": 86, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "1390119421", "name": "Koen Smets"}, {"authorId": "1722864", "name": "Bart Goethals"}, {"authorId": "3028579", "name": "B. Verdonk"}]}, {"paperId": "ced23639a3a4c9e04418fe03f0506778476402b5", "url": "https://www.semanticscholar.org/paper/ced23639a3a4c9e04418fe03f0506778476402b5", "title": "Bayesian Machine Learning in Metamaterial Design: Fragile Becomes Supercompressible", "abstract": "Designing future‐proof materials goes beyond a quest for the best. The next generation of materials needs to be adaptive, multipurpose, and tunable. This is not possible by following the traditional experimentally guided trial‐and‐error process, as this limits the search for untapped regions of the solution space. Here, a computational data‐driven approach is followed for exploring a new metamaterial concept and adapting it to different target properties, choice of base materials, length scales, and manufacturing processes. Guided by Bayesian machine learning, two designs are fabricated at different length scales that transform brittle polymers into lightweight, recoverable, and supercompressible metamaterials. The macroscale design is tuned for maximum compressibility, achieving strains beyond 94% and recoverable strengths around 0.1 kPa, while the microscale design reaches recoverable strengths beyond 100 kPa and strains around 80%. The data‐driven code is available to facilitate future design and analysis of metamaterials and structures (https://github.com/mabessa/F3DAS).", "year": 2019, "referenceCount": 37, "citationCount": 89, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Materials Science"], "authors": [{"authorId": "73014519", "name": "M. Bessa"}, {"authorId": "93431580", "name": "P. Głowacki"}, {"authorId": "147491476", "name": "Michael Houlder"}]}, {"paperId": "1c0058b12db2e8001cf0f7a5a0046e910fe289f4", "url": "https://www.semanticscholar.org/paper/1c0058b12db2e8001cf0f7a5a0046e910fe289f4", "title": "Using Natural Language Processing to Classify Suicide Notes", "abstract": "We hypothesize that machine-learning algorithms (MLA) could classify completer and ideator suicide notes as well a mental health professionals (MHP). Five MHPs classified 66 notes as either ideator or completer; machine learning algorithms (MLA) were used for the same task. Results: MHPs were accurate 71% of the time; the SMO algorithm was accurate 79% of the time. This is an important first step in developing an evidence based suicide predictor for emergency department use. Language: en", "year": 2008, "referenceCount": 5, "citationCount": 70, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine", "Psychology"], "authors": [{"authorId": "1787579", "name": "J. Pestian"}, {"authorId": "1784716", "name": "P. Matykiewicz"}, {"authorId": "1398054313", "name": "J. Grupp-Phelan"}, {"authorId": "4531905", "name": "S. Lavanier"}, {"authorId": "2070022325", "name": "Jennifer Combs"}, {"authorId": "4622760", "name": "R. Kowatch"}]}, {"paperId": "fd4defba71c686946351f5e7a090c7aa8136d32f", "url": "https://www.semanticscholar.org/paper/fd4defba71c686946351f5e7a090c7aa8136d32f", "title": "Rank Pooling for Action Recognition", "abstract": "We propose a function-based temporal pooling method that captures the latent structure of the video sequence data - e.g., how frame-level features evolve over time in a video. We show how the parameters of a function that has been fit to the video data can serve as a robust new video representation. As a specific example, we learn a pooling function via ranking machines. By learning to rank the frame-level features of a video in chronological order, we obtain a new representation that captures the video-wide temporal dynamics of a video, suitable for action recognition. Other than ranking functions, we explore different parametric models that could also explain the temporal changes in videos. The proposed functional pooling methods, and rank pooling in particular, is easy to interpret and implement, fast to compute and effective in recognizing a wide variety of actions. We evaluate our method on various benchmarks for generic action, fine-grained action and gesture recognition. Results show that rank pooling brings an absolute improvement of 7-10 average pooling baseline. At the same time, rank pooling is compatible with and complementary to several appearance and local motion based methods and features, such as improved trajectories and deep learning features.", "year": 2015, "referenceCount": 76, "citationCount": 265, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1688071", "name": "Basura Fernando"}, {"authorId": "2304222", "name": "E. Gavves"}, {"authorId": "2111981", "name": "José Oramas"}, {"authorId": "3060081", "name": "Amir Ghodrati"}, {"authorId": "1704728", "name": "T. Tuytelaars"}]}, {"paperId": "40691dc6f882c93f4676b2f47cc9f41ade848ddb", "url": "https://www.semanticscholar.org/paper/40691dc6f882c93f4676b2f47cc9f41ade848ddb", "title": "Using machine learning and a data-driven approach to identify the small fatigue crack driving force in polycrystalline materials", "abstract": null, "year": 2018, "referenceCount": 69, "citationCount": 97, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "103576856", "name": "A. Rovinelli"}, {"authorId": "10406251", "name": "M. Sangid"}, {"authorId": "34719700", "name": "H. Proudhon"}, {"authorId": "93446569", "name": "W. Ludwig"}]}, {"paperId": "c18663fea10c8a303d045fd2c1f33cacf9b73ca3", "url": "https://www.semanticscholar.org/paper/c18663fea10c8a303d045fd2c1f33cacf9b73ca3", "title": "GPipe: Efficient Training of Giant Neural Networks using Pipeline Parallelism", "abstract": "Scaling up deep neural network capacity has been known as an effective approach to improving model quality for several different machine learning tasks. In many cases, increasing model capacity beyond the memory limit of a single accelerator has required developing special algorithms or infrastructure. These solutions are often architecture-specific and do not transfer to other tasks. To address the need for efficient and task-independent model parallelism, we introduce GPipe, a pipeline parallelism library that allows scaling any network that can be expressed as a sequence of layers. By pipelining different sub-sequences of layers on separate accelerators, GPipe provides the flexibility of scaling a variety of different networks to gigantic sizes efficiently. Moreover, GPipe utilizes a novel batch-splitting pipelining algorithm, resulting in almost linear speedup when a model is partitioned across multiple accelerators. We demonstrate the advantages of GPipe by training large-scale neural networks on two different tasks with distinct network architectures: (i) Image Classification: We train a 557-million-parameter AmoebaNet model and attain a top-1 accuracy of 84.4% on ImageNet-2012, (ii) Multilingual Neural Machine Translation: We train a single 6-billion-parameter, 128-layer Transformer model on a corpus spanning over 100 languages and achieve better quality than all bilingual models.", "year": 2018, "referenceCount": 77, "citationCount": 770, "influentialCitationCount": 111, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2145438541", "name": "Yanping Huang"}, {"authorId": "50607661", "name": "Yonglong Cheng"}, {"authorId": "7167328", "name": "Dehao Chen"}, {"authorId": "34946720", "name": "HyoukJoong Lee"}, {"authorId": "2020608", "name": "Jiquan Ngiam"}, {"authorId": "2827616", "name": "Quoc V. Le"}, {"authorId": "2545358", "name": "Z. Chen"}]}, {"paperId": "c5a1ecc327386bf710cfdbf23c17e723c9fbac88", "url": "https://www.semanticscholar.org/paper/c5a1ecc327386bf710cfdbf23c17e723c9fbac88", "title": "Machine Learning of User Profiles: Representational Issues", "abstract": "As more information becomes available electronically, tools for finding information of interest to users becomes increasingly important. The goal of the research described here is to build a system for generating comprehensible user profiles that accurately capture user interest with minimum user interaction. The research described here focuses on the importance of a suitable generalization hierarchy and representation for learning profiles which are predictively accurate and comprehensible. In our experiments we evaluated both traditional features based on weighted term vectors as well as subject features corresponding to categories which could be drawn from a thesaurus. Our experiments, conducted in the context of a content-based profiling system for on-line newspapers on the World Wide Web (the IDD News Browser), demonstrate the importance of a generalization hierarchy and the promise of combining natural language processing techniques with machine learning (ML) to address an information retrieval (IR) problem.", "year": 1996, "referenceCount": 43, "citationCount": 55, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2740861", "name": "E. Bloedorn"}, {"authorId": "1729172", "name": "I. Mani"}, {"authorId": "40656733", "name": "T. MacMillan"}]}, {"paperId": "1ea4b0bc24e1b4786bea6e6773106cc3c2695b59", "url": "https://www.semanticscholar.org/paper/1ea4b0bc24e1b4786bea6e6773106cc3c2695b59", "title": "An Empirical Comparison of Supervised Machine Learning Techniques in Bioinformatics", "abstract": "Research in bioinformatics is driven by the experimental data. Current biological databases are populated by vast amounts of experimental data. Machine learning has been widely applied to bioinformatics and has gained a lot of success in this research area. At present, with various learning algorithms available in the literature, researchers are facing difficulties in choosing the best method that can apply to their data. We performed an empirical study on 7 individual learning systems and 9 different combined methods on 4 different biological data sets, and provide some suggested issues to be considered when answering the following questions: (i) How does one choose which algorithm is best suitable for their data set? (ii) Are combined methods better than a single approach? (iii) How does one compare the effectiveness of a particular algorithm to the others?", "year": 2003, "referenceCount": 12, "citationCount": 74, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144665015", "name": "A. Tan"}, {"authorId": "2502593", "name": "D. Gilbert"}]}, {"paperId": "1d52299fef8da2fdb26ffa2b9ee9fa7a8ed918e5", "url": "https://www.semanticscholar.org/paper/1d52299fef8da2fdb26ffa2b9ee9fa7a8ed918e5", "title": "Universal learning technology : Support vector machines", "abstract": "This paper describes the Support Vector Machine (SVM) technology, its relation to the main ideas of Statistical Learning Theory, and shows a universal nature of SVMs. It also contains examples that show a high level of generalization ability of SVMs.", "year": 2005, "referenceCount": 5, "citationCount": 63, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "50560492", "name": "V. Vapnik"}]}, {"paperId": "f77f30b884cd9dcb08032c66470293e33090c0b0", "url": "https://www.semanticscholar.org/paper/f77f30b884cd9dcb08032c66470293e33090c0b0", "title": "Code Smell Detection: Towards a Machine Learning-Based Approach", "abstract": "Several code smells detection tools have been developed providing different results, because smells can be subjectively interpreted and hence detected in different ways. Usually the detection techniques are based on the computation of different kinds of metrics, and other aspects related to the domain of the system under analysis, its size and other design features are not taken into account. In this paper we propose an approach we are studying based on machine learning techniques. We outline some common problems faced for smells detection and we describe the different steps of our approach and the algorithms we use for the classification.", "year": 2013, "referenceCount": 19, "citationCount": 88, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1695555", "name": "F. Fontana"}, {"authorId": "145844143", "name": "Marco Zanoni"}, {"authorId": "2052737310", "name": "A. Marino"}, {"authorId": "144811716", "name": "M. Mäntylä"}]}, {"paperId": "90ffae8e6abd67a8814ea9a56c1ce93440a6a0d7", "url": "https://www.semanticscholar.org/paper/90ffae8e6abd67a8814ea9a56c1ce93440a6a0d7", "title": "Clinical Characterization and Prediction of Clinical Severity of SARS-CoV-2 Infection Among US Adults Using Data From the US National COVID Cohort Collaborative", "abstract": "Key Points Question In a US data resource large enough to adjust for multiple confounders, what risk factors are associated with COVID-19 severity and severity trajectory over time, and can machine learning models predict clinical severity? Findings In this cohort study of 174 568 adults with SARS-CoV-2, 32 472 (18.6%) were hospitalized and 6565 (20.2%) were severely ill, and first-day machine learning models accurately predicted clinical severity. Mortality was 11.6% overall and decreased from 16.4% in March to April 2020 to 8.6% in September to October 2020. Meaning These findings suggest that machine learning models can be used to predict COVID-19 clinical severity with the use of an available large-scale US COVID-19 data resource.", "year": 2021, "referenceCount": 41, "citationCount": 72, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "32082228", "name": "T. Bennett"}, {"authorId": "49012941", "name": "R. Moffitt"}, {"authorId": "2844991", "name": "J. Hajagos"}, {"authorId": "2052499186", "name": "B. Amor"}, {"authorId": "2119073205", "name": "A. Anand"}, {"authorId": "2120142289", "name": "Mark Bissell"}, {"authorId": "1804322651", "name": "K. Bradwell"}, {"authorId": "117727522", "name": "C. Bremer"}, {"authorId": "2113890150", "name": "J. B. Byrd"}, {"authorId": "112983974", "name": "A. Denham"}, {"authorId": "4994798", "name": "P. Dewitt"}, {"authorId": "39783098", "name": "D. Gabriel"}, {"authorId": "5696544", "name": "B. Garibaldi"}, {"authorId": "33755835", "name": "A. Girvin"}, {"authorId": "1684985", "name": "J. Guinney"}, {"authorId": "35772466", "name": "E. Hill"}, {"authorId": "2052502622", "name": "Stephanie S. Hong"}, {"authorId": "2119098665", "name": "H. Jimenez"}, {"authorId": "1711213", "name": "Ramakanth Kavuluru"}, {"authorId": "1782557130", "name": "K. Kostka"}, {"authorId": "21059200", "name": "H. Lehmann"}, {"authorId": "2050589643", "name": "E. Levitt"}, {"authorId": "6475899", "name": "S. Mallipattu"}, {"authorId": "2052499202", "name": "A. Manna"}, {"authorId": "2911541", "name": "J. McMurry"}, {"authorId": "145010862", "name": "M. Morris"}, {"authorId": "3048081", "name": "J. Muschelli"}, {"authorId": "146143459", "name": "Andrew J. Neumann"}, {"authorId": "1741083", "name": "M. Palchuk"}, {"authorId": "32733281", "name": "E. Pfaff"}, {"authorId": "2119092926", "name": "Zhenglong Qian"}, {"authorId": "66851030", "name": "N. Qureshi"}, {"authorId": "41022278", "name": "S. Russell"}, {"authorId": "3707212", "name": "H. Spratt"}, {"authorId": "3239548", "name": "A. Walden"}, {"authorId": "2110114729", "name": "Andrew E. Williams"}, {"authorId": "84275945", "name": "J. Wooldridge"}, {"authorId": "2142557556", "name": "Y. J. Yoo"}, {"authorId": "1652307031", "name": "X. Zhang"}, {"authorId": "123443838", "name": "R. Zhu"}, {"authorId": "4066869", "name": "C. Austin"}, {"authorId": "1735710", "name": "J. Saltz"}, {"authorId": "1941289", "name": "K. Gersing"}, {"authorId": "1976792", "name": "M. Haendel"}, {"authorId": "1792682", "name": "C. Chute"}]}, {"paperId": "f37d5d1a16d371ba159ac07e5c1b37d35188977f", "url": "https://www.semanticscholar.org/paper/f37d5d1a16d371ba159ac07e5c1b37d35188977f", "title": "Programming by demonstration: a machine learning approach", "abstract": "Programming by Demonstration: a Machine Learning Approach", "year": 2001, "referenceCount": 89, "citationCount": 49, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143907654", "name": "T. Lau"}, {"authorId": "1780531", "name": "Daniel S. Weld"}, {"authorId": "1740213", "name": "Pedro M. Domingos"}]}, {"paperId": "47a148e508c43db0c1faeb7513f9ae07eee3f4d2", "url": "https://www.semanticscholar.org/paper/47a148e508c43db0c1faeb7513f9ae07eee3f4d2", "title": "Machine Learning and Psychological Research: The Unexplored Effect of Measurement", "abstract": "Machine learning (i.e., data mining, artificial intelligence, big data) has been increasingly applied in psychological science. Although some areas of research have benefited tremendously from a new set of statistical tools, most often in the use of biological or genetic variables, the hype has not been substantiated in more traditional areas of research. We argue that this phenomenon results from measurement errors that prevent machine-learning algorithms from accurately modeling nonlinear relationships, if indeed they exist. This shortcoming is showcased across a set of simulated examples, demonstrating that model selection between a machine-learning algorithm and regression depends on the measurement quality, regardless of sample size. We conclude with a set of recommendations and a discussion of ways to better integrate machine learning with statistics as traditionally practiced in psychological science.", "year": 2020, "referenceCount": 42, "citationCount": 43, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "8490482", "name": "R. Jacobucci"}, {"authorId": "5163661", "name": "K. Grimm"}]}, {"paperId": "d03ca175e2b2745126e792fdc31dfadae4c63afa", "url": "https://www.semanticscholar.org/paper/d03ca175e2b2745126e792fdc31dfadae4c63afa", "title": "A Simple Unified Framework for Detecting Out-of-Distribution Samples and Adversarial Attacks", "abstract": "Detecting test samples drawn sufficiently far away from the training distribution statistically or adversarially is a fundamental requirement for deploying a good classifier in many real-world machine learning applications. However, deep neural networks with the softmax classifier are known to produce highly overconfident posterior distributions even for such abnormal samples. In this paper, we propose a simple yet effective method for detecting any abnormal samples, which is applicable to any pre-trained softmax neural classifier. We obtain the class conditional Gaussian distributions with respect to (low- and upper-level) features of the deep models under Gaussian discriminant analysis, which result in a confidence score based on the Mahalanobis distance. While most prior methods have been evaluated for detecting either out-of-distribution or adversarial samples, but not both, the proposed method achieves the state-of-the-art performances for both cases in our experiments. Moreover, we found that our proposed method is more robust in harsh cases, e.g., when the training dataset has noisy labels or small number of samples. Finally, we show that the proposed method enjoys broader usage by applying it to class-incremental learning: whenever out-of-distribution samples are detected, our classification rule can incorporate new classes well without further training deep models.", "year": 2018, "referenceCount": 32, "citationCount": 924, "influentialCitationCount": 252, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3436470", "name": "Kimin Lee"}, {"authorId": "2208511", "name": "Kibok Lee"}, {"authorId": "1697141", "name": "Honglak Lee"}, {"authorId": "143720148", "name": "Jinwoo Shin"}]}, {"paperId": "8fd363f5a50e23f21043d9ea31d5c19a84e8bcdb", "url": "https://www.semanticscholar.org/paper/8fd363f5a50e23f21043d9ea31d5c19a84e8bcdb", "title": "A Note on Metric Properties for Some Divergence Measures: The Gaussian Case", "abstract": "Multivariate Gaussian densities are pervasive in pattern recognition and machine learning. A central operation that appears in most of these areas is to measure the dierence between two multivariate Gaussians. Unfortunately, traditional measures based on the Kullback{ Leibler (KL) divergence and the Bhattacharyya distance do not satisfy all metric axioms necessary for many algorithms. In this paper we propose a modication for the KL divergence and the Bhattacharyya distance, for multivariate Gaussian densities, that transforms the two measures into distance metrics. Next, we show how these metric axioms impact the unfolding process of manifold learning algorithms. Finally, we illustrate the ecacy of the proposed metrics on two dierent manifold learning algorithms when used for motion clustering in video data. Our results show that, in this particular application, the new proposed metrics lead to boosts in performance (at least 7%) when compared to other divergence measures.", "year": 2012, "referenceCount": 37, "citationCount": 59, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1403907488", "name": "Karim Abou-Moustafa"}, {"authorId": "1701344", "name": "F. Ferrie"}]}, {"paperId": "5c45a5d05ac564adb67811eeb9d41d6460c70135", "url": "https://www.semanticscholar.org/paper/5c45a5d05ac564adb67811eeb9d41d6460c70135", "title": "Development and Validation of a Deep Learning Algorithm for Detection of Diabetic Retinopathy in Retinal Fundus Photographs.", "abstract": "Importance\nDeep learning is a family of computational methods that allow an algorithm to program itself by learning from a large set of examples that demonstrate the desired behavior, removing the need to specify rules explicitly. Application of these methods to medical imaging requires further assessment and validation.\n\n\nObjective\nTo apply deep learning to create an algorithm for automated detection of diabetic retinopathy and diabetic macular edema in retinal fundus photographs.\n\n\nDesign and Setting\nA specific type of neural network optimized for image classification called a deep convolutional neural network was trained using a retrospective development data set of 128 175 retinal images, which were graded 3 to 7 times for diabetic retinopathy, diabetic macular edema, and image gradability by a panel of 54 US licensed ophthalmologists and ophthalmology senior residents between May and December 2015. The resultant algorithm was validated in January and February 2016 using 2 separate data sets, both graded by at least 7 US board-certified ophthalmologists with high intragrader consistency.\n\n\nExposure\nDeep learning-trained algorithm.\n\n\nMain Outcomes and Measures\nThe sensitivity and specificity of the algorithm for detecting referable diabetic retinopathy (RDR), defined as moderate and worse diabetic retinopathy, referable diabetic macular edema, or both, were generated based on the reference standard of the majority decision of the ophthalmologist panel. The algorithm was evaluated at 2 operating points selected from the development set, one selected for high specificity and another for high sensitivity.\n\n\nResults\nThe EyePACS-1 data set consisted of 9963 images from 4997 patients (mean age, 54.4 years; 62.2% women; prevalence of RDR, 683/8878 fully gradable images [7.8%]); the Messidor-2 data set had 1748 images from 874 patients (mean age, 57.6 years; 42.6% women; prevalence of RDR, 254/1745 fully gradable images [14.6%]). For detecting RDR, the algorithm had an area under the receiver operating curve of 0.991 (95% CI, 0.988-0.993) for EyePACS-1 and 0.990 (95% CI, 0.986-0.995) for Messidor-2. Using the first operating cut point with high specificity, for EyePACS-1, the sensitivity was 90.3% (95% CI, 87.5%-92.7%) and the specificity was 98.1% (95% CI, 97.8%-98.5%). For Messidor-2, the sensitivity was 87.0% (95% CI, 81.1%-91.0%) and the specificity was 98.5% (95% CI, 97.7%-99.1%). Using a second operating point with high sensitivity in the development set, for EyePACS-1 the sensitivity was 97.5% and specificity was 93.4% and for Messidor-2 the sensitivity was 96.1% and specificity was 93.9%.\n\n\nConclusions and Relevance\nIn this evaluation of retinal fundus photographs from adults with diabetes, an algorithm based on deep machine learning had high sensitivity and specificity for detecting referable diabetic retinopathy. Further research is necessary to determine the feasibility of applying this algorithm in the clinical setting and to determine whether use of the algorithm could lead to improved care and outcomes compared with current ophthalmologic assessment.", "year": 2016, "referenceCount": 28, "citationCount": 4144, "influentialCitationCount": 115, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "3236386", "name": "Varun Gulshan"}, {"authorId": "49506408", "name": "L. Peng"}, {"authorId": "2229081", "name": "Marc Coram"}, {"authorId": "2924473", "name": "Martin C. Stumpe"}, {"authorId": "97874426", "name": "Derek J. Wu"}, {"authorId": "50484974", "name": "Arunachalam Narayanaswamy"}, {"authorId": "1811430", "name": "Subhashini Venugopalan"}, {"authorId": "10777941", "name": "Kasumi Widner"}, {"authorId": "10688956", "name": "T. Madams"}, {"authorId": "50162175", "name": "Jorge A Cuadros"}, {"authorId": "3423678", "name": "R. Kim"}, {"authorId": "2035210", "name": "R. Raman"}, {"authorId": "2057376568", "name": "Philip Nelson"}, {"authorId": "5791678", "name": "J. Mega"}, {"authorId": "47191829", "name": "D. Webster"}]}, {"paperId": "84d50d907391e4450b7d126caf8b9c2a07e1df4f", "url": "https://www.semanticscholar.org/paper/84d50d907391e4450b7d126caf8b9c2a07e1df4f", "title": "Applying machine learning techniques for ADME-Tox prediction: a review", "abstract": "Introduction: Pharmacokinetics involves the study of absorption, distribution, metabolism, excretion and toxicity of xenobiotics (ADME-Tox). In this sense, the ADME-Tox profile of a bioactive compound can impact its efficacy and safety. Moreover, efficacy and safety were considered some of the major causes of clinical failures in the development of new chemical entities. In this context, machine learning (ML) techniques have been often used in ADME-Tox studies due to the existence of compounds with known pharmacokinetic properties available for generating predictive models. Areas covered: This review examines the growth in the use of some ML techniques in ADME-Tox studies, in particular supervised and unsupervised techniques. Also, some critical points (e.g., size of the data set and type of output variable) must be considered during the generation of models that relate ADME-Tox properties and biological activity. Expert opinion: ML techniques have been successfully employed in pharmacokinetic studies, helping the complex process of designing new drug candidates from the use of reliable ML models. An application of this procedure would be the prediction of ADME-Tox properties from studies of quantitative structure–activity relationships or the discovery of new compounds from a virtual screening using filters based on results obtained from ML techniques.", "year": 2015, "referenceCount": 92, "citationCount": 92, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "6019396", "name": "V. Maltarollo"}, {"authorId": "14182494", "name": "J. C. Gertrudes"}, {"authorId": "34797219", "name": "P. R. Oliveira"}, {"authorId": "2082452", "name": "K. M. Honorio"}]}, {"paperId": "b05af62ecc1c5e176a950551ba324088a455c797", "url": "https://www.semanticscholar.org/paper/b05af62ecc1c5e176a950551ba324088a455c797", "title": "Research on Ensemble Learning", "abstract": "Ensemble learning is a powerful machine learning paradigm which has exhibited apparent advantages in many applications. An ensemble in the context of machine learning can be broadly defined as a machine learning system that is constructed with a set of individual models working in parallel and whose outputs are combined with a decision fusion strategy to produce a single answer for a given problem. In this paper we introduce core of ensemble learning and key techniques to improve ensemble learning. Based on this we describe the procedure of two typical algorithms, i.e., adaboost and bagging, in detail. Finally we testify the superiority in classification accuracy with some experiments.", "year": 2009, "referenceCount": 9, "citationCount": 45, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3265414", "name": "Faliang Huang"}, {"authorId": "2876642", "name": "Guoqing Xie"}, {"authorId": "9706112", "name": "Ruliang Xiao"}]}, {"paperId": "e020164c8ebc962bad03b64d7e064b95c59315f9", "url": "https://www.semanticscholar.org/paper/e020164c8ebc962bad03b64d7e064b95c59315f9", "title": "Detecting Student Misuse of Intelligent Tutoring Systems", "abstract": null, "year": 2004, "referenceCount": 18, "citationCount": 372, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144849745", "name": "R. Baker"}, {"authorId": "34186174", "name": "A. Corbett"}, {"authorId": "1718810", "name": "K. Koedinger"}]}, {"paperId": "fb78e90eedaff0c369a6d582f66394ccb4357dd5", "url": "https://www.semanticscholar.org/paper/fb78e90eedaff0c369a6d582f66394ccb4357dd5", "title": "Machine Learning on the Basis of Formal Concept Analysis", "abstract": null, "year": 2001, "referenceCount": 66, "citationCount": 63, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1765540", "name": "S. Kuznetsov"}]}, {"paperId": "cb2952189fbd6c9f003ae23bec7d7a674b598d1a", "url": "https://www.semanticscholar.org/paper/cb2952189fbd6c9f003ae23bec7d7a674b598d1a", "title": "Semi-supervised machine learning approach for DDoS detection", "abstract": null, "year": 2018, "referenceCount": 39, "citationCount": 94, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35705551", "name": "Mohamed Idhammad"}, {"authorId": "2505117", "name": "K. Afdel"}, {"authorId": "35511409", "name": "Mustapha Belouch"}]}, {"paperId": "ae8c317961f2b72266ab343c78cbd1100f6173f6", "url": "https://www.semanticscholar.org/paper/ae8c317961f2b72266ab343c78cbd1100f6173f6", "title": "White-box vs Black-box: Bayes Optimal Strategies for Membership Inference", "abstract": "Membership inference determines, given a sample and trained parameters of a machine learning model, whether the sample was part of the training set. In this paper, we derive the optimal strategy for membership inference with a few assumptions on the distribution of the parameters. We show that optimal attacks only depend on the loss function, and thus black-box attacks are as good as white-box attacks. As the optimal strategy is not tractable, we provide approximations of it leading to several inference methods, and show that existing membership inference methods are coarser approximations of this optimal strategy. Our membership attacks outperform the state of the art in various settings, ranging from a simple logistic regression to more complex architectures and datasets, such as ResNet-101 and Imagenet.", "year": 2019, "referenceCount": 31, "citationCount": 152, "influentialCitationCount": 32, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3469062", "name": "Alexandre Sablayrolles"}, {"authorId": "3271933", "name": "Matthijs Douze"}, {"authorId": "2462253", "name": "C. Schmid"}, {"authorId": "1734570", "name": "Y. Ollivier"}, {"authorId": "1681054", "name": "H. Jégou"}]}, {"paperId": "e60dd237328bc92941e0559ab358e6186cdd41de", "url": "https://www.semanticscholar.org/paper/e60dd237328bc92941e0559ab358e6186cdd41de", "title": "On the Convergence of A Class of Adam-Type Algorithms for Non-Convex Optimization", "abstract": "This paper studies a class of adaptive gradient based momentum algorithms that update the search directions and learning rates simultaneously using past gradients. This class, which we refer to as the \"Adam-type\", includes the popular algorithms such as the Adam, AMSGrad and AdaGrad. Despite their popularity in training deep neural networks, the convergence of these algorithms for solving nonconvex problems remains an open question. This paper provides a set of mild sufficient conditions that guarantee the convergence for the Adam-type methods. We prove that under our derived conditions, these methods can achieve the convergence rate of order $O(\\log{T}/\\sqrt{T})$ for nonconvex stochastic optimization. We show the conditions are essential in the sense that violating them may make the algorithm diverge. Moreover, we propose and analyze a class of (deterministic) incremental adaptive gradient algorithms, which has the same $O(\\log{T}/\\sqrt{T})$ convergence rate. Our study could also be extended to a broader class of adaptive gradient methods in machine learning and optimization.", "year": 2018, "referenceCount": 35, "citationCount": 219, "influentialCitationCount": 54, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2347508", "name": "Xiangyi Chen"}, {"authorId": "143743061", "name": "Sijia Liu"}, {"authorId": "39447572", "name": "Ruoyu Sun"}, {"authorId": "1793717", "name": "Mingyi Hong"}]}, {"paperId": "491bdbc276f4fdf57c4d511cd09109260a063967", "url": "https://www.semanticscholar.org/paper/491bdbc276f4fdf57c4d511cd09109260a063967", "title": "Data mining: manufacturing and service applications", "abstract": "In this paper basic concepts of machine learning and data mining are introduced. Machine learning algorithms extract knowledge from diverse data bases that can be used to build decision-making systems. For example, based on the operational engineering data, equipment faults can be detected, the number of items to be ordered can be predicted, optimal control parameters can be determined. A framework for organizing and applying knowledge for decision-making in manufacturing and service applications is presented. The framework uses decision-making constructs such decision tables, decision maps, and atlases. It offers a new data-driven paradigm of importance to modern manufacturing and service organisations. Examples of data mining applications in industrial, medical, and pharmaceutical domains are presented. It is envisioned that the data-driven framework presented in the paper will enhance these applications.", "year": 2006, "referenceCount": 56, "citationCount": 135, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "2063959413", "name": "A. Kusiak"}]}, {"paperId": "a724bb040771307571f3ae1233a115cd62bb52be", "url": "https://www.semanticscholar.org/paper/a724bb040771307571f3ae1233a115cd62bb52be", "title": "Constructing Boosting Algorithms from SVMs: An Application to One-Class Classification", "abstract": "We show via an equivalence of mathematical programs that a support vector (SV) algorithm can be translated into an equivalent boosting-like algorithm and vice versa. We exemplify this translation procedure for a new algorithm: one-class leveraging, starting from the one-class support vector machine (1-SVM). This is a first step toward unsupervised learning in a boosting framework. Building on so-called barrier methods known from the theory of constrained optimization, it returns a function, written as a convex combination of base hypotheses, that characterizes whether a given test point is likely to have been generated from the distribution underlying the training data. Simulations on one-class classification problems demonstrate the usefulness of our approach.", "year": 2002, "referenceCount": 77, "citationCount": 252, "influentialCitationCount": 19, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2414086", "name": "G. Rätsch"}, {"authorId": "2459012", "name": "S. Mika"}, {"authorId": "1707625", "name": "B. Schölkopf"}, {"authorId": "145034054", "name": "K. Müller"}]}, {"paperId": "3bf0dbbbe8a9a56264bf440b44048f52662b8b15", "url": "https://www.semanticscholar.org/paper/3bf0dbbbe8a9a56264bf440b44048f52662b8b15", "title": "Improving the Caenorhabditis elegans Genome Annotation Using Machine Learning", "abstract": "For modern biology, precise genome annotations are of prime importance, as they allow the accurate definition of genic regions. We employ state-of-the-art machine learning methods to assay and improve the accuracy of the genome annotation of the nematode Caenorhabditis elegans. The proposed machine learning system is trained to recognize exons and introns on the unspliced mRNA, utilizing recent advances in support vector machines and label sequence learning. In 87% (coding and untranslated regions) and 95% (coding regions only) of all genes tested in several out-of-sample evaluations, our method correctly identified all exons and introns. Notably, only 37% and 50%, respectively, of the presently unconfirmed genes in the C. elegans genome annotation agree with our predictions, thus we hypothesize that a sizable fraction of those genes are not correctly annotated. A retrospective evaluation of the Wormbase WS120 annotation [1] of C. elegans reveals that splice form predictions on unconfirmed genes in WS120 are inaccurate in about 18% of the considered cases, while our predictions deviate from the truth only in 10%–13%. We experimentally analyzed 20 controversial genes on which our system and the annotation disagree, confirming the superiority of our predictions. While our method correctly predicted 75% of those cases, the standard annotation was never completely correct. The accuracy of our system is further corroborated by a comparison with two other recently proposed systems that can be used for splice form prediction: SNAP and ExonHunter. We conclude that the genome annotation of C. elegans and other organisms can be greatly enhanced using modern machine learning technology.", "year": 2006, "referenceCount": 46, "citationCount": 84, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "2414086", "name": "G. Rätsch"}, {"authorId": "3029782", "name": "S. Sonnenburg"}, {"authorId": "2084256", "name": "J. Srinivasan"}, {"authorId": "39635388", "name": "H. Witte"}, {"authorId": "145034054", "name": "K. Müller"}, {"authorId": "1838730", "name": "R. Sommer"}, {"authorId": "1707625", "name": "B. Schölkopf"}]}, {"paperId": "26c7faa28ab1622b32826b1ece2ac8585be6338d", "url": "https://www.semanticscholar.org/paper/26c7faa28ab1622b32826b1ece2ac8585be6338d", "title": "Sentiment Analysis on Product Reviews Using Machine Learning Techniques", "abstract": null, "year": 2018, "referenceCount": 13, "citationCount": 71, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "51294299", "name": "Rajkumar S. Jagdale"}, {"authorId": "51286342", "name": "Vishal S. Shirsat"}, {"authorId": "35255645", "name": "S. Deshmukh"}]}, {"paperId": "4417dfcfc722b8b31278a0ebcc1595963dab5a1c", "url": "https://www.semanticscholar.org/paper/4417dfcfc722b8b31278a0ebcc1595963dab5a1c", "title": "Malware Detection by Eating a Whole EXE", "abstract": "In this work we introduce malware detection from raw byte sequences as a fruitful research area to the larger machine learning community. Building a neural network for such a problem presents a number of interesting challenges that have not occurred in tasks such as image processing or NLP. In particular, we note that detection from raw bytes presents a sequence problem with over two million time steps and a problem where batch normalization appear to hinder the learning process. We present our initial work in building a solution to tackle this problem, which has linear complexity dependence on the sequence length, and allows for interpretable sub-regions of the binary to be identified. In doing so we will discuss the many challenges in building a neural network to process data at this scale, and the methods we used to work around them.", "year": 2017, "referenceCount": 62, "citationCount": 324, "influentialCitationCount": 69, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "34885007", "name": "Edward Raff"}, {"authorId": "2055570627", "name": "Jon Barker"}, {"authorId": "40214038", "name": "J. Sylvester"}, {"authorId": "144286150", "name": "Robert Brandon"}, {"authorId": "2301680", "name": "Bryan Catanzaro"}, {"authorId": "144440349", "name": "Charles K. Nicholas"}]}, {"paperId": "fa36d180a3d650315e34d0dfa5065478dffa13dc", "url": "https://www.semanticscholar.org/paper/fa36d180a3d650315e34d0dfa5065478dffa13dc", "title": "Analysis of Malware behavior: Type classification using machine learning", "abstract": "Malicious software has become a major threat to modern society, not only due to the increased complexity of the malware itself but also due to the exponential increase of new malware each day. This study tackles the problem of analyzing and classifying a high amount of malware in a scalable and automatized manner. We have developed a distributed malware testing environment by extending Cuckoo Sandbox that was used to test an extensive number of malware samples and trace their behavioral data. The extracted data was used for the development of a novel type classification approach based on supervised machine learning. The proposed classification approach employs a novel combination of features that achieves a high classification rate with a weighted average AUC value of 0.98 using Random Forests classifier. The approach has been extensively tested on a total of 42,000 malware samples. Based on the above results it is believed that the developed system can be used to pre-filter novel from known malware in a future malware analysis system.", "year": 2015, "referenceCount": 20, "citationCount": 89, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2891464", "name": "Radu S. Pirscoveanu"}, {"authorId": "2516279", "name": "Steven S. Hansen"}, {"authorId": "34777995", "name": "Thor M. T. Larsen"}, {"authorId": "35428029", "name": "M. Stevanovic"}, {"authorId": "3369847", "name": "J. Pedersen"}, {"authorId": "25226912", "name": "A. Czech"}]}, {"paperId": "3a32801cde1c1f066a8ae74647705a28442e6136", "url": "https://www.semanticscholar.org/paper/3a32801cde1c1f066a8ae74647705a28442e6136", "title": "Machine Health Monitoring Using Adaptive Kernel Spectral Clustering and Deep Long Short-Term Memory Recurrent Neural Networks", "abstract": "Machine health monitoring is of great importance in industrial informatics field. Recently, deep learning methods applied to machine health monitoring have been proven effective. However, the existing methods face enormous difficulties in extracting heterogeneous features indicating the variation until failure and revealing the inherent high-dimensional features of massive signals, which affect the accuracy and efficiency of machine health monitoring. In this paper, a novel data-driven machine health monitoring method is proposed using adaptive kernel spectral clustering (AKSC) and deep long short-term memory recurrent neural networks (LSTM-RNN). This method include three steps: First, features in the time domain, frequency domain, and time-frequency domain are, respectively, extracted from massive measured signals. And, an Euclidean distance based algorithm is designed to select degradation features. Second, the AKSC algorithm is introduced to adaptively identify machine anomaly behaviors from multiple degradation features. Third, a new deep learning model (LSTM-RNN) is constructed to update and predict the failure time of the machine. The effectiveness of the proposed method is validated using a set of test-to-failure experimental data. The results show that the performance of the proposed method is competitive with other existing methods.", "year": 2019, "referenceCount": 37, "citationCount": 104, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "49096871", "name": "Yiwei Cheng"}, {"authorId": "1711199", "name": "Haiping Zhu"}, {"authorId": "2146665885", "name": "Jun Wu"}, {"authorId": "1688789", "name": "X. Shao"}]}, {"paperId": "f86fe380a7ddc6c76df267d00fc7772ffd13c619", "url": "https://www.semanticscholar.org/paper/f86fe380a7ddc6c76df267d00fc7772ffd13c619", "title": "Discovering charge density functionals and structure-property relationships with PROPhet: A general framework for coupling machine learning and first-principles methods", "abstract": null, "year": 2017, "referenceCount": 52, "citationCount": 84, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "50281621", "name": "B. Kolb"}, {"authorId": "35268340", "name": "Levi C Lentz"}, {"authorId": "4475495", "name": "A. Kolpak"}]}, {"paperId": "6e6c03c3a971ca0d17f21bd094beaca51b514676", "url": "https://www.semanticscholar.org/paper/6e6c03c3a971ca0d17f21bd094beaca51b514676", "title": "Identifying Ethical Considerations for Machine Learning Healthcare Applications", "abstract": "Abstract Along with potential benefits to healthcare delivery, machine learning healthcare applications (ML-HCAs) raise a number of ethical concerns. Ethical evaluations of ML-HCAs will need to structure the overall problem of evaluating these technologies, especially for a diverse group of stakeholders. This paper outlines a systematic approach to identifying ML-HCA ethical concerns, starting with a conceptual model of the pipeline of the conception, development, implementation of ML-HCAs, and the parallel pipeline of evaluation and oversight tasks at each stage. Over this model, we layer key questions that raise value-based issues, along with ethical considerations identified in large part by a literature review, but also identifying some ethical considerations that have yet to receive attention. This pipeline model framework will be useful for systematic ethical appraisals of ML-HCA from development through implementation, and for interdisciplinary collaboration of diverse stakeholders that will be required to understand and subsequently manage the ethical implications of ML-HCAs.", "year": 2020, "referenceCount": 63, "citationCount": 88, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "16015502", "name": "D. Char"}, {"authorId": "143650563", "name": "M. Abràmoff"}, {"authorId": "5993799", "name": "C. Feudtner"}]}, {"paperId": "84b7729299a2c4efecf88b5b0467ca29ba5e77b3", "url": "https://www.semanticscholar.org/paper/84b7729299a2c4efecf88b5b0467ca29ba5e77b3", "title": "Deep learning versus traditional machine learning methods for aggregated energy demand prediction", "abstract": "In this paper the more advanced, in comparison with traditional machine learning approaches, deep learning methods are explored with the purpose of accurately predicting the aggregated energy consumption. Despite the fact that a wide range of machine learning methods have been applied to probabilistic energy prediction, the deep learning ones certainly represent the state-of-the-art artificial intelligence methods with remarkable success in a spectrum of practical applications. In particular, the use of Multi Layer Perceptrons, recently enhanced with deep learning capabilities, is proposed. Furthermore, its performance is compared with the most commonly used machine learning methods, such as Support Vector Machines, Gaussian Processes, Regression Trees, Ensemble Boosting and Linear Regression. The analysis of the day-ahead energy prediction demonstrates that different prediction methods present significantly different levels of accuracy in the case of a challenging dataset that comprises an interesting mix of consumers, wind and solar generation. The results show that Multi Layer Perceptrons outperform all the eight methods used as a benchmark in this study.", "year": 2017, "referenceCount": 35, "citationCount": 51, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1790542", "name": "N. Paterakis"}, {"authorId": "146634864", "name": "Elena Mocanu"}, {"authorId": "1970654", "name": "M. Gibescu"}, {"authorId": "50257911", "name": "Bart Stappers"}, {"authorId": "35360436", "name": "Walter van Alst"}]}, {"paperId": "845d6f6900219a76ea7dfcb7684cf37c1b426c32", "url": "https://www.semanticscholar.org/paper/845d6f6900219a76ea7dfcb7684cf37c1b426c32", "title": "Polypharmacology Browser PPB2: Target Prediction Combining Nearest Neighbors with Machine Learning", "abstract": "Here we report PPB2 as a target prediction tool assigning targets to a query molecule based on ChEMBL data. PPB2 computes ligand similarities using molecular fingerprints encoding composition (MQN), molecular shape and pharmacophores (Xfp), and substructures (ECfp4) and features an unprecedented combination of nearest neighbor (NN) searches and Naı̈ve Bayes (NB) machine learning, together with simple NN searches, NB and Deep Neural Network (DNN) machine learning models as further options. Although NN(ECfp4) gives the best results in terms of recall in a 10-fold cross-validation study, combining NN searches with NB machine learning provides superior precision statistics, as well as better results in a case study predicting off-targets of a recently reported TRPV6 calcium channel inhibitor, illustrating the value of this combined approach. PPB2 is available to assess possible off-targets of small molecule drug-like compounds by public access at http://gdb.unibe.ch .", "year": 2018, "referenceCount": 52, "citationCount": 59, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine", "Computer Science"], "authors": [{"authorId": "3285525", "name": "M. Awale"}, {"authorId": "144796684", "name": "J. Reymond"}]}, {"paperId": "8d2650784b6491fd2b9e73bb212aae229cea01ea", "url": "https://www.semanticscholar.org/paper/8d2650784b6491fd2b9e73bb212aae229cea01ea", "title": "Artificial Intelligence and Machine Learning Applications in Smart Production: Progress, Trends, and Directions", "abstract": "Adaptation and innovation are extremely important to the manufacturing industry. This development should lead to sustainable manufacturing using new technologies. To promote sustainability, smart production requires global perspectives of smart production application technology. In this regard, thanks to intensive research efforts in the field of artificial intelligence (AI), a number of AI-based techniques, such as machine learning, have already been established in the industry to achieve sustainable manufacturing. Thus, the aim of the present research was to analyze, systematically, the scientific literature relating to the application of artificial intelligence and machine learning (ML) in industry. In fact, with the introduction of the Industry 4.0, artificial intelligence and machine learning are considered the driving force of smart factory revolution. The purpose of this review was to classify the literature, including publication year, authors, scientific sector, country, institution, and keywords. The analysis was done using the Web of Science and SCOPUS database. Furthermore, UCINET and NVivo 12 software were used to complete them. A literature review on ML and AI empirical studies published in the last century was carried out to highlight the evolution of the topic before and after Industry 4.0 introduction, from 1999 to now. Eighty-two articles were reviewed and classified. A first interesting result is the greater number of works published by the USA and the increasing interest after the birth of Industry 4.0.", "year": 2020, "referenceCount": 30, "citationCount": 96, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Engineering"], "authors": [{"authorId": "77613442", "name": "R. Cioffi"}, {"authorId": "1573894982", "name": "Marta Travaglioni"}, {"authorId": "123520060", "name": "G. Piscitelli"}, {"authorId": "49596586", "name": "A. Petrillo"}, {"authorId": "47356066", "name": "F. De Felice"}]}, {"paperId": "9d451b39d7c97aebecd36d0ca6e554a9a4309067", "url": "https://www.semanticscholar.org/paper/9d451b39d7c97aebecd36d0ca6e554a9a4309067", "title": "Wrapped progressive sampling search for optimizing learning algorithm parameters", "abstract": "We present a heuristic meta-learning search method for finding a set of optimized algorithmic parameters for a range of machine learning algo- rithms. The method, wrapped progressive sampling, is a combination of classifier wrapping and progressive sampling of training data. A series of experiments on UCI benchmark data sets with nominal features, and five machine learning algorithms to which simple wrapping and wrapped progres- sive sampling is applied, yields results that show little improvement for the algorithm which offers few parameter variations, but marked improvements for the algorithms offering many possible testable parameter combinations, yielding up to 32.2% error reduction with the winnow learning algorithm", "year": 2005, "referenceCount": 11, "citationCount": 63, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145977875", "name": "Antal van den Bosch"}]}, {"paperId": "69dbd0f1e4d7d804dea0be176fd3adc2c7cd8bb3", "url": "https://www.semanticscholar.org/paper/69dbd0f1e4d7d804dea0be176fd3adc2c7cd8bb3", "title": "Big Data Analytics, Machine Learning, and Artificial Intelligence in Next-Generation Wireless Networks", "abstract": "The next-generation wireless networks are evolving into very complex systems because of the very diversified service requirements, heterogeneity in applications, devices, and networks. The network operators need to make the best use of the available resources, for example, power, spectrum, as well as infrastructures. Traditional networking approaches, i.e., reactive, centrally-managed, one-size-fits-all approaches, and conventional data analysis tools that have limited capability (space and time) are not competent anymore and cannot satisfy and serve that future complex networks regarding operation and optimization cost effectively. A novel paradigm of proactive, self-aware, self-adaptive, and predictive networking is much needed. The network operators have access to large amounts of data, especially from the network and the subscribers. Systematic exploitation of the big data dramatically helps in making the system smart, intelligent, and facilitates efficient as well as cost-effective operation and optimization. We envision data-driven next-generation wireless networks, where the network operators employ advanced data analytics, machine learning (ML), and artificial intelligence. We discuss the data sources and strong drivers for the adoption of the data analytics, and the role of ML, artificial intelligence in making the system intelligent regarding being self-aware, self-adaptive, proactive and prescriptive. A set of network design and optimization schemes are presented concerning data analytics. This paper concludes with a discussion of challenges and the benefits of adopting big data analytics, ML, and artificial intelligence in the next-generation communication systems.", "year": 2017, "referenceCount": 31, "citationCount": 227, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2109751", "name": "M. G. Kibria"}, {"authorId": "145025159", "name": "K. Nguyen"}, {"authorId": "1707891", "name": "G. Villardi"}, {"authorId": "3278294", "name": "Ou Zhao"}, {"authorId": "1889421", "name": "K. Ishizu"}, {"authorId": "32987476", "name": "F. Kojima"}]}, {"paperId": "3a6b1896c5d76b2c85467cb0611104d8f9de2b87", "url": "https://www.semanticscholar.org/paper/3a6b1896c5d76b2c85467cb0611104d8f9de2b87", "title": "Slow Feature Analysis for Human Action Recognition", "abstract": "Slow Feature Analysis (SFA) extracts slowly varying features from a quickly varying input signal [1]. It has been successfully applied to modeling the visual receptive fields of the cortical neurons. Sufficient experimental results in neuroscience suggest that the temporal slowness principle is a general learning principle in visual perception. In this paper, we introduce the SFA framework to the problem of human action recognition by incorporating the discriminative information with SFA learning and considering the spatial relationship of body parts. In particular, we consider four kinds of SFA learning strategies, including the original unsupervised SFA (U-SFA), the supervised SFA (S-SFA), the discriminative SFA (D-SFA), and the spatial discriminative SFA (SD--SFA), to extract slow feature functions from a large amount of training cuboids which are obtained by random sampling in motion boundaries. Afterward, to represent action sequences, the squared first order temporal derivatives are accumulated over all transformed cuboids into one feature vector, which is termed the Accumulated Squared Derivative (ASD) feature. The ASD feature encodes the statistical distribution of slow features in an action sequence. Finally, a linear support vector machine (SVM) is trained to classify actions represented by ASD features. We conduct extensive experiments, including two sets of control experiments, two sets of large scale experiments on the KTH and Weizmann databases, and two sets of experiments on the CASIA and UT-interaction databases, to demonstrate the effectiveness of SFA for human action recognition. Experimental results suggest that the SFA-based approach (1) is able to extract useful motion patterns and improves the recognition performance, (2) requires less intermediate processing steps but achieves comparable or even better performance, and (3) has good potential to recognize complex multiperson activities.", "year": 2012, "referenceCount": 50, "citationCount": 289, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2156120959", "name": "Zhang Zhang"}, {"authorId": "143719920", "name": "D. Tao"}]}, {"paperId": "95588f6f59e9e0175a5d3266506626ac063ef666", "url": "https://www.semanticscholar.org/paper/95588f6f59e9e0175a5d3266506626ac063ef666", "title": "Verification for Machine Learning, Autonomy, and Neural Networks Survey", "abstract": "This survey presents an overview of verification techniques for autonomous systems, with a focus on safety-critical autonomous cyber-physical systems (CPS) and subcomponents thereof. Autonomy in CPS is enabling by recent advances in artificial intelligence (AI) and machine learning (ML) through approaches such as deep neural networks (DNNs), embedded in so-called learning enabled components (LECs) that accomplish tasks from classification to control. Recently, the formal methods and formal verification community has developed methods to characterize behaviors in these LECs with eventual goals of formally verifying specifications for LECs, and this article presents a survey of many of these recent approaches.", "year": 2018, "referenceCount": 161, "citationCount": 79, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34061035", "name": "Weiming Xiang"}, {"authorId": "35733741", "name": "Patrick Musau"}, {"authorId": "90443338", "name": "A. Wild"}, {"authorId": "144194822", "name": "Diego Manzanas Lopez"}, {"authorId": "40486580", "name": "Nathaniel Hamilton"}, {"authorId": "2115881364", "name": "Xiaodong Yang"}, {"authorId": "26173486", "name": "Joel A. Rosenfeld"}, {"authorId": "2427495", "name": "Taylor T. Johnson"}]}, {"paperId": "02089a851b318d02667e41e70ce0c0e65f2d91d1", "url": "https://www.semanticscholar.org/paper/02089a851b318d02667e41e70ce0c0e65f2d91d1", "title": "Accurate and sensitive peptide identification with Mascot Percolator.", "abstract": "Sound scoring methods for sequence database search algorithms such as Mascot and Sequest are essential for sensitive and accurate peptide and protein identifications from proteomic tandem mass spectrometry data. In this paper, we present a software package that interfaces Mascot with Percolator, a well performing machine learning method for rescoring database search results, and demonstrate it to be amenable for both low and high accuracy mass spectrometry data, outperforming all available Mascot scoring schemes as well as providing reliable significance measures. Mascot Percolator can be readily used as a stand alone tool or integrated into existing data analysis pipelines.", "year": 2009, "referenceCount": 30, "citationCount": 368, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2273521", "name": "Markus Brosch"}, {"authorId": "46274980", "name": "Lu Yu"}, {"authorId": "8126949", "name": "T. Hubbard"}, {"authorId": "2830622", "name": "J. Choudhary"}]}, {"paperId": "abf85d134bdedd1b378606cd7829e560ca4a48b8", "url": "https://www.semanticscholar.org/paper/abf85d134bdedd1b378606cd7829e560ca4a48b8", "title": "SMSAssassin: crowdsourcing driven mobile-based system for SMS spam filtering", "abstract": "Due to increase in use of Short Message Service (SMS) over mobile phones in developing countries, there has been a burst of spam SMSes. Content-based machine learning approaches were effective in filtering email spams. Researchers have used topical and stylistic features of the SMS to classify spam and ham. SMS spam filtering can be largely influenced by the presence of regional words, abbreviations and idioms. We have tested the feasibility of applying Bayesian learning and Support Vector Machine(SVM) based machine learning techniques which were reported to be most effective in email spam filtering on a India centric dataset. In our ongoing research, as an exploratory step, we have developed a mobile-based system SMSAssassin that can filter SMS spam messages based on bayesian learning and sender blacklisting mechanism. Since the spam SMS keywords and patterns keep on changing, SMSAssassin uses crowd sourcing to keep itself updated. Using a dataset that we are collecting from users in the real-world, we evaluated our approaches and found some interesting results.", "year": 2011, "referenceCount": 14, "citationCount": 101, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "98664139", "name": "Kuldeep Yadav"}, {"authorId": "1734731", "name": "P. Kumaraguru"}, {"authorId": "2010320", "name": "A. Goyal"}, {"authorId": "2110031793", "name": "Ashish Gupta"}, {"authorId": "143672603", "name": "Vinayak Naik"}]}, {"paperId": "d741963c725fdd771de95cb6dbf8d479fcdd32fa", "url": "https://www.semanticscholar.org/paper/d741963c725fdd771de95cb6dbf8d479fcdd32fa", "title": "Artificial intelligence and machine learning in emergency medicine", "abstract": "Interest in artificial intelligence (AI) research has grown rapidly over the past few years, in part thanks to the numerous successes of modern machine learning techniques such as deep learning, the availability of large datasets and improvements in computing power. AI is proving to be increasingly applicable to healthcare and there is a growing list of tasks where algorithms have matched or surpassed physician performance. Despite the successes there remain significant concerns and challenges surrounding algorithm opacity, trust and patient data security. Notwithstanding these challenges, AI technologies will likely become increasingly integrated into emergency medicine in the coming years. This perspective presents an overview of current AI research relevant to emergency medicine.", "year": 2018, "referenceCount": 65, "citationCount": 76, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1778985923", "name": "J. Stewart"}, {"authorId": "2521500", "name": "P. Sprivulis"}, {"authorId": "144084518", "name": "G. Dwivedi"}]}]}