{"total": 5120672, "offset": 5900, "next": 6000, "data": [{"paperId": "3e3165f06f3334267f1fcb4a018ba27f17b622d8", "url": "https://www.semanticscholar.org/paper/3e3165f06f3334267f1fcb4a018ba27f17b622d8", "title": "Automatic acoustic detection of birds through deep learning: The first Bird Audio Detection challenge", "abstract": "Assessing the presence and abundance of birds is important for monitoring specific species as well as overall ecosystem health. Many birds are most readily detected by their sounds, and thus, passive acoustic monitoring is highly appropriate. Yet acoustic monitoring is often held back by practical limitations such as the need for manual configuration, reliance on example sound libraries, low accuracy, low robustness, and limited ability to generalise to novel acoustic conditions. Here, we report outcomes from a collaborative data challenge. We present new acoustic monitoring datasets, summarise the machine learning techniques proposed by challenge teams, conduct detailed performance evaluation, and discuss how such approaches to detection can be integrated into remote monitoring projects. Multiple methods were able to attain performance of around 88% area under the receiver operating characteristic (ROC) curve (AUC), much higher performance than previous general‐purpose methods. With modern machine learning, including deep learning, general‐purpose acoustic bird detection can achieve very high retrieval rates in remote monitoring data, with no manual recalibration, and no pretraining of the detector for the target species or the acoustic conditions in the target environment.", "year": 2018, "referenceCount": 59, "citationCount": 179, "influentialCitationCount": 13, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "3198659", "name": "D. Stowell"}, {"authorId": "3101750", "name": "Y. Stylianou"}, {"authorId": "2066878158", "name": "Mike Wood"}, {"authorId": "51136403", "name": "H. Pamula"}, {"authorId": "1742496", "name": "H. Glotin"}]}, {"paperId": "67049930a70b1ea731dc9a7a7e1646735d47e113", "url": "https://www.semanticscholar.org/paper/67049930a70b1ea731dc9a7a7e1646735d47e113", "title": "Constructing Diverse Classifier Ensembles using Artificial Training Examples", "abstract": "Ensemble methods like bagging and boosting that combine the decisions of multiple hypotheses are some of the strongest existing machine learning methods. The diversity of the members of an ensemble is known to be an important factor in determining its generalization error. This paper presents a new method for generating ensembles that directly constructs diverse hypotheses using additional artificially-constructed training examples. The technique is a simple, general metalearner that can use any strong learner as a base classifier to build diverse committees. Experimental results using decision-tree induction as a base learner demonstrate that this approach consistently achieves higher predictive accuracy than both the base classifier and bagging (whereas boosting can occasionally decrease accuracy), and also obtains higher accuracy than boosting early in the learning curve when training data is limited.", "year": 2003, "referenceCount": 22, "citationCount": 296, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2780489", "name": "Prem Melville"}, {"authorId": "1797655", "name": "R. Mooney"}]}, {"paperId": "54fe746db56d523947527a2345b1a5ee9f4a1c73", "url": "https://www.semanticscholar.org/paper/54fe746db56d523947527a2345b1a5ee9f4a1c73", "title": "Identifying disease genes using machine learning and gene functional similarities, assessed through Gene Ontology", "abstract": "Identifying disease genes from a vast amount of genetic data is one of the most challenging tasks in the post-genomic era. Also, complex diseases present highly heterogeneous genotype, which difficult biological marker identification. Machine learning methods are widely used to identify these markers, but their performance is highly dependent upon the size and quality of available data. In this study, we demonstrated that machine learning classifiers trained on gene functional similarities, using Gene Ontology (GO), can improve the identification of genes involved in complex diseases. For this purpose, we developed a supervised machine learning methodology to predict complex disease genes. The proposed pipeline was assessed using Autism Spectrum Disorder (ASD) candidate genes. A quantitative measure of gene functional similarities was obtained by employing different semantic similarity measures. To infer the hidden functional similarities between ASD genes, various types of machine learning classifiers were built on quantitative semantic similarity matrices of ASD and non-ASD genes. The classifiers trained and tested on ASD and non-ASD gene functional similarities outperformed previously reported ASD classifiers. For example, a Random Forest (RF) classifier achieved an AUC of 0. 80 for predicting new ASD genes, which was higher than the reported classifier (0.73). Additionally, this classifier was able to predict 73 novel ASD candidate genes that were were enriched for core ASD phenotypes, such as autism and obsessive-compulsive behavior. In addition, predicted genes were also enriched for ASD co-occurring conditions, including Attention Deficit Hyperactivity Disorder (ADHD). We also developed a KNIME workflow with the proposed methodology which allows users to configure and execute it without requiring machine learning and programming skills. Machine learning is an effective and reliable technique to decipher ASD mechanism by identifying novel disease genes, but this study further demonstrated that their performance can be improved by incorporating a quantitative measure of gene functional similarities. Source code and the workflow of the proposed methodology are available at https://github.com/Muh-Asif/ASD-genes-prediction.", "year": 2018, "referenceCount": 46, "citationCount": 51, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Medicine", "Computer Science"], "authors": [{"authorId": "38419147", "name": "M. Asif"}, {"authorId": "12048306", "name": "H. Martiniano"}, {"authorId": "5664342", "name": "A. Vicente"}, {"authorId": "1721340", "name": "F. Couto"}]}, {"paperId": "ed968437157f6b2d55114e90059cdce746d7b090", "url": "https://www.semanticscholar.org/paper/ed968437157f6b2d55114e90059cdce746d7b090", "title": "Two-stage extreme learning machine for high-dimensional data", "abstract": null, "year": 2016, "referenceCount": 24, "citationCount": 27, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145779145", "name": "P. Liu"}, {"authorId": "2339847", "name": "Y. Huang"}, {"authorId": "46643379", "name": "L. Meng"}, {"authorId": "48886265", "name": "S. Gong"}, {"authorId": "144973878", "name": "Guopeng Zhang"}]}, {"paperId": "06da4df04ac22b29d7cfca3590ec95e6ed708543", "url": "https://www.semanticscholar.org/paper/06da4df04ac22b29d7cfca3590ec95e6ed708543", "title": "Kernel methods in Quantum Machine Learning", "abstract": null, "year": 2019, "referenceCount": 52, "citationCount": 20, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "31060387", "name": "R. Mengoni"}, {"authorId": "1712913", "name": "A. Pierro"}]}, {"paperId": "b4c0dee1b1bfe2ba9fa87ebb526df2a288011533", "url": "https://www.semanticscholar.org/paper/b4c0dee1b1bfe2ba9fa87ebb526df2a288011533", "title": "The Curse of Dimensionality for Local Kernel Machines", "abstract": "We present a series of theoretical arguments supporting the claim that a large class of modern learning algorithms based on local kernels are sensitive to the curse of dimensionality. These include local manifold learning algorithms such as Isomap and LLE, support vector classifiers with Gaussian or other local kernels, and graph-based semisupervised learning algorithms using a local similarity function. These algorithms are shown to be local in the sense that crucial properties of the learned function at x depend mostly on the neighbors of x in the training set. This makes them sensitive to the curse of dimensionality, well studied for classical non-parametric statistical learning. There is a large class of data distributions for which non-local solutions could be expressed compactly and potentially be learned with few examples, but which will require a large number of local bases and therefore a large number of training examples when using a local learning algorithm.", "year": 2005, "referenceCount": 30, "citationCount": 81, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "1751762", "name": "Yoshua Bengio"}, {"authorId": "2460212", "name": "Olivier Delalleau"}]}, {"paperId": "c709e8f2d6c66e68003a0db22c60d35715293b9f", "url": "https://www.semanticscholar.org/paper/c709e8f2d6c66e68003a0db22c60d35715293b9f", "title": "Extending the search for new resonances with machine learning", "abstract": "The oldest and most robust technique to search for new particles is to look for ``bumps'' in invariant mass spectra over smoothly falling backgrounds. We present a new extension of the bump hunt that naturally benefits from modern machine learning algorithms while remaining model agnostic. This approach is based on the classification without labels (CWoLa) method where the invariant mass is used to create two potentially mixed samples, one with little or no signal and one with a potential resonance. Additional features that are uncorrelated with the invariant mass can be used for training the classifier. Given the lack of new physics signals at the Large Hadron Collider (LHC), such model-agnostic approaches are critical for ensuring full coverage to fully exploit the rich datasets from the LHC experiments. In addition to illustrating how the new method works in simple test cases, we demonstrate the power of the extended bump hunt on a realistic all-hadronic resonance search in a channel that would not be covered with existing techniques.", "year": 2019, "referenceCount": 82, "citationCount": 91, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "153639309", "name": "J. Collins"}, {"authorId": "28203888", "name": "K. Howe"}, {"authorId": "3085579", "name": "B. Nachman"}]}, {"paperId": "11fac1618c5f70734806e2479bd7a269e7cecb05", "url": "https://www.semanticscholar.org/paper/11fac1618c5f70734806e2479bd7a269e7cecb05", "title": "Communication: Understanding molecular representations in machine learning: The role of uniqueness and target similarity.", "abstract": "The predictive accuracy of Machine Learning (ML) models of molecular properties depends on the choice of the molecular representation. Inspired by the postulates of quantum mechanics, we introduce a hierarchy of representations which meet uniqueness and target similarity criteria. To systematically control target similarity, we simply rely on interatomic many body expansions, as implemented in universal force-fields, including Bonding, Angular (BA), and higher order terms. Addition of higher order contributions systematically increases similarity to the true potential energy and predictive accuracy of the resulting ML models. We report numerical evidence for the performance of BAML models trained on molecular properties pre-calculated at electron-correlated and density functional theory level of theory for thousands of small organic molecules. Properties studied include enthalpies and free energies of atomization, heat capacity, zero-point vibrational energies, dipole-moment, polarizability, HOMO/LUMO energies and gap, ionization potential, electron affinity, and electronic excitations. After training, BAML predicts energies or electronic properties of out-of-sample molecules with unprecedented accuracy and speed.", "year": 2016, "referenceCount": 34, "citationCount": 219, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Chemistry", "Medicine"], "authors": [{"authorId": "46799859", "name": "B. Huang"}, {"authorId": "7847508", "name": "O. A. von Lilienfeld"}]}, {"paperId": "b7a72a1c7fb61e144dfb447488043509bed6873f", "url": "https://www.semanticscholar.org/paper/b7a72a1c7fb61e144dfb447488043509bed6873f", "title": "Machine learning–XGBoost analysis of language networks to classify patients with epilepsy", "abstract": null, "year": 2017, "referenceCount": 66, "citationCount": 229, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Psychology"], "authors": [{"authorId": "1401528397", "name": "L. Torlay"}, {"authorId": "1396261582", "name": "M. Perrone‐Bertolotti"}, {"authorId": "145101715", "name": "E. Thomas"}, {"authorId": "2576313", "name": "M. Baciu"}]}, {"paperId": "e83291498a3bc6b0efe8f9571e9c9ca1811707bd", "url": "https://www.semanticscholar.org/paper/e83291498a3bc6b0efe8f9571e9c9ca1811707bd", "title": "PixelDefend: Leveraging Generative Models to Understand and Defend against Adversarial Examples", "abstract": "Adversarial perturbations of normal images are usually imperceptible to humans, but they can seriously confuse state-of-the-art machine learning models. What makes them so special in the eyes of image classifiers? In this paper, we show empirically that adversarial examples mainly lie in the low probability regions of the training distribution, regardless of attack types and targeted models. Using statistical hypothesis testing, we find that modern neural density models are surprisingly good at detecting imperceptible image perturbations. Based on this discovery, we devised PixelDefend, a new approach that purifies a maliciously perturbed image by moving it back towards the distribution seen in the training data. The purified image is then run through an unmodified classifier, making our method agnostic to both the classifier and the attacking method. As a result, PixelDefend can be used to protect already deployed models and be combined with other model-specific defenses. Experiments show that our method greatly improves resilience across a wide variety of state-of-the-art attacking methods, increasing accuracy on the strongest attack from 63% to 84% for Fashion MNIST and from 32% to 70% for CIFAR-10.", "year": 2017, "referenceCount": 50, "citationCount": 586, "influentialCitationCount": 64, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "115504645", "name": "Yang Song"}, {"authorId": "3307885", "name": "Taesup Kim"}, {"authorId": "2388416", "name": "S. Nowozin"}, {"authorId": "2490652", "name": "S. Ermon"}, {"authorId": "1684887", "name": "Nate Kushman"}]}, {"paperId": "e02f91d625cd32290d4ede0f31284da115844316", "url": "https://www.semanticscholar.org/paper/e02f91d625cd32290d4ede0f31284da115844316", "title": "DeepXDE: A Deep Learning Library for Solving Differential Equations", "abstract": "Deep learning has achieved remarkable success in diverse applications; however, its use in solving partial differential equations (PDEs) has emerged only recently. Here, we present an overview of physics-informed neural networks (PINNs), which embed a PDE into the loss of the neural network using automatic differentiation. The PINN algorithm is simple, and it can be applied to different types of PDEs, including integro-differential equations, fractional PDEs, and stochastic PDEs. Moreover, from the implementation point of view, PINNs solve inverse problems as easily as forward problems. We propose a new residual-based adaptive refinement (RAR) method to improve the training efficiency of PINNs. For pedagogical reasons, we compare the PINN algorithm to a standard finite element method. We also present a Python library for PINNs, DeepXDE, which is designed to serve both as an education tool to be used in the classroom as well as a research tool for solving problems in computational science and engineering. Specifically, DeepXDE can solve forward problems given initial and boundary conditions, as well as inverse problems given some extra measurements. DeepXDE supports complex-geometry domains based on the technique of constructive solid geometry, and enables the user code to be compact, resembling closely the mathematical formulation. We introduce the usage of DeepXDE and its customizability, and we also demonstrate the capability of PINNs and the user-friendliness of DeepXDE for five different examples. More broadly, DeepXDE contributes to the more rapid development of the emerging Scientific Machine Learning field.", "year": 2019, "referenceCount": 62, "citationCount": 464, "influentialCitationCount": 59, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics", "Mathematics"], "authors": [{"authorId": "2149373363", "name": "Lu Lu"}, {"authorId": "32526075", "name": "Xuhui Meng"}, {"authorId": "14838210", "name": "Zhiping Mao"}, {"authorId": "1720124", "name": "G. Karniadakis"}]}, {"paperId": "51597ed34e49d91672fa84e5d8a284f9755ee3a5", "url": "https://www.semanticscholar.org/paper/51597ed34e49d91672fa84e5d8a284f9755ee3a5", "title": "Origins of structural and electronic transitions in disordered silicon", "abstract": null, "year": 2021, "referenceCount": 83, "citationCount": 105, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2432235", "name": "Volker L. Deringer"}, {"authorId": "2105796", "name": "N. Bernstein"}, {"authorId": "2559761", "name": "Gábor Csányi"}, {"authorId": "2045384570", "name": "Chiheb Ben Mahmoud"}, {"authorId": "1917770", "name": "M. Ceriotti"}, {"authorId": "2130836675", "name": "M. Wilson"}, {"authorId": "30069262", "name": "David Alan Drabold"}, {"authorId": "2169428271", "name": "S. Elliott"}]}, {"paperId": "81b6783ae6ce1882dc00b73146aaf8946b1b71be", "url": "https://www.semanticscholar.org/paper/81b6783ae6ce1882dc00b73146aaf8946b1b71be", "title": "Machine Learning at Microsoft with ML.NET", "abstract": "Machine Learning is transitioning from an art and science into a technology available to every developer. In the near future, every application on every platform will incorporate trained models to encode data-based decisions that would be impossible for developers to author. This presents a significant engineering challenge, since currently data science and modeling are largely decoupled from standard software development processes. This separation makes incorporating machine learning capabilities inside applications unnecessarily costly and difficult, and furthermore discourage developers from embracing ML in first place. In this paper we present ML.NET, a framework developed at Microsoft over the last decade in response to the challenge of making it easy to ship machine learning models in large software applications. We present its architecture, and illuminate the application demands that shaped it. Specifically, we introduce DataView, the core data abstraction of ML.NET which allows it to capture full predictive pipelines efficiently and consistently across training and inference lifecycles. We close the paper with a surprisingly favorable performance study of ML.NET compared to more recent entrants, and a discussion of some lessons learned.", "year": 2019, "referenceCount": 28, "citationCount": 50, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2144094395", "name": "Zeeshan Ahmed"}, {"authorId": "1961237", "name": "S. Amizadeh"}, {"authorId": "47695762", "name": "M. Bilenko"}, {"authorId": "46464440", "name": "Rogan Carr"}, {"authorId": "40429042", "name": "Wei-Sheng Chin"}, {"authorId": "2077137972", "name": "Yael Dekel"}, {"authorId": "2098180941", "name": "Xavier Dupre"}, {"authorId": "1389623540", "name": "Vadim Eksarevskiy"}, {"authorId": "1389623565", "name": "Eric Erhardt"}, {"authorId": "1389623551", "name": "Costin Eseanu"}, {"authorId": "1389623553", "name": "Senja Filipi"}, {"authorId": "2436568", "name": "Tom Finley"}, {"authorId": "2054713176", "name": "Abhishek Goswami"}, {"authorId": "2070458766", "name": "Monte L. Hoover"}, {"authorId": "2065974288", "name": "Scott Inglis"}, {"authorId": "2192580", "name": "Matteo Interlandi"}, {"authorId": "67301176", "name": "S. Katzenberger"}, {"authorId": "1389623559", "name": "Najeeb Kazmi"}, {"authorId": "2135405691", "name": "Gleb Krivosheev"}, {"authorId": "2105238610", "name": "Pete Luferenko"}, {"authorId": "1389623537", "name": "Ivan Matantsev"}, {"authorId": "3035003", "name": "Sergiy Matusevych"}, {"authorId": "2072909915", "name": "S. Moradi"}, {"authorId": "1389623503", "name": "Gani Nazirov"}, {"authorId": "2233861", "name": "Justin Ormont"}, {"authorId": "2271928", "name": "Gal Oshri"}, {"authorId": "51152502", "name": "Artidoro Pagnoni"}, {"authorId": "2065336399", "name": "Jignesh Parmar"}, {"authorId": "2068306945", "name": "Prabhat Roy"}, {"authorId": "2112398343", "name": "Sarthak Shah"}, {"authorId": "1388651232", "name": "Mohammad Zeeshan Siddiqui"}, {"authorId": "2965406", "name": "Markus Weimer"}, {"authorId": "2886622", "name": "S. Zahirazami"}, {"authorId": "2139103184", "name": "Yiwen Zhu"}]}, {"paperId": "f366e7b30c507c9c3acdd19173fa9db7368f1831", "url": "https://www.semanticscholar.org/paper/f366e7b30c507c9c3acdd19173fa9db7368f1831", "title": "Adaptation in Natural and Artificial Systems: An Introductory Analysis with Applications to Biology, Control, and Artificial Intelligence", "abstract": "From the Publisher: \nGenetic algorithms are playing an increasingly important role in studies of complex adaptive systems, ranging from adaptive agents in economic theory to the use of machine learning techniques in the design of complex devices such as aircraft turbines and integrated circuits. Adaptation in Natural and Artificial Systems is the book that initiated this field of study, presenting the theoretical foundations and exploring applications. \nIn its most familiar form, adaptation is a biological process, whereby organisms evolve by rearranging genetic material to survive in environments confronting them. In this now classic work, Holland presents a mathematical model that allows for the nonlinearity of such complex interactions. He demonstrates the model's universality by applying it to economics, physiological psychology, game theory, and artificial intelligence and then outlines the way in which this approach modifies the traditional views of mathematical genetics. \nInitially applying his concepts to simply defined artificial systems with limited numbers of parameters, Holland goes on to explore their use in the study of a wide range of complex, naturally occuring processes, concentrating on systems having multiple factors that interact in nonlinear ways. Along the way he accounts for major effects of coadaptation and coevolution: the emergence of building blocks, or schemata, that are recombined and passed on to succeeding generations to provide, innovations and improvements. \nJohn H. Holland is Professor of Psychology and Professor of Electrical Engineering and Computer Science at the University of Michigan. He is also Maxwell Professor at the Santa Fe Institute and isDirector of the University of Michigan/Santa Fe Institute Advanced Research Program.", "year": 1992, "referenceCount": 40, "citationCount": 12019, "influentialCitationCount": 482, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Engineering"], "authors": [{"authorId": "144404817", "name": "J. Holland"}]}, {"paperId": "4d9a5db16bc818de736e9c64f53705c3530e7369", "url": "https://www.semanticscholar.org/paper/4d9a5db16bc818de736e9c64f53705c3530e7369", "title": "Computational Analysis of Behavior.", "abstract": "In this review, we discuss the emerging field of computational behavioral analysis-the use of modern methods from computer science and engineering to quantitatively measure animal behavior. We discuss aspects of experiment design important to both obtaining biologically relevant behavioral data and enabling the use of machine vision and learning techniques for automation. These two goals are often in conflict. Restraining or restricting the environment of the animal can simplify automatic behavior quantification, but it can also degrade the quality or alter important aspects of behavior. To enable biologists to design experiments to obtain better behavioral measurements, and computer scientists to pinpoint fruitful directions for algorithm improvement, we review known effects of artificial manipulation of the animal on behavior. We also review machine vision and learning techniques for tracking, feature extraction, automated behavior classification, and automated behavior discovery, the assumptions they make, and the types of data they work best with.", "year": 2016, "referenceCount": 150, "citationCount": 148, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144649110", "name": "S. Egnor"}, {"authorId": "2424812", "name": "K. Branson"}]}, {"paperId": "8912255e445723401c98fa20c65c8125409c04a7", "url": "https://www.semanticscholar.org/paper/8912255e445723401c98fa20c65c8125409c04a7", "title": "Combining Machine Learning and Pharmacophore-Based Interaction Fingerprint for in Silico Screening", "abstract": "In this study, we developed a new pharmacophore-based interaction fingerprint (Pharm-IF) and examined its usefulness for in silico screening using machine learning techniques such as support vector machine (SVM) and random forest (RF) instead of similarity-based ranking. Using the docking results of PKA, SRC, cathepsin K, carbonic anhydrase II, and HIV-1 protease, the screening efficiencies of the Pharm-IF models were compared to GLIDE score and the residue-based IF (PLIF) models. The combination of SVM and Pharm-IF demonstrated a higher enrichment factor at 10% (5.7 on average) than those of GLIDE score (4.2) and PLIF (4.3). In terms of the size of the training sets, learning more than five crystal structures enabled the machine learning models to stably achieve better efficiencies than GLIDE score. We also employed the docking poses of known active compounds, in addition to the crystal structures, as positive samples of training sets. The enrichment factors of the RF models at 10% using the docking poses for SRC and cathepsin K showed significantly higher values (6.5 and 6.3) than those using only the crystal structures (3.9 and 3.2), respectively.", "year": 2010, "referenceCount": 5, "citationCount": 94, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2110061927", "name": "Tomohiro Sato"}, {"authorId": "1719100", "name": "T. Honma"}, {"authorId": "15956782", "name": "S. Yokoyama"}]}, {"paperId": "5baa3e00d66bc42db7e3908f0b70875cff9d0193", "url": "https://www.semanticscholar.org/paper/5baa3e00d66bc42db7e3908f0b70875cff9d0193", "title": "What is being transferred in transfer learning?", "abstract": "One desired capability for machines is the ability to transfer their knowledge of one domain to another where data is (usually) scarce. Despite ample adaptation of transfer learning in various deep learning applications, we yet do not understand what enables a successful transfer and which part of the network is responsible for that. In this paper, we provide new tools and analyses to address these fundamental questions. Through a series of analyses on transferring to block-shuffled images, we separate the effect of feature reuse from learning low-level statistics of data and show that some benefit of transfer learning comes from the latter. We present that when training from pre-trained weights, the model stays in the same basin in the loss landscape and different instances of such model are similar in feature space and close in parameter space.", "year": 2020, "referenceCount": 47, "citationCount": 186, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "3007442", "name": "Behnam Neyshabur"}, {"authorId": "2812848", "name": "Hanie Sedghi"}, {"authorId": "151505981", "name": "Chiyuan Zhang"}]}, {"paperId": "a296037f49fb73a38b2e9ef77012379f2b7621b0", "url": "https://www.semanticscholar.org/paper/a296037f49fb73a38b2e9ef77012379f2b7621b0", "title": "Machine Learning and Energy Minimization Approaches for Crystal Structure Predictions: A Review and New Horizons", "abstract": "Predicting crystal structure has always been a challenging problem for physical sciences. Recently, computational methods have been built to predict crystal structure with success but have been limited in scope and computational time. In this paper, we review computational methods such as density functional theory and machine learning methods used to predict crystal structure. We also explored the breadth versus accuracy of building a model to predict across any crystal structure using machine learning. We extracted 24 913 unique chemical formulas existing between 290 and 310 K from the Pearson Crystal Database. Of these 24 913 formulas, there exists 10 711 unique crystal structures referred to as entry prototypes. Common entries might have hundreds of chemical compositions, while the vast majority of entry prototypes is represented by fewer than ten unique compositions. To include all data in our predictions, entry prototypes that lacked a minimum number of representatives were relabeled as “Other”. By s...", "year": 2018, "referenceCount": 0, "citationCount": 99, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "12306801", "name": "Jake Graser"}, {"authorId": "51474082", "name": "Steven K. Kauwe"}, {"authorId": "15227654", "name": "Taylor D. Sparks"}]}, {"paperId": "2946bf642907677363a04c60762c74d815574885", "url": "https://www.semanticscholar.org/paper/2946bf642907677363a04c60762c74d815574885", "title": "Stochastic Optimization of Sorting Networks via Continuous Relaxations", "abstract": "Sorting input objects is an important step in many machine learning pipelines. However, the sorting operator is non-differentiable with respect to its inputs, which prohibits end-to-end gradient-based optimization. In this work, we propose NeuralSort, a general-purpose continuous relaxation of the output of the sorting operator from permutation matrices to the set of unimodal row-stochastic matrices, where every row sums to one and has a distinct arg max. This relaxation permits straight-through optimization of any computational graph involve a sorting operation. Further, we use this relaxation to enable gradient-based stochastic optimization over the combinatorially large space of permutations by deriving a reparameterized gradient estimator for the Plackett-Luce family of distributions over permutations. We demonstrate the usefulness of our framework on three tasks that require learning semantic orderings of high-dimensional objects, including a fully differentiable, parameterized extension of the k-nearest neighbors algorithm.", "year": 2019, "referenceCount": 38, "citationCount": 95, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1954250", "name": "Aditya Grover"}, {"authorId": "2113762219", "name": "Eric Wang"}, {"authorId": "40576688", "name": "Aaron Zweig"}, {"authorId": "2490652", "name": "S. Ermon"}]}, {"paperId": "61c88b55d74b6d7bd2b0a5fc13b4dae754616f60", "url": "https://www.semanticscholar.org/paper/61c88b55d74b6d7bd2b0a5fc13b4dae754616f60", "title": "Machine Learning: A Review of the Algorithms and Its Applications", "abstract": null, "year": 2019, "referenceCount": 18, "citationCount": 42, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1581931259", "name": "Devanshi Dhall"}, {"authorId": "49081734", "name": "Ravinder Kaur"}, {"authorId": "2343974", "name": "Mamta Juneja"}]}, {"paperId": "d302b0aad742a4242f929926ebcd57a530143410", "url": "https://www.semanticscholar.org/paper/d302b0aad742a4242f929926ebcd57a530143410", "title": "Modern Machine Learning Techniques and Their Applications in Cartoon Animation Research", "abstract": "The integration of machine learning techniques and cartoon animation research is fast becoming a hot topic. This book helps readers learn the latest machine learning techniques, including patch alignment framework; spectral clustering, graph cuts, and convex relaxation; ensemble manifold learning; multiple kernel learning; multiview subspace learning; and multiview distance metric learning. It then presents the applications of these modern machine learning techniques in cartoon animation research. With these techniques, users can efficiently utilize the cartoon materials to generate animations in areas such as virtual reality, video games, animation films, and sport simulations", "year": 2013, "referenceCount": 0, "citationCount": 35, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2117883981", "name": "Jun Yu"}, {"authorId": "143719920", "name": "D. Tao"}]}, {"paperId": "94d33955e1d6c11402aa65105fcd2d9a46418870", "url": "https://www.semanticscholar.org/paper/94d33955e1d6c11402aa65105fcd2d9a46418870", "title": "A Topological \"Reading\" Lesson: Classification of MNIST using TDA", "abstract": "We present a way to use Topological Data Analysis (TDA) for machine learning tasks on grayscale images. We apply persistent homology to generate a wide range of topological features using a point cloud obtained from an image, its natural grayscale filtration, and different filtrations defined on the binarized image. We show that this topological machine learning pipeline can be used as a highly relevant dimensionality reduction by applying it to the MNIST digits dataset. We conduct a feature selection and study their correlations while providing an intuitive interpretation of their importance, which is relevant in both machine learning and TDA. Finally, we show that we can classify digit images while reducing the size of the feature set by a factor 5 compared to the grayscale pixel value features and maintain similar accuracy.", "year": 2019, "referenceCount": 19, "citationCount": 27, "influentialCitationCount": 9, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1379498044", "name": "A. Garin"}, {"authorId": "102217200", "name": "Guillaume Tauzin"}]}, {"paperId": "23a7c8d9f142184d28e56b0751e172fef6539275", "url": "https://www.semanticscholar.org/paper/23a7c8d9f142184d28e56b0751e172fef6539275", "title": "OCA: Opinion corpus for Arabic", "abstract": "Sentiment analysis is a challenging new task related to text mining and natural language processing. Although there are, at present, several studies related to this theme, most of these focus mainly on English texts. The resources available for opinion mining (OM) in other languages are still limited. In this article, we present a new Arabic corpus for the OM task that has been made available to the scientific community for research purposes. The corpus contains 500 movie reviews collected from different web pages and blogs in Arabic, 250 of them considered as positive reviews, and the other 250 as negative opinions. Furthermore, different experiments have been carried out on this corpus, using machine learning algorithms such as support vector machines and Nave Bayes. The results obtained are very promising and we are encouraged to continue this line of research.", "year": 2011, "referenceCount": 38, "citationCount": 263, "influentialCitationCount": 37, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1406535038", "name": "Mohammed Rushdi-Saleh"}, {"authorId": "1397974262", "name": "M. Martín-Valdivia"}, {"authorId": "145200121", "name": "L. A. U. López"}, {"authorId": "1788861", "name": "José Manuel Perea Ortega"}]}, {"paperId": "0b40b4c631e3bfe8211c1529168029df7ad2e8e8", "url": "https://www.semanticscholar.org/paper/0b40b4c631e3bfe8211c1529168029df7ad2e8e8", "title": "Retiring Adult: New Datasets for Fair Machine Learning", "abstract": "Although the fairness community has recognized the importance of data, researchers in the area primarily rely on UCI Adult when it comes to tabular data. Derived from a 1994 US Census survey, this dataset has appeared in hundreds of research papers where it served as the basis for the development and comparison of many algorithmic fairness interventions. We reconstruct a superset of the UCI Adult data from available US Census sources and reveal idiosyncrasies of the UCI Adult dataset that limit its external validity. Our primary contribution is a suite of new datasets derived from US Census surveys that extend the existing data ecosystem for research on fair machine learning. We create prediction tasks relating to income, employment, health, transportation, and housing. The data span multiple years and all states of the United States, allowing researchers to study temporal shift and geographic variation. We highlight a broad initial sweep of new empirical insights relating to trade-oﬀs between fairness criteria, performance of algorithmic interventions, and the role of distribution shift based on our new datasets. Our ﬁndings inform ongoing debates, challenge some existing narratives, and point to future research directions.", "year": 2021, "referenceCount": 65, "citationCount": 86, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "11258292", "name": "Frances Ding"}, {"authorId": "1775622", "name": "Moritz Hardt"}, {"authorId": "1489216270", "name": "John Miller"}, {"authorId": "152772922", "name": "Ludwig Schmidt"}]}, {"paperId": "52289cccda6b9109f4a3d19ffc3f111114ef820b", "url": "https://www.semanticscholar.org/paper/52289cccda6b9109f4a3d19ffc3f111114ef820b", "title": "Application of neural networks and other machine learning algorithms to DNA sequence analysis", "abstract": "In this article we report initial, quantitative results on application of simple neutral networks, and simple machine learning methods, to two problems in DNA sequence analysis. The two problems we consider are: (1) determination of whether procaryotic and eucaryotic DNA sequences segments are translated to protein. An accuracy of 99.4% is reported for procaryotic DNA (E. coli) and 98.4% for eucaryotic DNA (H. Sapiens genes known to be expressed in liver); (2) determination of whether eucaryotic DNA sequence segments containing the dinucleotides ''AG'' or ''GT'' are transcribed to RNA splice junctions. Accuracy of 91.2% was achieved on intron/exon splice junctions (acceptor sites) and 92.8% on exon/intron splice junctions (donor sites). The solution of these two problems, by use of information processing algorithms operating on unannotated base sequences and without recourse to biological laboratory work, is relevant to the Human Genome Project. A variety of neural network, machine learning, and information theoretic algorithms are used. The accuracies obtained exceed those of previous investigations for which quantitative results are available in the literature. They result from an ongoing program of research that applies machine learning algorithms to the problem of determining biological function of DNA sequences. Some predictions of possible new genesmore » using these methods are listed -- although a complete survey of the H. sapiens and E. coli sections of GenBank will be given elsewhere. 36 refs., 6 figs., 6 tabs.« less", "year": 1988, "referenceCount": 0, "citationCount": 92, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Biology"], "authors": [{"authorId": "2020074", "name": "A. Lapedes"}, {"authorId": "50672341", "name": "C. Barnes"}, {"authorId": "1763036", "name": "C. Burks"}, {"authorId": "2542113", "name": "R. Farber"}, {"authorId": "2182166", "name": "K. Sirotkin"}]}, {"paperId": "9538759763d4039036f621baf82567d43b00518c", "url": "https://www.semanticscholar.org/paper/9538759763d4039036f621baf82567d43b00518c", "title": "Distributed Box-Constrained Quadratic Optimization for Dual Linear SVM", "abstract": "Training machine learning models sometimes needs to be done on large amounts of data that exceed the capacity of a single machine, motivating recent works on developing algorithms that train in a distributed fashion. This paper proposes an efficient box-constrained quadratic optimization algorithm for distributedly training linear support vector machines (SVMs) with large data. Our key technical contribution is an analytical solution to the problem of computing the optimal step size at each iteration, using an efficient method that requires only O(1) communication cost to ensure fast convergence. With this optimal step size, our approach is superior to other methods by possessing global linear convergence, or, equivalently, O(log(1/e)) iteration complexity for an e-accurate solution, for distributedly solving the non-strongly-convex linear SVM dual problem. Experiments also show that our method is significantly faster than state-of-the-art distributed linear SVM algorithms including DSVM-AVE, DisDCA and TRON.", "year": 2015, "referenceCount": 37, "citationCount": 50, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "37376821", "name": "Ching-pei Lee"}, {"authorId": "144590225", "name": "D. Roth"}]}, {"paperId": "138fafc2d679bc6446ff74f55dfd316b0d5674b9", "url": "https://www.semanticscholar.org/paper/138fafc2d679bc6446ff74f55dfd316b0d5674b9", "title": "Evidential Deep Learning to Quantify Classification Uncertainty", "abstract": "Deterministic neural nets have been shown to learn effective predictors on a wide range of machine learning problems. However, as the standard approach is to train the network to minimize a prediction loss, the resultant model remains ignorant to its prediction confidence. Orthogonally to Bayesian neural nets that indirectly infer prediction uncertainty through weight uncertainties, we propose explicit modeling of the same using the theory of subjective logic. By placing a Dirichlet distribution on the class probabilities, we treat predictions of a neural net as subjective opinions and learn the function that collects the evidence leading to these opinions by a deterministic neural net from data. The resultant predictor for a multi-class classification problem is another Dirichlet distribution whose parameters are set by the continuous output of a neural net. We provide a preliminary analysis on how the peculiarities of our new loss function drive improved uncertainty estimation. We observe that our method achieves unprecedented success on detection of out-of-distribution queries and endurance against adversarial perturbations.", "year": 2018, "referenceCount": 31, "citationCount": 312, "influentialCitationCount": 59, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1715430", "name": "M. Sensoy"}, {"authorId": "11213556", "name": "M. Kandemir"}, {"authorId": "1795727", "name": "Lance M. Kaplan"}]}, {"paperId": "46a6f1f87f34f3155a6ffd5a99cbde20731d67c6", "url": "https://www.semanticscholar.org/paper/46a6f1f87f34f3155a6ffd5a99cbde20731d67c6", "title": "Customer Churn Prediction Using Improved One-Class Support Vector Machine", "abstract": null, "year": 2005, "referenceCount": 9, "citationCount": 107, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2110263254", "name": "Yu Zhao"}, {"authorId": "2152691794", "name": "Bing Li"}, {"authorId": null, "name": "Xiu Li"}, {"authorId": "2109272766", "name": "Wenhuang Liu"}, {"authorId": "35499834", "name": "S. Ren"}]}, {"paperId": "269be66378a4314445a781b1bf577c5d61b93b71", "url": "https://www.semanticscholar.org/paper/269be66378a4314445a781b1bf577c5d61b93b71", "title": "Imitation Learning", "abstract": "Imitation learning techniques aim to mimic human behavior in a given task. An agent (a learning machine) is trained to perform a task from demonstrations by learning a mapping between observations and actions. The idea of teaching by imitation has been around for many years; however, the field is gaining attention recently due to advances in computing and sensing as well as rising demand for intelligent applications. The paradigm of learning by imitation is gaining popularity because it facilitates teaching complex tasks with minimal expert knowledge of the tasks. Generic imitation learning methods could potentially reduce the problem of teaching a task to that of providing demonstrations, without the need for explicit programming or designing reward functions specific to the task. Modern sensors are able to collect and transmit high volumes of data rapidly, and processors with high computational power allow fast processing that maps the sensory data to actions in a timely manner. This opens the door for many potential AI applications that require real-time perception and reaction such as humanoid robots, self-driving vehicles, human computer interaction, and computer games, to name a few. However, specialized algorithms are needed to effectively and robustly learn models as learning by imitation poses its own set of challenges. In this article, we survey imitation learning methods and present design options in different steps of the learning process. We introduce a background and motivation for the field as well as highlight challenges specific to the imitation problem. Methods for designing and evaluating imitation learning tasks are categorized and reviewed. Special attention is given to learning methods in robotics and games as these domains are the most popular in the literature and provide a wide array of problems and methodologies. We extensively discuss combining imitation learning approaches using different sources and methods, as well as incorporating other motion learning methods to enhance imitation. We also discuss the potential impact on industry, present major applications, and highlight current and future research directions.", "year": 2017, "referenceCount": 166, "citationCount": 214, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2061099244", "name": "A. Hussein"}, {"authorId": "1698684", "name": "M. Gaber"}, {"authorId": "1807106", "name": "Eyad Elyan"}, {"authorId": "8683625", "name": "Chrisina Jayne"}]}, {"paperId": "8efe2e730344e9df401854981bf368019b4084af", "url": "https://www.semanticscholar.org/paper/8efe2e730344e9df401854981bf368019b4084af", "title": "Recognition of Electromyographic Signals Using Cascaded Kernel Learning Machine", "abstract": "Electromyographic (EMG) signals recognition is a complex pattern recognition problem due to its property of large variations in signals and features. This paper proposes a novel EMG classifier called cascaded kernel learning machine (CKLM) to achieve the goal of high-accuracy EMG recognition. First, the EMG signals are acquired by three surface electrodes placed on three different muscles. Second, EMG features are extracted by autoregressive model (ARM) and EMG histogram. After the feature extraction, the CKLM is performed to classify the features. CKLM is composed of two different kinds of kernel learning machines: generalized discriminant analysis (GDA) algorithm and support vector machine (SVM). By using GDA, both the goals of the dimensionality reduction of input features and the selection of discriminating features, named kernel FisherEMG, can be reached. Then, SVM combined with one-against-one strategy is executed to classify the kernel FisherEMG. By cascading SVM with GDA, the input features will be nonlinearly mapped twice by radial-basis function (RBF). As a result, a linear optimal separating hyperplane can be found with the largest margin of separation between each pair of postures' classes in the implicit dot product feature space. In addition, we develop a digital signal processor (DSP)-based EMG classification system for the control of a multi-degrees-of-freedom prosthetic hand for the practical implementation. Based on the clinical experiments, the results show that the proposed CKLM is superior to other frequently used methods, such as k-nearest neighbor algorithm, multilayer neural network, and SVM. The best EMG recognition rate 93.54% is obtained by CKLM.", "year": 2007, "referenceCount": 33, "citationCount": 104, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "47909860", "name": "Yi-Hung Liu"}, {"authorId": "1734312", "name": "Han-Pang Huang"}, {"authorId": "50985940", "name": "C.H. Weng"}]}, {"paperId": "3fdcf2d8fe58dcbc2c353e5974e2030f8281c799", "url": "https://www.semanticscholar.org/paper/3fdcf2d8fe58dcbc2c353e5974e2030f8281c799", "title": "Data-Free Knowledge Distillation for Heterogeneous Federated Learning", "abstract": "Federated Learning (FL) is a decentralized machine-learning paradigm in which a global server iteratively aggregates the model parameters of local users without accessing their data. User heterogeneity has imposed significant challenges to FL, which can incur drifted global models that are slow to converge. Knowledge Distillation has recently emerged to tackle this issue, by refining the server model using aggregated knowledge from heterogeneous users, other than directly aggregating their model parameters. This approach, however, depends on a proxy dataset, making it impractical unless such prerequisite is satisfied. Moreover, the ensemble knowledge is not fully utilized to guide local model learning, which may in turn affect the quality of the aggregated model. In this work, we propose a data-free knowledge distillation approach to address heterogeneous FL, where the server learns a lightweight generator to ensemble user information in a data-free manner, which is then broadcasted to users, regulating local training using the learned knowledge as an inductive bias. Empirical studies powered by theoretical implications show that, our approach facilitates FL with better generalization performance using fewer communication rounds, compared with the state-of-the-art.", "year": 2021, "referenceCount": 58, "citationCount": 102, "influentialCitationCount": 23, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "30451228", "name": "Zhuangdi Zhu"}, {"authorId": "2110805917", "name": "Junyuan Hong"}, {"authorId": "145487992", "name": "Jiayu Zhou"}]}, {"paperId": "87a18efaeb18776dff93597124d67e216da3ac48", "url": "https://www.semanticscholar.org/paper/87a18efaeb18776dff93597124d67e216da3ac48", "title": "Hippocampal Shape Analysis of Alzheimer Disease Based on Machine Learning Methods", "abstract": "BACKGROUND AND PURPOSE: Alzheimer disease (AD) is a neurodegenerative disease characterized by progressive dementia. The hippocampus is particularly vulnerable to damage at the very earliest stages of AD. This article seeks to evaluate critical AD-associated regional changes in the hippocampus using machine learning methods. MATERIALS AND METHODS: High-resolution MR images were acquired from 19 patients with AD and 20 age- and sex-matched healthy control subjects. Regional changes of bilateral hippocampi were characterized using computational anatomic mapping methods. A feature selection method for support vector machine and leave-1-out cross-validation was introduced to determine regional shape differences that minimized the error rate in the datasets. RESULTS: Patients with AD showed significant deformations in the CA1 region of bilateral hippocampi, as well as the subiculum of the left hippocampus. There were also some changes in the CA2–4 subregions of the left hippocampus among patients with AD. Moreover, the left hippocampal surface showed greater variations than the right compared with those in healthy control subjects. The accuracies of leave-1-out cross-validation and 3-fold cross-validation experiments for assessing the reliability of these subregions were more than 80% in bilateral hippocampi. CONCLUSION: Subtle and spatially complex deformation patterns of hippocampus between patients with AD and healthy control subjects can be detected by machine learning methods.", "year": 2007, "referenceCount": 51, "citationCount": 125, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "33125653", "name": "S. Li"}, {"authorId": "1686093", "name": "F. Shi"}, {"authorId": "49551728", "name": "F. Pu"}, {"authorId": "1502862234", "name": "X. Li"}, {"authorId": "40570474", "name": "T. Jiang"}, {"authorId": "2114078962", "name": "S. Xie"}, {"authorId": "119917444", "name": "Y. Wang"}]}, {"paperId": "bae7f0b3448a3eac77886f2a683c0cf9256bb8bf", "url": "https://www.semanticscholar.org/paper/bae7f0b3448a3eac77886f2a683c0cf9256bb8bf", "title": "Fairness and Machine Learning Limitations and Opportunities", "abstract": null, "year": 2018, "referenceCount": 42, "citationCount": 66, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": null, "authors": [{"authorId": "2881033", "name": "Solon Barocas"}, {"authorId": "1775622", "name": "Moritz Hardt"}, {"authorId": "47735253", "name": "A. Narayanan"}]}, {"paperId": "fecc5530ba3c1e0cf75755b1c316c170263d7fb7", "url": "https://www.semanticscholar.org/paper/fecc5530ba3c1e0cf75755b1c316c170263d7fb7", "title": "Decision tree learning based feature evaluation and selection for image classification", "abstract": "In the big data era, machine learning has become an increasingly popular approach for data processing. Data could be in various forms, such as text, images, audios, videos and signals. The essence of machine learning is to learn any patterns from features of data. In the above types of data, the number of features is massively high, which could result in the presence of a large number of irrelevant features. Most machine learning algorithms are sensitive to irrelevant features so effective evaluation and selection of features in machine learning tasks are highly important. Also, effective evaluation of features can also help identify which features are necessary to be extracted from unstructured data. In this paper, we focus on the processing of image features in classification tasks. In particular, we review two main types of feature selection techniques, namely filter and wrapper. We also review several machine learning approaches that have been used popularly in image classification, and identify the limitations of these algorithms in terms of feature evaluation. An experimental study is reported showing the performance of C4.5 (a decision tree learning algorithm) and other popular algorithms (Naive Bayes, K Nearest Neighbours and Multi-layer Perceptron) on five image data sets from the UCI repository. Furthermore, we describe the nature of decision tree learning algorithms for analysing the capability of such algorithms in terms of feature evaluation in the training stage and for showing how rules extracted a decision tree can be used for evaluating features in the validation stage.", "year": 2017, "referenceCount": 25, "citationCount": 22, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145508090", "name": "Han Liu"}, {"authorId": "1788563", "name": "Ella Haig"}, {"authorId": "153425321", "name": "Weili Ding"}]}, {"paperId": "09e023c1efd5c877f0ece320765750cbd3b968ef", "url": "https://www.semanticscholar.org/paper/09e023c1efd5c877f0ece320765750cbd3b968ef", "title": "To Collect or Not to Collect? Machine Learning for Memory Management", "abstract": "This article investigates how machine learning methods might enhance current garbage collection techniques in that they contribute to more adaptive solutions. Machine learning is concerned with programs that improve with experience. Machine learning techniques have been successfully applied to a number of real world problems, such as data mining, game playing, medical diagnosis, speech recognition and automated control. Reinforcement learning provides an approach in which an agent interacts with the environment and learns by trial and error rather than from direct training examples. In other words, the learning task is specified by rewards and penalties that indirectly tell the agent what it is supposed to do instead of telling it how to accomplish the task. In this article we outline a framework for applying reinforcement learning to optimize the performance of conventional garbage collectors. In this project we have researched an adaptive decision process that makes decisions regarding which garbage collector technique should be invoked and how it should be applied. The decision is based on information about the memory allocation behavior of currently running applications. The system learns through trial and error to take the optimal actions in an initially unknown environment.", "year": 2002, "referenceCount": 20, "citationCount": 27, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2071306422", "name": "Eva Andreasson"}, {"authorId": "143762003", "name": "F. Hoffmann"}, {"authorId": "1887592", "name": "O. Lindholm"}]}, {"paperId": "3a4d79c5c2646051753ff0d98f57c08604299aa2", "url": "https://www.semanticscholar.org/paper/3a4d79c5c2646051753ff0d98f57c08604299aa2", "title": "TensorFlow Eager: A Multi-Stage, Python-Embedded DSL for Machine Learning", "abstract": "TensorFlow Eager is a multi-stage, Python-embedded domain-specific language for hardware-accelerated machine learning, suitable for both interactive research and production. TensorFlow, which TensorFlow Eager extends, requires users to represent computations as dataflow graphs; this permits compiler optimizations and simplifies deployment but hinders rapid prototyping and run-time dynamism. TensorFlow Eager eliminates these usability costs without sacrificing the benefits furnished by graphs: It provides an imperative front-end to TensorFlow that executes operations immediately and a JIT tracer that translates Python functions composed of TensorFlow operations into executable dataflow graphs. TensorFlow Eager thus offers a multi-stage programming model that makes it easy to interpolate between imperative and staged execution in a single package.", "year": 2019, "referenceCount": 34, "citationCount": 56, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1945142", "name": "Akshay Agrawal"}, {"authorId": "2063982692", "name": "A. Modi"}, {"authorId": "144720379", "name": "Alexandre Passos"}, {"authorId": "49939485", "name": "Allen Lavoie"}, {"authorId": "2078528337", "name": "Ashish Agarwal"}, {"authorId": "2463241", "name": "Asim Shankar"}, {"authorId": "2204671", "name": "Igor Ganichev"}, {"authorId": "3369421", "name": "J. Levenberg"}, {"authorId": "2069751443", "name": "Mingsheng Hong"}, {"authorId": "3089272", "name": "R. Monga"}, {"authorId": "49406880", "name": "Shanqing Cai"}]}, {"paperId": "5beff11072de25e9be72bd02acc2215a254566e4", "url": "https://www.semanticscholar.org/paper/5beff11072de25e9be72bd02acc2215a254566e4", "title": "A Blockchain and Machine Learning-Based Drug Supply Chain Management and Recommendation System for Smart Pharmaceutical Industry", "abstract": "From the last decade, pharmaceutical companies are facing difficulties in tracking their products during the supply chain process, allowing the counterfeiters to add their fake medicines into the market. Counterfeit drugs are analyzed as a very big challenge for the pharmaceutical industry worldwide. As indicated by the statistics, yearly business loss of around $200 billion is reported by US pharmaceutical companies due to these counterfeit drugs. These drugs may not help the patients to recover the disease but have many other dangerous side effects. According to the World Health Organization (WHO) survey report, in under-developed countries every 10th drug use by the consumers is counterfeit and has low quality. Hence, a system that can trace and track drug delivery at every phase is needed to solve the counterfeiting problem. The blockchain has the full potential to handle and track the supply chain process very efficiently. In this paper, we have proposed and implemented a novel blockchain and machine learning-based drug supply chain management and recommendation system (DSCMR). Our proposed system consists of two main modules: blockchain-based drug supply chain management and machine learning-based drug recommendation system for consumers. In the first module, the drug supply chain management system is deployed using Hyperledger fabrics which is capable of continuously monitor and track the drug delivery process in the smart pharmaceutical industry. On the other hand, the N-gram, LightGBM models are used in the machine learning module to recommend the top-rated or best medicines to the customers of the pharmaceutical industry. These models have trained on well known publicly available drug reviews dataset provided by the UCI: an open-source machine learning repository. Moreover, the machine learning module is integrated with this blockchain system with the help of the REST API. Finally, we also perform several tests to check the efficiency and usability of our proposed system.", "year": 2020, "referenceCount": 73, "citationCount": 63, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1471742438", "name": "Khizar Abbas"}, {"authorId": "2340570", "name": "Muhammad Afaq"}, {"authorId": "2126392248", "name": "Talha Ahmed Khan"}, {"authorId": "2151893", "name": "Wang-Cheol Song"}]}, {"paperId": "e72f29e88350ba95376e7131da98804a8a68993a", "url": "https://www.semanticscholar.org/paper/e72f29e88350ba95376e7131da98804a8a68993a", "title": "Mapping Landslides on EO Data: Performance of Deep Learning Models vs. Traditional Machine Learning Models", "abstract": "Mapping landslides using automated methods is a challenging task, which is still largely done using human efforts. Today, the availability of high-resolution EO data products is increasing exponentially, and one of the targets is to exploit this data source for the rapid generation of landslide inventory. Conventional methods like pixel-based and object-based machine learning strategies have been studied extensively in the last decade. In addition, recent advances in CNN (convolutional neural network), a type of deep-learning method, has been widely successful in extracting information from images and have outperformed other conventional learning methods. In the last few years, there have been only a few attempts to adapt CNN for landslide mapping. In this study, we introduce a modified U-Net model for semantic segmentation of landslides at a regional scale from EO data using ResNet34 blocks for feature extraction. We also compare this with conventional pixel-based and object-based methods. The experiment was done in Douglas County, a study area selected in the south of Portland in Oregon, USA, and landslide inventory extracted from SLIDO (Statewide Landslide Information Database of Oregon) was considered as the ground truth. Landslide mapping is an imbalanced learning problem with very limited availability of training data. Our network was trained on a combination of focal Tversky loss and cross-entropy loss functions using augmented image tiles sampled from a selected training area. The deep-learning method was observed to have a better performance than the conventional methods with an MCC (Matthews correlation coefficient) score of 0.495 and a POD (probability of detection) rate of 0.72 .", "year": 2020, "referenceCount": 84, "citationCount": 97, "influentialCitationCount": 5, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145733294", "name": "N. Prakash"}, {"authorId": "47270540", "name": "A. Manconi"}, {"authorId": "50069834", "name": "S. Loew"}]}, {"paperId": "fce06704eda0d034d69a07b1273a8cabde62bd95", "url": "https://www.semanticscholar.org/paper/fce06704eda0d034d69a07b1273a8cabde62bd95", "title": "Statistical Problems in Particle Physics, Astrophysics and Cosmology : proceedings of PHYSTAT05, Oxford, UK, 12-15 September 2005", "abstract": "Bayes/Frequentism Goodness of Fit Likelihood/Parameter Estimation Nuisance Parameters/Limits/Discovery Machine Learning Software Visualization Astrophysics Time Series Deconvolution.", "year": 2003, "referenceCount": 0, "citationCount": 77, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Physics", "Computer Science"], "authors": [{"authorId": "2944623", "name": "L. Lyons"}, {"authorId": "97969017", "name": "M. K. Ünel"}]}, {"paperId": "cf2ac44e77291c3ca95aac0736fea82960ad6813", "url": "https://www.semanticscholar.org/paper/cf2ac44e77291c3ca95aac0736fea82960ad6813", "title": "Image processing and classification algorithm for yeast cell morphology in a microfluidic chip.", "abstract": "The study of yeast cell morphology requires consistent identification of cell cycle phases based on cell bud size. A computer-based image processing algorithm is designed to automatically classify microscopic images of yeast cells in a microfluidic channel environment. The images were enhanced to reduce background noise, and a robust segmentation algorithm is developed to extract geometrical features including compactness, axis ratio, and bud size. The features are then used for classification, and the accuracy of various machine-learning classifiers is compared. The linear support vector machine, distance-based classification, and k-nearest-neighbor algorithm were the classifiers used in this experiment. The performance of the system under various illumination and focusing conditions were also tested. The results suggest it is possible to automatically classify yeast cells based on their morphological characteristics with noisy and low-contrast images.", "year": 2011, "referenceCount": 34, "citationCount": 267, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "9008145", "name": "Bo Yang Yu"}, {"authorId": "144766880", "name": "Caglar Elbuken"}, {"authorId": "31776525", "name": "C. Ren"}, {"authorId": "1812389", "name": "J. Huissoon"}]}, {"paperId": "ba3f4d05971d3d9ded23725846b864f5a8e8a7a1", "url": "https://www.semanticscholar.org/paper/ba3f4d05971d3d9ded23725846b864f5a8e8a7a1", "title": "Object Tracking With Multi-View Support Vector Machines", "abstract": "How to build an accurate and reliable appearance model to improve the performance is a crucial problem in object tracking. Since the multi-view learning can lead to more accurate and robust representation of the object, in this paper, we propose a novel tracking method via multi-view learning framework by using multiple support vector machines (SVM). The multi-view SVMs tracking method is constructed based on multiple views of features and a novel combination strategy. To realize a comprehensive representation, we select three different types of features, i.e., gray scale value, histogram of oriented gradients (HOG), and local binary pattern (LBP), to train the corresponding SVMs. These features represent the object from the perspectives of description, detection, and recognition, respectively . In order to realize the combination of the SVMs under the multi-view learning framework, we present a novel collaborative strategy with entropy criterion, which is acquired by the confidence distribution of the candidate samples. In addition, to learn the changes of the object and the scenario, we propose a novel update scheme based on subspace evolution strategy. The new scheme can control the model update adaptively and help to address the occlusion problems . We conduct our approach on several public video sequences and the experimental results demonstrate that our method is robust and accurate, and can achieve the state-of-the-art tracking performance.", "year": 2015, "referenceCount": 49, "citationCount": 116, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2042151", "name": "Shunli Zhang"}, {"authorId": "116215056", "name": "Xinzhu Yu"}, {"authorId": "144575574", "name": "Yao Sui"}, {"authorId": "2123978", "name": "Sicong Zhao"}, {"authorId": "2152827743", "name": "Li Zhang"}]}, {"paperId": "597fdd60db83b8dadaad601e5ce18987eb674564", "url": "https://www.semanticscholar.org/paper/597fdd60db83b8dadaad601e5ce18987eb674564", "title": "Estimating replicability of classifier learning experiments", "abstract": "Replicability of machine learning experiments measures how likely it is that the outcome of one experiment is repeated when performed with a different randomization of the data. In this paper, we present an estimator of replicability of an experiment that is efficient. More precisely, the estimator is unbiased and has lowest variance in the class of estimators formed by a linear combination of outcomes of experiments on a given data set.We gathered empirical data for comparing experiments consisting of different sampling schemes and hypothesis tests. Both factors are shown to have an impact on replicability of experiments. The data suggests that sign tests should not be used due to low replicability. Ranked sum tests show better performance, but the combination of a sorted runs sampling scheme with a t-test gives the most desirable performance judged on Type I and II error and replicability.", "year": 2004, "referenceCount": 10, "citationCount": 55, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1680097", "name": "R. Bouckaert"}]}, {"paperId": "5ec042d297a0bc3d02a0748005b890b4d2f5a9ec", "url": "https://www.semanticscholar.org/paper/5ec042d297a0bc3d02a0748005b890b4d2f5a9ec", "title": "Machine learning and image analysis for morphological galaxy classification", "abstract": "In this paper we present an experimental study of machine learning and image analysis for performing automated morphological galaxy classification. We used a neural network, and a locally weighted regression method, and implemented homogeneous ensembles of classifiers. The ensemble of neural networks was created using the bagging ensemble method, and manipulation of input features was used to create the ensemble of locally weighed regression. The galaxies used were rotated, centred, and cropped, all in a fully automatic manner. In addition, we used principal component analysis to reduce the dimensionality of the data, and to extract relevant information in the images. Preliminary experimental results using 10-fold cross-validation show that the homogeneous ensemble of locally weighted regression produces the best results, with over 91 per cent accuracy when considering three galaxy types (E, S and Irr), and over 95 per cent accuracy for two types (E and S).", "year": 2004, "referenceCount": 8, "citationCount": 85, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "1744475", "name": "J. L. Calleja"}, {"authorId": "152401643", "name": "O. Fuentes"}]}, {"paperId": "3f6f0d06004dde20483c191455e351844de0769d", "url": "https://www.semanticscholar.org/paper/3f6f0d06004dde20483c191455e351844de0769d", "title": "Positive Semidefinite Metric Learning Using Boosting-like Algorithms", "abstract": "The success of many machine learning and pattern recognition methods relies heavily upon the identification of an appropriate distance metric on the input data. It is often beneficial to learn such a metric from the input training data, instead of using a default one such as the Euclidean distance. In this work, we propose a boosting-based technique, termed BOOSTMETRIC, for learning a quadratic Mahalanobis distance metric. Learning a valid Mahalanobis distance metric requires enforcing the constraint that the matrix parameter to the metric remains positive semidefinite. Semidefinite programming is often used to enforce this constraint, but does not scale well and is not easy to implement. BOOSTMETRIC is instead based on the observation that any positive semidefinite matrix can be decomposed into a linear combination of trace-one rank-one matrices. BOOSTMETRIC thus uses rank-one positive semidefinite matrices as weak learners within an efficient and scalable boosting-based learning process. The resulting methods are easy to implement, efficient, and can accommodate various types of constraints. We extend traditional boosting algorithms in that its weak learner is a positive semidefinite matrix with trace and rank being one rather than a classifier or regressor. Experiments on various data sets demonstrate that the proposed algorithms compare favorably to those state-of-the-art methods in terms of classification accuracy and running time.", "year": 2011, "referenceCount": 55, "citationCount": 83, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1780381", "name": "Chunhua Shen"}, {"authorId": "1752839", "name": "Junae Kim"}, {"authorId": "36547165", "name": "Lei Wang"}, {"authorId": "5546141", "name": "A. V. Hengel"}]}, {"paperId": "56ef935e32386256d3fc57c409ac6a8d7af1ca2e", "url": "https://www.semanticscholar.org/paper/56ef935e32386256d3fc57c409ac6a8d7af1ca2e", "title": "An enhanced WiFi indoor localization system based on machine learning", "abstract": "The Global Navigation Satellite Systems (GNSS) suffer from accuracy deterioration and outages in dense urban canyons and are almost unavailable for indoor environments. Nowadays, developing indoor positioning systems has become an attractive research topic due to the increasing demands on ubiquitous positioning. WiFi technology has been studied for many years to provide indoor positioning services. The WiFi indoor localization systems based on machine learning approach are widely used in the literature. These systems attempt to find the perfect match between the user fingerprint and pre-defined set of grid points on the radio map. However, Fingerprints are duplicated from available Access Points (APs) and interference, which increase number of matched patterns with the user's fingerprint. In this research, the Principle Component Analysis (PCA) is utilized to improve the performance and to reduce the computation cost of the WiFi indoor localization systems based on machine learning approach. All proposed methods were developed and physically realized on Android-based smart phone using the IEEE 802.11 WLANs. The experimental setup was conducted in a real indoor environment in both static and dynamic modes. The performance of the proposed method was tested using K-Nearest Neighbors, Decision Tree, Random Forest and Support Vector Machine classifiers. The results show that the performance of the proposed method outperforms other indoor localization reported in the literature. The computation time was reduced by 70% when using Random Forest classifier in the static mode and by 33% when using KNN in the dynamic mode.", "year": 2016, "referenceCount": 25, "citationCount": 84, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Engineering", "Computer Science"], "authors": [{"authorId": "7566339", "name": "Ahmed H. Salamah"}, {"authorId": "49640813", "name": "M. Tamazin"}, {"authorId": "145844806", "name": "M. Sharkas"}, {"authorId": "145386145", "name": "M. Khedr"}]}, {"paperId": "e3f77f53418032e5a551f16a11276ca508fae97c", "url": "https://www.semanticscholar.org/paper/e3f77f53418032e5a551f16a11276ca508fae97c", "title": "Empirical Comparison of Area under ROC curve (AUC) and Mathew Correlation Coefficient (MCC) for Evaluating Machine Learning Algorithms on Imbalanced Datasets for Binary Classification", "abstract": "A common challenge encountered when trying to perform classifications and comparing classifiers is selecting a suitable performance metric. This is particularly important when the data has class-imbalance problems. Area under the Receiver Operating Characteristic Curve (AUC) has been commonly used by the machine learning community in such situations, and recently researchers are starting to use Matthew Correlation Coefficient (MCC), especially in biomedical research. However, there is no empirical study that has been conducted to compare the suitability of the two metrics. In this paper, the aim of this study is to provide insights about how AUC and MCC are compared to each other when used with classical machine learning algorithms over a range of imbalanced datasets. In our study, we utilize an earlier-proposed criteria for comparing metrics based on the degree of consistency and degree of Discriminancy to compare AUC against MCC. We carry out experiments using four machine learning algorithms on 54 imbalanced datasets, with imbalance ratios ranging from 1% to 10%. The results demonstrate that both AUC and MCC are statistically consistent with each other; however AUC is more discriminating than MCC. The same observation is noticed when evaluated on 23 balanced datasets. This suggests AUC to be a better measure than MCC in evaluating and comparing classification algorithms.", "year": 2019, "referenceCount": 24, "citationCount": 36, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "52449259", "name": "Chongomweru Halimu"}, {"authorId": "1872191", "name": "Asem Kasem"}, {"authorId": "2203108", "name": "S. Newaz"}]}, {"paperId": "9144853e11640ce1c777ac0742f4924e3d3dfcf9", "url": "https://www.semanticscholar.org/paper/9144853e11640ce1c777ac0742f4924e3d3dfcf9", "title": "Examining the Ability of Artificial Neural Networks Machine Learning Models to Accurately Predict Complications Following Posterior Lumbar Spine Fusion", "abstract": "Study Design. A cross-sectional database study. Objective. The aim of this study was to train and validate machine learning models to identify risk factors for complications following posterior lumbar spine fusion. Summary of Background Data. Machine learning models such as artificial neural networks (ANNs) are valuable tools for analyzing and interpreting large and complex datasets. ANNs have yet to be used for risk factor analysis in orthopedic surgery. Methods. The American College of Surgeons National Surgical Quality Improvement Program (ACS-NSQIP) database was queried for patients who underwent posterior lumbar spine fusion. This query returned 22,629 patients, 70% of whom were used to train our models, and 30% were used to evaluate the models. The predictive variables used included sex, age, ethnicity, diabetes, smoking, steroid use, coagulopathy, functional status, American Society for Anesthesiology (ASA) class ≥3, body mass index (BMI), pulmonary comorbidities, and cardiac comorbidities. The models were used to predict cardiac complications, wound complications, venous thromboembolism (VTE), and mortality. Using ASA class as a benchmark for prediction, area under receiver operating curves (AUC) was used to determine the accuracy of our machine learning models. Results. On the basis of AUC values, ANN and LR both outperformed ASA class for predicting all four types of complications. ANN was the most accurate for predicting cardiac complications, and LR was most accurate for predicting wound complications, VTE, and mortality, though ANN and LR had comparable AUC values for predicting all types of complications. ANN had greater sensitivity than LR for detecting wound complications and mortality. Conclusion. Machine learning in the form of logistic regression and ANNs were more accurate than benchmark ASA scores for identifying risk factors of developing complications following posterior lumbar spine fusion, suggesting they are potentially great tools for risk factor analysis in spine surgery. Level of Evidence: 3", "year": 2017, "referenceCount": 26, "citationCount": 84, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "8901068", "name": "Jun S. Kim"}, {"authorId": "6366723", "name": "R. Merrill"}, {"authorId": "50002911", "name": "Varun Arvind"}, {"authorId": "40389063", "name": "Deepak A Kaji"}, {"authorId": "48536171", "name": "S. Pasik"}, {"authorId": "26678074", "name": "C. Nwachukwu"}, {"authorId": "36874725", "name": "Luilly Vargas"}, {"authorId": "46919615", "name": "Nebiyu S. Osman"}, {"authorId": "4682692", "name": "E. Oermann"}, {"authorId": "36158302", "name": "J. Caridi"}, {"authorId": "144527577", "name": "Samuel K. Cho"}]}, {"paperId": "f2b18264de28827a061fe9e22c437d1f616fdb4a", "url": "https://www.semanticscholar.org/paper/f2b18264de28827a061fe9e22c437d1f616fdb4a", "title": "Learning question classifiers: the role of semantic information", "abstract": "To respond correctly to a free form factual question given a large collection of text data, one needs to understand the question to a level that allows determining some of the constraints the question imposes on a possible answer. These constraints may include a semantic classification of the sought after answer and may even suggest using different strategies when looking for and verifying a candidate answer. This work presents a machine learning approach to question classification. Guided by a layered semantic hierarchy of answer types, we develop a hierarchical classifier that classifies questions into fine-grained classes. This work also performs a systematic study of the use of semantic information sources in natural language classification tasks. It is shown that, in the context of question classification, augmenting the input of the classifier with appropriate semantic category information results in significant improvements to classification accuracy. We show accurate results on a large collection of free-form questions used in TREC 10 and 11.", "year": 2005, "referenceCount": 27, "citationCount": 288, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2153901204", "name": "Xin Li"}, {"authorId": "144590225", "name": "D. Roth"}]}, {"paperId": "69aebcade04e1c1982107e352e541a2dc296e605", "url": "https://www.semanticscholar.org/paper/69aebcade04e1c1982107e352e541a2dc296e605", "title": "Transmit Antenna Selection in MIMO Wiretap Channels: A Machine Learning Approach", "abstract": "In this letter, we exploit the potential benefits of machine learning in enhancing physical layer security in multi-input multi-output multi-antenna-eavesdropper wiretap channels. To this end, we focus on the scenario where the source adopts transmit antenna selection (TAS) as the transmission strategy. We assume that the channel state information (CSI) of the legitimate receiver is available to the source, while the CSI of the eavesdropper can be either known or not known at the source. By modeling the problem of TAS as a multiclass classification problem, we propose two machine learning-based schemes, namely, the support vector machine-based scheme and the naive-Bayes-based scheme, to select the optimal antenna that maximizes the secrecy performance of the considered system. Compared to the conventional TAS scheme, we show that our proposed schemes can achieve almost the same secrecy performance with relatively small feedback overhead. The work presented here provides insights into the design of new machine learning-based secure transmission schemes.", "year": 2018, "referenceCount": 12, "citationCount": 72, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1965757", "name": "Dongxuan He"}, {"authorId": "2116898033", "name": "Chenxi Liu"}, {"authorId": "1718541", "name": "Tony Q. S. Quek"}, {"authorId": "153469687", "name": "Hua Wang"}]}, {"paperId": "e8d040ff7cdff42b4c0a8d1c62b47fc2a0a17e3d", "url": "https://www.semanticscholar.org/paper/e8d040ff7cdff42b4c0a8d1c62b47fc2a0a17e3d", "title": "A Machine Learning Benchmark for Facies Classification", "abstract": "The recent interest in using deep learning for seismic interpretation tasks, such as facies classification, has been facing a significant obstacle, namely, the absence of large publicly available annotated data sets for training and testing models. As a result, researchers have often resorted to annotating their own training and testing data. However, different researchers may annotate different classes or use different train and test splits. In addition, it is common for papers that apply machine learning for facies classification to not contain quantitative results, and rather rely solely on visual inspection of the results. All of these practices have led to subjective results and have greatly hindered our ability to compare different machine-learning models against each other and understand the advantages and disadvantages of each approach. To address these issues, we open source a fully annotated 3D geologic model of the Netherlands F3 block. This model is based on study of the 3D seismic data in addition to 26 well logs, and it is grounded on the careful study of the geology of the region. Furthermore, we have developed two baseline models for facies classification based on a deconvolution network architecture and make their codes publicly available. Finally, we have developed a scheme for evaluating different models on this data set, and we have evaluated the results of our baseline models. In addition to making the data set and the code publicly available, our work helps advance research in this area by creating an objective benchmark for comparing the results of different machine-learning approaches for facies classification.", "year": 2019, "referenceCount": 53, "citationCount": 51, "influentialCitationCount": 8, "isOpenAccess": true, "fieldsOfStudy": ["Engineering", "Computer Science", "Physics", "Geology"], "authors": [{"authorId": "3046631", "name": "Yazeed Alaudah"}, {"authorId": "66037507", "name": "P. Michalowicz"}, {"authorId": "8707145", "name": "M. Alfarraj"}, {"authorId": "9202076", "name": "G. Al-Regib"}]}, {"paperId": "d33b221722c09b747d9144c4afff28bceb19f253", "url": "https://www.semanticscholar.org/paper/d33b221722c09b747d9144c4afff28bceb19f253", "title": "Assessing Grasp Stability Based on Learning and Haptic Data", "abstract": "An important ability of a robot that interacts with the environment and manipulates objects is to deal with the uncertainty in sensory data. Sensory information is necessary to, for example, perform online assessment of grasp stability. We present methods to assess grasp stability based on haptic data and machine-learning methods, including AdaBoost, support vector machines (SVMs), and hidden Markov models (HMMs). In particular, we study the effect of different sensory streams to grasp stability. This includes object information such as shape; grasp information such as approach vector; tactile measurements from fingertips; and joint configuration of the hand. Sensory knowledge affects the success of the grasping process both in the planning stage (before a grasp is executed) and during the execution of the grasp (closed-loop online control). In this paper, we study both of these aspects. We propose a probabilistic learning framework to assess grasp stability and demonstrate that knowledge about grasp stability can be inferred using information from tactile sensors. Experiments on both simulated and real data are shown. The results indicate that the idea to exploit the learning approach is applicable in realistic scenarios, which opens a number of interesting venues for the future research.", "year": 2011, "referenceCount": 43, "citationCount": 186, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1742732", "name": "Yasemin Bekiroglu"}, {"authorId": "1831536", "name": "J. Laaksonen"}, {"authorId": "1396286976", "name": "J. A. Jørgensen"}, {"authorId": "2717428", "name": "V. Kyrki"}, {"authorId": "1731490", "name": "D. Kragic"}]}, {"paperId": "17af9994d0cec986c51bd09cf1467eb971088ca5", "url": "https://www.semanticscholar.org/paper/17af9994d0cec986c51bd09cf1467eb971088ca5", "title": "SKICAT: A Machine Learning System for Automated Cataloging of Large Scale Sky Surveys", "abstract": null, "year": 1993, "referenceCount": 7, "citationCount": 78, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1695784", "name": "U. Fayyad"}, {"authorId": "49171546", "name": "N. Weir"}, {"authorId": "92547994", "name": "S. Djorgovski"}]}, {"paperId": "9e9ca70a45d4b2616bec1a9c03d3f9e048147d27", "url": "https://www.semanticscholar.org/paper/9e9ca70a45d4b2616bec1a9c03d3f9e048147d27", "title": "Grader variability and the importance of reference standards for evaluating machine learning models for diabetic retinopathy", "abstract": null, "year": 2017, "referenceCount": 31, "citationCount": 304, "influentialCitationCount": 15, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2058373914", "name": "Jonathan Krause"}, {"authorId": "3236386", "name": "Varun Gulshan"}, {"authorId": "5062178", "name": "E. Rahimy"}, {"authorId": "5574580", "name": "Peter Karth"}, {"authorId": "10777941", "name": "Kasumi Widner"}, {"authorId": "102388768", "name": "G. Corrado"}, {"authorId": "49506408", "name": "L. Peng"}, {"authorId": "47191829", "name": "D. Webster"}]}, {"paperId": "a9908db3a3f1d2bffcd4aaba6b8a9e1a18d9e55f", "url": "https://www.semanticscholar.org/paper/a9908db3a3f1d2bffcd4aaba6b8a9e1a18d9e55f", "title": "Machine Learning for Adaptive Power Management", "abstract": "Adaptive Power Management (APM) systems for laptops decide when to place a component into various powersaving states given the user activity. The long-term goal of an APM system is to maximize the battery life while minimizing the annoyance to the user. The state-of-the-art in commercial solutions is timeout policies. These policies switch components into their low power states based on thresholds of periods of inactivity. Unfortunately, such methods not only waste power during the periods of inactivity, but also needlessly annoy the user when they turn off components at inappropriate times. Research in APM, on the other hand, has focused more on modeling system dynamics and not on usage patterns. We propose a system that learns when to turn off components based on different user patterns. We describe the challenges of building such a system and progressively explore a range of solutions. We experiment with a direct approach that predicts when to turn off a component given usage features (e.g., historical keyboard and mouse activity, active application, history of network traffic, and history of CPU utilization). To improve performance of the direct approach we partition data based on the context and train the learning algorithms separately for each context. Context could be past idleness or any partitioning of the data that improves performance. We then propose a model-based approach that captures the temporal dynamic of system and user state, the cost of power and user annoyance, as well as the effect of power-saving actions on the user and system. Our direct approach is validated on a large data corpus collected from multiple real users where results show a considerable improvement over traditional timeout methods. INTRODUCTION Adaptive Power Management (APM) attempts to increase the perceived battery life of a laptop by turning off certain components when their services are not going to be needed. Of course, it is not known in advance which services will be needed and when. Moreover, the perceived impact of having certain services not available is much greater than the perceived impact of others. The goal of APM is to extend the battery life as much as possible with an acceptable perceived loss of performance. APM, as opposed to non-adaptive power management, attempts to make better decisions with time and to adapt to individual users. APM is an example of an autonomic system. The autonomics concept is derived from the human body’s autonomic nervous system that regulates individual organ function, and for the most part is not subject to voluntary control. An autonomic computing system controls the functioning of computer applications or systems without explicit user input. The goal of autonomic computing is to create systems that are self-managing, self-healing, and self-protecting. Autonomic computing promises to reduce expenditures associated with operations, maintenance, and support, and to significantly improve the end user’s experience. Autonomic systems ensure smooth and uninterrupted operation by monitoring the system state, diagnosing problems, identifying user context, and executing actions to fix the problems. For example, an APM system monitors the user and laptop state, diagnoses the user mood or context, and changes power states such that the user is not noticeably impacted. Autonomic systems need to naturally reason about uncertainty in both perception Intel Technology Journal, Volume 10, Issue 4, 2006 Machine Learning for Adaptive Power Management 300 and action. In an APM system, perception uncertainty arises from the fact that the user context cannot be directly observed from sensors, such as keyboard and mouse activity, or the currently active application. Actions that turn off components also generate uncertainty. They create uncertainty in terms of the time it takes to turn a component on and off and in terms of the effect it would have on the user’s context. For example, placing the machine on standby does not always take the same amount of time and sometimes the Operating System (OS) does not even allow it. If the user context is for example a measure of idleness, then going to standby, could either increase idleness if it succeeds or decrease it if it fails, hence the uncertainty. If the user context is a measure of the users’ mode of operation (e.g., working, browsing for fun) then going to standby could again change the context in an unpredictable manner. Modeling real-world phenomena as stochastic processes and sequential decision-making under uncertainty (see Figure 1) are widely used paradigms in artificial intelligence. The process of estimating these stochastic process models and the computation of optimal policies fall into the category of machine learning. Machine learning refers to the problem of constructing computer programs that automatically improve with experience. The simplest class of machine learning algorithms are classifiers, which are functions that learn (from examples) to map input patterns to output classes. For the APM domain, our algorithms learn to map laptop usage patterns (at the OS level) into power management actions as shown in Figure 2. In this paper, we first summarize past approaches to the APM problem and then describe a machine-learning approach that maps user patterns to power-saving sections. Our approach outperforms current commercial solutions such as timeout policies. We then propose a more general model-based approach that relies on building stochastic process models. We finally discuss the potential application of such models to other domains. Figure 1: A classic sequential decision-making task under uncertainty. The doctor performs treatments and diagnostic tests on the patient, which change in a stochastic manner the internal state of the patient. The doctor then observes symptoms. The optimal policy is one where in the long run the patient is made well. Figure 2: APM takes as input user and system activity and issues power management actions to the OS and to the hardware APM User-OS Interaction OS-HW Interaction Senses user activity and annoyance Senses hardware activity and power consumption Senses OS activity Actions for PM", "year": 2006, "referenceCount": 18, "citationCount": 48, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "115174611", "name": "George Theocharous"}]}, {"paperId": "235ecfb65e3539fc272db213dabee9c333c29ab1", "url": "https://www.semanticscholar.org/paper/235ecfb65e3539fc272db213dabee9c333c29ab1", "title": "Incremental learning of event definitions with Inductive Logic Programming", "abstract": null, "year": 2014, "referenceCount": 96, "citationCount": 79, "influentialCitationCount": 7, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2891369", "name": "Nikos Katzouris"}, {"authorId": "1707851", "name": "A. Artikis"}, {"authorId": "4738873", "name": "G. Paliouras"}]}, {"paperId": "b50e10b7efba5f272aec70ad8cad76a2aa086f1a", "url": "https://www.semanticscholar.org/paper/b50e10b7efba5f272aec70ad8cad76a2aa086f1a", "title": "Comparison of random forest, artificial neural networks and support vector machine for intelligent diagnosis of rotating machinery", "abstract": "Nowadays, the data-driven diagnosis method, exploiting pattern recognition method to diagnose the fault patterns automatically, achieves much success for rotating machinery. Some popular classification algorithms such as artificial neural networks and support vector machine have been extensively studied and tested with many application cases, while the random forest, one of the present state-of-the-art classifiers based on ensemble learning strategy, is relatively unknown in this field. In this paper, the behavior of random forest for the intelligent diagnosis of rotating machinery is investigated with various features on two datasets. A framework for the comparison of different methods, that is, random forest, extreme learning machine, probabilistic neural network and support vector machine, is presented to find the most efficient one. Random forest has been proven to outperform the comparative classifiers in terms of recognition accuracy, stability and robustness to features, especially with a small training set. Additionally, compared with traditional methods, random forest is not easily influenced by environmental noise. Furthermore, the user-friendly parameters in random forest offer great convenience for practical engineering. These results suggest that random forest is a promising pattern recognition method for the intelligent diagnosis of rotating machinery.", "year": 2018, "referenceCount": 39, "citationCount": 174, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39874576", "name": "Te Han"}, {"authorId": "145869528", "name": "D. Jiang"}, {"authorId": "2110560405", "name": "Qi Zhao"}, {"authorId": "36547165", "name": "Lei Wang"}, {"authorId": "2065233153", "name": "Kai Yin"}]}, {"paperId": "7a92e48d4ab63d982b6e5c70538bfd8a0d50c30e", "url": "https://www.semanticscholar.org/paper/7a92e48d4ab63d982b6e5c70538bfd8a0d50c30e", "title": "A framework for evaluating approximation methods for Gaussian process regression", "abstract": "Gaussian process (GP) predictors are an important component of many Bayesian approaches to machine learning. However, even a straightforward implementation of Gaussian process regression (GPR) requires O(n2) space and O(n3) time for a data set of n examples. Several approximation methods have been proposed, but there is a lack of understanding of the relative merits of the different approximations, and in what situations they are most useful. We recommend assessing the quality of the predictions obtained as a function of the compute time taken, and comparing to standard baselines (e.g., Subset of Data and FITC). We empirically investigate four different approximation algorithms on four different prediction problems, and make our code available to encourage future comparisons.", "year": 2012, "referenceCount": 36, "citationCount": 143, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "3180200", "name": "Krzysztof Chalupka"}, {"authorId": "145715698", "name": "Christopher K. I. Williams"}, {"authorId": "145797336", "name": "Iain Murray"}]}, {"paperId": "dfa49837d0ff284837e64677556c36ab1391fae0", "url": "https://www.semanticscholar.org/paper/dfa49837d0ff284837e64677556c36ab1391fae0", "title": "Support Vector Machines", "abstract": "Support vector machines are statistical- and machine-learning techniques with the primary goal of prediction. They can be applied to continuous, binary, and categorical outcomes analogous to Gaussian, logistic, and multinomial regression. We introduce a new command for this purpose, svmachines. This package is a thin wrapper for the widely deployed libsvm (Chang and Lin, 2011, ACM Transactions on Intelligent Systems and Technology 2(3): Article 27). We illustrate svmachines with two examples.", "year": 2016, "referenceCount": 21, "citationCount": 64, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "71502984", "name": "Nick Guenther"}, {"authorId": "1815604", "name": "M. Schonlau"}]}, {"paperId": "572e3eed573d0c4b6fe27214153f96e1ccd77e32", "url": "https://www.semanticscholar.org/paper/572e3eed573d0c4b6fe27214153f96e1ccd77e32", "title": "Machine Learning with Personal Data", "abstract": "This paper provides an analysis of the impact of using machine learning to conduct profiling of individuals in the context of the EU General Data Protection Regulation.We look at what profiling means and at the right that data subjects have not to be subject to decisions based solely on automated processing, including profiling, which produce legal effects concerning them or significantly affect them. We also look at data subjects’ right to be informed about the existence of automated decision-making, including profiling, and their right to receive meaningful information about the logic involved, as well as the significance and the envisaged consequences of such processing.The purpose of this paper is to explore the application of relevant data protection rights and obligations to machine learning, including implications for the development and deployment of machine learning systems and the ways in which personal data are collected and used. In particular, we consider what compliance with the first data protection principle of lawful, fair, and transparent processing means in the context of using machine learning for profiling purposes. We ask whether automated processing utilising machine learning, including for profiling purposes, might in fact offer benefits and not merely present challenges in relation to fair and lawful processing.", "year": 2016, "referenceCount": 8, "citationCount": 36, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "72001758", "name": "Dimitra Kamarinou"}, {"authorId": "144368115", "name": "C. Millard"}, {"authorId": "144857568", "name": "Jatinder Singh"}]}, {"paperId": "dcacb5b784d328d6d6b67c75de826b58674c290f", "url": "https://www.semanticscholar.org/paper/dcacb5b784d328d6d6b67c75de826b58674c290f", "title": "Remote sensing and machine learning for crop water stress determination in various crops: a critical review", "abstract": null, "year": 2020, "referenceCount": 133, "citationCount": 62, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "90899793", "name": "S. Virnodkar"}, {"authorId": "2261969", "name": "V. Pachghare"}, {"authorId": "83534434", "name": "V. Patil"}, {"authorId": "145189562", "name": "S. K. Jha"}]}, {"paperId": "22c6c6deac6141de63f9f6d2729a944a1e4a90a6", "url": "https://www.semanticscholar.org/paper/22c6c6deac6141de63f9f6d2729a944a1e4a90a6", "title": "Training SVM with indefinite kernels", "abstract": "Similarity matrices generated from many applications may not be positive semidefinite, and hence can't fit into the kernel machine framework. In this paper, we study the problem of training support vector machines with an indefinite kernel. We consider a regularized SVM formulation, in which the indefinite kernel matrix is treated as a noisy observation of some unknown positive semidefinite one (proxy kernel) and the support vectors and the proxy kernel can be computed simultaneously. We propose a semi-infinite quadratically constrained linear program formulation for the optimization, which can be solved iteratively to find a global optimum solution. We further propose to employ an additional pruning strategy, which significantly improves the efficiency of the algorithm, while retaining the convergence property of the algorithm. In addition, we show the close relationship between the proposed formulation and multiple kernel learning. Experiments on a collection of benchmark data sets demonstrate the efficiency and effectiveness of the proposed algorithm.", "year": 2008, "referenceCount": 30, "citationCount": 73, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2108513551", "name": "Jianhui Chen"}, {"authorId": "144030870", "name": "Jieping Ye"}]}, {"paperId": "a622be547caf0b1223626de5e69377c20ae11265", "url": "https://www.semanticscholar.org/paper/a622be547caf0b1223626de5e69377c20ae11265", "title": "A Dissection of Overfitting and Generalization in Continuous Reinforcement Learning", "abstract": "The risks and perils of overfitting in machine learning are well known. However most of the treatment of this, including diagnostic tools and remedies, was developed for the supervised learning case. In this work, we aim to offer new perspectives on the characterization and prevention of overfitting in deep Reinforcement Learning (RL) methods, with a particular focus on continuous domains. We examine several aspects, such as how to define and diagnose overfitting in MDPs, and how to reduce risks by injecting sufficient training diversity. This work complements recent findings on the brittleness of deep RL methods and offers practical observations for RL researchers and practitioners.", "year": 2018, "referenceCount": 23, "citationCount": 128, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "2111672235", "name": "Amy Zhang"}, {"authorId": "2482072", "name": "Nicolas Ballas"}, {"authorId": "145134886", "name": "Joelle Pineau"}]}, {"paperId": "cbc10bb6123132d0683a0525aaba558c245406ed", "url": "https://www.semanticscholar.org/paper/cbc10bb6123132d0683a0525aaba558c245406ed", "title": "Prediction of thermal boundary resistance by the machine learning method", "abstract": null, "year": 2017, "referenceCount": 84, "citationCount": 60, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "11880581", "name": "T. Zhan"}, {"authorId": "2153680664", "name": "Lei Fang"}, {"authorId": "153018856", "name": "Yibin Xu"}]}, {"paperId": "007464b4564d2fff325bfb85b2a2ee8c20e3fd3e", "url": "https://www.semanticscholar.org/paper/007464b4564d2fff325bfb85b2a2ee8c20e3fd3e", "title": "EEG-based emotion classification using deep belief networks", "abstract": "In recent years, there are many great successes in using deep architectures for unsupervised feature learning from data, especially for images and speech. In this paper, we introduce recent advanced deep learning models to classify two emotional categories (positive and negative) from EEG data. We train a deep belief network (DBN) with differential entropy features extracted from multichannel EEG as input. A hidden markov model (HMM) is integrated to accurately capture a more reliable emotional stage switching. We also compare the performance of the deep models to KNN, SVM and Graph regularized Extreme Learning Machine (GELM). The average accuracies of DBN-HMM, DBN, GELM, SVM, and KNN in our experiments are 87.62%, 86.91%, 85.67%, 84.08%, and 69.66%, respectively. Our experimental results show that the DBN and DBN-HMM models improve the accuracy of EEG-based emotion classification in comparison with the state-of-the-art methods.", "year": 2014, "referenceCount": 9, "citationCount": 230, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3108302", "name": "Wei-Long Zheng"}, {"authorId": "2682019", "name": "Jia-Yi Zhu"}, {"authorId": "2110679289", "name": "Yong Peng"}, {"authorId": "1715839", "name": "Bao-Liang Lu"}]}, {"paperId": "789ad4218d1e2e920b4d192023f840fe8246d746", "url": "https://www.semanticscholar.org/paper/789ad4218d1e2e920b4d192023f840fe8246d746", "title": "Mining large streams of user data for personalized recommendations", "abstract": "The Netflix Prize put the spotlight on the use of data mining and machine learning methods for predicting user preferences. Many lessons came out of the competition. But since then, Recommender Systems have evolved. This evolution has been driven by the greater availability of different kinds of user data in industry and the interest that the area has drawn among the research community. The goal of this paper is to give an up-to-date overview of the use of data mining approaches for personalization and recommendation. Using Netflix personalization as a motivating use case, I will describe the use of different kinds of data and machine learning techniques.\n After introducing the traditional approaches to recommendation, I highlight some of the main lessons learned from the Netflix Prize. I then describe the use of recommendation and personalization techniques at Netflix. Finally, I pinpoint the most promising current research avenues and unsolved problems that deserve attention in this domain.", "year": 2013, "referenceCount": 76, "citationCount": 129, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2478897", "name": "X. Amatriain"}]}, {"paperId": "d468396ab05a1ee98e92e3b8232d47708092af09", "url": "https://www.semanticscholar.org/paper/d468396ab05a1ee98e92e3b8232d47708092af09", "title": "Persistent Homology Machine Learning for Fingerprint Classification", "abstract": "The fingerprint classification problem is to sort fingerprints into predetermined groups, such as arch, loop, and whorl. It was asserted in the literature that minutiae points, which are commonly used for fingerprint matching, are not useful for classification. We show that, to the contrary, near state-of-the-art classification accuracy rates can be achieved when applying topological data analysis (TDA) to 3-dimensional point clouds of oriented minutiae points. We also apply TDA to fingerprint ink-roll images, which yields a lower accuracy rate but still shows promise; moreover, combining the two approaches outperforms each one individually. These methods use supervised learning applied to persistent homology and allow us to explore feature selection on barcodes, an important topic at the interface between TDA and machine learning. We test our classification algorithms on the NIST fingerprint database SD-27.", "year": 2017, "referenceCount": 24, "citationCount": 23, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2640058", "name": "Noah Giansiracusa"}, {"authorId": "2855899", "name": "Robert S. Giansiracusa"}, {"authorId": "145016678", "name": "Chul Moon"}]}, {"paperId": "2a8e26f7ad35b0a322936f648608aab3b6c1f44d", "url": "https://www.semanticscholar.org/paper/2a8e26f7ad35b0a322936f648608aab3b6c1f44d", "title": "Sparse and unique nonnegative matrix factorization through data preprocessing", "abstract": "Nonnegative matrix factorization (NMF) has become a very popular technique in machine learning because it automatically extracts meaningful features through a sparse and part-based representation. However, NMF has the drawback of being highly ill-posed, that is, there typically exist many different but equivalent factorizations. In this paper, we introduce a completely new way to obtaining more well-posed NMF problems whose solutions are sparser. Our technique is based on the preprocessing of the nonnegative input data matrix, and relies on the theory of M-matrices and the geometric interpretation of NMF. This approach provably leads to optimal and sparse solutions under the separability assumption of Donoho and Stodden (2003), and, for rank-three matrices, makes the number of exact factorizations finite. We illustrate the effectiveness of our technique on several image data sets.", "year": 2012, "referenceCount": 48, "citationCount": 140, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2039115", "name": "Nicolas Gillis"}]}, {"paperId": "ab2ad4118683a42e6a1262f6239c0f3c033df581", "url": "https://www.semanticscholar.org/paper/ab2ad4118683a42e6a1262f6239c0f3c033df581", "title": "Fast and Accurate Uncertainty Estimation in Chemical Machine Learning.", "abstract": "We present a scheme to obtain an inexpensive and reliable estimate of the uncertainty associated with the predictions of a machine-learning model of atomic and molecular properties. The scheme is based on resampling, with multiple models being generated based on subsampling of the same training data. The accuracy of the uncertainty prediction can be benchmarked by maximum likelihood estimation, which can also be used to correct for correlations between resampled models and to improve the performance of the uncertainty estimation by a cross-validation procedure. In the case of sparse Gaussian Process Regression models, this resampled estimator can be evaluated at negligible cost. We demonstrate the reliability of these estimates for the prediction of molecular and materials energetics and for the estimation of nuclear chemical shieldings in molecular crystals. Extension to estimate the uncertainty in energy differences, forces, or other correlated predictions is straightforward. This method can be easily applied to other machine-learning schemes and will be beneficial to make data-driven predictions more reliable and to facilitate training-set optimization and active-learning strategies.", "year": 2018, "referenceCount": 62, "citationCount": 82, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science", "Physics"], "authors": [{"authorId": "34778608", "name": "F. Musil"}, {"authorId": "11042469", "name": "Michael J. Willatt"}, {"authorId": "88754305", "name": "Mikhail A. Langovoy"}, {"authorId": "1917770", "name": "M. Ceriotti"}]}, {"paperId": "7f93b0b25043c92dc3eb77b5b7e2834b7d36d3ad", "url": "https://www.semanticscholar.org/paper/7f93b0b25043c92dc3eb77b5b7e2834b7d36d3ad", "title": "Security Evaluation of Support Vector Machines in Adversarial Environments", "abstract": null, "year": 2014, "referenceCount": 75, "citationCount": 105, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1684175", "name": "B. Biggio"}, {"authorId": "2338858", "name": "I. Corona"}, {"authorId": "39743720", "name": "Blaine Nelson"}, {"authorId": "1868067", "name": "Benjamin I. P. Rubinstein"}, {"authorId": "3248803", "name": "Davide Maiorca"}, {"authorId": "1716261", "name": "G. Fumera"}, {"authorId": "1779484", "name": "G. Giacinto"}, {"authorId": "1710171", "name": "F. Roli"}]}, {"paperId": "aac31850359dca92a9a84a3e74dcd0f98edd1e00", "url": "https://www.semanticscholar.org/paper/aac31850359dca92a9a84a3e74dcd0f98edd1e00", "title": "DeBayes: a Bayesian method for debiasing network embeddings", "abstract": "As machine learning algorithms are increasingly deployed for high-impact automated decision making, ethical and increasingly also legal standards demand that they treat all individuals fairly, without discrimination based on their age, gender, race or other sensitive traits. In recent years much progress has been made on ensuring fairness and reducing bias in standard machine learning settings. Yet, for network embedding, with applications in vulnerable domains ranging from social network analysis to recommender systems, current options remain limited both in number and performance. We thus propose DeBayes: a conceptually elegant Bayesian method that is capable of learning debiased embeddings by using a biased prior. Our experiments show that these representations can then be used to perform link prediction that is significantly more fair in terms of popular metrics such as demographic parity and equalized opportunity.", "year": 2020, "referenceCount": 26, "citationCount": 33, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1507650929", "name": "Maarten Buyl"}, {"authorId": "51204489", "name": "T. D. Bie"}]}, {"paperId": "69ee679b0357ff1ae7656d66bd23d98328258e6e", "url": "https://www.semanticscholar.org/paper/69ee679b0357ff1ae7656d66bd23d98328258e6e", "title": "Attack and anomaly detection in IoT sensors in IoT sites using machine learning approaches", "abstract": null, "year": 2019, "referenceCount": 32, "citationCount": 305, "influentialCitationCount": 15, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2118720453", "name": "Mahmudul Hasan"}, {"authorId": "2157630857", "name": "Md. Milon Islam"}, {"authorId": "1412660145", "name": "Md Ishrak Islam Zarif"}, {"authorId": "143733972", "name": "M. Hashem"}]}, {"paperId": "6231a099ca65d088eecc5dc7f3b1dd095d0d44ad", "url": "https://www.semanticscholar.org/paper/6231a099ca65d088eecc5dc7f3b1dd095d0d44ad", "title": "Discovering Mammography-based Machine Learning Classifiers for Breast Cancer Diagnosis", "abstract": null, "year": 2012, "referenceCount": 50, "citationCount": 86, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1388401481", "name": "R. Ramos-Pollán"}, {"authorId": "1401832480", "name": "M. A. Guevara-López"}, {"authorId": "40556983", "name": "C. Ortega"}, {"authorId": "1405705109", "name": "G. Díaz-Herrero"}, {"authorId": "1405705107", "name": "Jose Miguel Franco-Valiente"}, {"authorId": "2777284", "name": "M. R. D. Solar"}, {"authorId": "1403854254", "name": "Naimy González-de-Posada"}, {"authorId": "2069274202", "name": "Mário Augusto Pires Vaz"}, {"authorId": "152234876", "name": "J. Loureiro"}, {"authorId": "51097475", "name": "Isabel Ramos"}]}, {"paperId": "1b38eb62878a73fe72234bc89db11a3432b0123c", "url": "https://www.semanticscholar.org/paper/1b38eb62878a73fe72234bc89db11a3432b0123c", "title": "A machine-learning classifier implemented in a standard 6T SRAM array", "abstract": "This paper presents a machine-learning classifier where the computation is performed within a standard 6T SRAM array. This eliminates explicit memory operations, which otherwise pose energy/performance bottlenecks, especially for emerging algorithms (e.g., from machine learning) that result in high ratio of memory accesses. We present an algorithm and prototype IC (in 130nm CMOS), where a 128×128 SRAM array performs storage of classifier models and complete classifier computations. We demonstrate a real application, namely digit recognition from MNIST-database images. The accuracy is equal to a conventional (ideal) digital/SRAM system, yet with 113× lower energy. The approach achieves accuracy >95% with a full feature set (i.e., 28×28=784 image pixels), and 90% when reduced to 82 features (as demonstrated on the IC due to area limitations). The energy per 10-way digit classification is 633pJ at a speed of 50MHz.", "year": 2016, "referenceCount": 0, "citationCount": 96, "influentialCitationCount": 18, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1519068895", "name": "Jintao Zhang"}, {"authorId": "2108367712", "name": "Zhuo Wang"}, {"authorId": "145020569", "name": "N. Verma"}]}, {"paperId": "644f848fbcbe2d33a5a12dec4ee2f4fb36a729a4", "url": "https://www.semanticscholar.org/paper/644f848fbcbe2d33a5a12dec4ee2f4fb36a729a4", "title": "Machine learning in complex networks", "abstract": null, "year": 2010, "referenceCount": 0, "citationCount": 48, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1945715", "name": "Fabricio A. Breve"}]}, {"paperId": "c6154ecadd374a50345980e2d5be0cc46c51027f", "url": "https://www.semanticscholar.org/paper/c6154ecadd374a50345980e2d5be0cc46c51027f", "title": "Soil Classification Using Machine Learning Methods and Crop Suggestion Based on Soil Series", "abstract": "Soil is an important ingredient of agriculture. There are several kinds of soil. Each type of soil can have different kinds of features and different kinds of crops grow on different types of soils. We need to know the features and characteristics of various soil types to understand which crops grow better in certain soil types. Machine learning techniques can be helpful in this case. In recent years, it is progressed a lot. Machine learning is still an emerging and challenging research field in agricultural data analysis. In this paper, we have proposed a model that can predict soil series with land type and according to prediction it can suggest suitable crops. Several machine learning algorithms such as weighted k-Nearest Neighbor (k-NN), Bagged Trees, and Gaussian kernel based Support Vector Machines (SVM) are used for soil classification. Experimental results show that the proposed SVM based method performs better than many existing methods.", "year": 2018, "referenceCount": 5, "citationCount": 50, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "121920671", "name": "S. Rahman"}, {"authorId": "68973043", "name": "Kaushik Chandra Mitra"}, {"authorId": "35296210", "name": "S. M. Mohidul Islam"}]}, {"paperId": "30d41b40869999190022257dcfb38587e85fccb2", "url": "https://www.semanticscholar.org/paper/30d41b40869999190022257dcfb38587e85fccb2", "title": "Machine Learning Outperforms ACC/AHA CVD Risk Calculator in MESA", "abstract": "Background Studies have demonstrated that the current US guidelines based on American College of Cardiology/American Heart Association (ACC/AHA) Pooled Cohort Equations Risk Calculator may underestimate risk of atherosclerotic cardiovascular disease (CVD) in certain high‐risk individuals, therefore missing opportunities for intensive therapy and preventing CVD events. Similarly, the guidelines may overestimate risk in low risk populations resulting in unnecessary statin therapy. We used Machine Learning (ML) to tackle this problem. Methods and Results We developed a ML Risk Calculator based on Support Vector Machines (SVMs) using a 13‐year follow up data set from MESA (the Multi‐Ethnic Study of Atherosclerosis) of 6459 participants who were atherosclerotic CVD‐free at baseline. We provided identical input to both risk calculators and compared their performance. We then used the FLEMENGHO study (the Flemish Study of Environment, Genes and Health Outcomes) to validate the model in an external cohort. ACC/AHA Risk Calculator, based on 7.5% 10‐year risk threshold, recommended statin to 46.0%. Despite this high proportion, 23.8% of the 480 “Hard CVD” events occurred in those not recommended statin, resulting in sensitivity 0.76, specificity 0.56, and AUC 0.71. In contrast, ML Risk Calculator recommended only 11.4% to take statin, and only 14.4% of “Hard CVD” events occurred in those not recommended statin, resulting in sensitivity 0.86, specificity 0.95, and AUC 0.92. Similar results were found for prediction of “All CVD” events. Conclusions The ML Risk Calculator outperformed the ACC/AHA Risk Calculator by recommending less drug therapy, yet missing fewer events. Additional studies are underway to validate the ML model in other cohorts and to explore its ability in short‐term CVD risk prediction.", "year": 2018, "referenceCount": 38, "citationCount": 89, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "1706204", "name": "I. Kakadiaris"}, {"authorId": "2045915", "name": "Michalis Vrigkas"}, {"authorId": "40563453", "name": "A. Yen"}, {"authorId": "2056540866", "name": "T. Kuznetsova"}, {"authorId": "145197121", "name": "M. Budoff"}, {"authorId": "20627607", "name": "M. Naghavi"}]}, {"paperId": "b75140271705190665cf284d0553c644b2661719", "url": "https://www.semanticscholar.org/paper/b75140271705190665cf284d0553c644b2661719", "title": "System Identification: A Machine Learning Perspective", "abstract": "Estimation of functions from sparse and noisy data is a central theme in machine learning. In the last few years, many algorithms have been developed that exploit Tikhonov regularization theory and reproducing kernel Hilbert spaces. These are the so-called kernel-based methods, which include powerful approaches like regularization networks, support vector machines, and Gaussian regression. Recently, these techniques have also gained popularity in the system identification community. In both linear and nonlinear settings, kernels that incorporate information on dynamic systems, such as the smoothness and stability of the input–output map, can challenge consolidated approaches based on parametric model structures. In the classical parametric setting, the complexity of the model (the model order) needs to be chosen, typically from a finite family of alternatives, by trading bias and variance. This (discrete) model order selection step may be critical, especially when the true model does not belong to the model class. In regularization-based approaches, model complexity is controlled by tuning (continuous) regularization parameters, making the model selection step more robust. In this article, we review these new kernel-based system identification approaches and discuss extensions based on nuclear and [Formula: see text] norms.", "year": 2019, "referenceCount": 0, "citationCount": 54, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1689638", "name": "A. Chiuso"}, {"authorId": "1719301", "name": "G. Pillonetto"}]}, {"paperId": "07ef1b52b9fbb25cec28f65d030e44237c8f3f5b", "url": "https://www.semanticscholar.org/paper/07ef1b52b9fbb25cec28f65d030e44237c8f3f5b", "title": "Maximin affinity learning of image segmentation", "abstract": "Images can be segmented by first using a classifier to predict an affinity graph that reflects the degree to which image pixels must be grouped together and then partitioning the graph to yield a segmentation. Machine learning has been applied to the affinity classifier to produce affinity graphs that are good in the sense of minimizing edge misclassification rates. However, this error measure is only indirectly related to the quality of segmentations produced by ultimately partitioning the affinity graph. We present the first machine learning algorithm for training a classifier to produce affinity graphs that are good in the sense of producing segmentations that directly minimize the Rand index, a well known segmentation performance measure. The Rand index measures segmentation performance by quantifying the classification of the connectivity of image pixel pairs after segmentation. By using the simple graph partitioning algorithm of finding the connected components of the thresholded affinity graph, we are able to train an affinity classifier to directly minimize the Rand index of segmentations resulting from the graph partitioning. Our learning algorithm corresponds to the learning of maximin affinities between image pixel pairs, which are predictive of the pixel-pair connectivity.", "year": 2009, "referenceCount": 22, "citationCount": 131, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3178417", "name": "Srinivas C. Turaga"}, {"authorId": "1997979", "name": "K. Briggman"}, {"authorId": "2495450", "name": "M. Helmstaedter"}, {"authorId": "144922222", "name": "W. Denk"}, {"authorId": "144924970", "name": "H. Seung"}]}, {"paperId": "e214d3cec203e99d0ad4328dcd15b32214ab49d4", "url": "https://www.semanticscholar.org/paper/e214d3cec203e99d0ad4328dcd15b32214ab49d4", "title": "Machine Learning and AI for Risk Management", "abstract": null, "year": 2018, "referenceCount": 36, "citationCount": 47, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "27705232", "name": "Saqib Aziz"}, {"authorId": "145985638", "name": "M. Dowling"}]}, {"paperId": "80e51213b97060bd7b77bd3c41fa3f26ed1a6069", "url": "https://www.semanticscholar.org/paper/80e51213b97060bd7b77bd3c41fa3f26ed1a6069", "title": "ELM ∗ : distributed extreme learning machine with MapReduce", "abstract": null, "year": 2014, "referenceCount": 34, "citationCount": 51, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1759388", "name": "Junchang Xin"}, {"authorId": "2830834", "name": "Zhiqiong Wang"}, {"authorId": "2127380258", "name": "Chen Chen"}, {"authorId": "144300850", "name": "Linlin Ding"}, {"authorId": "8349792", "name": "Guoren Wang"}, {"authorId": "2124211783", "name": "Yuhai Zhao"}]}, {"paperId": "8fd0431186564148b8c0b8a30c363fe724ff320e", "url": "https://www.semanticscholar.org/paper/8fd0431186564148b8c0b8a30c363fe724ff320e", "title": "Adversarial Machine Learning for 5G Communications Security", "abstract": "—Machine learning provides automated means to capture complex dynamics of wireless spectrum and support better understanding of spectrum resources and their efﬁcient utilization. As communication systems become smarter with cognitive radio capabilities empowered by machine learning to perform critical tasks such as spectrum awareness and spectrum sharing, they also become susceptible to new vulnerabilities due to the attacks that target the machine learning applications. This paper identiﬁes the emerging attack surface of adversarial machine learning and corresponding attacks launched against wireless communications in the context of 5G systems. The focus is on attacks against (i) spectrum sharing of 5G communications with incumbent users such as in the Citizens Broadband Radio Service (CBRS) band and (ii) physical layer authentication of 5G User Equipment (UE) to support network slicing. For the ﬁrst attack, the adversary transmits during data transmission or spectrum sensing periods to manipulate the signal-level inputs to the deep learning classiﬁer that is deployed at the Environmental Sensing Capability (ESC) to support the 5G system. For the second attack, the adversary spoofs wireless signals with the generative adversarial network (GAN) to inﬁltrate the physical layer authentication mechanism based on a deep learning classiﬁer that is deployed at the 5G base station. Results indicate major vulnerabilities of 5G systems to adversarial machine learning. To sustain the 5G system operations in the presence of adversaries, a defense mechanism is presented to increase the uncertainty of the adversary in training the surrogate model used for launching its subsequent attacks.", "year": 2021, "referenceCount": 74, "citationCount": 18, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3099456", "name": "Y. Sagduyu"}, {"authorId": "3138942", "name": "T. Erpek"}, {"authorId": "2118897377", "name": "Yi Shi"}]}, {"paperId": "b84720c6a517c7db44c2ff54a082e1a98b765eed", "url": "https://www.semanticscholar.org/paper/b84720c6a517c7db44c2ff54a082e1a98b765eed", "title": "A brief survey of web data extraction tools", "abstract": "In the last few years, several works in the literature have addressed the problem of data extraction from Web pages. The importance of this problem derives from the fact that, once extracted, the data can be handled in a way similar to instances of a traditional database. The approaches proposed in the literature to address the problem of Web data extraction use techniques borrowed from areas such as natural language processing, languages and grammars, machine learning, information retrieval, databases, and ontologies. As a consequence, they present very distinct features and capabilities which make a direct comparison difficult to be done. In this paper, we propose a taxonomy for characterizing Web data extraction fools, briefly survey major Web data extraction tools described in the literature, and provide a qualitative analysis of them. Hopefully, this work will stimulate other studies aimed at a more comprehensive analysis of data extraction approaches and tools for Web data.", "year": 2002, "referenceCount": 50, "citationCount": 793, "influentialCitationCount": 24, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1764577", "name": "Alberto H. F. Laender"}, {"authorId": "1396785771", "name": "B. Ribeiro-Neto"}, {"authorId": "1690426", "name": "A. D. Silva"}, {"authorId": "2065541874", "name": "Juliana S. Teixeira"}]}, {"paperId": "dde6c11693ad4989e8dd5e4882a7eebef2897803", "url": "https://www.semanticscholar.org/paper/dde6c11693ad4989e8dd5e4882a7eebef2897803", "title": "Breast cancer detection by leveraging Machine Learning", "abstract": null, "year": 2020, "referenceCount": 11, "citationCount": 67, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1742228309", "name": "Anji Reddy Vaka"}, {"authorId": "48363943", "name": "B. Soni"}, {"authorId": "2006011740", "name": "K. SudheerReddy"}]}, {"paperId": "2ed569e4702cc85eb5baed234e8e17c0169b408c", "url": "https://www.semanticscholar.org/paper/2ed569e4702cc85eb5baed234e8e17c0169b408c", "title": "Machine learning applications in systems metabolic engineering.", "abstract": null, "year": 2020, "referenceCount": 62, "citationCount": 68, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "51213251", "name": "Gi Bae Kim"}, {"authorId": "32283843", "name": "W. Kim"}, {"authorId": "5483015", "name": "H. Kim"}, {"authorId": "1524514543", "name": "S. Lee"}]}, {"paperId": "e559eb6227a5e349b1179ce101462875aa7aa92c", "url": "https://www.semanticscholar.org/paper/e559eb6227a5e349b1179ce101462875aa7aa92c", "title": "On L1-Norm Multiclass Support Vector Machines", "abstract": "Binary support vector machines (SVMs) have been proven to deliver high performance. In multiclass classification, however, issues remain with respect to variable selection. One challenging issue is classification and variable selection in the presence of variables in the magnitude of thousands, greatly exceeding the size of training sample. This often occurs in genomics classification. To meet the challenge, this article proposes a novel multiclass support vector machine, which performs classification and variable selection simultaneously through an L1-norm penalized sparse representation. The proposed methodology, together with the developed regularization solution path, permits variable selection in such a situation. For the proposed methodology, a statistical learning theory is developed to quantify the generalization error in an attempt to gain insight into the basic structure of sparse learning, permitting the number of variables to greatly exceed the sample size. The operating characteristics of the methodology are examined through both simulated and benchmark data and are compared against some competitors in terms of accuracy of prediction. The numerical results suggest that the proposed methodology is highly competitive.", "year": 2007, "referenceCount": 33, "citationCount": 107, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "2108574176", "name": "Lifeng Wang"}, {"authorId": "2266946", "name": "Xiaotong Shen"}]}, {"paperId": "5d12eadd78a953c0abd346ab9e701e2e6bb851b3", "url": "https://www.semanticscholar.org/paper/5d12eadd78a953c0abd346ab9e701e2e6bb851b3", "title": "DNorm: disease name normalization with pairwise learning to rank", "abstract": "Motivation: Despite the central role of diseases in biomedical research, there have been much fewer attempts to automatically determine which diseases are mentioned in a text—the task of disease name normalization (DNorm)—compared with other normalization tasks in biomedical text mining research. Methods: In this article we introduce the first machine learning approach for DNorm, using the NCBI disease corpus and the MEDIC vocabulary, which combines MeSH® and OMIM. Our method is a high-performing and mathematically principled framework for learning similarities between mentions and concept names directly from training data. The technique is based on pairwise learning to rank, which has not previously been applied to the normalization task but has proven successful in large optimization problems for information retrieval. Results: We compare our method with several techniques based on lexical normalization and matching, MetaMap and Lucene. Our algorithm achieves 0.782 micro-averaged F-measure and 0.809 macro-averaged F-measure, an increase over the highest performing baseline method of 0.121 and 0.098, respectively. Availability: The source code for DNorm is available at http://www.ncbi.nlm.nih.gov/CBBresearch/Lu/Demo/DNorm, along with a web-based demonstration and links to the NCBI disease corpus. Results on PubMed abstracts are available in PubTator: http://www.ncbi.nlm.nih.gov/CBBresearch/Lu/Demo/PubTator Contact: zhiyong.lu@nih.gov", "year": 2013, "referenceCount": 49, "citationCount": 431, "influentialCitationCount": 48, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2277706", "name": "Robert Leaman"}, {"authorId": "34619326", "name": "R. Dogan"}, {"authorId": "144202084", "name": "Zhiyong Lu"}]}, {"paperId": "480b83e2b4caf7982d3352629aaced6366135c05", "url": "https://www.semanticscholar.org/paper/480b83e2b4caf7982d3352629aaced6366135c05", "title": "Machine learning based early warning system enables accurate mortality risk prediction for COVID-19", "abstract": null, "year": 2020, "referenceCount": 63, "citationCount": 139, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "2109219148", "name": "Yue Gao"}, {"authorId": "10830353", "name": "G. Cai"}, {"authorId": "2117160277", "name": "Wei Fang"}, {"authorId": "1992931079", "name": "Huayi Li"}, {"authorId": "2116420397", "name": "Si-yuan Wang"}, {"authorId": "49330538", "name": "Lingxi Chen"}, {"authorId": "1976144399", "name": "Yang Yu"}, {"authorId": "2146030777", "name": "Dan Liu"}, {"authorId": "47411434", "name": "Sen Xu"}, {"authorId": "2135616957", "name": "Peng-fei Cui"}, {"authorId": "6619023", "name": "S. Zeng"}, {"authorId": "4296151", "name": "Xinxia Feng"}, {"authorId": "1828806582", "name": "Ruidi Yu"}, {"authorId": "2115809516", "name": "Ya Wang"}, {"authorId": "2116522195", "name": "Yuan Yuan"}, {"authorId": "6284911", "name": "X. Jiao"}, {"authorId": "1828811107", "name": "J. Chi"}, {"authorId": "2108421023", "name": "Jiahao Liu"}, {"authorId": "1828759753", "name": "Ruyuan Li"}, {"authorId": "2110299220", "name": "Xu Zheng"}, {"authorId": "2116331773", "name": "Chunyan Song"}, {"authorId": "2057732451", "name": "Ning Jin"}, {"authorId": "30433388", "name": "Wenjian Gong"}, {"authorId": "2146035484", "name": "Xingchi Liu"}, {"authorId": "2109139298", "name": "Lei-lei Huang"}, {"authorId": "6430238", "name": "X. Tian"}, {"authorId": "2109137972", "name": "Lin Li"}, {"authorId": "2057292550", "name": "H. Xing"}, {"authorId": "144044362", "name": "D. Ma"}, {"authorId": "1915093", "name": "Chunrui Li"}, {"authorId": "1380827054", "name": "F. Ye"}, {"authorId": "3561386", "name": "Q. Gao"}]}, {"paperId": "66f3d4f231463720ed474bd4403dffa9208cc99c", "url": "https://www.semanticscholar.org/paper/66f3d4f231463720ed474bd4403dffa9208cc99c", "title": "Co-Designing Machine Learning Apps in K–12 With Primary School Children", "abstract": "Artificial intelligence and machine learning are making their ways rapidly to K–12 education. Google Teachable Machine, powered by convolutional neural networks, provides an easy-to-use yet powerful tool for classification tasks. We conducted a series of co-design workshops with primary school children, where they explored and designed their own machine learning powered applications with Google Teachable Machine. Our results show that Google Teachable Machine is a feasible tool for K–12 education. The trained machine learning models are lightweight and computationally efficient, and the applications are usable even with low-end mobile devices. The students and teachers appreciated the multidisciplinary and inclusive workshop, which supports development of transversal competencies in accordance to the national primary school curriculum.", "year": 2020, "referenceCount": 14, "citationCount": 20, "influentialCitationCount": 2, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "38061542", "name": "Tapani Toivonen"}, {"authorId": "1791529", "name": "I. Jormanainen"}, {"authorId": "118866790", "name": "Juho Kahila"}, {"authorId": "144523037", "name": "M. Tedre"}, {"authorId": "2305400", "name": "Teemu Valtonen"}, {"authorId": "2405282", "name": "Henriikka Vartiainen"}]}, {"paperId": "f3237a7c37951e9e0386497f074f5bc6fde8ffa3", "url": "https://www.semanticscholar.org/paper/f3237a7c37951e9e0386497f074f5bc6fde8ffa3", "title": "Recent research advances on interactive machine learning", "abstract": null, "year": 2018, "referenceCount": 131, "citationCount": 51, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2343630", "name": "Liu Jiang"}, {"authorId": "48641970", "name": "Shixia Liu"}, {"authorId": "48240660", "name": "Changjian Chen"}]}, {"paperId": "406200622d3a470e07b67bec7c8c93b8521003ed", "url": "https://www.semanticscholar.org/paper/406200622d3a470e07b67bec7c8c93b8521003ed", "title": "Practical Face Recognition and Verification with Wisard", "abstract": null, "year": 1986, "referenceCount": 0, "citationCount": 118, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145564802", "name": "T. Stonham"}]}, {"paperId": "0a4804b7bbc943073c3fa7693035be7fd017e324", "url": "https://www.semanticscholar.org/paper/0a4804b7bbc943073c3fa7693035be7fd017e324", "title": "Deep Learning in Label-free Cell Classification", "abstract": null, "year": 2016, "referenceCount": 74, "citationCount": 343, "influentialCitationCount": 4, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "2895250", "name": "C. Chen"}, {"authorId": "1817594", "name": "A. Mahjoubfar"}, {"authorId": "46814899", "name": "L. Tai"}, {"authorId": "5612465", "name": "I. Blaby"}, {"authorId": "153172901", "name": "A. Huang"}, {"authorId": "144756614", "name": "K. Niazi"}, {"authorId": "48368645", "name": "B. Jalali"}]}, {"paperId": "cff8c426aef07c8e933bd63000ac8ee22e566cdb", "url": "https://www.semanticscholar.org/paper/cff8c426aef07c8e933bd63000ac8ee22e566cdb", "title": "Automated Machine Learning: The New Wave of Machine Learning", "abstract": "With the explosion in the use of machine learning in various domains, the need for an efficient pipeline for the development of machine learning models has never been more critical. However, the task of forming and training models largely remains traditional with a dependency on domain experts and time-consuming data manipulation operations, which impedes the development of machine learning models in both academia as well as industry. This demand advocates the new research era concerned with fitting machine learning models fully automatically i.e., AutoML. Automated Machine Learning(AutoML) is an end-to-end process that aims at automating this model development pipeline without any external assistance. First, we provide an insights of AutoML. Second, we delve into the individual segments in the AutoML pipeline and cover their approaches in brief. We also provide a case study on the industrial use and impact of AutoML with a focus on practical applicability in a business context. At last, we conclude with the open research issues, and future research directions.", "year": 2020, "referenceCount": 44, "citationCount": 25, "influentialCitationCount": 0, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1654094726", "name": "Karansingh Chauhan"}, {"authorId": "1654097507", "name": "Shreena Jani"}, {"authorId": "1654097494", "name": "Dhrumin Thakkar"}, {"authorId": "1654099439", "name": "Riddham Dave"}, {"authorId": "39896776", "name": "Jitendra Bhatia"}, {"authorId": "49252696", "name": "S. Tanwar"}, {"authorId": "1747075", "name": "M. Obaidat"}]}, {"paperId": "311a0a5139175794cf92382e4cfae957a12752d6", "url": "https://www.semanticscholar.org/paper/311a0a5139175794cf92382e4cfae957a12752d6", "title": "Efficient and Private Scoring of Decision Trees, Support Vector Machines and Logistic Regression Models Based on Pre-Computation", "abstract": "Many data-driven personalized services require that private data of users is scored against a trained machine learning model. In this paper we propose a novel protocol for privacy-preserving classification of decision trees, a popular machine learning model in these scenarios. Our solutions is composed out of building blocks, namely a secure comparison protocol, a protocol for obliviously selecting inputs, and a protocol for multiplication. By combining some of the building blocks for our decision tree classification protocol, we also improve previously proposed solutions for classification of support vector machines and logistic regression models. Our protocols are information theoretically secure and, unlike previously proposed solutions, do not require modular exponentiations. We show that our protocols for privacy-preserving classification lead to more efficient results from the point of view of computational and communication complexities. We present accuracy and runtime results for seven classification benchmark datasets from the UCI repository.", "year": 2019, "referenceCount": 61, "citationCount": 85, "influentialCitationCount": 8, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "134381862", "name": "Martine De Cock"}, {"authorId": "1700846", "name": "Rafael Dowsley"}, {"authorId": "50362765", "name": "Caleb Horst"}, {"authorId": "1692745", "name": "R. Katti"}, {"authorId": "143961127", "name": "Anderson C. A. Nascimento"}, {"authorId": "3443170", "name": "W. Poon"}, {"authorId": "25121568", "name": "Stacey Truex"}]}, {"paperId": "3c5f17ba04676574d95fac3d0687fe642ceb1dda", "url": "https://www.semanticscholar.org/paper/3c5f17ba04676574d95fac3d0687fe642ceb1dda", "title": "QoT estimation for unestablished lighpaths using machine learning", "abstract": "We investigate a machine-learning technique that predicts whether the bit-error-rate of unestablished lightpaths meets the required threshold based on traffic volume, desired route and modulation format. The system is trained and tested on synthetic data.", "year": 2017, "referenceCount": 7, "citationCount": 79, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1823877", "name": "L. Barletta"}, {"authorId": "33354551", "name": "A. Giusti"}, {"authorId": "2370043", "name": "C. Rottondi"}, {"authorId": "1759410", "name": "M. Tornatore"}]}, {"paperId": "e02bc29aa007d0f4dcfe98e89776c66a991c458d", "url": "https://www.semanticscholar.org/paper/e02bc29aa007d0f4dcfe98e89776c66a991c458d", "title": "Non-negative low rank and sparse graph for semi-supervised learning", "abstract": "Constructing a good graph to represent data structures is critical for many important machine learning tasks such as clustering and classification. This paper proposes a novel non-negative low-rank and sparse (NNLRS) graph for semi-supervised learning. The weights of edges in the graph are obtained by seeking a nonnegative low-rank and sparse matrix that represents each data sample as a linear combination of others. The so-obtained NNLRS-graph can capture both the global mixture of subspaces structure (by the low rankness) and the locally linear structure (by the sparseness) of the data, hence is both generative and discriminative. We demonstrate the effectiveness of NNLRS-graph in semi-supervised classification and discriminative analysis. Extensive experiments testify to the significant advantages of NNLRS-graph over graphs obtained through conventional means.", "year": 2012, "referenceCount": 26, "citationCount": 301, "influentialCitationCount": 31, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1734743", "name": "Liansheng Zhuang"}, {"authorId": "2345388", "name": "Haoyuan Gao"}, {"authorId": "33383055", "name": "Zhouchen Lin"}, {"authorId": "2146275501", "name": "Yi Ma"}, {"authorId": "2155051858", "name": "Xin Zhang"}, {"authorId": "1708598", "name": "Nenghai Yu"}]}, {"paperId": "6c150bb1050d7997139f09a935f41e230b6e77cc", "url": "https://www.semanticscholar.org/paper/6c150bb1050d7997139f09a935f41e230b6e77cc", "title": "Simpler knowledge-based support vector machines", "abstract": "If appropriately used, prior knowledge can significantly improve the predictive accuracy of learning algorithms or reduce the amount of training data needed. In this paper we introduce a simple method to incorporate prior knowledge in support vector machines by modifying the hypothesis space rather than the optimization problem. The optimization problem is amenable to solution by the constrained concave convex procedure, which finds a local optimum. The paper discusses different kinds of prior knowledge and demonstrates the applicability of the approach in some characteristic experiments.", "year": 2006, "referenceCount": 31, "citationCount": 39, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2827616", "name": "Quoc V. Le"}, {"authorId": "46234526", "name": "Alex Smola"}, {"authorId": "1693945", "name": "Thomas Gärtner"}]}, {"paperId": "999f0acfac28215db2e4c69ff42711fd4f56511d", "url": "https://www.semanticscholar.org/paper/999f0acfac28215db2e4c69ff42711fd4f56511d", "title": "Machine Comprehension with Syntax, Frames, and Semantics", "abstract": "We demonstrate significant improvement on the MCTest question answering task (Richardson et al., 2013) by augmenting baseline features with features based on syntax, frame semantics, coreference, and word embeddings, and combining them in a max-margin learning framework. We achieve the best results we are aware of on this dataset, outperforming concurrentlypublished results. These results demonstrate a significant performance gradient for the use of linguistic structure in machine comprehension.", "year": 2015, "referenceCount": 33, "citationCount": 102, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2113221447", "name": "Hai Wang"}, {"authorId": "143977268", "name": "Mohit Bansal"}, {"authorId": "1700980", "name": "Kevin Gimpel"}, {"authorId": "145689002", "name": "David A. McAllester"}]}, {"paperId": "c1f493e9e193e56ebcba85b32e7efc8d71dd7dc8", "url": "https://www.semanticscholar.org/paper/c1f493e9e193e56ebcba85b32e7efc8d71dd7dc8", "title": "Machine learning for characterizing risk of type 2 diabetes mellitus in a rural Chinese population: the Henan Rural Cohort Study", "abstract": null, "year": 2020, "referenceCount": 72, "citationCount": 52, "influentialCitationCount": 1, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Medicine"], "authors": [{"authorId": "2118354311", "name": "Liying Zhang"}, {"authorId": "2108853239", "name": "Yikang Wang"}, {"authorId": "49841352", "name": "M. Niu"}, {"authorId": "2142951", "name": "Chongjian Wang"}, {"authorId": "47196624", "name": "Zhenfei Wang"}]}, {"paperId": "03c1db0b27621c051da7780c2fa72e012c7a726e", "url": "https://www.semanticscholar.org/paper/03c1db0b27621c051da7780c2fa72e012c7a726e", "title": "Kohonen feature maps as a supervised learning machine", "abstract": "Kohonen feature maps as a supervised learning machine are proposed and discussed. The proposed models adopt supervised learning without modifying the basic learning algorithm. They behave as a supervised learning machine, which can learn input-output functions in addition to the characteristics of the conventional Kohonen feature maps. In the pattern recognition problems, the proposed models can structure the recognition system more simply than the conventional method, i.e., structuring a pattern recognition machine using a supervised learning machine after pre-processing by the Kohonen feature map. The proposed models do not distinguish the input vectors from the desired vectors because they regard them as the same kind of vectors. Several examples are simulated in order to compare with the conventional supervised learning machines. The results indicate the effectiveness of the proposed models.<<ETX>>", "year": 1993, "referenceCount": 5, "citationCount": 40, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2085100318", "name": "H. Ichiki"}, {"authorId": "145719769", "name": "M. Hagiwara"}, {"authorId": "1747731", "name": "M. Nakagawa"}]}, {"paperId": "639bc5a8144cce90711993a1e860359ce70b2d0f", "url": "https://www.semanticscholar.org/paper/639bc5a8144cce90711993a1e860359ce70b2d0f", "title": "Is inductive machine learning just another wild goose (or might it lay the golden egg)?", "abstract": "The research reported here contrasts the roles, methodologies and capabilities of statistical methods with those of inductive machine learning methods, as they are used inferentially in geographical analysis. To this end, various established problems with statistical inference applied in geographical settings are reviewed, based on Gould's (1970) critique. Possible solutions to the problems outlined by Gould are suggested via reviews of: (i) improved statistical methods, and (ii) recent inductive machine learning techniques. Following this, some newer problems with inference are described, emerging from the increased complexity of geographical datasets and from the analysis tasks to which we put them. Again, some solutions are suggested by pointing to newer methods. By way of results, questions are posed, and answered, relating to the changes brought about by adopting inductive machine learning methods for geographical analysis. Specifically, these questions relate to analysis capabilities, methodologies, the role of the geographer and consequences for teaching and learning. Conclusions argue that there is now a strong need, motivated from many perspectives, to give geographical data a stronger voice, thus favouring techniques that minimize the prior assumptions made of a dataset.", "year": 2003, "referenceCount": 120, "citationCount": 76, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1801583", "name": "M. Gahegan"}]}]}