{"total": 5814519, "offset": 500, "next": 600, "data": [{"paperId": "f7eb3e6221dc7bbe5eda0ce796755f5d71e7d61a", "url": "https://www.semanticscholar.org/paper/f7eb3e6221dc7bbe5eda0ce796755f5d71e7d61a", "title": "Machine learning in adversarial environments", "abstract": null, "year": 2010, "referenceCount": 29, "citationCount": 129, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1754215", "name": "P. Laskov"}, {"authorId": "144990248", "name": "R. Lippmann"}]}, {"paperId": "5176a2f31dace77db9135dde7020d2c37f78cca0", "url": "https://www.semanticscholar.org/paper/5176a2f31dace77db9135dde7020d2c37f78cca0", "title": "The Elements of Statistical Learning: Data Mining, Inference, and Prediction", "abstract": "In the words of the authors, the goal of this book was to “bring together many of the important new ideas in learning, and explain them in a statistical framework.” The authors have been quite successful in achieving this objective, and their work is a welcome addition to the statistics and learning literatures. Statistics has always been interdisciplinary, borrowing ideas from diverse \u008e elds and repaying the debt with contributions, both theoretical and practical, to the other intellectual disciplines. For statistical learning, this cross-fertilization is especially noticeable. This book is a valuable resource, both for the statistician needing an introduction to machine learning and related \u008e elds and for the computer scientist wishing to learn more about statistics. Statisticians will especially appreciate that it is written in their own language. The level of the book is roughly that of a second-year doctoral student in statistics, and it will be useful as a textbook for such students. In a stimulating article, Breiman (2001) argued that statistics has been focused too much on a “data modeling culture,” where the model is paramount. Breiman argued instead for an “algorithmic modeling culture,” with emphasis on black-box types of prediction. Breiman’s article is controversial, and in his discussion, Efron objects that “prediction is certainly an interesting subject, but Leo’s paper overstates both its role and our profession’s lack of interest in it.” Although I mostly agree with Efron, I worry that the courses offered by most statistics departments include little, if any, treatment of statistical learning and prediction. (Stanford, where Efron and the authors of this book teach, is an exception.) Graduate students in statistics certainly need to know more than they do now about prediction, machine learning, statistical learning, and data mining (not disjoint subjects). I hope that graduate courses covering the topics of this book will become more common in statistics curricula. Most of the book is focused on supervised learning, where one has inputs and outputs from some system and wishes to predict unknown outputs corresponding to known inputs. The methods discussed for supervised learning include linear and logistic regression; basis expansion, such as splines and wavelets; kernel techniques, such as local regression, local likelihood, and radial basis functions; neural networks; additive models; decision trees based on recursive partitioning, such as CART; and support vector machines. There is a \u008e nal chapter on unsupervised learning, including association rules, cluster analysis, self-organizing maps, principal components and curves, and independent component analysis. Many statisticians will be unfamiliar with at least some of these algorithms. Association rules are popular for mining commercial data in what is called “market basket analysis.” The aim is to discover types of products often purchased together. Such knowledge can be used to develop marketing strategies, such as store or catalog layouts. Self-organizing maps (SOMs) involve essentially constrained k-means clustering, where prototypes are mapped to a two-dimensional curved coordinate system. Independent components analysis is similar to principal components analysis and factor analysis, but it uses higher-order moments to achieve independence, not merely zero correlation between components. A strength of the book is the attempt to organize a plethora of methods into a coherent whole. The relationships among the methods are emphasized. I know of no other book that covers so much ground. Of course, with such broad coverage, it is not possible to cover any single topic in great depth, so this book will encourage further reading. Fortunately, each chapter includes bibliographic notes surveying the recent literature. These notes and the extensive references provide a good introduction to the learning literature, including much outside of statistics. The book might be more suitable as a textbook if less material were covered in greater depth; however, such a change would compromise the book’s usefulness as a reference, and so I am happier with the book as it was written.", "year": 2004, "referenceCount": 2, "citationCount": 15322, "influentialCitationCount": 1843, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "144108246", "name": "D. Ruppert"}]}, {"paperId": "01f702f8b1f9d1314587015f1f038af4d5735e77", "url": "https://www.semanticscholar.org/paper/01f702f8b1f9d1314587015f1f038af4d5735e77", "title": "Opposition-Based Learning: A New Scheme for Machine Intelligence", "abstract": "Opposition-based learning as a new scheme for machine intelligence is introduced. Estimates and counter-estimates, weights and opposite weights, and actions versus counter-actions are the foundation of this new approach. Examples are provided. Possibilities for extensions of existing learning algorithms are discussed. Preliminary results are provided", "year": 2005, "referenceCount": 9, "citationCount": 1272, "influentialCitationCount": 142, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9315255", "name": "H. Tizhoosh"}]}, {"paperId": "d05d86db86a4ac0d95e6dcd951b42a9651939793", "url": "https://www.semanticscholar.org/paper/d05d86db86a4ac0d95e6dcd951b42a9651939793", "title": "Deep Learning Approach for Intelligent Intrusion Detection System", "abstract": "Machine learning techniques are being widely used to develop an intrusion detection system (IDS) for detecting and classifying cyberattacks at the network-level and the host-level in a timely and automatic manner. However, many challenges arise since malicious attacks are continually changing and are occurring in very large volumes requiring a scalable solution. There are different malware datasets available publicly for further research by cyber security community. However, no existing study has shown the detailed analysis of the performance of various machine learning algorithms on various publicly available datasets. Due to the dynamic nature of malware with continuously changing attacking methods, the malware datasets available publicly are to be updated systematically and benchmarked. In this paper, a deep neural network (DNN), a type of deep learning model, is explored to develop a flexible and effective IDS to detect and classify unforeseen and unpredictable cyberattacks. The continuous change in network behavior and rapid evolution of attacks makes it necessary to evaluate various datasets which are generated over the years through static and dynamic approaches. This type of study facilitates to identify the best algorithm which can effectively work in detecting future cyberattacks. A comprehensive evaluation of experiments of DNNs and other classical machine learning classifiers are shown on various publicly available benchmark malware datasets. The optimal network parameters and network topologies for DNNs are chosen through the following hyperparameter selection methods with KDDCup 99 dataset. All the experiments of DNNs are run till 1,000 epochs with the learning rate varying in the range [0.01–0.5]. The DNN model which performed well on KDDCup 99 is applied on other datasets, such as NSL-KDD, UNSW-NB15, Kyoto, WSN-DS, and CICIDS 2017, to conduct the benchmark. Our DNN model learns the abstract and high-dimensional feature representation of the IDS data by passing them into many hidden layers. Through a rigorous experimental testing, it is confirmed that DNNs perform well in comparison with the classical machine learning classifiers. Finally, we propose a highly scalable and hybrid DNNs framework called scale-hybrid-IDS-AlertNet which can be used in real-time to effectively monitor the network traffic and host-level events to proactively alert possible cyberattacks.", "year": 2019, "referenceCount": 85, "citationCount": 546, "influentialCitationCount": 24, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "51162051", "name": "R. Vinayakumar"}, {"authorId": "2474250", "name": "M. Alazab"}, {"authorId": "144456263", "name": "K. Soman"}, {"authorId": "2916235", "name": "P. Poornachandran"}, {"authorId": "1399133087", "name": "Ameer Al-Nemrat"}, {"authorId": "145710905", "name": "S. Venkatraman"}]}, {"paperId": "6ffe8872748d183d792c1b45aa5e4eb3b2116741", "url": "https://www.semanticscholar.org/paper/6ffe8872748d183d792c1b45aa5e4eb3b2116741", "title": "The immune system, adaptation, and machine learning", "abstract": null, "year": 1986, "referenceCount": 23, "citationCount": 1403, "influentialCitationCount": 69, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145394227", "name": "J. D. Farmer"}, {"authorId": "2078655", "name": "N. Packard"}, {"authorId": "1832489", "name": "A. Perelson"}]}, {"paperId": "cd49acefc8d51e324aa562e5337e1c2aff067053", "url": "https://www.semanticscholar.org/paper/cd49acefc8d51e324aa562e5337e1c2aff067053", "title": "An Overview of Multi-task Learning", "abstract": "As a promising area in machine learning, multi-task learning (MTL) aims to improve the performance of multiple related learning tasks by leveraging useful information among them. In this paper, we give an overview of MTL by first giving a definition of MTL. Then several different settings of MTL are introduced, including multi-task supervised learning, multi-task unsupervised learning, multi-task semi-supervised learning, multi-task active learning, multi-task reinforcement learning, multi-task online learning and multi-task multi-view learning. For each setting, representative MTL models are presented. In order to speed up the learning process, parallel and distributed MTL models are introduced. Many areas, including computer vision, bioinformatics, health informatics, speech, natural language processing, web applications and ubiquitous computing, use MTL to improve the performance of the applications involved and some representative works are reviewed. Finally, recent theoretical analyses for MTL are presented.", "year": 2018, "referenceCount": 135, "citationCount": 949, "influentialCitationCount": 29, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "46867608", "name": "Yu Zhang"}, {"authorId": "153096457", "name": "Qiang Yang"}]}, {"paperId": "c99179ca3784e3465fd9ed049d7f34b50d39393e", "url": "https://www.semanticscholar.org/paper/c99179ca3784e3465fd9ed049d7f34b50d39393e", "title": "Ensemble learning: A survey", "abstract": "Ensemble methods are considered the state‐of‐the art solution for many machine learning challenges. Such methods improve the predictive performance of a single model by training multiple models and combining their predictions. This paper introduce the concept of ensemble learning, reviews traditional, novel and state‐of‐the‐art ensemble methods and discusses current challenges and trends in the field.", "year": 2018, "referenceCount": 167, "citationCount": 866, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2066733832", "name": "Omer Sagi"}, {"authorId": "1732091", "name": "L. Rokach"}]}, {"paperId": "36dd3331060e5e6157d9558563b95253308709cb", "url": "https://www.semanticscholar.org/paper/36dd3331060e5e6157d9558563b95253308709cb", "title": "Machine learning: a review of classification and combining techniques", "abstract": null, "year": 2006, "referenceCount": 155, "citationCount": 958, "influentialCitationCount": 38, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1697867", "name": "S. Kotsiantis"}, {"authorId": "3194855", "name": "I. Zaharakis"}, {"authorId": "1725504", "name": "P. Pintelas"}]}, {"paperId": "48cc41c7b2fac21d7bbd2988c5c6a2c5f9744852", "url": "https://www.semanticscholar.org/paper/48cc41c7b2fac21d7bbd2988c5c6a2c5f9744852", "title": "Deep learning for cellular image analysis", "abstract": null, "year": 2019, "referenceCount": 185, "citationCount": 527, "influentialCitationCount": 5, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2065614284", "name": "Erick Moen"}, {"authorId": "91548448", "name": "Dylan Bannon"}, {"authorId": "5864924", "name": "Takamasa Kudo"}, {"authorId": "2054090660", "name": "William Graf"}, {"authorId": "2835805", "name": "M. Covert"}, {"authorId": "6838746", "name": "David Van Valen"}]}, {"paperId": "96b0c9ca2c50ae7243086cea755789eac14d5eef", "url": "https://www.semanticscholar.org/paper/96b0c9ca2c50ae7243086cea755789eac14d5eef", "title": "Deep learning: new computational modelling techniques for genomics", "abstract": null, "year": 2019, "referenceCount": 150, "citationCount": 524, "influentialCitationCount": 9, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "38086241", "name": "Gökçen Eraslan"}, {"authorId": "52204747", "name": "Žiga Avsec"}, {"authorId": "89030634", "name": "J. Gagneur"}, {"authorId": "2958299", "name": "Fabian J Theis"}]}, {"paperId": "0bfc6add0390f1b4cfbd0e90ac71475cca88b2d5", "url": "https://www.semanticscholar.org/paper/0bfc6add0390f1b4cfbd0e90ac71475cca88b2d5", "title": "A Review on Multi-Label Learning Algorithms", "abstract": "Multi-label learning studies the problem where each example is represented by a single instance while associated with a set of labels simultaneously. During the past decade, significant amount of progresses have been made toward this emerging machine learning paradigm. This paper aims to provide a timely review on this area with emphasis on state-of-the-art multi-label learning algorithms. Firstly, fundamentals on multi-label learning including formal definition and evaluation metrics are given. Secondly and primarily, eight representative multi-label learning algorithms are scrutinized under common notations with relevant analyses and discussions. Thirdly, several related learning settings are briefly summarized. As a conclusion, online resources and open research problems on multi-label learning are outlined for reference purposes.", "year": 2014, "referenceCount": 201, "citationCount": 2102, "influentialCitationCount": 182, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3039887", "name": "Min-Ling Zhang"}, {"authorId": "145624000", "name": "Zhi-Hua Zhou"}]}, {"paperId": "e6cb9e80d1894bbb01882523137145d81dfb0a3c", "url": "https://www.semanticscholar.org/paper/e6cb9e80d1894bbb01882523137145d81dfb0a3c", "title": "The SHOGUN Machine Learning Toolbox", "abstract": "We have developed a machine learning toolbox, called SHOGUN, which is designed for unified large-scale learning for a broad range of feature types and learning settings. It offers a considerable number of machine learning models such as support vector machines, hidden Markov models, multiple kernel learning, linear discriminant analysis, and more. Most of the specific algorithms are able to deal with several different data classes. We have used this toolbox in several applications from computational biology, some of them coming with no less than 50 million training examples and others with 7 billion test examples. With more than a thousand installations worldwide, SHOGUN is already widely adopted in the machine learning community and beyond. \n \nSHOGUN is implemented in C++ and interfaces to MATLABTM, R, Octave, Python, and has a stand-alone command line interface. The source code is freely available under the GNU General Public License, Version 3 at http://www.shogun-toolbox.org.", "year": 2010, "referenceCount": 11, "citationCount": 292, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3029782", "name": "S. Sonnenburg"}, {"authorId": "2414086", "name": "G. Rätsch"}, {"authorId": "2574834", "name": "S. Henschel"}, {"authorId": "3263887", "name": "Christian Widmer"}, {"authorId": "2094634", "name": "Jonas Behr"}, {"authorId": "2281542", "name": "A. Zien"}, {"authorId": "1933978557", "name": "F. D. Bona"}, {"authorId": "49345823", "name": "Alexander Binder"}, {"authorId": "2140119", "name": "C. Gehl"}, {"authorId": "1778663", "name": "Vojtech Franc"}]}, {"paperId": "395dd01c0d24777c660cf195c4cfadcdf51fb7e8", "url": "https://www.semanticscholar.org/paper/395dd01c0d24777c660cf195c4cfadcdf51fb7e8", "title": "Learning to learn by gradient descent by gradient descent", "abstract": "The move from hand-designed features to learned features in machine learning has been wildly successful. In spite of this, optimization algorithms are still designed by hand. In this paper we show how the design of an optimization algorithm can be cast as a learning problem, allowing the algorithm to learn to exploit structure in the problems of interest in an automatic way. Our learned algorithms, implemented by LSTMs, outperform generic, hand-designed competitors on the tasks for which they are trained, and also generalize well to new tasks with similar structure. We demonstrate this on a number of tasks, including simple convex problems, training neural networks, and styling images with neural art.", "year": 2016, "referenceCount": 42, "citationCount": 1484, "influentialCitationCount": 166, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2206490", "name": "Marcin Andrychowicz"}, {"authorId": "1715051", "name": "Misha Denil"}, {"authorId": "2016840", "name": "Sergio Gomez Colmenarejo"}, {"authorId": "3243579", "name": "Matthew W. Hoffman"}, {"authorId": "144846367", "name": "D. Pfau"}, {"authorId": "1725157", "name": "T. Schaul"}, {"authorId": "1737568", "name": "N. D. Freitas"}]}, {"paperId": "7ab0f0da686cd4094fd96f5a30e0b6072525fd09", "url": "https://www.semanticscholar.org/paper/7ab0f0da686cd4094fd96f5a30e0b6072525fd09", "title": "Deep Learning in Medical Image Analysis.", "abstract": "This review covers computer-assisted analysis of images in the field of medical imaging. Recent advances in machine learning, especially with regard to deep learning, are helping to identify, classify, and quantify patterns in medical images. At the core of these advances is the ability to exploit hierarchical feature representations learned solely from data, instead of features designed by hand according to domain-specific knowledge. Deep learning is rapidly becoming the state of the art, leading to enhanced performance in various medical applications. We introduce the fundamentals of deep learning methods and review their successes in image registration, detection of anatomical and cellular structures, tissue segmentation, computer-aided disease diagnosis and prognosis, and so on. We conclude by discussing research issues and suggesting future directions for further improvement.", "year": 2017, "referenceCount": 127, "citationCount": 1470, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Medicine", "Computer Science"], "authors": [{"authorId": "144986260", "name": "D. Shen"}, {"authorId": "46531894", "name": "Guorong Wu"}, {"authorId": "143802908", "name": "Heung-Il Suk"}]}, {"paperId": "4b61c25a86083c20730c9b12737ac6ac4178c364", "url": "https://www.semanticscholar.org/paper/4b61c25a86083c20730c9b12737ac6ac4178c364", "title": "An Introduction to Deep Reinforcement Learning", "abstract": "Deep reinforcement learning is the combination of reinforcement learning (RL) and deep learning. This field of research has been able to solve a wide range of complex decision-making tasks that were previously out of reach for a machine. Thus, deep RL opens up many new applications in domains such as healthcare, robotics, smart grids, finance, and many more. This manuscript provides an introduction to deep reinforcement learning models, algorithms and techniques. Particular focus is on the aspects related to generalization and how deep RL can be used for practical applications. We assume the reader is familiar with basic machine learning concepts.", "year": 2018, "referenceCount": 355, "citationCount": 606, "influentialCitationCount": 41, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1389921282", "name": "Vincent François-Lavet"}, {"authorId": "40068904", "name": "Peter Henderson"}, {"authorId": "18014232", "name": "Riashat Islam"}, {"authorId": "1792298", "name": "Marc G. Bellemare"}, {"authorId": "145134886", "name": "Joelle Pineau"}]}, {"paperId": "5c04f8002e24a8c09bfbfedca3c6c346fe1e5d53", "url": "https://www.semanticscholar.org/paper/5c04f8002e24a8c09bfbfedca3c6c346fe1e5d53", "title": "An Introduction to Support Vector Machines and Other Kernel-based Learning Methods", "abstract": "From the publisher: This is the first comprehensive introduction to Support Vector Machines (SVMs), a new generation learning system based on recent advances in statistical learning theory. SVMs deliver state-of-the-art performance in real-world applications such as text categorisation, hand-written character recognition, image classification, biosequences analysis, etc., and are now established as one of the standard tools for machine learning and data mining. Students will find the book both stimulating and accessible, while practitioners will be guided smoothly through the material required for a good grasp of the theory and its applications. The concepts are introduced gradually in accessible and self-contained stages, while the presentation is rigorous and thorough. Pointers to relevant literature and web sites containing software ensure that it forms an ideal starting point for further study. Equally, the book and its associated web site will guide practitioners to updated literature, new applications, and on-line software.", "year": 2000, "referenceCount": 27, "citationCount": 13846, "influentialCitationCount": 1176, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "1685083", "name": "N. Cristianini"}, {"authorId": "1404459229", "name": "J. Shawe-Taylor"}]}, {"paperId": "cb8a1b8d87a3fef15635eb4a32173f9c6f966055", "url": "https://www.semanticscholar.org/paper/cb8a1b8d87a3fef15635eb4a32173f9c6f966055", "title": "A Survey on Deep Learning", "abstract": "The field of machine learning is witnessing its golden era as deep learning slowly becomes the leader in this domain. Deep learning uses multiple layers to represent the abstractions of data to build computational models. Some key enabler deep learning algorithms such as generative adversarial networks, convolutional neural networks, and model transfers have completely changed our perception of information processing. However, there exists an aperture of understanding behind this tremendously fast-paced domain, because it was never previously represented from a multiscope perspective. The lack of core understanding renders these powerful methods as black-box machines that inhibit development at a fundamental level. Moreover, deep learning has repeatedly been perceived as a silver bullet to all stumbling blocks in machine learning, which is far from the truth. This article presents a comprehensive review of historical and recent state-of-the-art approaches in visual, audio, and text processing; social network analysis; and natural language processing, followed by the in-depth analysis on pivoting and groundbreaking advances in deep learning applications. It was also undertaken to review the issues faced in deep learning such as unsupervised learning, black-box models, and online learning and to illustrate how these challenges can be transformed into prolific future research avenues.", "year": 2018, "referenceCount": 183, "citationCount": 410, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1997924", "name": "Samira Pouyanfar"}, {"authorId": "8062083", "name": "Saad Sadiq"}, {"authorId": "39588413", "name": "Yilin Yan"}, {"authorId": "2229900", "name": "Haiman Tian"}, {"authorId": "2868174", "name": "Yudong Tao"}, {"authorId": "39611894", "name": "Maria E. Presa-Reyes"}, {"authorId": "144987531", "name": "M. Shyu"}, {"authorId": "1705664", "name": "Shu‐Ching Chen"}, {"authorId": "153093860", "name": "S. S. Iyengar"}]}, {"paperId": "b57e6468740d9320f3f14c6079168b8e21366416", "url": "https://www.semanticscholar.org/paper/b57e6468740d9320f3f14c6079168b8e21366416", "title": "The History Began from AlexNet: A Comprehensive Survey on Deep Learning Approaches", "abstract": "Deep learning has demonstrated tremendous success in variety of application domains in the past few years. This new field of machine learning has been growing rapidly and applied in most of the application domains with some new modalities of applications, which helps to open new opportunity. There are different methods have been proposed on different category of learning approaches, which includes supervised, semi-supervised and un-supervised learning. The experimental results show state-of-the-art performance of deep learning over traditional machine learning approaches in the field of Image Processing, Computer Vision, Speech Recognition, Machine Translation, Art, Medical imaging, Medical information processing, Robotics and control, Bio-informatics, Natural Language Processing (NLP), Cyber security, and many more. This report presents a brief survey on development of DL approaches, including Deep Neural Network (DNN), Convolutional Neural Network (CNN), Recurrent Neural Network (RNN) including Long Short Term Memory (LSTM) and Gated Recurrent Units (GRU), Auto-Encoder (AE), Deep Belief Network (DBN), Generative Adversarial Network (GAN), and Deep Reinforcement Learning (DRL). In addition, we have included recent development of proposed advanced variant DL techniques based on the mentioned DL approaches. Furthermore, DL approaches have explored and evaluated in different application domains are also included in this survey. We have also comprised recently developed frameworks, SDKs, and benchmark datasets that are used for implementing and evaluating deep learning approaches. There are some surveys have published on Deep Learning in Neural Networks [1, 38] and a survey on RL [234]. However, those papers have not discussed the individual advanced techniques for training large scale deep learning models and the recently developed method of generative models [1].", "year": 2018, "referenceCount": 287, "citationCount": 498, "influentialCitationCount": 56, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1932404", "name": "Md. Zahangir Alom"}, {"authorId": "1799779", "name": "T. Taha"}, {"authorId": "2498059", "name": "C. Yakopcic"}, {"authorId": "40893684", "name": "Stefan Westberg"}, {"authorId": "2325550", "name": "P. Sidike"}, {"authorId": "100898809", "name": "M. S. Nasrin"}, {"authorId": "32977294", "name": "B. V. Essen"}, {"authorId": "144948131", "name": "A. Awwal"}, {"authorId": "2401900", "name": "V. Asari"}]}, {"paperId": "38aff6df1accc456f6cda7d16d4b9ecf418ef21e", "url": "https://www.semanticscholar.org/paper/38aff6df1accc456f6cda7d16d4b9ecf418ef21e", "title": "Map-Reduce for Machine Learning on Multicore", "abstract": "We are at the beginning of the multicore era. Computers will have increasingly many cores (processors), but there is still no good programming framework for these architectures, and thus no simple and unified way for machine learning to take advantage of the potential speed up. In this paper, we develop a broadly applicable parallel programming method, one that is easily applied to many different learning algorithms. Our work is in distinct contrast to the tradition in machine learning of designing (often ingenious) ways to speed up a single algorithm at a time. Specifically, we show that algorithms that fit the Statistical Query model [15] can be written in a certain \"summation form,\" which allows them to be easily parallelized on multicore computers. We adapt Google's map-reduce [7] paradigm to demonstrate this parallel speed up technique on a variety of learning algorithms including locally weighted linear regression (LWLR), k-means, logistic regression (LR), naive Bayes (NB), SVM, ICA, PCA, gaussian discriminant analysis (GDA), EM, and backpropagation (NN). Our experimental results show basically linear speedup with an increasing number of processors.", "year": 2006, "referenceCount": 31, "citationCount": 1143, "influentialCitationCount": 55, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2551676", "name": "Cheng-Tao Chu"}, {"authorId": "2109828167", "name": "Sang Kyun Kim"}, {"authorId": "47904256", "name": "Yi-An Lin"}, {"authorId": "2117163611", "name": "YuanYuan Yu"}, {"authorId": "1720184", "name": "G. Bradski"}, {"authorId": "34699434", "name": "A. Ng"}, {"authorId": "1746638", "name": "K. Olukotun"}]}, {"paperId": "7e7b9f37ce280787075046727efbaf9b5a390729", "url": "https://www.semanticscholar.org/paper/7e7b9f37ce280787075046727efbaf9b5a390729", "title": "Applications of Machine Learning in Cancer Prediction and Prognosis", "abstract": "Machine learning is a branch of artificial intelligence that employs a variety of statistical, probabilistic and optimization techniques that allows computers to “learn” from past examples and to detect hard-to-discern patterns from large, noisy or complex data sets. This capability is particularly well-suited to medical applications, especially those that depend on complex proteomic and genomic measurements. As a result, machine learning is frequently used in cancer diagnosis and detection. More recently machine learning has been applied to cancer prognosis and prediction. This latter approach is particularly interesting as it is part of a growing trend towards personalized, predictive medicine. In assembling this review we conducted a broad survey of the different types of machine learning methods being used, the types of data being integrated and the performance of these methods in cancer prediction and prognosis. A number of trends are noted, including a growing dependence on protein biomarkers and microarray data, a strong bias towards applications in prostate and breast cancer, and a heavy reliance on “older” technologies such artificial neural networks (ANNs) instead of more recently developed or more easily interpretable machine learning methods. A number of published studies also appear to lack an appropriate level of validation or testing. Among the better designed and validated studies it is clear that machine learning methods can be used to substantially (15–25%) improve the accuracy of predicting cancer susceptibility, recurrence and mortality. At a more fundamental level, it is also evident that machine learning is also helping to improve our basic understanding of cancer development and progression.", "year": 2006, "referenceCount": 210, "citationCount": 902, "influentialCitationCount": 28, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "34468738", "name": "Joseph A. Cruz"}, {"authorId": "2066145", "name": "D. Wishart"}]}, {"paperId": "dc0c84b7c5e6521216da789f8171544709120cf0", "url": "https://www.semanticscholar.org/paper/dc0c84b7c5e6521216da789f8171544709120cf0", "title": "Opportunities and obstacles for deep learning in biology and medicine", "abstract": "Deep learning, which describes a class of machine learning algorithms, has recently showed impressive results across a variety of domains. Biology and medicine are data rich, but the data are complex and often ill-understood. Problems of this nature may be particularly well-suited to deep learning techniques. We examine applications of deep learning to a variety of biomedical problems -- patient classification, fundamental biological processes, and treatment of patients -- to predict whether deep learning will transform these tasks or if the biomedical sphere poses unique challenges. We find that deep learning has yet to revolutionize or definitively resolve any of these problems, but promising advances have been made on the prior state of the art. Even when improvement over a previous baseline has been modest, we have seen signs that deep learning methods may speed or aid human investigation. More work is needed to address concerns related to interpretability and how to best model each problem. Furthermore, the limited amount of labeled data for training presents problems in some domains, as can legal and privacy constraints on work with sensitive health records. Nonetheless, we foresee deep learning powering changes at the bench and bedside with the potential to transform several areas of biology and medicine.", "year": 2017, "referenceCount": 628, "citationCount": 1219, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Biology", "Computer Science", "Medicine"], "authors": [{"authorId": "5926615", "name": "T. Ching"}, {"authorId": "1868440", "name": "Daniel S. Himmelstein"}, {"authorId": "1402651503", "name": "Brett K. Beaulieu-Jones"}, {"authorId": "32985843", "name": "Alexandr A Kalinin"}, {"authorId": "48154546", "name": "Brian T Do"}, {"authorId": "3738725", "name": "Gregory P. Way"}, {"authorId": "137381074", "name": "E. Ferrero"}, {"authorId": "2236448", "name": "P. Agapow"}, {"authorId": "40862218", "name": "M. Zietz"}, {"authorId": "35290352", "name": "M. M. Hoffman"}, {"authorId": "1993128574", "name": "W. Xie"}, {"authorId": "6997856", "name": "G. Rosen"}, {"authorId": "6580840", "name": "Benjamin J. Lengerich"}, {"authorId": "39246361", "name": "Johnny Israeli"}, {"authorId": "3369052", "name": "Jack Lanchantin"}, {"authorId": "8230326", "name": "S. Woloszynek"}, {"authorId": "1721012", "name": "Anne E Carpenter"}, {"authorId": "3407268", "name": "Avanti Shrikumar"}, {"authorId": "1807918", "name": "Jinbo Xu"}, {"authorId": "30469485", "name": "Evan M. Cofer"}, {"authorId": "39291675", "name": "C. A. Lavender"}, {"authorId": "3178417", "name": "Srinivas C. Turaga"}, {"authorId": "35786407", "name": "Amr M. Alexandari"}, {"authorId": "144202084", "name": "Zhiyong Lu"}, {"authorId": "145192391", "name": "David J Harris"}, {"authorId": "1973239", "name": "D. DeCaprio"}, {"authorId": "121817403", "name": "Yanjun Qi"}, {"authorId": "2844479", "name": "A. Kundaje"}, {"authorId": "2699239", "name": "Yifan Peng"}, {"authorId": "3116087", "name": "L. K. Wiley"}, {"authorId": "3451383", "name": "Marwin H. S. Segler"}, {"authorId": "2831521", "name": "S. Boca"}, {"authorId": "7946353", "name": "S. Joshua Joshua Swamidass"}, {"authorId": "119855034", "name": "Austin Huang"}, {"authorId": "2041407", "name": "A. Gitter"}, {"authorId": "2104940", "name": "C. Greene"}]}, {"paperId": "4d931ea98be69882f547ec6c1b42b78c3e13c36d", "url": "https://www.semanticscholar.org/paper/4d931ea98be69882f547ec6c1b42b78c3e13c36d", "title": "Quantum circuit learning", "abstract": "We propose a classical-quantum hybrid algorithm for machine learning on near-term quantum processors, which we call quantum circuit learning. A quantum circuit driven by our framework learns a given task by tuning parameters implemented on it. The iterative optimization of the parameters allows us to circumvent the high-depth circuit. Theoretical investigation shows that a quantum circuit can approximate nonlinear functions, which is further confirmed by numerical simulations. Hybridizing a low-depth quantum circuit and a classical computer for machine learning, the proposed framework paves the way toward applications of near-term quantum devices for quantum machine learning.", "year": 2018, "referenceCount": 43, "citationCount": 563, "influentialCitationCount": 39, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Physics"], "authors": [{"authorId": "89418147", "name": "K. Mitarai"}, {"authorId": "31729454", "name": "M. Negoro"}, {"authorId": "2460970", "name": "M. Kitagawa"}, {"authorId": "144950743", "name": "K. Fujii"}]}, {"paperId": "293987e14d64dc768a432115c93171ab8653e3bb", "url": "https://www.semanticscholar.org/paper/293987e14d64dc768a432115c93171ab8653e3bb", "title": "Machine Learning in Medical Imaging", "abstract": "This article will discuss very different ways of using machine learning that may be less familiar, and we will demonstrate through examples the role of these concepts in medical imaging. Although the term machine learning is relatively recent, the ideas of machine learning have been applied to medical imaging for decades, perhaps most notably in the areas of computer-aided diagnosis (CAD) and functional brain mapping. We will not attempt in this brief article to survey the rich literature of this field. Instead our goals will be 1) to acquaint the reader with some modern techniques that are now staples of the machine-learning field and 2) to illustrate how these techniques can be employed in various ways in medical imaging.", "year": 2010, "referenceCount": 51, "citationCount": 213, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3067670", "name": "M. Wernick"}, {"authorId": "46286398", "name": "Yongyi Yang"}, {"authorId": "2489609", "name": "J. Brankov"}, {"authorId": "3182604", "name": "G. Yourganov"}, {"authorId": "2790050", "name": "S. Strother"}]}, {"paperId": "bee570503aaa0ed5bc5dd4cf6aa742df0b5cef87", "url": "https://www.semanticscholar.org/paper/bee570503aaa0ed5bc5dd4cf6aa742df0b5cef87", "title": "The Elements of Statistical Learning: Data Mining, Inference, and Prediction, 2nd Edition", "abstract": null, "year": 2005, "referenceCount": 1, "citationCount": 13847, "influentialCitationCount": 880, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1784682", "name": "T. Hastie"}, {"authorId": "1761784", "name": "R. Tibshirani"}, {"authorId": "3056361", "name": "J. Friedman"}]}, {"paperId": "60f43e763b370af0028317d7f6d94885cdfe390a", "url": "https://www.semanticscholar.org/paper/60f43e763b370af0028317d7f6d94885cdfe390a", "title": "Federated Learning", "abstract": "How is it possible to allow multiple data owners to collaboratively train and use a shared prediction model while keeping all the local training data private? Traditional machine learning approaches need to combine all data at one location, typically a data center, which may very well violate the laws on user privacy and data confidentiality. Today, many parts of the world demand that technology companies treat user data carefully according to user-privacy laws. The European Union’s General Data Protection Regulation (GDPR) is a prime example. In this book, we describe how federated machine learning addresses this problem with novel solutions combining distributed machine learning, cryptography and security, and incentive mechanism design based on economic principles and game theory. We explain different types of privacypreserving machine learning solutions and their technological backgrounds, and highlight some representative practical use cases.We show how federated learning can become the foundation of next-generation machine learning that caters to technological and societal needs for responsible AI development and application.", "year": 2019, "referenceCount": 172, "citationCount": 270, "influentialCitationCount": 13, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "153096457", "name": "Qiang Yang"}, {"authorId": "1614034792", "name": "Yang Liu"}, {"authorId": "2157394918", "name": "Yong Cheng"}, {"authorId": "1505828520", "name": "Yan Kang"}, {"authorId": "11573257", "name": "Tianjian Chen"}, {"authorId": "2110984588", "name": "Han Yu"}]}, {"paperId": "da5c65b0ac8b525c3d3d4889bf44d8a48d254a07", "url": "https://www.semanticscholar.org/paper/da5c65b0ac8b525c3d3d4889bf44d8a48d254a07", "title": "Deep Bayesian Active Learning with Image Data", "abstract": "Even though active learning forms an important pillar of machine learning, deep learning tools are not prevalent within it. Deep learning poses several difficulties when used in an active learning setting. First, active learning (AL) methods generally rely on being able to learn and update models from small amounts of data. Recent advances in deep learning, on the other hand, are notorious for their dependence on large amounts of data. Second, many AL acquisition functions rely on model uncertainty, yet deep learning methods rarely represent such model uncertainty. In this paper we combine recent advances in Bayesian deep learning into the active learning framework in a practical way. We develop an active learning framework for high dimensional data, a task which has been extremely challenging so far, with very sparse existing literature. Taking advantage of specialised models such as Bayesian convolutional neural networks, we demonstrate our active learning techniques with image data, obtaining a significant improvement on existing active learning approaches. We demonstrate this on both the MNIST dataset, as well as for skin cancer diagnosis from lesion images (ISIC2016 task).", "year": 2017, "referenceCount": 42, "citationCount": 1014, "influentialCitationCount": 166, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2681954", "name": "Y. Gal"}, {"authorId": "18014232", "name": "Riashat Islam"}, {"authorId": "1744700", "name": "Zoubin Ghahramani"}]}, {"paperId": "cfea40bf4e4131aab2727e3aaedcf02c1dd594ac", "url": "https://www.semanticscholar.org/paper/cfea40bf4e4131aab2727e3aaedcf02c1dd594ac", "title": "Bidirectional Extreme Learning Machine for Regression Problem and Its Learning Effectiveness", "abstract": "It is clear that the learning effectiveness and learning speed of neural networks are in general far slower than required, which has been a major bottleneck for many applications. Recently, a simple and efficient learning method, referred to as extreme learning machine (ELM), was proposed by Huang , which has shown that, compared to some conventional methods, the training time of neural networks can be reduced by a thousand times. However, one of the open problems in ELM research is whether the number of hidden nodes can be further reduced without affecting learning effectiveness. This brief proposes a new learning algorithm, called bidirectional extreme learning machine (B-ELM), in which some hidden nodes are not randomly selected. In theory, this algorithm tends to reduce network output error to 0 at an extremely early learning stage. Furthermore, we find a relationship between the network output error and the network output weights in the proposed B-ELM. Simulation results demonstrate that the proposed method can be tens to hundreds of times faster than other incremental ELM algorithms.", "year": 2012, "referenceCount": 14, "citationCount": 162, "influentialCitationCount": 6, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2108776795", "name": "Yimin Yang"}, {"authorId": "2119048509", "name": "Yaonan Wang"}, {"authorId": "2474758", "name": "Xiaofang Yuan"}]}, {"paperId": "de9180ecc8b645aff238be05f645d50fa34a808f", "url": "https://www.semanticscholar.org/paper/de9180ecc8b645aff238be05f645d50fa34a808f", "title": "Learning Curves in Machine Learning", "abstract": null, "year": 2010, "referenceCount": 14, "citationCount": 50, "influentialCitationCount": 3, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1933403", "name": "Claudia Perlich"}]}, {"paperId": "c4ae802491724aee021f31f02327b9671cead3dc", "url": "https://www.semanticscholar.org/paper/c4ae802491724aee021f31f02327b9671cead3dc", "title": "Types of Machine Learning Algorithms", "abstract": "• Supervised learning --where the algorithm generates a function that maps inputs to desired outputs. One standard formulation of the supervised learning task is the classification problem: the learner is required to learn (to approximate the behavior of) a function which maps a vector into one of several classes by looking at several input-output examples of the function. • Unsupervised learning --which models a set of inputs: labeled examples are not available. • Semi-supervised learning --which combines both labeled and unlabeled examples to generate an appropriate function or classifier. • Reinforcement learning --where the algorithm learns a policy of how to act given an observation of the world. Every action has some impact in the environment, and the environment provides feedback that guides the learning algorithm. • Transduction --similar to supervised learning, but does not explicitly construct a function: instead, tries to predict new outputs based on training inputs, training outputs, and new inputs. • Learning to learn --where the algorithm learns its own inductive bias based on previous experience.", "year": 2010, "referenceCount": 57, "citationCount": 280, "influentialCitationCount": 14, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145298622", "name": "T. Ayodele"}]}, {"paperId": "b5ae39d8bf8a06ae91b236ef115fdab8921e6455", "url": "https://www.semanticscholar.org/paper/b5ae39d8bf8a06ae91b236ef115fdab8921e6455", "title": "Optimization method based extreme learning machine for classification", "abstract": null, "year": 2010, "referenceCount": 31, "citationCount": 810, "influentialCitationCount": 44, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "145678691", "name": "G. Huang"}, {"authorId": "3210833", "name": "Xiaojian Ding"}, {"authorId": "2986982", "name": "Hongming Zhou"}]}, {"paperId": "276194e96ebd620b5cff35a9168bdda39a0be57b", "url": "https://www.semanticscholar.org/paper/276194e96ebd620b5cff35a9168bdda39a0be57b", "title": "Federated Multi-Task Learning", "abstract": "Federated learning poses new statistical and systems challenges in training machine learning models over distributed networks of devices. In this work, we show that multi-task learning is naturally suited to handle the statistical challenges of this setting, and propose a novel systems-aware optimization method, MOCHA, that is robust to practical systems issues. Our method and theory for the first time consider issues of high communication cost, stragglers, and fault tolerance for distributed multi-task learning. The resulting method achieves significant speedups compared to alternatives in the federated setting, as we demonstrate through simulations on real-world federated datasets.", "year": 2017, "referenceCount": 57, "citationCount": 900, "influentialCitationCount": 74, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "145260024", "name": "Virginia Smith"}, {"authorId": "2054892", "name": "Chao-Kai Chiang"}, {"authorId": "2095979", "name": "Maziar Sanjabi"}, {"authorId": "145532827", "name": "Ameet S. Talwalkar"}]}, {"paperId": "be633c8eeffdba4499c6f53e002d663c868dc87c", "url": "https://www.semanticscholar.org/paper/be633c8eeffdba4499c6f53e002d663c868dc87c", "title": "Support Vector Machine", "abstract": null, "year": 2016, "referenceCount": 45, "citationCount": 577, "influentialCitationCount": 1, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3339259", "name": "S. Suthaharan"}]}, {"paperId": "a20bfec3c95aad003dcb45a21a220c19cca8bb66", "url": "https://www.semanticscholar.org/paper/a20bfec3c95aad003dcb45a21a220c19cca8bb66", "title": "A Machine Learning Approach to Coreference Resolution of Noun Phrases", "abstract": "In this paper, we present a learning approach to coreference resolution of noun phrases in unrestricted text. The approach learns from a small, annotated corpus and the task includes resolving not just a certain type of noun phrase (e.g., pronouns) but rather general noun phrases. It also does not restrict the entity types of the noun phrases; that is, coreference is assigned whether they are of organization, person, or other types. We evaluate our approach on common data sets (namely, the MUC-6 and MUC-7 coreference corpora) and obtain encouraging results, indicating that on the general noun phrase coreference task, the learning approach holds promise and achieves accuracy comparable to that of nonlearning approaches. Our system is the first learning-based system that offers performance comparable to that of state-of-the-art nonlearning systems on these data sets.", "year": 2001, "referenceCount": 24, "citationCount": 1091, "influentialCitationCount": 150, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2248565", "name": "W. M. Soon"}, {"authorId": "34789794", "name": "H. Ng"}, {"authorId": "3216372", "name": "Chung Yong Lim"}]}, {"paperId": "066dd3d09eb5815e8be1da560abd1abe08f87cb9", "url": "https://www.semanticscholar.org/paper/066dd3d09eb5815e8be1da560abd1abe08f87cb9", "title": "OP-ELM: Optimally Pruned Extreme Learning Machine", "abstract": "In this brief, the optimally pruned extreme learning machine (OP-ELM) methodology is presented. It is based on the original extreme learning machine (ELM) algorithm with additional steps to make it more robust and generic. The whole methodology is presented in detail and then applied to several regression and classification problems. Results for both computational time and accuracy (mean square error) are compared to the original ELM and to three other widely used methodologies: multilayer perceptron (MLP), support vector machine (SVM), and Gaussian process (GP). As the experiments for both regression and classification illustrate, the proposed OP-ELM methodology performs several orders of magnitude faster than the other algorithms used in this brief, except the original ELM. Despite the simplicity and fast performance, the OP-ELM is still able to maintain an accuracy that is comparable to the performance of the SVM. A toolbox for the OP-ELM is publicly available online.", "year": 2010, "referenceCount": 17, "citationCount": 716, "influentialCitationCount": 47, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "3194493", "name": "Y. Miché"}, {"authorId": "2500799", "name": "A. Sorjamaa"}, {"authorId": "144224330", "name": "P. Bas"}, {"authorId": "1738231", "name": "O. Simula"}, {"authorId": "1696508", "name": "C. Jutten"}, {"authorId": "1731049", "name": "A. Lendasse"}]}, {"paperId": "0ef9ae1ce8c91ce671a211bdda792bf3752d1522", "url": "https://www.semanticscholar.org/paper/0ef9ae1ce8c91ce671a211bdda792bf3752d1522", "title": "A Deep Learning Approach for Intrusion Detection Using Recurrent Neural Networks", "abstract": "Intrusion detection plays an important role in ensuring information security, and the key technology is to accurately identify various attacks in the network. In this paper, we explore how to model an intrusion detection system based on deep learning, and we propose a deep learning approach for intrusion detection using recurrent neural networks (RNN-IDS). Moreover, we study the performance of the model in binary classification and multiclass classification, and the number of neurons and different learning rate impacts on the performance of the proposed model. We compare it with those of J48, artificial neural network, random forest, support vector machine, and other machine learning methods proposed by previous researchers on the benchmark data set. The experimental results show that RNN-IDS is very suitable for modeling a classification model with high accuracy and that its performance is superior to that of traditional machine learning classification methods in both binary and multiclass classification. The RNN-IDS model improves the accuracy of the intrusion detection and provides a new research method for intrusion detection.", "year": 2017, "referenceCount": 26, "citationCount": 898, "influentialCitationCount": 65, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "30796665", "name": "Chuanlong Yin"}, {"authorId": "1733625", "name": "Yuefei Zhu"}, {"authorId": "2191560", "name": "Jin-long Fei"}, {"authorId": "50046030", "name": "Xin-Zheng He"}]}, {"paperId": "8de174ab5419b9d3127695405efd079808e956e8", "url": "https://www.semanticscholar.org/paper/8de174ab5419b9d3127695405efd079808e956e8", "title": "Curriculum learning", "abstract": "Humans and animals learn much better when the examples are not randomly presented but organized in a meaningful order which illustrates gradually more concepts, and gradually more complex ones. Here, we formalize such training strategies in the context of machine learning, and call them \"curriculum learning\". In the context of recent research studying the difficulty of training in the presence of non-convex training criteria (for deep deterministic and stochastic neural networks), we explore curriculum learning in various set-ups. The experiments show that significant improvements in generalization can be achieved. We hypothesize that curriculum learning has both an effect on the speed of convergence of the training process to a minimum and, in the case of non-convex criteria, on the quality of the local minima obtained: curriculum learning can be seen as a particular form of continuation method (a general strategy for global optimization of non-convex functions).", "year": 2009, "referenceCount": 33, "citationCount": 3609, "influentialCitationCount": 317, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1751762", "name": "Yoshua Bengio"}, {"authorId": "2373952", "name": "J. Louradour"}, {"authorId": "2939803", "name": "Ronan Collobert"}, {"authorId": "145183709", "name": "J. Weston"}]}, {"paperId": "9d3e0fce253a4ae4a4456b2f24c03329a2b74621", "url": "https://www.semanticscholar.org/paper/9d3e0fce253a4ae4a4456b2f24c03329a2b74621", "title": "Deep Learning for Health Informatics", "abstract": "With a massive influx of multimodality data, the role of data analytics in health informatics has grown rapidly in the last decade. This has also prompted increasing interests in the generation of analytical, data driven models based on machine learning in health informatics. Deep learning, a technique with its foundation in artificial neural networks, is emerging in recent years as a powerful tool for machine learning, promising to reshape the future of artificial intelligence. Rapid improvements in computational power, fast data storage, and parallelization have also contributed to the rapid uptake of the technology in addition to its predictive power and ability to generate automatically optimized high-level features and semantic interpretation from the input data. This article presents a comprehensive up-to-date review of research employing deep learning in health informatics, providing a critical analysis of the relative merit, and potential pitfalls of the technique as well as its future outlook. The paper mainly focuses on key applications of deep learning in the fields of translational bioinformatics, medical imaging, pervasive sensing, medical informatics, and public health.", "year": 2017, "referenceCount": 164, "citationCount": 1106, "influentialCitationCount": 34, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "1859140", "name": "D. Ravì"}, {"authorId": "1905807", "name": "Charence Wong"}, {"authorId": "2775904", "name": "F. Deligianni"}, {"authorId": "3163767", "name": "M. Berthelot"}, {"authorId": "1443783456", "name": "Javier Andreu-Perez"}, {"authorId": "1745644", "name": "Benny P. L. Lo"}, {"authorId": "144574968", "name": "Guang-Zhong Yang"}]}, {"paperId": "90abbe1f2f78493b9a596ba13b7145a07e50df84", "url": "https://www.semanticscholar.org/paper/90abbe1f2f78493b9a596ba13b7145a07e50df84", "title": "A survey of transfer learning", "abstract": null, "year": 2016, "referenceCount": 143, "citationCount": 1228, "influentialCitationCount": 34, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "35541327", "name": "K. R. Weiss"}, {"authorId": "1725285", "name": "T. Khoshgoftaar"}, {"authorId": "39472430", "name": "Dingding Wang"}]}, {"paperId": "5bf9cebe3658cfbf7f67c0a2680c8233509aa5e4", "url": "https://www.semanticscholar.org/paper/5bf9cebe3658cfbf7f67c0a2680c8233509aa5e4", "title": "UCI Repository of Machine Learning Database", "abstract": null, "year": 1998, "referenceCount": 0, "citationCount": 1176, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "28978752", "name": "D. Newman"}]}, {"paperId": "9f1e9e56d80146766bc2316efbc54d8b770a23df", "url": "https://www.semanticscholar.org/paper/9f1e9e56d80146766bc2316efbc54d8b770a23df", "title": "Deep Reinforcement Learning: An Overview", "abstract": "We give an overview of recent exciting achievements of deep reinforcement learning (RL). We discuss six core elements, six important mechanisms, and twelve applications. We start with background of machine learning, deep learning and reinforcement learning. Next we discuss core RL elements, including value function, in particular, Deep Q-Network (DQN), policy, reward, model, planning, and exploration. After that, we discuss important mechanisms for RL, including attention and memory, unsupervised learning, transfer learning, multi-agent RL, hierarchical RL, and learning to learn. Then we discuss various applications of RL, including games, in particular, AlphaGo, robotics, natural language processing, including dialogue systems, machine translation, and text generation, computer vision, neural architecture design, business management, finance, healthcare, Industry 4.0, smart grid, intelligent transportation systems, and computer systems. We mention topics not reviewed yet, and list a collection of RL resources. After presenting a brief summary, we close with discussions. \nPlease see Deep Reinforcement Learning, arXiv:1810.06339, for a significant update.", "year": 2017, "referenceCount": 584, "citationCount": 844, "influentialCitationCount": 77, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2276894", "name": "Yuxi Li"}]}, {"paperId": "64be9999b68e12d260ba7423f6b55ffd41552ad3", "url": "https://www.semanticscholar.org/paper/64be9999b68e12d260ba7423f6b55ffd41552ad3", "title": "Deep Learning Applications in Medical Image Analysis", "abstract": "The tremendous success of machine learning algorithms at image recognition tasks in recent years intersects with a time of dramatically increased use of electronic medical records and diagnostic imaging. This review introduces the machine learning algorithms as applied to medical image analysis, focusing on convolutional neural networks, and emphasizing clinical aspects of the field. The advantage of machine learning in an era of medical big data is that significant hierarchal relationships within the data can be discovered algorithmically without laborious hand-crafting of features. We cover key research areas and applications of medical image classification, localization, detection, segmentation, and registration. We conclude by discussing research obstacles, emerging trends, and possible future directions.", "year": 2018, "referenceCount": 140, "citationCount": 697, "influentialCitationCount": 10, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "34812292", "name": "Justin Ker"}, {"authorId": "46659335", "name": "Lipo Wang"}, {"authorId": "39917910", "name": "J. Rao"}, {"authorId": "48508646", "name": "Tchoyoson C. C. Lim"}]}, {"paperId": "04f4085c0126ba29453a582cd1e62e05c8e15c82", "url": "https://www.semanticscholar.org/paper/04f4085c0126ba29453a582cd1e62e05c8e15c82", "title": "Automating the Construction of Internet Portals with Machine Learning", "abstract": null, "year": 2000, "referenceCount": 75, "citationCount": 906, "influentialCitationCount": 158, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "143753639", "name": "A. McCallum"}, {"authorId": "145172877", "name": "K. Nigam"}, {"authorId": "35211659", "name": "Jason D. M. Rennie"}, {"authorId": "2544946", "name": "K. Seymore"}]}, {"paperId": "7574bfa9fa539f1ccbaeabc7c82c295d6143b84c", "url": "https://www.semanticscholar.org/paper/7574bfa9fa539f1ccbaeabc7c82c295d6143b84c", "title": "Reinforcement Learning", "abstract": "Reinforcement learning is an approach to artificial intelligence that emphasizes learning by the individual from its interaction with its environment. This contrasts with classical approaches to artificial intelligence and machine learning, which have downplayed learning from interaction, focusing instead on learning from a knowledgeable teacher, or on reasoning from a complete model of the environment. Modern reinforcement learning research is highly interdisciplinary; it includes researchers specializing in operations research, genetic algorithms, neural networks, psychology, and control engineering. Reinforcement learning is learning what to do—how to map situations to actions—so as to maximize a scalar reward signal. The learner is not told which action to take, as in most forms of machine learning, but instead must discover which actions yield the most reward by trying them. In the most interesting and challenging cases, actions may affect not only the immediate reward, but also the next situation, and through that all subsequent rewards. These two characteristics—trial-and-error search and delayed reward—are the two most important distinguishing features of reinforcement learning. One of the challenges that arises in reinforcement learning and not in other kinds of learning is the tradeoff between exploration and exploitation. To obtain a lot of reward, a reinforcement learning agent must prefer actions that it has tried in the past and found to be effective in producing reward. But to discover which actions these are it has to select actions that it has not tried before. The agent has to exploit what it already knows in order to obtain reward, but it also has to explore in order to make better action selections in the future. The dilemma is that neither exploitation nor exploration can be pursued exclusively without failing at the task. Modern reinforcement learning research uses the formal framework of", "year": 1992, "referenceCount": 33, "citationCount": 511, "influentialCitationCount": 12, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1699645", "name": "R. Sutton"}]}, {"paperId": "db64f424710d57025c5fb42a564551f093a4d111", "url": "https://www.semanticscholar.org/paper/db64f424710d57025c5fb42a564551f093a4d111", "title": "The Extreme Value Machine", "abstract": "It is often desirable to be able to recognize when inputs to a recognition function learned in a supervised manner correspond to classes unseen at training time. With this ability, new class labels could be assigned to these inputs by a human operator, allowing them to be incorporated into the recognition function—ideally under an efficient incremental update mechanism. While good algorithms that assume inputs from a fixed set of classes exist, e.g. , artificial neural networks and kernel machines, it is not immediately obvious how to extend them to perform incremental learning in the presence of unknown query classes. Existing algorithms take little to no distributional information into account when learning recognition functions and lack a strong theoretical foundation. We address this gap by formulating a novel, theoretically sound classifier—the Extreme Value Machine (EVM). The EVM has a well-grounded interpretation derived from statistical Extreme Value Theory (EVT), and is the first classifier to be able to perform nonlinear kernel-free variable bandwidth incremental learning. Compared to other classifiers in the same deep network derived feature space, the EVM is accurate and efficient on an established benchmark partition of the ImageNet dataset.", "year": 2015, "referenceCount": 67, "citationCount": 164, "influentialCitationCount": 25, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "39886114", "name": "Ethan M. Rudd"}, {"authorId": "34939951", "name": "Lalit P. Jain"}, {"authorId": "2613438", "name": "W. Scheirer"}, {"authorId": "32163276", "name": "T. Boult"}]}, {"paperId": "cc7827a17a7759a04aa389290d1a874db56e85e5", "url": "https://www.semanticscholar.org/paper/cc7827a17a7759a04aa389290d1a874db56e85e5", "title": "Meta-Learning: A Survey", "abstract": "Meta-learning, or learning to learn, is the science of systematically observing how different machine learning approaches perform on a wide range of learning tasks, and then learning from this experience, or meta-data, to learn new tasks much faster than otherwise possible. Not only does this dramatically speed up and improve the design of machine learning pipelines or neural architectures, it also allows us to replace hand-engineered algorithms with novel approaches learned in a data-driven way. In this chapter, we provide an overview of the state of the art in this fascinating and continuously evolving field.", "year": 2018, "referenceCount": 207, "citationCount": 369, "influentialCitationCount": 22, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1717534", "name": "J. Vanschoren"}]}, {"paperId": "b17862e73e79a554e6ad2b27f6df44be1b533a0d", "url": "https://www.semanticscholar.org/paper/b17862e73e79a554e6ad2b27f6df44be1b533a0d", "title": "Tuning Metaheuristics - A Machine Learning Perspective", "abstract": null, "year": 2009, "referenceCount": 0, "citationCount": 333, "influentialCitationCount": 31, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1690903", "name": "M. Birattari"}]}, {"paperId": "e7d4989aeb3aba1bca30035fc1da28a518f9de39", "url": "https://www.semanticscholar.org/paper/e7d4989aeb3aba1bca30035fc1da28a518f9de39", "title": "Open-source machine learning: R meets Weka", "abstract": null, "year": 2009, "referenceCount": 16, "citationCount": 365, "influentialCitationCount": 25, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1764952", "name": "K. Hornik"}, {"authorId": "31697389", "name": "C. Buchta"}, {"authorId": "2144516", "name": "A. Zeileis"}]}, {"paperId": "12d1d070a53d4084d88a77b8b143bad51c40c38f", "url": "https://www.semanticscholar.org/paper/12d1d070a53d4084d88a77b8b143bad51c40c38f", "title": "Reinforcement Learning: A Survey", "abstract": "This paper surveys the field of reinforcement learning from a computer-science perspective. It is written to be accessible to researchers familiar with machine learning. Both the historical basis of the field and a broad selection of current work are summarized. Reinforcement learning is the problem faced by an agent that learns behavior through trial-and-error interactions with a dynamic environment. The work described here has a resemblance to work in psychology, but differs considerably in the details and in the use of the word \"reinforcement.\" The paper discusses central issues of reinforcement learning, including trading off exploration and exploitation, establishing the foundations of the field via Markov decision theory, learning from delayed reinforcement, constructing empirical models to accelerate learning, making use of generalization and hierarchy, and coping with hidden state. It concludes with a survey of some implemented systems and an assessment of the practical utility of current methods for reinforcement learning.", "year": 1996, "referenceCount": 128, "citationCount": 7677, "influentialCitationCount": 435, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1709512", "name": "L. Kaelbling"}, {"authorId": "144885169", "name": "M. Littman"}, {"authorId": "1760402", "name": "A. Moore"}]}, {"paperId": "66405753664af1895830f147365cc5903388dea1", "url": "https://www.semanticscholar.org/paper/66405753664af1895830f147365cc5903388dea1", "title": "A review of machine learning approaches to Spam filtering", "abstract": null, "year": 2009, "referenceCount": 121, "citationCount": 491, "influentialCitationCount": 20, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3327532", "name": "Thiago S. Guzella"}, {"authorId": "2891406", "name": "W. Caminhas"}]}, {"paperId": "4ea55038daf0907d27296de047008fb58def41c5", "url": "https://www.semanticscholar.org/paper/4ea55038daf0907d27296de047008fb58def41c5", "title": "Applications of Deep Learning and Reinforcement Learning to Biological Data", "abstract": "Rapid advances in hardware-based technologies during the past decades have opened up new possibilities for life scientists to gather multimodal data in various application domains, such as omics, bioimaging, medical imaging, and (brain/body)–machine interfaces. These have generated novel opportunities for development of dedicated data-intensive machine learning techniques. In particular, recent research in deep learning (DL), reinforcement learning (RL), and their combination (deep RL) promise to revolutionize the future of artificial intelligence. The growth in computational power accompanied by faster and increased data storage, and declining computing costs have already allowed scientists in various fields to apply these techniques on data sets that were previously intractable owing to their size and complexity. This paper provides a comprehensive survey on the application of DL, RL, and deep RL techniques in mining biological data. In addition, we compare the performances of DL techniques when applied to different data sets across various application domains. Finally, we outline open issues in this challenging research area and discuss future development perspectives.", "year": 2017, "referenceCount": 222, "citationCount": 466, "influentialCitationCount": 3, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "authors": [{"authorId": "144774721", "name": "M. Mahmud"}, {"authorId": "4216715", "name": "M. S. Kaiser"}, {"authorId": "144664815", "name": "A. Hussain"}, {"authorId": "47323504", "name": "S. Vassanelli"}]}, {"paperId": "7e910b031e703caf683d44d7417d702a5aba2e95", "url": "https://www.semanticscholar.org/paper/7e910b031e703caf683d44d7417d702a5aba2e95", "title": "Handbook Of Research On Machine Learning Applications and Trends: Algorithms, Methods and Techniques (2 Volumes)", "abstract": "The machine learning approach provides a useful tool when the amount of data is very large and a model is not available to explain the generation and relation of the data set. The Handbook of Research on Machine Learning Applications and Trends: Algorithms, Methods, and Techniques provides a set of practical applications for solving problems and applying various techniques in automatic data extraction and setting. A defining collection of field advancements, this Handbook of Research fills the gap between theory and practice, providing a strong reference for academicians, researchers, and practitioners.", "year": 2009, "referenceCount": 83, "citationCount": 368, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2060576305", "name": "E. S. Olivas"}, {"authorId": "103992067", "name": "J. D. M. Guerrero"}, {"authorId": "71631370", "name": "M. M. Sober"}, {"authorId": "35119570", "name": "J. Benedito"}, {"authorId": "152692443", "name": "A. López"}]}, {"paperId": "a191715b2e3e51cc08114e759b7bf7fdf9f2c206", "url": "https://www.semanticscholar.org/paper/a191715b2e3e51cc08114e759b7bf7fdf9f2c206", "title": "Deep Learning with Python", "abstract": "Summary Deep Learning with Python introduces the field of deep learning using the Python language and the powerful Keras library. Written by Keras creator and Google AI researcher Franois Chollet, this book builds your understanding through intuitive explanations and practical examples. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the Technology Machine learning has made remarkable progress in recent years. We went from near-unusable speech and image recognition, to near-human accuracy. We went from machines that couldn't beat a serious Go player, to defeating a world champion. Behind this progress is deep learninga combination of engineering advances, best practices, and theory that enables a wealth of previously impossible smart applications. About the Book Deep Learning with Python introduces the field of deep learning using the Python language and the powerful Keras library. Written by Keras creator and Google AI researcher Franois Chollet, this book builds your understanding through intuitive explanations and practical examples. You'll explore challenging concepts and practice with applications in computer vision, natural-language processing, and generative models. By the time you finish, you'll have the knowledge and hands-on skills to apply deep learning in your own projects. What's Inside Deep learning from first principles Setting up your own deep-learning environment Image-classification models Deep learning for text and sequences Neural style transfer, text generation, and image generation About the Reader Readers need intermediate Python skills. No previous experience with Keras, TensorFlow, or machine learning is required. About the Author Franois Chollet works on deep learning at Google in Mountain View, CA. He is the creator of the Keras deep-learning library, as well as a contributor to the TensorFlow machine-learning framework. He also does deep-learning research, with a focus on computer vision and the application of machine learning to formal reasoning. His papers have been published at major conferences in the field, including the Conference on Computer Vision and Pattern Recognition (CVPR), the Conference and Workshop on Neural Information Processing Systems (NIPS), the International Conference on Learning Representations (ICLR), and others.", "year": 2017, "referenceCount": 0, "citationCount": 442, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1565641737", "name": "François Chollet"}]}, {"paperId": "efd68f3724942c9de5dc804d3c7cb3f70f42234b", "url": "https://www.semanticscholar.org/paper/efd68f3724942c9de5dc804d3c7cb3f70f42234b", "title": "Deep learning for computational biology", "abstract": "Technological advances in genomics and imaging have led to an explosion of molecular and cellular profiling data from large numbers of samples. This rapid increase in biological data dimension and acquisition rate is challenging conventional analysis strategies. Modern machine learning methods, such as deep learning, promise to leverage very large data sets for finding hidden structure within them, and for making accurate predictions. In this review, we discuss applications of this new breed of analysis approaches in regulatory genomics and cellular imaging. We provide background of what deep learning is, and the settings in which it can be successfully applied to derive biological insights. In addition to presenting specific applications and providing tips for practical use, we also highlight possible pitfalls and limitations to guide computational biologists when and how to make the most use of this new technology.", "year": 2016, "referenceCount": 136, "citationCount": 937, "influentialCitationCount": 29, "isOpenAccess": false, "fieldsOfStudy": ["Medicine", "Biology"], "authors": [{"authorId": "2414348", "name": "Christof Angermueller"}, {"authorId": "3451978", "name": "Tanel Pärnamaa"}, {"authorId": "2827805", "name": "L. Parts"}, {"authorId": "152423211", "name": "O. Stegle"}]}, {"paperId": "767dcaf77f73f958cfee0f54cfcde0882e8ec50e", "url": "https://www.semanticscholar.org/paper/767dcaf77f73f958cfee0f54cfcde0882e8ec50e", "title": "Deep Learning: A Practitioner's Approach", "abstract": "Although interest in machine learning has reached a high point, lofty expectations often scuttle projects before they get very far. How can machine learningespecially deep neural networksmake a real difference in your organization? This hands-on guide not only provides the most practical information available on the subject, but also helps you get started building efficient deep learning networks. Authors Adam Gibson and Josh Patterson provide theory on deep learning before introducing their open-source Deeplearning4j (DL4J) library for developing production-class workflows. Through real-world examples, youll learn methods and strategies for training deep network architectures and running deep learning workflows on Spark and Hadoop with DL4J. Dive into machine learning concepts in general, as well as deep learning in particular Understand how deep networks evolved from neural network fundamentals Explore the major deep network architectures, including Convolutional and Recurrent Learn how to map specific deep networks to the right problem Walk through the fundamentals of tuning general neural networks and specific deep network architectures Use vectorization techniques for different data types with DataVec, DL4Js workflow toolLearn how to use DL4J natively on Spark and Hadoop", "year": 2017, "referenceCount": 0, "citationCount": 362, "influentialCitationCount": 50, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2055466552", "name": "Joshua Patterson"}, {"authorId": "2052126530", "name": "Adam Gibson"}]}, {"paperId": "298af26244e3ad836c1aa5cf5855d05f5197063d", "url": "https://www.semanticscholar.org/paper/298af26244e3ad836c1aa5cf5855d05f5197063d", "title": "Machine Learning Methods Without Tears: A Primer for Ecologists", "abstract": "Machine learning methods, a family of statistical techniques with origins in the field of artificial intelligence, are recognized as holding great promise for the advancement of understanding and prediction about ecological phenomena. These modeling techniques are flexible enough to handle complex problems with multiple interacting elements and typically outcompete traditional approaches (e.g., generalized linear models), making them ideal for modeling ecological systems. Despite their inherent advantages, a review of the literature reveals only a modest use of these approaches in ecology as compared to other disciplines. One potential explanation for this lack of interest is that machine learning techniques do not fall neatly into the class of statistical modeling approaches with which most ecologists are familiar. In this paper, we provide an introduction to three machine learning approaches that can be broadly used by ecologists: classification and regression trees, artificial neural networks, and evolutionary computation. For each approach, we provide a brief background to the methodology, give examples of its application in ecology, describe model development and implementation, discuss strengths and weaknesses, explore the availability of statistical software, and provide an illustrative example. Although the ecological application of machine learning approaches has increased, there remains considerable skepticism with respect to the role of these techniques in ecology. Our review encourages a greater understanding of machine learning approaches and promotes their future application and utilization, while also providing a basis from which ecologists can make informed decisions about whether to select or avoid these approaches in their future modeling endeavors.", "year": 2008, "referenceCount": 110, "citationCount": 563, "influentialCitationCount": 35, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2008387", "name": "J. Olden"}, {"authorId": "34870951", "name": "J. Lawler"}, {"authorId": "1991309", "name": "N. Poff"}]}, {"paperId": "6241276a3074f73c1ce9b9ce4ac69f748732aecd", "url": "https://www.semanticscholar.org/paper/6241276a3074f73c1ce9b9ce4ac69f748732aecd", "title": "Data Mining and Machine Learning in Astronomy", "abstract": "We review the current state of data mining and machine learning in astronomy. 'Data Mining' can have a somewhat mixed connotation from the point of view of a researcher in this field. If used correctly, it can be a powerful approach, holding the potential to fully exploit the exponentially increasing amount of available data, promising great scientific advance. However, if misused, it can be little more than the black-box application of complex computing algorithms that may give little physical insight, and provide questionable results. Here, we give an overview of the entire data mining process, from data collection through to the interpretation of results. We cover common machine learning algorithms, such as artificial neural networks and support vector machines, applications from a broad range of astronomy, emphasizing those where data mining techniques directly resulted in improved science, and important current and future directions, including probability density functions, parallel algorithms, petascale computing, and the time domain. We conclude that, so long as one carefully selects an appropriate algorithm, and is guided by the astronomical problem at hand, data mining can be very much the powerful tool, and not the questionable black box.", "year": 2009, "referenceCount": 314, "citationCount": 271, "influentialCitationCount": 16, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "2332144", "name": "N. Ball"}, {"authorId": "102648043", "name": "Robert J. Brunner Herzberg Institute of Astrophysics"}, {"authorId": "2073777983", "name": "Victoria"}, {"authorId": "80559887", "name": "Bc"}, {"authorId": "69477256", "name": "Canada."}, {"authorId": "102339916", "name": "D. O. Astronomy"}, {"authorId": "103072545", "name": "U. I. Urbana-Champaign"}]}, {"paperId": "cf8f2ca0c2d618104bc8724a6effc509088f16c4", "url": "https://www.semanticscholar.org/paper/cf8f2ca0c2d618104bc8724a6effc509088f16c4", "title": "Never-Ending Learning", "abstract": "Whereas people learn many different types of knowledge from diverse experiences over many years, most current machine learning systems acquire just a single function or data model from just a single data set. We propose a neverending learning paradigm for machine learning, to better reflect the more ambitious and encompassing type of learning performed by humans. As a case study, we describe the Never-Ending Language Learner (NELL), which achieves some of the desired properties of a never-ending learner, and we discuss lessons learned. NELL has been learning to read the web 24 hours/day since January 2010, and so far has acquired a knowledge base with over 80 million confidenceweighted beliefs (e.g., servedWith(tea, biscuits)). NELL has also learned millions of features and parameters that enable it to read these beliefs from the web. Additionally, it has learned to reason over these beliefs to infer new beliefs, and is able to extend its ontology by synthesizing new relational predicates. NELL can be tracked online at http://rtw.ml.cmu.edu, and followed on Twitter at @CMUNELL.", "year": 2012, "referenceCount": 58, "citationCount": 823, "influentialCitationCount": 60, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Psychology"], "authors": [{"authorId": "40975594", "name": "Tom Michael Mitchell"}, {"authorId": "50056360", "name": "William W. Cohen"}, {"authorId": "1842532", "name": "Estevam Hruschka"}, {"authorId": "2406435", "name": "Partha P. Talukdar"}, {"authorId": "2119660368", "name": "Bo Yang"}, {"authorId": "31779043", "name": "J. Betteridge"}, {"authorId": "143818235", "name": "Andrew Carlson"}, {"authorId": "40135250", "name": "Bhavana Dalvi"}, {"authorId": "40642935", "name": "Matt Gardner"}, {"authorId": "16411658", "name": "B. Kisiel"}, {"authorId": "2517825", "name": "J. Krishnamurthy"}, {"authorId": "1914797", "name": "N. Lao"}, {"authorId": "2406799", "name": "Kathryn Mazaitis"}, {"authorId": "35645263", "name": "Thahir Mohamed"}, {"authorId": "3115592", "name": "Ndapandula Nakashole"}, {"authorId": "144888672", "name": "Emmanouil Antonios Platanios"}, {"authorId": "1863425", "name": "Alan Ritter"}, {"authorId": "32402038", "name": "M. Samadi"}, {"authorId": "1717452", "name": "Burr Settles"}, {"authorId": "2108772203", "name": "Richard C. Wang"}, {"authorId": "2129412", "name": "D. Wijaya"}, {"authorId": "1726095131", "name": "A. Gupta"}, {"authorId": "39717886", "name": "Xinlei Chen"}, {"authorId": "2407368", "name": "Abulhair Saparov"}, {"authorId": "2062798496", "name": "Malcolm Greaves"}, {"authorId": "122360608", "name": "Joel Welling"}]}, {"paperId": "1242d79573397094c5670f55e58c8333cced0beb", "url": "https://www.semanticscholar.org/paper/1242d79573397094c5670f55e58c8333cced0beb", "title": "Deep Learning: A Primer for Radiologists.", "abstract": "Deep learning is a class of machine learning methods that are gaining success and attracting interest in many domains, including computer vision, speech recognition, natural language processing, and playing games. Deep learning methods produce a mapping from raw inputs to desired outputs (eg, image classes). Unlike traditional machine learning methods, which require hand-engineered feature extraction from inputs, deep learning methods learn these features directly from data. With the advent of large datasets and increased computing power, these methods can produce models with exceptional performance. These models are multilayer artificial neural networks, loosely inspired by biologic neural systems. Weighted connections between nodes (neurons) in the network are iteratively adjusted based on example pairs of inputs and target outputs by back-propagating a corrective error signal through the network. For computer vision tasks, convolutional neural networks (CNNs) have proven to be effective. Recently, several clinical applications of CNNs have been proposed and studied in radiology for classification, detection, and segmentation tasks. This article reviews the key concepts of deep learning for clinical radiologists, discusses technical requirements, describes emerging applications in clinical radiology, and outlines limitations and future directions in this field. Radiologists should become familiar with the principles and potential applications of deep learning in medical imaging. ©RSNA, 2017.", "year": 2017, "referenceCount": 28, "citationCount": 583, "influentialCitationCount": 14, "isOpenAccess": true, "fieldsOfStudy": ["Medicine"], "authors": [{"authorId": "38162399", "name": "G. Chartrand"}, {"authorId": "34842677", "name": "P. Cheng"}, {"authorId": "37627814", "name": "Eugene Vorontsov"}, {"authorId": "3325894", "name": "M. Drozdzal"}, {"authorId": "3622148", "name": "S. Turcotte"}, {"authorId": "1972076", "name": "C. Pal"}, {"authorId": "1781469", "name": "S. Kadoury"}, {"authorId": "2080173111", "name": "A. Tang"}]}, {"paperId": "bcce96a2a074448953fc61a29a84afbdfc8db55a", "url": "https://www.semanticscholar.org/paper/bcce96a2a074448953fc61a29a84afbdfc8db55a", "title": "Online Learning and Online Convex Optimization", "abstract": "Online learning is a well established learning paradigm which has both theoretical and practical appeals. The goal of online learning is to make a sequence of accurate predictions given knowledge of the correct answer to previous prediction tasks and possibly additional available information. Online learning has been studied in several research fields including game theory, information theory, and machine learning. It also became of great interest to practitioners due the recent emergence of large scale applications such as online advertisement placement and online web ranking. In this survey we provide a modern overview of online learning. Our goal is to give the reader a sense of some of the interesting ideas and in particular to underscore the centrality of convexity in deriving efficient online learning algorithms. We do not mean to be comprehensive but rather to give a high-level, rigorous yet easy to follow, survey.", "year": 2012, "referenceCount": 48, "citationCount": 1732, "influentialCitationCount": 216, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1389955537", "name": "S. Shalev-Shwartz"}]}, {"paperId": "7c7f1bb3d483df4c4a20b78a91b833f32d6bdcc5", "url": "https://www.semanticscholar.org/paper/7c7f1bb3d483df4c4a20b78a91b833f32d6bdcc5", "title": "Machine learning in virtual screening.", "abstract": "In this review, we highlight recent applications of machine learning to virtual screening, focusing on the use of supervised techniques to train statistical learning algorithms to prioritize databases of molecules as active against a particular protein target. Both ligand-based similarity searching and structure-based docking have benefited from machine learning algorithms, including naïve Bayesian classifiers, support vector machines, neural networks, and decision trees, as well as more traditional regression techniques. Effective application of these methodologies requires an appreciation of data preparation, validation, optimization, and search methodologies, and we also survey developments in these areas.", "year": 2009, "referenceCount": 161, "citationCount": 167, "influentialCitationCount": 4, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "20751784", "name": "James L. Melville"}, {"authorId": "1741789", "name": "E. Burke"}, {"authorId": "2499418", "name": "J. Hirst"}]}, {"paperId": "4a9678a38a70429588541518e8ed33995beb4baa", "url": "https://www.semanticscholar.org/paper/4a9678a38a70429588541518e8ed33995beb4baa", "title": "Learning phase transitions by confusion", "abstract": null, "year": 2016, "referenceCount": 28, "citationCount": 501, "influentialCitationCount": 10, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "51481163", "name": "E. V. Nieuwenburg"}, {"authorId": "119924153", "name": "Ye-Hua Liu"}, {"authorId": "39971786", "name": "S. Huber"}]}, {"paperId": "5f4c2600317338978041af2aa9101f62d9f6790e", "url": "https://www.semanticscholar.org/paper/5f4c2600317338978041af2aa9101f62d9f6790e", "title": "Searching for exotic particles in high-energy physics with deep learning.", "abstract": null, "year": 2014, "referenceCount": 28, "citationCount": 979, "influentialCitationCount": 82, "isOpenAccess": true, "fieldsOfStudy": ["Physics", "Medicine"], "authors": [{"authorId": "144902513", "name": "P. Baldi"}, {"authorId": "47696458", "name": "Peter Sadowski"}, {"authorId": "104317636", "name": "D. Whiteson"}]}, {"paperId": "ccd1282aea3cc7c3d40300d82472fc5f9f54cb8e", "url": "https://www.semanticscholar.org/paper/ccd1282aea3cc7c3d40300d82472fc5f9f54cb8e", "title": "Online Learning for Matrix Factorization and Sparse Coding", "abstract": "Sparse coding--that is, modelling data vectors as sparse linear combinations of basis elements--is widely used in machine learning, neuroscience, signal processing, and statistics. This paper focuses on the large-scale matrix factorization problem that consists of learning the basis set in order to adapt it to specific data. Variations of this problem include dictionary learning in signal processing, non-negative matrix factorization and sparse principal component analysis. In this paper, we propose to address these tasks with a new online optimization algorithm, based on stochastic approximations, which scales up gracefully to large data sets with millions of training samples, and extends naturally to various matrix factorization formulations, making it suitable for a wide range of learning problems. A proof of convergence is presented, along with experiments with natural images and genomic data demonstrating that it leads to state-of-the-art performance in terms of speed and optimization for both small and large data sets.", "year": 2009, "referenceCount": 94, "citationCount": 2506, "influentialCitationCount": 299, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "2599292", "name": "J. Mairal"}, {"authorId": "144570279", "name": "F. Bach"}, {"authorId": "144189388", "name": "J. Ponce"}, {"authorId": "1699339", "name": "G. Sapiro"}]}, {"paperId": "872352b0a53ab6cbb4420f81df64d215d86c7d9b", "url": "https://www.semanticscholar.org/paper/872352b0a53ab6cbb4420f81df64d215d86c7d9b", "title": "Emotions from Text: Machine Learning for Text-based Emotion Prediction", "abstract": "In addition to information, text contains attitudinal, and more specifically, emotional content. This paper explores the text-based emotion prediction problem empirically, using supervised machine learning with the SNoW learning architecture. The goal is to classify the emotional affinity of sentences in the narrative domain of children's fairy tales, for subsequent usage in appropriate expressive rendering of text-to-speech synthesis. Initial experiments on a preliminary data set of 22 fairy tales show encouraging results over a naive baseline and BOW approach for classification of emotional versus non-emotional contents, with some dependency on parameter tuning. We also discuss results for a tripartite model which covers emotional valence, as well as feature set alternations. In addition, we present plans for a more cognitively sound sequential model, taking into consideration a larger set of basic emotions.", "year": 2005, "referenceCount": 35, "citationCount": 865, "influentialCitationCount": 59, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144648940", "name": "Cecilia Ovesdotter Alm"}, {"authorId": "144590225", "name": "D. Roth"}, {"authorId": "145421878", "name": "R. Sproat"}]}, {"paperId": "a206216c3f67605ac6e25b0178c3f156dc0f7ba0", "url": "https://www.semanticscholar.org/paper/a206216c3f67605ac6e25b0178c3f156dc0f7ba0", "title": "WEKA: a machine learning workbench", "abstract": "WEKA is a workbench for machine learning that is intended to aid in the application of machine learning techniques to a variety of real-world problems, in particular, those arising from agricultural and horticultural domains. Unlike other machine learning projects, the emphasis is on providing a working environment for the domain specialist rather than the machine learning expert. Lessons learned include the necessity of providing a wealth of interactive tools for data manipulation, result visualization, database linkage, and cross-validation and comparison of rule sets, to complement the basic machine learning tools.<<ETX>>", "year": 1994, "referenceCount": 22, "citationCount": 1054, "influentialCitationCount": 112, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144189431", "name": "G. Holmes"}, {"authorId": "1382098662", "name": "A. Donkin"}, {"authorId": "9419406", "name": "I. Witten"}]}, {"paperId": "b51a3a7d676df7947a0b28fb902a5a9f0bdf54ee", "url": "https://www.semanticscholar.org/paper/b51a3a7d676df7947a0b28fb902a5a9f0bdf54ee", "title": "IAM Graph Database Repository for Graph Based Pattern Recognition and Machine Learning", "abstract": null, "year": 2008, "referenceCount": 34, "citationCount": 439, "influentialCitationCount": 59, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1759104", "name": "Kaspar Riesen"}, {"authorId": "1720945", "name": "H. Bunke"}]}, {"paperId": "5b59992ca6b77aaec066a0d3142336d2cb1028f1", "url": "https://www.semanticscholar.org/paper/5b59992ca6b77aaec066a0d3142336d2cb1028f1", "title": "A survey of deep learning-based network anomaly detection", "abstract": null, "year": 2017, "referenceCount": 47, "citationCount": 414, "influentialCitationCount": 11, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1905560", "name": "Donghwoon Kwon"}, {"authorId": "2109871406", "name": "Hyunjoo Kim"}, {"authorId": "2109199266", "name": "Jinoh Kim"}, {"authorId": "2637314", "name": "S. Suh"}, {"authorId": "2107699", "name": "Ikkyun Kim"}, {"authorId": "3317011", "name": "Kuinam J. Kim"}]}, {"paperId": "9512facd37bba2ff1ece31900c08901bb011f1ce", "url": "https://www.semanticscholar.org/paper/9512facd37bba2ff1ece31900c08901bb011f1ce", "title": "Using Machine Teaching to Identify Optimal Training-Set Attacks on Machine Learners", "abstract": "\n \n We investigate a problem at the intersection of machine learning and security: training-set attacks on machine learners. In such attacks an attacker contaminates the training data so that a specific learning algorithm would produce a model profitable to the attacker. Understanding training-set attacks is important as more intelligent agents (e.g. spam filters and robots) are equipped with learning capability and can potentially be hacked via data they receive from the environment. This paper identifies the optimal training-set attack on a broad family of machine learners. First we show that optimal training-set attack can be formulated as a bilevel optimization problem. Then we show that for machine learners with certain Karush-Kuhn-Tucker conditions we can solve the bilevel problem efficiently using gradient methods on an implicit function. As examples, we demonstrate optimal training-set attacks on Support VectorMachines, logistic regression, and linear regression with extensive experiments. Finally, we discuss potential defenses against such attacks.\n \n", "year": 2015, "referenceCount": 32, "citationCount": 311, "influentialCitationCount": 37, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2121022", "name": "Shike Mei"}, {"authorId": "1832364", "name": "Xiaojin Zhu"}]}, {"paperId": "9c4da62e9e89e65ac78ee271e424e8b498053e8c", "url": "https://www.semanticscholar.org/paper/9c4da62e9e89e65ac78ee271e424e8b498053e8c", "title": "Advances in kernel methods: support vector learning", "abstract": "Introduction to support vector learning roadmap. Part 1 Theory: three remarks on the support vector method of function estimation, Vladimir Vapnik generalization performance of support vector machines and other pattern classifiers, Peter Bartlett and John Shawe-Taylor Bayesian voting schemes and large margin classifiers, Nello Cristianini and John Shawe-Taylor support vector machines, reproducing kernel Hilbert spaces, and randomized GACV, Grace Wahba geometry and invariance in kernel based methods, Christopher J.C. Burges on the annealed VC entropy for margin classifiers - a statistical mechanics study, Manfred Opper entropy numbers, operators and support vector kernels, Robert C. Williamson et al. Part 2 Implementations: solving the quadratic programming problem arising in support vector classification, Linda Kaufman making large-scale support vector machine learning practical, Thorsten Joachims fast training of support vector machines using sequential minimal optimization, John C. Platt. Part 3 Applications: support vector machines for dynamic reconstruction of a chaotic system, Davide Mattera and Simon Haykin using support vector machines for time series prediction, Klaus-Robert Muller et al pairwise classification and support vector machines, Ulrich Kressel. Part 4 Extensions of the algorithm: reducing the run-time complexity in support vector machines, Edgar E. Osuna and Federico Girosi support vector regression with ANOVA decomposition kernels, Mark O. Stitson et al support vector density estimation, Jason Weston et al combining support vector and mathematical programming methods for classification, Bernhard Scholkopf et al.", "year": 1999, "referenceCount": 235, "citationCount": 5422, "influentialCitationCount": 217, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics"], "authors": [{"authorId": "1707625", "name": "B. Schölkopf"}, {"authorId": "2676309", "name": "C. Burges"}, {"authorId": "46234526", "name": "Alex Smola"}]}, {"paperId": "3c1dfe0b52c0638ff69a187ae183e8cdeebff303", "url": "https://www.semanticscholar.org/paper/3c1dfe0b52c0638ff69a187ae183e8cdeebff303", "title": "Machine-Learning Research Four Current Directions", "abstract": "The last five years have seen an explosion in machine-learning research. This explosion has many causes: First, separate research communities in symbolic machine learning, computational learning theory, neural networks, statistics, and pattern recognition have discovered one another and begun to work together. Second, machine-learning techniques are being applied to new kinds of problem, including knowledge discovery in databases, language processing, robot control, and combinatorial optimization, as well as to more traditional problems such as speech recognition, face recognition, handwriting recognition, medical data analysis, and game playing. In this article, I selected four topics within machine learning where there has been a lot of recent activity. The purpose of the article is to describe the results in these areas to a broader AI audience and to sketch some of the open research problems. The topic areas are (1) ensembles of classifiers, (2) methods for scaling up supervised learning algorithms, (3) reinforcement learning, and (4) the learning of complex stochastic models. The reader should be cautioned that this article is not a comprehensive review of each of these topics. Rather, my goal is to provide a representative sample of the research in each of these four areas. In each of the areas, there are many other papers that describe relevant work. I apologize to those authors whose work I was unable to include in the article. Ensembles of Classifiers", "year": 1997, "referenceCount": 128, "citationCount": 1003, "influentialCitationCount": 56, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144299726", "name": "Thomas G. Dietterich"}]}, {"paperId": "3e397756f7c64c2ce77510f9f0539fae1171ee92", "url": "https://www.semanticscholar.org/paper/3e397756f7c64c2ce77510f9f0539fae1171ee92", "title": "An Insight into Extreme Learning Machines: Random Neurons, Random Features and Kernels", "abstract": null, "year": 2014, "referenceCount": 92, "citationCount": 816, "influentialCitationCount": 51, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145678691", "name": "G. Huang"}]}, {"paperId": "d517b13f2b152c913b81ce534a149493517dbdad", "url": "https://www.semanticscholar.org/paper/d517b13f2b152c913b81ce534a149493517dbdad", "title": "Big Data Deep Learning: Challenges and Perspectives", "abstract": "Deep learning is currently an extremely active research area in machine learning and pattern recognition society. It has gained huge successes in a broad area of applications such as speech recognition, computer vision, and natural language processing. With the sheer size of data available today, big data brings big opportunities and transformative potential for various sectors; on the other hand, it also presents unprecedented challenges to harnessing data and information. As the data keeps getting bigger, deep learning is coming to play a key role in providing big data predictive analytics solutions. In this paper, we provide a brief overview of deep learning, and highlight current research efforts and the challenges to big data, as well as the future trends.", "year": 2014, "referenceCount": 110, "citationCount": 867, "influentialCitationCount": 30, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2145447101", "name": "Xue-wen Chen"}, {"authorId": "39376164", "name": "Xiaotong Lin"}]}, {"paperId": "c9d60858f1cbe6b7eb36473b7d37ff4b73c31af8", "url": "https://www.semanticscholar.org/paper/c9d60858f1cbe6b7eb36473b7d37ff4b73c31af8", "title": "Machine Learning from Imbalanced Data Sets 101", "abstract": "For research to progress most effectively, we first should establish common ground regarding just what is the problem that imbalanced data sets present to machine learning systems. Why and when should imbalanced data sets be problematic? When is the problem simply an artifact of easily rectified design choices? I will try to pick the low-hanging fruit and share them with the rest of the workshop participants. Specifically, I would like to discuss what the problem is not. I hope this will lead to a profitable discussion of what the problem indeed is, and how it might be addressed most effectively.", "year": 2008, "referenceCount": 8, "citationCount": 430, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1752722", "name": "F. Provost"}]}, {"paperId": "50feafd2cdafdfb1eead14388f6210f6b467eaa0", "url": "https://www.semanticscholar.org/paper/50feafd2cdafdfb1eead14388f6210f6b467eaa0", "title": "Pareto-Based Multiobjective Machine Learning: An Overview and Case Studies", "abstract": "Machine learning is inherently a multiobjective task. Traditionally, however, either only one of the objectives is adopted as the cost function or multiple objectives are aggregated to a scalar cost function. This can be mainly attributed to the fact that most conventional learning algorithms can only deal with a scalar cost function. Over the last decade, efforts on solving machine learning problems using the Pareto-based multiobjective optimization methodology have gained increasing impetus, particularly due to the great success of multiobjective optimization using evolutionary algorithms and other population-based stochastic search methods. It has been shown that Pareto-based multiobjective learning approaches are more powerful compared to learning algorithms with a scalar cost function in addressing various topics of machine learning, such as clustering, feature selection, improvement of generalization ability, knowledge extraction, and ensemble generation. One common benefit of the different multiobjective learning approaches is that a deeper insight into the learning problem can be gained by analyzing the Pareto front composed of multiple Pareto-optimal solutions. This paper provides an overview of the existing research on multiobjective machine learning, focusing on supervised learning. In addition, a number of case studies are provided to illustrate the major benefits of the Pareto-based approach to machine learning, e.g., how to identify interpretable models and models that can generalize on unseen data from the obtained Pareto-optimal solutions. Three approaches to Pareto-based multiobjective ensemble generation are compared and discussed in detail. Finally, potentially interesting topics in multiobjective machine learning are suggested.", "year": 2008, "referenceCount": 109, "citationCount": 354, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2157835870", "name": "Yaochu Jin"}, {"authorId": "1718432", "name": "B. Sendhoff"}]}, {"paperId": "5726c7b40fcc454b77d989656c085520bf6c15fa", "url": "https://www.semanticscholar.org/paper/5726c7b40fcc454b77d989656c085520bf6c15fa", "title": "Multimodal learning with deep Boltzmann machines", "abstract": "Data often consists of multiple diverse modalities. For example, images are tagged with textual information and videos are accompanied by audio. Each modality is characterized by having distinct statistical properties. We propose a Deep Boltzmann Machine for learning a generative model of such multimodal data. We show that the model can be used to create fused representations by combining features across modalities. These learned representations are useful for classification and information retrieval. By sampling from the conditional distributions over each data modality, it is possible to create these representations even when some data modalities are missing. We conduct experiments on bimodal image-text and audio-video data. The fused representation achieves good classification results on the MIR-Flickr data set matching or outperforming other deep models as well as SVM based models that use Multiple Kernel Learning. We further demonstrate that this multimodal model helps classification and retrieval even when only unimodal data is available at test time.", "year": 2012, "referenceCount": 46, "citationCount": 1555, "influentialCitationCount": 126, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2897313", "name": "Nitish Srivastava"}, {"authorId": "145124475", "name": "R. Salakhutdinov"}]}, {"paperId": "7550a05bf00f7b24aed9c1ac3ef000575388d21c", "url": "https://www.semanticscholar.org/paper/7550a05bf00f7b24aed9c1ac3ef000575388d21c", "title": "Making large scale SVM learning practical", "abstract": "Training a support vector machine SVM leads to a quadratic optimization problem with bound constraints and one linear equality constraint. Despite the fact that this type of problem is well understood, there are many issues to be considered in designing an SVM learner. In particular, for large learning tasks with many training examples on the shelf optimization techniques for general quadratic programs quickly become intractable in their memory and time requirements. SVM light is an implementation of an SVM learner which addresses the problem of large tasks. This chapter presents algorithmic and computational results developed for SVM light V 2.0, which make large-scale SVM training more practical. The results give guidelines for the application of SVMs to large domains.", "year": 1998, "referenceCount": 14, "citationCount": 5531, "influentialCitationCount": 507, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1680188", "name": "T. Joachims"}]}, {"paperId": "9011405b759b492b1132aea7b6165c9d1b0513e7", "url": "https://www.semanticscholar.org/paper/9011405b759b492b1132aea7b6165c9d1b0513e7", "title": "Reconciling schemas of disparate data sources: a machine-learning approach", "abstract": "A data-integration system provides access to a multitude of data sources through a single mediated schema. A key bottleneck in building such systems has been the laborious manual construction of semantic mappings between the source schemas and the mediated schema. We describe LSD, a system that employs and extends current machine-learning techniques to semi-automatically find such mappings. LSD first asks the user to provide the semantic mappings for a small set of data sources, then uses these mappings together with the sources to train a set of learners. Each learner exploits a different type of information either in the source schemas or in their data. Once the learners have been trained, LSD finds semantic mappings for a new data source by applying the learners, then combining their predictions using a meta-learner. To further improve matching accuracy, we extend machine learning techniques so that LSD can incorporate domain constraints as an additional source of knowledge, and develop a novel learner that utilizes the structural information in XML documents. Our approach thus is distinguished in that it incorporates multiple types of knowledge. Importantly, its architecture is extensible to additional learners that may exploit new kinds of information. We describe a set of experiments on several real-world domains, and show that LSD proposes semantic mappings with a high degree of accuracy.", "year": 2001, "referenceCount": 28, "citationCount": 901, "influentialCitationCount": 68, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "3030274", "name": "A. Doan"}, {"authorId": "1740213", "name": "Pedro M. Domingos"}, {"authorId": "1770962", "name": "A. Halevy"}]}, {"paperId": "a84f4fe31fcfb4ad92c995dba0fc09ed8fe6a4f4", "url": "https://www.semanticscholar.org/paper/a84f4fe31fcfb4ad92c995dba0fc09ed8fe6a4f4", "title": "Exploiting Machine Learning to Subvert Your Spam Filter", "abstract": "Using statistical machine learning for making security decisions introduces new vulnerabilities in large scale systems. This paper shows how an adversary can exploit statistical machine learning, as used in the SpamBayes spam filter, to render it useless--even if the adversary's access is limited to only 1% of the training messages. We further demonstrate a new class of focused attacks that successfully prevent victims from receiving specific email messages. Finally, we introduce two new types of defenses against these attacks.", "year": 2008, "referenceCount": 21, "citationCount": 297, "influentialCitationCount": 17, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39743720", "name": "Blaine Nelson"}, {"authorId": "145140480", "name": "M. Barreno"}, {"authorId": "1852911", "name": "F. J. Chi"}, {"authorId": "1687701", "name": "A. Joseph"}, {"authorId": "1868067", "name": "Benjamin I. P. Rubinstein"}, {"authorId": "39708572", "name": "Udam Saini"}, {"authorId": "37210858", "name": "Charles Sutton"}, {"authorId": "1787610", "name": "J. Tygar"}, {"authorId": "2065015702", "name": "Kai Xia"}]}, {"paperId": "ae20c630759847cd88655631d0041b0be127fd0c", "url": "https://www.semanticscholar.org/paper/ae20c630759847cd88655631d0041b0be127fd0c", "title": "Transfer Learning for Visual Categorization: A Survey", "abstract": "Regular machine learning and data mining techniques study the training data for future inferences under a major assumption that the future data are within the same feature space or have the same distribution as the training data. However, due to the limited availability of human labeled training data, training data that stay in the same feature space or have the same distribution as the future data cannot be guaranteed to be sufficient enough to avoid the over-fitting problem. In real-world applications, apart from data in the target domain, related data in a different domain can also be included to expand the availability of our prior knowledge about the target future data. Transfer learning addresses such cross-domain learning problems by extracting useful information from data in a related domain and transferring them for being used in target tasks. In recent years, with transfer learning being applied to visual categorization, some typical problems, e.g., view divergence in action recognition tasks and concept drifting in image classification tasks, can be efficiently solved. In this paper, we survey state-of-the-art transfer learning algorithms in visual categorization applications, such as object recognition, image classification, and human action recognition.", "year": 2015, "referenceCount": 99, "citationCount": 583, "influentialCitationCount": 16, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144082425", "name": "L. Shao"}, {"authorId": "152506137", "name": "F. Zhu"}, {"authorId": "67180560", "name": "Xuelong Li"}]}, {"paperId": "391b86cf16c2702dcc4beee55a6dd6d3bd7cf27b", "url": "https://www.semanticscholar.org/paper/391b86cf16c2702dcc4beee55a6dd6d3bd7cf27b", "title": "Deep Learning for Content-Based Image Retrieval: A Comprehensive Study", "abstract": "Learning effective feature representations and similarity measures are crucial to the retrieval performance of a content-based image retrieval (CBIR) system. Despite extensive research efforts for decades, it remains one of the most challenging open problems that considerably hinders the successes of real-world CBIR systems. The key challenge has been attributed to the well-known ``semantic gap'' issue that exists between low-level image pixels captured by machines and high-level semantic concepts perceived by human. Among various techniques, machine learning has been actively investigated as a possible direction to bridge the semantic gap in the long term. Inspired by recent successes of deep learning techniques for computer vision and other applications, in this paper, we attempt to address an open problem: if deep learning is a hope for bridging the semantic gap in CBIR and how much improvements in CBIR tasks can be achieved by exploring the state-of-the-art deep learning techniques for learning feature representations and similarity measures. Specifically, we investigate a framework of deep learning with application to CBIR tasks with an extensive set of empirical studies by examining a state-of-the-art deep learning method (Convolutional Neural Networks) for CBIR tasks under varied settings. From our empirical studies, we find some encouraging results and summarize some important insights for future research.", "year": 2014, "referenceCount": 59, "citationCount": 790, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2041852738", "name": "Ji Wan"}, {"authorId": "47858913", "name": "Dayong Wang"}, {"authorId": "1741126", "name": "S. Hoi"}, {"authorId": "2406415", "name": "Pengcheng Wu"}, {"authorId": "1704030", "name": "Jianke Zhu"}, {"authorId": "1699819", "name": "Yongdong Zhang"}, {"authorId": "30821609", "name": "Jintao Li"}]}, {"paperId": "4417f78b31546227784941bbd6f6532a177e60b8", "url": "https://www.semanticscholar.org/paper/4417f78b31546227784941bbd6f6532a177e60b8", "title": "Deep Learning using Linear Support Vector Machines", "abstract": "Recently, fully-connected and convolutional neural networks have been trained to achieve state-of-the-art performance on a wide variety of tasks such as speech recognition, image classification, natural language processing, and bioinformatics. For classification tasks, most of these \"deep learning\" models employ the softmax activation function for prediction and minimize cross-entropy loss. In this paper, we demonstrate a small but consistent advantage of replacing the softmax layer with a linear support vector machine. Learning minimizes a margin-based loss instead of the cross-entropy loss. While there have been various combinations of neural nets and SVMs in prior art, our results using L2-SVMs show that by simply replacing softmax with linear SVMs gives significant gains on popular deep learning datasets MNIST, CIFAR-10, and the ICML 2013 Representation Learning Workshop's face expression recognition challenge.", "year": 2013, "referenceCount": 25, "citationCount": 736, "influentialCitationCount": 69, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "34312504", "name": "Yichuan Tang"}]}, {"paperId": "5f198e9f1a6cace1fcee5ec53f5d35d9d83af6b7", "url": "https://www.semanticscholar.org/paper/5f198e9f1a6cace1fcee5ec53f5d35d9d83af6b7", "title": "Can machine learning be secure?", "abstract": "Machine learning systems offer unparalled flexibility in dealing with evolving input in a variety of applications, such as intrusion detection systems and spam e-mail filtering. However, machine learning algorithms themselves can be a target of attack by a malicious adversary. This paper provides a framework for answering the question, \"Can machine learning be secure?\" Novel contributions of this paper include a taxonomy of different types of attacks on machine learning techniques and systems, a variety of defenses against those attacks, a discussion of ideas that are important to security for machine learning, an analytical model giving a lower bound on attacker's work function, and a list of open problems.", "year": 2006, "referenceCount": 40, "citationCount": 803, "influentialCitationCount": 56, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145140480", "name": "M. Barreno"}, {"authorId": "39743720", "name": "Blaine Nelson"}, {"authorId": "145879573", "name": "R. Sears"}, {"authorId": "1687701", "name": "A. Joseph"}, {"authorId": "1787610", "name": "J. Tygar"}]}, {"paperId": "07295d6836d8fadd4150328d33659e5022fccc2f", "url": "https://www.semanticscholar.org/paper/07295d6836d8fadd4150328d33659e5022fccc2f", "title": "Structured machine learning: the next ten years", "abstract": null, "year": 2008, "referenceCount": 111, "citationCount": 131, "influentialCitationCount": 2, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "144299726", "name": "Thomas G. Dietterich"}, {"authorId": "1740213", "name": "Pedro M. Domingos"}, {"authorId": "1746034", "name": "L. Getoor"}, {"authorId": "145147566", "name": "S. Muggleton"}, {"authorId": "1729906", "name": "Prasad Tadepalli"}]}, {"paperId": "59882b92d0183163e897a671b8c9298f89df5df3", "url": "https://www.semanticscholar.org/paper/59882b92d0183163e897a671b8c9298f89df5df3", "title": "Task-Driven Dictionary Learning", "abstract": "Modeling data with linear combinations of a few elements from a learned dictionary has been the focus of much recent research in machine learning, neuroscience, and signal processing. For signals such as natural images that admit such sparse representations, it is now well established that these models are well suited to restoration tasks. In this context, learning the dictionary amounts to solving a large-scale matrix factorization problem, which can be done efficiently with classical optimization tools. The same approach has also been used for learning features from data for other purposes, e.g., image classification, but tuning the dictionary in a supervised way for these tasks has proven to be more difficult. In this paper, we present a general formulation for supervised dictionary learning adapted to a wide variety of tasks, and present an efficient algorithm for solving the corresponding optimization problem. Experiments on handwritten digit classification, digital art identification, nonlinear inverse image problems, and compressed sensing demonstrate that our approach is effective in large-scale settings, and is well suited to supervised and semi-supervised classification, as well as regression tasks for data that admit sparse representations.", "year": 2010, "referenceCount": 61, "citationCount": 877, "influentialCitationCount": 98, "isOpenAccess": true, "fieldsOfStudy": ["Mathematics", "Computer Science", "Medicine"], "authors": [{"authorId": "2599292", "name": "J. Mairal"}, {"authorId": "144570279", "name": "F. Bach"}, {"authorId": "144189388", "name": "J. Ponce"}]}, {"paperId": "464ebd4c86542e1610d67a9bc8810b8a7c109efe", "url": "https://www.semanticscholar.org/paper/464ebd4c86542e1610d67a9bc8810b8a7c109efe", "title": "Convex incremental extreme learning machine", "abstract": null, "year": 2007, "referenceCount": 29, "citationCount": 1043, "influentialCitationCount": 31, "isOpenAccess": false, "fieldsOfStudy": ["Mathematics", "Computer Science"], "authors": [{"authorId": "145678691", "name": "G. Huang"}, {"authorId": "2146071327", "name": "Lei Chen"}]}, {"paperId": "664b701a39371c5356754dc72cea1349233c8506", "url": "https://www.semanticscholar.org/paper/664b701a39371c5356754dc72cea1349233c8506", "title": "Computer Systems That Learn: Classification and Prediction Methods from Statistics, Neural Nets, Machine Learning and Expert Systems", "abstract": "Preface 1 Overview of Learning Systems 1.1 What is a Learning System? 1.2 Motivation for Building Learning Systems 1.3 Types of Practical Empirical Learning Systems 1.3.1 Common Theme: The Classification Model 1.3.2 Let the Data Speak 1.4 What's New in Learning Methods 1.4.1 The Impact of New Technology 1.5 Outline of the Book 1.6 Bibliographical and Historical Remarks 2 How to Estimate the True Performance of a Learning System 2.1 The Importance of Unbiased Error Rate Estimation 2.2. What is an Error? 2.2.1 Costs and Risks 2.3 Apparent Error Rate Estimates 2.4 Too Good to Be True: Overspecialization 2.5 True Error Rate Estimation 2.5.1 The Idealized Model for Unlimited Samples 2.5.2 Train-and Test Error Rate Estimation 2.5.3 Resampling Techniques 2.5.4 Finding the Right Complexity Fit 2.6 Getting the Most Out of the Data 2.7 Classifier Complexity and Feature Dimensionality 2.7.1 Expected Patterns of Classifier Behavior 2.8 What Can Go Wrong? 2.8.1 Poor Features, Data Errors, and Mislabeled Classes 2.8.2 Unrepresentative Samples 2.9 How Close to the Truth? 2.10 Common Mistakes in Performance Analysis 2.11 Bibliographical and Historical Remarks 3 Statistical Pattern Recognition 3.1 Introduction and Overview 3.2 A Few Sample Applications 3.3 Bayesian Classifiers 3.3.1 Direct Application of the Bayes Rule 3.4 Linear Discriminants 3.4.1 The Normality Assumption and Discriminant Functions 3.4.2 Logistic Regression 3.5 Nearest Neighbor Methods 3.6 Feature Selection 3.7 Error Rate Analysis 3.8 Bibliographical and Historical Remarks 4 Neural Nets 4.1 Introduction and Overview 4.2 Perceptrons 4.2.1 Least Mean Square Learning Systems 4.2.2 How Good Is a Linear Separation Network? 4.3 Multilayer Neural Networks 4.3.1 Back-Propagation 4.3.2 The Practical Application of Back-Propagation 4.4 Error Rate and Complexity Fit Estimation 4.5 Improving on Standard Back-Propagation 4.6 Bibliographical and Historical Remarks 5 Machine Learning: Easily Understood Decision Rules 5.1 Introduction and Overview 5.2 Decision Trees 5.2.1 Finding the Perfect Tree 5.2.2 The Incredible Shrinking Tree 5.2.3 Limitations of Tree Induction Methods 5.3 Rule Induction 5.3.1 Predictive Value Maximization 5.4 Bibliographical and Historical Remarks 6 Which Technique is Best? 6.1 What's Important in Choosing a Classifier? 6.1.1 Prediction Accuracy 6.1.2 Speed of Learning and Classification 6.1.3 Explanation and Insight 6.2 So, How Do I Choose a Learning System? 6.3 Variations on the Standard Problem 6.3.1 Missing Data 6.3.2 Incremental Learning 6.4 Future Prospects for Improved Learning Methods 6.5 Bibliographical and Historical Remarks 7 Expert Systems 7.1 Introduction and Overview 7.1.1 Why Build Expert Systems? New vs. Old Knowledge 7.2 Estimating Error Rates for Expert Systems 7.3 Complexity of Knowledge Bases 7.3.1 How Many Rules Are Too Many? 7.4 Knowledge Base Example 7.5 Empirical Analysis of Knowledge Bases 7.6 Future: Combined Learning and Expert Systems 7.7 Bibliographical and Historical Remarks References Author Index Subject Index", "year": 1990, "referenceCount": 0, "citationCount": 1065, "influentialCitationCount": 41, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "145700185", "name": "S. Weiss"}, {"authorId": "3285789", "name": "C. Kulikowski"}]}, {"paperId": "83cf4b2f39bcc802b09fd59b69e23068447b26b7", "url": "https://www.semanticscholar.org/paper/83cf4b2f39bcc802b09fd59b69e23068447b26b7", "title": "Multi-Task Learning for Multiple Language Translation", "abstract": "In this paper, we investigate the problem of learning a machine translation model that can simultaneously translate sentences from one source language to multiple target languages. Our solution is inspired by the recently proposed neural machine translation model which generalizes machine translation as a sequence learning problem. We extend the neural machine translation to a multi-task learning framework which shares source language representation and separates the modeling of different target language translation. Our framework can be applied to situations where either large amounts of parallel data or limited parallel data is available. Experiments show that our multi-task learning model is able to achieve significantly higher translation quality over individually learned model in both situations on the data sets publicly available.", "year": 2015, "referenceCount": 21, "citationCount": 509, "influentialCitationCount": 51, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "9532787", "name": "Daxiang Dong"}, {"authorId": "40354707", "name": "Hua Wu"}, {"authorId": "48692318", "name": "W. He"}, {"authorId": "3046102", "name": "Dianhai Yu"}, {"authorId": "144270731", "name": "Haifeng Wang"}]}, {"paperId": "c0927ffb79810318daab8821068629975cab67ad", "url": "https://www.semanticscholar.org/paper/c0927ffb79810318daab8821068629975cab67ad", "title": "Deep Learning for Classification of Malware System Call Sequences", "abstract": null, "year": 2016, "referenceCount": 43, "citationCount": 375, "influentialCitationCount": 21, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2582104", "name": "Bojan Kolosnjaji"}, {"authorId": "2403031", "name": "Apostolis Zarras"}, {"authorId": "1396893935", "name": "George D. Webster"}, {"authorId": "49601001", "name": "C. Eckert"}]}, {"paperId": "035256a8a6d8a73af2adb38245f4130daa1f0535", "url": "https://www.semanticscholar.org/paper/035256a8a6d8a73af2adb38245f4130daa1f0535", "title": "Machine learning in bioinformatics", "abstract": "This article reviews machine learning methods for bioinformatics. It presents modelling methods, such as supervised classification, clustering and probabilistic graphical models for knowledge discovery, as well as deterministic and stochastic heuristics for optimization. Applications in genomics, proteomics, systems biology, evolution and text mining are also shown.", "year": 2006, "referenceCount": 301, "citationCount": 769, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "144999310", "name": "P. Larrañaga"}, {"authorId": "145892659", "name": "Borja Calvo"}, {"authorId": "145585784", "name": "Roberto Santana"}, {"authorId": "1687365", "name": "C. Bielza"}, {"authorId": "2086344475", "name": "Josu Galdiano"}, {"authorId": "1788277", "name": "Iñaki Inza"}, {"authorId": "144762651", "name": "J. A. Lozano"}, {"authorId": "2708156", "name": "Rubén Armañanzas"}, {"authorId": "1800760", "name": "G. Santafé"}, {"authorId": "2110404467", "name": "Aritz Pérez Martínez"}, {"authorId": "145689219", "name": "V. Robles"}]}, {"paperId": "028165965fdf066821e1b65ac1de3ae6c503c30d", "url": "https://www.semanticscholar.org/paper/028165965fdf066821e1b65ac1de3ae6c503c30d", "title": "Editorial: On Machine Learning", "abstract": null, "year": 1986, "referenceCount": 22, "citationCount": 864, "influentialCitationCount": 0, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1713919", "name": "P. Langley"}]}, {"paperId": "1f135e98e867ffcde5b359e7b817bbe21f80cfce", "url": "https://www.semanticscholar.org/paper/1f135e98e867ffcde5b359e7b817bbe21f80cfce", "title": "Deep Learning and Its Application to LHC Physics", "abstract": "Machine learning has played an important role in the analysis of high-energy physics data for decades. The emergence of deep learning in 2012 allowed for machine learning tools which could adeptly handle higher-dimensional and more complex problems than previously feasible. This review is aimed at the reader who is familiar with high-energy physics but not machine learning. The connections between machine learning and high-energy physics data analysis are explored, followed by an introduction to the core concepts of neural networks, examples of the key results demonstrating the power of deep learning for analysis of LHC data, and discussion of future prospects and concerns.", "year": 2018, "referenceCount": 38, "citationCount": 223, "influentialCitationCount": 6, "isOpenAccess": true, "fieldsOfStudy": ["Physics"], "authors": [{"authorId": "104284017", "name": "D. Guest"}, {"authorId": "11638962", "name": "K. Cranmer"}, {"authorId": "104317636", "name": "D. Whiteson"}]}, {"paperId": "94ac58d1b6132b07ef66c47af8bd506bdb67e0c3", "url": "https://www.semanticscholar.org/paper/94ac58d1b6132b07ef66c47af8bd506bdb67e0c3", "title": "Investigating statistical machine learning as a tool for software development", "abstract": "As statistical machine learning algorithms and techniques continue to mature, many researchers and developers see statistical machine learning not only as a topic of expert study, but also as a tool for software development. Extensive prior work has studied software development, but little prior work has studied software developers applying statistical machine learning. This paper presents interviews of eleven researchers experienced in applying statistical machine learning algorithms and techniques to human-computer interaction problems, as well as a study of ten participants working during a five-hour study to apply statistical machine learning algorithms and techniques to a realistic problem. We distill three related categories of difficulties that arise in applying statistical machine learning as a tool for software development: (1) difficulty pursuing statistical machine learning as an iterative and exploratory process, (2) difficulty understanding relationships between data and the behavior of statistical machine learning algorithms, and (3) difficulty evaluating the performance of statistical machine learning algorithms and techniques in the context of applications. This paper provides important new insight into these difficulties and the need for development tools that better support the application of statistical machine learning.", "year": 2008, "referenceCount": 32, "citationCount": 110, "influentialCitationCount": 7, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "39699737", "name": "Kayur Patel"}, {"authorId": "145504534", "name": "J. Fogarty"}, {"authorId": "9522307", "name": "J. Landay"}, {"authorId": "40376159", "name": "B. Harrison"}]}, {"paperId": "cfacdf62b0f3e50993a6a55250127d694a2efdce", "url": "https://www.semanticscholar.org/paper/cfacdf62b0f3e50993a6a55250127d694a2efdce", "title": "The city as a machine for learning.", "abstract": "Abstract Despite its centrality to urban politics, economies and life, learning remains a neglected and undertheorised domain in urban geography. In this paper, I address this by exploring a politics of learning through two key sites: first, tactical learning; second, urban learning forums. I offer a conception of learning based on three processes: translation , or the relational distributions through which learning is produced as a sociomaterial epistemology of displacement and change; coordination , or the construction of functional systems that enable learning as a means of linking different forms of knowledge, coping with complexity and facilitating adaptation; and dwelling , or the education of attention through which learning operates as a way of seeing and inhabiting the world. I then consider this conception of learning in relation to tactical learning, i.e. the resources marginal groups use to cope with, negotiate and resist in the city, and urban learning forums, i.e. the possibilities for progressive forms of learning between different constituencies in the city. I conclude with an outline of a critical urbanism of learning.", "year": 2011, "referenceCount": 76, "citationCount": 168, "influentialCitationCount": 18, "isOpenAccess": true, "fieldsOfStudy": ["Sociology"], "authors": [{"authorId": "51937792", "name": "Colin McFarlane"}]}, {"paperId": "6f0cde3fcab0044f386b5b8a4244c371507bec15", "url": "https://www.semanticscholar.org/paper/6f0cde3fcab0044f386b5b8a4244c371507bec15", "title": "A Survey on Metric Learning for Feature Vectors and Structured Data", "abstract": "The need for appropriate ways to measure the distance or similarity between data is ubiquitous in machine learning, pattern recognition and data mining, but handcrafting such good metrics for specific problems is generally difficult. This has led to the emergence of metric learning, which aims at automatically learning a metric from data and has attracted a lot of interest in machine learning and related fields for the past ten years. This survey paper proposes a systematic review of the metric learning literature, highlighting the pros and cons of each approach. We pay particular attention to Mahalanobis distance metric learning, a well-studied and successful framework, but additionally present a wide range of methods that have recently emerged as powerful alternatives, including nonlinear metric learning, similarity learning and local metric learning. Recent trends and extensions, such as semi-supervised metric learning, metric learning for histogram data and the derivation of generalization guarantees, are also covered. Finally, this survey addresses metric learning for structured data, in particular edit distance learning, and attempts to give an overview of the remaining challenges in metric learning for the years to come.", "year": 2013, "referenceCount": 221, "citationCount": 608, "influentialCitationCount": 38, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science", "Mathematics"], "authors": [{"authorId": "1702915", "name": "A. Bellet"}, {"authorId": "1749327", "name": "Amaury Habrard"}, {"authorId": "1738336", "name": "M. Sebban"}]}, {"paperId": "0628fdf728d0aba31be803a7d834c7f4b569408d", "url": "https://www.semanticscholar.org/paper/0628fdf728d0aba31be803a7d834c7f4b569408d", "title": "Imbalanced Learning: Foundations, Algorithms, and Applications", "abstract": "The first book of its kind to review the current status and future direction of the exciting new branch of machine learning/data mining called imbalanced learningImbalanced learning focuses on how an intelligent system can learn when it is provided with imbalanced data. Solving imbalanced learning problems is critical in numerous data-intensive networked systems, including surveillance, security, Internet, finance, biomedical, defense, and more. Due to the inherent complex characteristics of imbalanced data sets, learning from such data requires new understandings, principles, algorithms, and tools to transform vast amounts of raw data efficiently into information and knowledge representation. The first comprehensive look at this new branch of machine learning, this book offers a critical review of the problem of imbalanced learning, covering the state of the art in techniques, principles, and real-world applications. Featuring contributions from experts in both academia and industry, Imbalanced Learning: Foundations, Algorithms, and Applications provides chapter coverage on:Foundations of Imbalanced LearningImbalanced Datasets: From Sampling to ClassifiersEnsemble Methods for Class Imbalance LearningClass Imbalance Learning Methods for Support Vector MachinesClass Imbalance and Active LearningNonstationary Stream Data Learning with Imbalanced Class DistributionAssessment Metrics for Imbalanced LearningImbalanced Learning: Foundations, Algorithms, and Applications will help scientists and engineers learn how to tackle the problem of learning from imbalanced datasets, and gain insight into current developments in the field as well as future research directions.", "year": 2013, "referenceCount": 0, "citationCount": 595, "influentialCitationCount": 44, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2198278", "name": "Haibo He"}, {"authorId": "2363386", "name": "Yunqian Ma"}]}, {"paperId": "ced4db5d559d4614efb5bbbcef353f7aac7a4f25", "url": "https://www.semanticscholar.org/paper/ced4db5d559d4614efb5bbbcef353f7aac7a4f25", "title": "Introduction to Statistical Relational Learning (Adaptive Computation and Machine Learning)", "abstract": "All rights reserved. No part of this book may be reproduced in any form by any electronic or mechanical means (including photocopying, recording, or information storage and retrieval) without permission in writing from the publisher.", "year": 2007, "referenceCount": 14, "citationCount": 583, "influentialCitationCount": 39, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1746034", "name": "L. Getoor"}, {"authorId": "1685978", "name": "B. Taskar"}]}, {"paperId": "76f96dadd80b19bde49e0e1f07bfa9fe8485eeec", "url": "https://www.semanticscholar.org/paper/76f96dadd80b19bde49e0e1f07bfa9fe8485eeec", "title": "Learning with Kernels: support vector machines, regularization, optimization, and beyond", "abstract": "From the Publisher: \nIn the 1990s, a new type of learning algorithm was developed, based on results from statistical learning theory: the Support Vector Machine (SVM). This gave rise to a new class of theoretically elegant learning machines that use a central concept of SVMs\u0097-kernels--for a number of learning tasks. Kernel machines provide a modular framework that can be adapted to different tasks and domains by the choice of the kernel function and the base algorithm. They are replacing neural networks in a variety of fields, including engineering, information retrieval, and bioinformatics. \nLearning with Kernels provides an introduction to SVMs and related kernel methods. Although the book begins with the basics, it also includes the latest research. It provides all of the concepts necessary to enable a reader equipped with some basic mathematical knowledge to enter the world of machine learning using theoretically well-founded yet easy-to-use kernel algorithms and to understand and apply the powerful algorithms that have been developed over the last few years.", "year": 2001, "referenceCount": 0, "citationCount": 3427, "influentialCitationCount": 135, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "1707625", "name": "B. Schölkopf"}, {"authorId": "46234526", "name": "Alex Smola"}]}, {"paperId": "cf80cc34528273d8fbe17783efe802a6509e1562", "url": "https://www.semanticscholar.org/paper/cf80cc34528273d8fbe17783efe802a6509e1562", "title": "Online dictionary learning for sparse coding", "abstract": "Sparse coding---that is, modelling data vectors as sparse linear combinations of basis elements---is widely used in machine learning, neuroscience, signal processing, and statistics. This paper focuses on learning the basis set, also called dictionary, to adapt it to specific data, an approach that has recently proven to be very effective for signal reconstruction and classification in the audio and image processing domains. This paper proposes a new online optimization algorithm for dictionary learning, based on stochastic approximations, which scales up gracefully to large datasets with millions of training samples. A proof of convergence is presented, along with experiments with natural images demonstrating that it leads to faster performance and better dictionaries than classical batch algorithms for both small and large datasets.", "year": 2009, "referenceCount": 30, "citationCount": 2182, "influentialCitationCount": 244, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2599292", "name": "J. Mairal"}, {"authorId": "144570279", "name": "F. Bach"}, {"authorId": "144189388", "name": "J. Ponce"}, {"authorId": "1699339", "name": "G. Sapiro"}]}, {"paperId": "bad620c25920edbaba8836032459b135669171c3", "url": "https://www.semanticscholar.org/paper/bad620c25920edbaba8836032459b135669171c3", "title": "Machine Learning and Its Applications to Biology", "abstract": "The term machine learning refers to a set of topics dealing with the creation and evaluation of algorithms that facilitate pattern recognition, classification, and prediction, based on models derived from existing data. Two facets of mechanization should be acknowledged when considering machine learning in broad terms. Firstly, it is intended that the classification and prediction tasks can be accomplished by a suitably programmed computing machine. That is, the product of machine learning is a classifier that can be feasibly used on available hardware. Secondly, it is intended that the creation of the classifier should itself be highly mechanized, and should not involve too much human input. This second facet is inevitably vague, but the basic objective is that the use of automatic algorithm construction methods can minimize the possibility that human biases could affect the selection and performance of the algorithm. Both the creation of the algorithm and its operation to classify objects or predict events are to be based on concrete, observable data. \n \nThe history of relations between biology and the field of machine learning is long and complex. An early technique [1] for machine learning called the perceptron constituted an attempt to model actual neuronal behavior, and the field of artificial neural network (ANN) design emerged from this attempt. Early work on the analysis of translation initiation sequences [2] employed the perceptron to define criteria for start sites in Escherichia coli. Further artificial neural network architectures such as the adaptive resonance theory (ART) [3] and neocognitron [4] were inspired from the organization of the visual nervous system. In the intervening years, the flexibility of machine learning techniques has grown along with mathematical frameworks for measuring their reliability, and it is natural to hope that machine learning methods will improve the efficiency of discovery and understanding in the mounting volume and complexity of biological data. \n \nThis tutorial is structured in four main components. Firstly, a brief section reviews definitions and mathematical prerequisites. Secondly, the field of supervised learning is described. Thirdly, methods of unsupervised learning are reviewed. Finally, a section reviews methods and examples as implemented in the open source data analysis and visualization language R (http://www.r-project.org).", "year": 2007, "referenceCount": 50, "citationCount": 482, "influentialCitationCount": 19, "isOpenAccess": true, "fieldsOfStudy": ["Computer Science", "Medicine"], "authors": [{"authorId": "2490889", "name": "A. Tarca"}, {"authorId": "33361123", "name": "V. Carey"}, {"authorId": "145793137", "name": "Xue-wen Chen"}, {"authorId": "2142580259", "name": "R. Romero"}, {"authorId": "1775019", "name": "S. Drăghici"}]}, {"paperId": "1bcbf2a4500d27d036e0f9d36d7af71c72f8ab61", "url": "https://www.semanticscholar.org/paper/1bcbf2a4500d27d036e0f9d36d7af71c72f8ab61", "title": "Recognizing facial expression: machine learning and application to spontaneous behavior", "abstract": "We present a systematic comparison of machine learning methods applied to the problem of fully automatic recognition of facial expressions. We report results on a series of experiments comparing recognition engines, including AdaBoost, support vector machines, linear discriminant analysis. We also explored feature selection techniques, including the use of AdaBoost for feature selection prior to classification by SVM or LDA. Best results were obtained by selecting a subset of Gabor filters using AdaBoost followed by classification with support vector machines. The system operates in real-time, and obtained 93% correct generalization to novel subjects for a 7-way forced choice on the Cohn-Kanade expression dataset. The outputs of the classifiers change smoothly as a function of time and thus can be used to measure facial expression dynamics. We applied the system to to fully automated recognition of facial actions (FACS). The present system classifies 17 action units, whether they occur singly or in combination with other actions, with a mean accuracy of 94.8%. We present preliminary results for applying this system to spontaneous facial expressions.", "year": 2005, "referenceCount": 18, "citationCount": 701, "influentialCitationCount": 56, "isOpenAccess": false, "fieldsOfStudy": ["Computer Science"], "authors": [{"authorId": "2218905", "name": "M. Bartlett"}, {"authorId": "46548046", "name": "G. Littlewort"}, {"authorId": "145595070", "name": "M. Frank"}, {"authorId": "2767464", "name": "C. Lainscsek"}, {"authorId": "2039025", "name": "I. Fasel"}, {"authorId": "1741200", "name": "J. Movellan"}]}]}